{"data":[{"name":"49:13","price":"ऐ मनुष्यो![8] हमने तुम्हें एक नर और एक मादा से पैदा किया तथा हमने तुम्हें जातियों और क़बीलों में कर दिए, ताकि तुम एक-दूसरे को पहचानो। निःसंदेह अल्लाह के निकट तुममें सबसे अधिक सम्मान वाला वह है, जो तुममें सबसे अधिक तक़्वा वाला है। निःसंदेह अल्लाह सब कुछ जानने वाला, पूरी ख़बर रखने वाला है।","arabic":"يَٰٓأَيُّهَا ٱلنَّاسُ إِنَّا خَلَقۡنَٰكُم مِّن ذَكَرٖ وَأُنثَىٰ وَجَعَلۡنَٰكُمۡ شُعُوبٗا وَقَبَآئِلَ لِتَعَارَفُوٓاْۚ إِنَّ أَكۡرَمَكُمۡ عِندَ ٱللَّهِ أَتۡقَىٰكُمۡۚ إِنَّ ٱللَّهَ عَلِيمٌ خَبِيرٞ","category":["49 (Al-Hujurat)","Al-Hujurat","Surah Al-Hujurat"],"ayahNumber":4625,"juzNumber":26,"footnotes":"8. इस आयत में सभी मनुष्यों को संबोधित करके यह बताया गया है कि सब जातियों और क़बीलों के मूल माँ-बाप एक ही हैं। इसलिए वर्ग, वर्ण तथा जाति और देश पर गर्व और भेद-भाव करना उचित नहीं। जिससे आपस में घृणा पैदा होती है। इस्लाम की सामाजिक व्यवस्था में कोई भेद-भाव, ऊँच-नीच, जात-पात तथा छुआ-छूत नहीं है। नमाज़ में सब एक साथ खड़े होते हैं। विवाह में भी कोई वर्ग, वर्ण और जाति का भेद-भाव नहीं। नबी (सल्लल्लाहु अलैहि व सल्लम) ने क़ुरैश जाति की स्त्री ज़ैनब (रज़ियल्लाहु अन्हा) का विवाह अपने मुक्त किए हुए दास ज़ैद (रज़ियल्लाहु अन्हु) से किया था। और जब उन्होंने उसे तलाक़ दे दी, तो आप (सल्लल्लाहु अलैहि व सल्लम) ने ज़ैनब से विवाह कर लिया। इसलिए कोई अपने को सय्यद कहते हुए अपनी पुत्री का विवाह किसी व्यक्ति से इसलिए न करे कि वह सय्यद नहीं है, तो यह जाहिली युग का विचार समझा जाएगा, जिससे इस्लाम का कोई संबंध नहीं है। बल्कि इस्लाम ने इसका खंडन किया है। आप (सल्लल्लाहु अलैहि व सल्लम) के युग में अफरीक़ा के एक आदमी बिलाल (रज़ियल्लाहु अन्हु) तथा रोम के एक आदमी सुहैब (रज़ियल्लाहु अन्हु) बिना रंग और देश के भेद-भाव के एक साथ रहते थे। नबी (सल्लल्लाहु अलैहि व सल्लम) ने फरमाया : अल्लाह ने मुझे उपदेश भेजा है कि आपस में झुककर रहो। और कोई किसी पर गर्व न करे। और न कोई किसी पर अत्याचार करे। (सह़ीह़ मुस्लिम : 2865) आप (सल्लल्लाहु अलैहि व सल्लम) ने कहा : लोग अपने मरे हुए बापों पर गर्व ने करें। अन्यथा वे उस कीड़े से हीन हो जाएँगे जो अपनी नाक से गंदगी ढकेलता है। अल्लाह ने जाहिलिय्यत का पक्षपात और बापों पर गर्व को दूर कर दिया। अब या तो सदाचारी ईमान वाला है या कुकर्मी अभागा है। सभी आदम की संतान हैं। (सुनन अबू दाऊद : 5116 इस ह़दीस की सनद ह़सन है।) यदि आज भी इस्लाम की इस व्यवस्था और विचार को मान लिया जाए, तो पूरे विश्व में शांति तथा मानवता का राज्य हो जाएगा।","lang":"hi","meta":{"transliteration":"yāayyuhā al-nāsu innā khalaqnākum min dhakarin wa-unthā wajaʿalnākum shuʿūban waqabāila litaʿārafū inna akramakum ʿinda al-lahi atqākum inna al-laha ʿalīmun khabīrun ","translations":["O mankind","O mankind","Indeed, We","created you","from","a male","and a female","and We made you","nations","and tribes","that you may know one another","Indeed","(the) most noble of you","near","Allah","(is the) most righteous of you","Indeed","Allah","(is) All-Knower","All-Aware","(13)"],"transliterationArr":["yāayyuhā","al-nāsu","innā","khalaqnākum","min","dhakarin","wa-unthā","wajaʿalnākum","shuʿūban","waqabāila","litaʿārafū","inna","akramakum","ʿinda","al-lahi","atqākum","inna","al-laha","ʿalīmun","khabīrun",null],"verseTiming":[[1,0,3200],[2,3200,4780],[3,4780,6300],[4,6300,7700],[5,7700,8780],[6,8780,9950],[7,9950,12380],[8,12380,14640],[9,14640,16220],[10,16220,18160],[11,18160,21090],[12,21090,22790],[13,22790,24600],[14,24600,25860],[15,25860,27140],[16,27140,28070],[17,28070,29910],[18,29910,31260],[19,31260,32170],[20,32170,33260],[21,33260,35775]]}}],"dua":{"id":64,"name":"Dua for Cultural Understanding","arabicName":"دعاء التفاهم الثقافي","reference":"49:13","verseTitle":"The Mutual Respect Supplication","significanceReason":"Encourages mutual understanding, respect, and appreciation of diverse human cultures and backgrounds."},"version":{"key":"hindi_omari","direction":"ltr","language_iso_code":"hi","version":"1.1.4","last_update":1675069101,"title":"Hindi Translation","description":"Translation of the Quran meanings into Indian by Azizul-Haqq Al-Umary."}}