{"data":[{"name":"3:173","price":"وه لوگ کہ جب ان سے لوگوں نے کہا کہ کافروں نے تمہارے مقابلے پر لشکر جمع کر لئے ہیں، تم ان سے خوف کھاؤ تو اس بات نے انہیں ایمان میں اور بڑھا دیا اور کہنے لگے ہمیں اللہ کافی ہے اور وه بہت اچھا کارساز ہے.(1)","arabic":"ٱلَّذِينَ قَالَ لَهُمُ ٱلنَّاسُ إِنَّ ٱلنَّاسَ قَدۡ جَمَعُواْ لَكُمۡ فَٱخۡشَوۡهُمۡ فَزَادَهُمۡ إِيمَٰنٗا وَقَالُواْ حَسۡبُنَا ٱللَّهُ وَنِعۡمَ ٱلۡوَكِيلُ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran"],"ayahNumber":466,"juzNumber":4,"footnotes":"(1) حمراء الاسد اور کہا جاتا ہے کہ بدر صغریٰ کے موقع پر ابوسفیان نے بعض لوگوں کی خدمات مالی معاوضہ دے کر حاصل کیں اور ان کے ذریعے مسلمانوں میں یہ افواہ پھیلائی کہ مشرکین مکہ لڑائی کے لئے بھرپور تیاری کر رہے ہیں تاکہ یہ سن کر مسلمانوں کے حوصلے پست ہو جائیں۔ بعض روایات کی رو سے یہ کام شیطان نے اپنے چیلے چانٹوں کے ذریعے سے کیا۔ لیکن مسلمان اس قسم کی افواہیں سن کر خوف زدہ ہونے کے بجائے، مزید عزم وولولہ سے سرشار ہوگئے جس کو یہاں ایمان کی زیادتی سے تعبیر کیا گیا ہے، کیونکہ ایمان جتنا پختہ ہوگا، جہاد کا عزم اور ولولہ بھی اتنا ہی زیادہ ہوگا۔ یہ آیت اس بات کی دلیل ہے کہ ایمان جامد قسم کی چیز نہیں ہے بلکہ اس میں کمی بیشی ہوتی رہتی ہے، جیسا کہ محدثین کا مسلک ہے، یہ بھی معلوم ہوا کہ ابتلا ومصیبت کے وقت اہل ایمان کا شیوہ اللہ پر اعتماد وتوکل ہے، اسی لئے حدیث میں بھی حَسْبُنَا اللهُ وَنِعْمَ الْوَكِيلُ پڑھنے کی فضیلت وارد ہے۔ نیز صحیح بخاری وغیرہ میں ہے حضرت ابراہیم (عليه السلام) کو جب آگ میں ڈالا گیا تو آپ کی زبان پر یہی الفاظ تھے۔ (فتح القدیر )","lang":"ur","meta":{"transliteration":"alladhīna qāla lahumu al-nāsu inna al-nāsa qad jamaʿū lakum fa-ikh'shawhum fazādahum īmānan waqālū ḥasbunā al-lahu waniʿ'ma al-wakīlu ","translations":["Those who","said","to them","[the people]","Indeed","the people","(have) certainly","gathered","against you","so fear them","But it increased them","(in) faith","and they said","Sufficient for us","(is) Allah","and (He is the) best","[the] Disposer of affairs","(173)"],"transliterationArr":["alladhīna","qāla","lahumu","al-nāsu","inna","al-nāsa","qad","jamaʿū","lakum","fa-ikh'shawhum","fazādahum","īmānan","waqālū","ḥasbunā","al-lahu","waniʿ'ma","al-wakīlu",null],"verseTiming":[[1,0,1320],[2,1320,2070],[3,2070,2720],[4,2720,4230],[5,4230,5660],[6,5660,7150],[7,7150,7590],[8,7590,8450],[9,8450,9120],[10,9120,10400],[11,10400,11830],[12,11830,13870],[13,13870,15260],[14,15260,17110],[15,17110,18200],[16,18200,19010],[17,19010,20060],[18,20060,20850],[19,20850,24105]]}}],"dua":{"id":12,"name":"Dua for Success and Victory","arabicName":"دعاء النجاح والنصر","reference":"3:173","verseTitle":"The Triumphant Supplication","significanceReason":"Invokes divine support and success in personal and collective endeavors. Popular among those facing challenges and seeking breakthrough."},"version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."}}