{"data":[{"name":"8:45","price":"اے ایمان والو! جب تم کسی مخالف فوج سے بھڑ جاؤ تو ﺛابت قدم رہو اور بکثرت اللہ کو یاد کرو تاکہ تمہیں کامیابی حاصل ہو۔(1)","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا لَقِيتُمۡ فِئَةٗ فَٱثۡبُتُواْ وَٱذۡكُرُواْ ٱللَّهَ كَثِيرٗا لَّعَلَّكُمۡ تُفۡلِحُونَ","category":["8 (Al-Anfal)","Al-Anfal","Surah Al-Anfal"],"ayahNumber":1205,"juzNumber":10,"footnotes":"(1) اب مسلمانوں کو لڑائی کے وہ آداب بتائے جا رہے ہیں جن کو دشمن سے مقابلے کے وقت ملحوظ رکھنا ضروری ہے۔ سب سے پہلی بات ثبات قدمی اور استقلال ہے، کیونکہ اس کے بغیر میدان جنگ میں ٹھہرنا ممکن ہی نہیں ہے تاہم اس سے تحرف اور تحیز کی وہ دونوں صورتیں مستثنیٰ ہوں گی جن کی پہلے وضاحت کی جا چکی ہے کیونکہ بعض دفعہ ثبات قدمی کے لئے بھی تحرف یا تحیز ناگزیر ہوتا ہے۔ دوسری ہدایت; اللہ کو کثرت سےیاد کرو۔ تاکہ مسلمان اگر تھوڑے ہوں تو اللہ کی مدد کے طالب رہیں اور اللہ بھی کثرت ذکر کی وجہ سے ان کی طرف متوجہ رہے اور اگر مسلمان تعداد میں زیادہ ہوں تو کثرت کی وجہ سے ان کے اندر عجب اور غرور پیدا نہ ہو، بلکہ اصل توجہ اللہ کی امداد پر ہی رہے۔","lang":"ur","meta":{"transliteration":"yāayyuhā alladhīna āmanū idhā laqītum fi-atan fa-uth'butū wa-udh'kurū al-laha kathīran laʿallakum tuf'liḥūna ","translations":["O you","who","believe","When","you meet","a force","then be firm","and remember","Allah","much","so that you may","(be) successful","(45)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","idhā","laqītum","fi-atan","fa-uth'butū","wa-udh'kurū","al-laha","kathīran","laʿallakum","tuf'liḥūna",null],"verseTiming":[[1,0,2900],[2,2900,3890],[3,3890,5900],[4,5900,6540],[5,6540,7470],[6,7470,9250],[7,9250,10440],[8,10440,11950],[9,11950,12790],[10,12790,13500],[11,13500,14410],[12,14410,15800],[13,15800,18775]]}},{"name":"8:46","price":"اور اللہ کی اور اس کے رسول کی فرماں برداری کرتے رہو، آپس میں اختلاف نہ کرو ورنہ بزدل ہو جاؤ گے اور تمہاری ہوا اکھڑ جائے گی اور صبر و سہارا رکھو، یقیناً اللہ تعالیٰ صبر کرنے والوں کے ساتھ ہے۔(1)","arabic":"وَأَطِيعُواْ ٱللَّهَ وَرَسُولَهُۥ وَلَا تَنَٰزَعُواْ فَتَفۡشَلُواْ وَتَذۡهَبَ رِيحُكُمۡۖ وَٱصۡبِرُوٓاْۚ إِنَّ ٱللَّهَ مَعَ ٱلصَّٰبِرِينَ","category":["8 (Al-Anfal)","Al-Anfal","Surah Al-Anfal"],"ayahNumber":1206,"juzNumber":10,"footnotes":"(1) تیسری ہدایت، اللہ اور رسول کی اطاعت، ظاہر بات ہے ان نازک حالات میں اللہ اور رسول کی نافرمانی کتنی سخت خطرناک ہو سکتی ہے۔ اس لئے ایک مسلمان کے لئے ویسے تو ہر حالت میں اللہ اور رسول کی اطاعت ضروری ہے تاہم میدان جنگ میں اس کی اہمیت دو چند ہو جاتی ہے اور اس موقع پر تھوڑی سی بھی نافرمانی اللہ کی مدد سے محرومی کا باعث بن سکتی ہے۔ چوتھی ہدایت کہ آپس میں تنازع اور اختلاف نہ کرو، اس سے تم بزدل ہو جاؤ گے اور ہوا اکھڑ جائے گی۔ اور پانچویں ہدایت کہ صبر کرو! یعنی جنگ میں کتنی بھی شدت آجائے اور تمہیں کتنے بھی کٹھن مراحل سے گزرنا پڑے لیکن صبر کا دامن ہاتھ سے نہ چھوٹے۔ نبی (صلى الله عليه وسلم) نے بھی ایک حدیث میں فرمایا: ”لوگو! دشمن سے مدبھیڑ کی آرزو مت کرو اور اللہ سے عافیت مانگا کرو! تاہم جب کبھی دشمن سے لڑائی کا موقع پیدا ہو جائے تو صبر کرو (یعنی جم کر لڑو) اور جان لو کہ جنت تلواروں کے سائے تلے ہے۔“ (صحيح بخاري- كتاب الجهاد- باب كان النبي صلى الله عليه وسلم إذا لم يقاتل أول النهار أخر القتال حتى تزول الشمس)","lang":"ur","meta":{"transliteration":"wa-aṭīʿū al-laha warasūlahu walā tanāzaʿū fatafshalū watadhhaba rīḥukum wa-iṣ'birū inna al-laha maʿa al-ṣābirīna ","translations":["And obey","Allah","and His Messenger","and (do) not","dispute","lest you lose courage","and (would) depart","your strength","and be patient","Indeed","Allah","(is) with","the patient ones","(46)"],"transliterationArr":["wa-aṭīʿū","al-laha","warasūlahu","walā","tanāzaʿū","fatafshalū","watadhhaba","rīḥukum","wa-iṣ'birū","inna","al-laha","maʿa","al-ṣābirīna",null],"verseTiming":[[1,0,1040],[2,1040,1910],[3,1910,3440],[4,3440,3940],[5,3940,5220],[6,5220,6570],[7,6570,7590],[8,7590,8650],[9,8650,9780],[10,9780,11610],[11,11610,12570],[12,12570,12850],[13,12850,16925]]}}],"dua":{"id":19,"name":"Dua for Overcoming Fear","arabicName":"دعاء التغلب على الخوف","reference":"8:45-46","verseTitle":"The Courage Supplication","significanceReason":"Provides spiritual strength to overcome fear, anxiety, and psychological barriers."},"version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."}}