{"data":[{"name":"39:9","price":"بھلا جو شخص راتوں کے اوقات سجدے اور قیام کی حالت میں (عبادت میں) گزارتا ہو، آخرت سے ڈرتا ہو اور اپنے رب کی رحمت کی امید رکھتا ہو(1) ، (اور جو اس کے برعکس ہو برابر ہو سکتے ہیں) بتاؤ تو علم والے اور بے علم کیا برابر کے ہیں(2)؟ یقیناً نصیحت وہی حاصل کرتے ہیں جو عقلمند ہوں۔ (اپنے رب کی طرف سے).(3)","arabic":"أَمَّنۡ هُوَ قَٰنِتٌ ءَانَآءَ ٱلَّيۡلِ سَاجِدٗا وَقَآئِمٗا يَحۡذَرُ ٱلۡأٓخِرَةَ وَيَرۡجُواْ رَحۡمَةَ رَبِّهِۦۗ قُلۡ هَلۡ يَسۡتَوِي ٱلَّذِينَ يَعۡلَمُونَ وَٱلَّذِينَ لَا يَعۡلَمُونَۗ إِنَّمَا يَتَذَكَّرُ أُوْلُواْ ٱلۡأَلۡبَٰبِ","category":["39 (Az-Zumar)","Az-Zumar","Surah Az-Zumar"],"ayahNumber":4067,"juzNumber":23,"footnotes":"(1) مطلب یہ ہے کہ ایک یہ کافر ومشرک ہے جس کا یہ حال ہے جو ابھی مذکور ہوا اور دوسرا وہ شخص ہے جو تنگی اور خوشی میں، رات کی گھڑیاں اللہ کے سامنے عاجزی اور فرماں برداری کا اظہار کرتے ہوئے، سجود وقیام میں گزارتا ہے۔ آخرت کا خوف بھی اس کے دل میں ہے اور رب کی رحمت کا امیدوار بھی ہے۔ یعنی خوف ورجا دونوں کیفیتوں سے وہ سرشار ہے، جو اصل ایمان ہے۔ کیا یہ دونوں برابر ہو سکتے ہیں؟ نہیں، یقیناً نہیں۔ خوف ورجا کے بارے میں حدیث ہے، حضرت انس (رضي الله عنه) بیان فرماتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم ایک شخص کے پاس گئے جب کہ اس پر سکرات الموت کی کیفیت طاری تھی، آپ صلی اللہ علیہ وسلم نے اس سے پوچھا تو اپنے آپ کو کیسے پاتا ہے؟ اس نے کہا میں اللہ سے امید رکھتا ہوں اور اپنے گناہوں کی وجہ سے ڈرتا بھی ہوں۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”اس موقعے پر جس بندے کے دل میں یہ دونوں باتیں جمع ہو جائیں تواللہ تعالیٰ اسے وہ چیز عطا فرما دیتا ہے جس کی وہ امید رکھتا ہے اور اس سے اسے بچا لیتا ہے جس سے وہ ڈرتا ہے“۔ (ترمذي ، ابن ماجه، كتاب الزهد، باب ذكر الموت والاستعداد له)۔\n(2) یعنی وہ جو جانتے ہیں کہ اللہ نے ثواب وعقاب کا جو وعدہ کیا ہے، وہ حق ہے اور وہ جو اس بات کو نہیں جانتے۔ یہ دونوں برابر نہیں۔ ایک عالم ہے اور ایک جاہل۔ جس طرح علم وجہل میں فرق ہے، اسی طرح عالم وجاہل برابر نہیں۔ یہ بھی ہو سکتا ہے کہ عالم وغیر عالم کی مثال سے یہ سمجھانا مقصود ہو کہ جس طرح یہ دونوں برابر نہیں، اللہ کا فرماں بردار اور اس کا نافرمان، دونوں برابر نہیں۔ بعض نے اس کا مطلب یہ بیان کیا ہے کہ عالم سے مراد وہ شخص ہےجو علم کے مطابق عمل بھی کرتا ہے۔ کیوں کہ وہی علم سے فائدہ حاصل کرنے والا ہے اور جو عمل نہیں کرتا وہ گویا ایسے ہی ہے کہ اسے علم ہی نہیں ہے۔ اس اعتبار سے یہ عامل اور غیر عامل کی مثال ہے کہ یہ دونوں برابر نہیں۔\n(3) اور یہ اہل ایمان ہی ہیں، نہ کہ کفار۔ گو وہ اپنے آپ کو صاحب دانش وبصیرت ہی سمجھتے ہوں۔ لیکن جب وہ اپنی عقل ودانش کو استعمال کرکے غور وتدبر ہی نہیں کرتے اور عبرت ونصیحت ہی حاصل نہیں کرتے تو ایسے ہی ہے گویا وہ چوپایوں کی طرح عقل ودانش سےمحروم ہیں۔","lang":"ur","meta":{"transliteration":"amman huwa qānitun ānāa al-layli sājidan waqāiman yaḥdharu al-ākhirata wayarjū raḥmata rabbihi qul hal yastawī alladhīna yaʿlamūna wa-alladhīna lā yaʿlamūna innamā yatadhakkaru ulū al-albābi ","translations":["Is (one) who","[he]","(is) devoutly obedient ","(during) hours","(of) the night","prostrating","and standing","fearing","the Hereafter","and hoping","(for the) Mercy","(of) his Lord","Say","Are","equal","those who","know","and those who","(do) not","know","Only","will take heed","those of understanding","those of understanding","(9)"],"transliterationArr":["amman","huwa","qānitun","ānāa","al-layli","sājidan","waqāiman","yaḥdharu","al-ākhirata","wayarjū","raḥmata","rabbihi","qul","hal","yastawī","alladhīna","yaʿlamūna","wa-alladhīna","lā","yaʿlamūna","innamā","yatadhakkaru","ulū","al-albābi",null],"verseTiming":[[1,0,1540],[2,1540,2170],[3,2170,3200],[4,3200,5900],[5,5900,6720],[6,6720,8460],[7,8460,11099],[8,11099,12849],[9,12849,14139],[10,14139,15259],[11,15259,16029],[12,16029,17289],[13,17289,17859],[14,17859,18249],[15,18249,19179],[16,19179,20099],[17,20099,21469],[18,21469,22609],[19,22609,23129],[20,23129,26269],[21,26269,28049],[22,28049,29389],[23,29389,29739],[24,29739,32614]]}}],"dua":{"id":22,"name":"Dua for Purposeful Living","arabicName":"دعاء الحياة الهادفة","reference":"39:9","verseTitle":"The Meaningful Existence Supplication","significanceReason":"Requests divine assistance in finding and maintaining a purposeful, meaningful life journey."},"version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."}}