{"data":[{"name":"4:135","price":"اے ایمان والو! عدل وانصاف پر مضبوطی سے جم جانے والے اور خوشنودی موﻻ کے لئے سچی گواہی دینے والے بن جاؤ، گو وه خود تمہارے اپنے خلاف ہو یا اپنے ماں باپ کے یا رشتہ دار عزیزوں کے(1) ، وه شخص اگر امیر ہو تو اور فقیر ہو تو دونوں کے ساتھ اللہ کو زیاده تعلق ہے، اس لئے تم خواہش نفس کے پیچھے پڑ کر انصاف نہ چھوڑ دینا(2) اور اگر تم نے کج بیانی یا پہلو تہی کی(3) تو جان لو کہ جو کچھ تم کرو گے اللہ تعالیٰ اس سے پوری طرح باخبر ہے۔","arabic":"۞ يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ كُونُواْ قَوَّٰمِينَ بِٱلۡقِسۡطِ شُهَدَآءَ لِلَّهِ وَلَوۡ عَلَىٰٓ أَنفُسِكُمۡ أَوِ ٱلۡوَٰلِدَيۡنِ وَٱلۡأَقۡرَبِينَۚ إِن يَكُنۡ غَنِيًّا أَوۡ فَقِيرٗا فَٱللَّهُ أَوۡلَىٰ بِهِمَاۖ فَلَا تَتَّبِعُواْ ٱلۡهَوَىٰٓ أَن تَعۡدِلُواْۚ وَإِن تَلۡوُۥٓاْ أَوۡ تُعۡرِضُواْ فَإِنَّ ٱللَّهَ كَانَ بِمَا تَعۡمَلُونَ خَبِيرٗا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa"],"ayahNumber":628,"juzNumber":5,"footnotes":"(1) اس میں اللہ تعالیٰ اہل ایمان کو عدل وانصاف قائم کرنے اور حق کے مطابق گواہی دینے کی تاکید فرما رہا ہے چاہے اس کی وجہ سے انہیں یا ان کے والدین اور رشتہ داروں کو نقصان ہی اٹھانا پڑے۔ اس لئے کہ حق سب پر حاکم ہے اور سب پر مقدم ہے۔\n(2) یعنی کسی مال دار کی مالداری کی وجہ سے رعایت کی جائے نہ کسی فقیر کے فقر کا اندیشہ تمہیں سچی بات کہنے سے روکے بلکہ اللہ ان دونوں سے تمہارے زیادہ قریب اور مقدم ہے۔\n(3) یعنی خواہش نفس، عصبیت یا بغض تمہیں انصاف کرنے سے نہ روک دے۔ جیسے دوسرے مقام پر فرمایا ”وَلا يَجْرِمَنَّكُمْ شَنَآنُ قَوْمٍ عَلَى أَلا تَعْدِلُوا“ (المائدۃ: 8) ”تمہیں کسی قوم کی دشمنی اس بات پر آمادہ نہ کرے کہ تم انصاف نہ کرو“۔\n(4) ”تَلْوُوا“، ”لیی“ سے ہے جو تحریف اور جان بوجھ کر جھوٹ بولنے کو کہا جاتا ہے۔ مطلب شہادت میں تحریف وتغییر ہے اور اعراض سے مراد شہادت کا کتمان (چھپانا) اور اس کا ترک کرنا ہے۔ ان دونوں باتوں سے بھی روکا گیا ہے۔ اس آیت میں عدل وانصاف کی تاکید اور اس کے لئے جن باتوں کی ضرورت ہے، ان کا اہتمام کرنے کا حکم دیا گیا ہے۔ مثلاً:\n(1) ہر حال میں عدل کرو اس سے سرمو انحراف نہ کرو، کسی ملامت گر کی ملامت اور کوئی اور محرک اس میں رکاوٹ نہ بنے۔ بلکہ اس کے قیام میں تم ایک دوسرے کے معاون اور دست وبازو بنو۔\n(1) صرف اللہ کی رضا تمہارے پیش نظر ہو، کیونکہ اس صورت میں تم تحریف، تبدیل اور کتمان سے گریز کرو گے اور تمہارا فیصلہ عدل کی میزان میں پورا اترے گا۔\n(1) عدل وانصاف کی زد اگر تم پر یا تمہارے والدین پر یا دیگر قریبی رشتے داروں پر بھی پڑے، تب بھی تم پروا مت کرو اور اپنی اور ان کی رعایت کے مقابلے میں عدل کے تقاضوں کو اہمیت دو۔\n(1) کسی مال دار کی اس کی تونگری کی وجہ سے رعایت نہ کرو اور کسی تنگ دست کے فقر سے خوف مت کھاؤ کیونکہ وہی جانتا ہے کہ ان دونوں کی بہتری کس میں ہے؟\n(1) فیصلے میں خواہش نفس، عصبیت اور دشمنی آڑے نہیں آنی چاہئے۔ بلکہ ان سب کو نظر انداز کرکے بے لاگ عدل کرو۔ عدل کا یہ اہتمام جس معاشرے میں ہوگا، وہاں امن وسکون اور اللہ کی طرف سے رحمتوں اور برکتوں کا نزول ہوگا۔ صحابہ کرام (رضي الله عنهم) نے اس نکتے کو بھی خوب سمجھ لیا تھا، چنانچہ حضرت عبداللہ بن رواحہ (رضي الله عنه) کی بابت آتا ہے کہ رسول اللہ (صلى الله عليه وسلم) نے انہیں خیبر کے یہودیوں کے پاس بھیجا کہ وہ وہاں کے پھلوں اور فصلوں کا تخمینہ لگا کر آئیں۔ یہودیوں نے انہیں رشوت کی پیشکش کی تاکہ وہ کچھ نرمی سے کام لیں۔ انہوں نے فرمایا اللہ کی قسم، میں اس کی طرف سے نمائندہ بن کر آیا ہوں جو دنیا میں مجھے سب سے زیادہ محبوب ہے اور تم میرے نزدیک سب سے زیادہ ناپسندیدہ ہو، لیکن اپنے محبوب کی محبت اور تمہاری دشمنی مجھے اس بات پر آمادہ نہیں کر سکتی کہ میں تمہارے معاملے میں انصاف نہ کروں۔ یہ سن کر انہوں نے کہا اسی عدل کی وجہ سے آسمان وزمین کا یہ نظام قائم ہے (تفسیر ابن کثیر)","lang":"ur","meta":{"transliteration":"yāayyuhā alladhīna āmanū kūnū qawwāmīna bil-qis'ṭi shuhadāa lillahi walaw ʿalā anfusikum awi al-wālidayni wal-aqrabīna in yakun ghaniyyan aw faqīran fal-lahu awlā bihimā falā tattabiʿū al-hawā an taʿdilū wa-in talwū aw tuʿ'riḍū fa-inna al-laha kāna bimā taʿmalūna khabīran ","translations":["O you","who","believe[d]","Be","custodians","of justice","(as) witnesses","to Allah","even if","(it is) against","yourselves","or","the parents","and the relatives","if","he be","rich","or","poor","for Allah","(is) nearer","to both of them","So (do) not","follow","the desire","lest","you deviate","And if","you distort","or","refrain","then indeed","Allah","is","of what","you do","All-Aware","(135)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","kūnū","qawwāmīna","bil-qis'ṭi","shuhadāa","lillahi","walaw","ʿalā","anfusikum","awi","al-wālidayni","wal-aqrabīna","in","yakun","ghaniyyan","aw","faqīran","fal-lahu","awlā","bihimā","falā","tattabiʿū","al-hawā","an","taʿdilū","wa-in","talwū","aw","tuʿ'riḍū","fa-inna","al-laha","kāna","bimā","taʿmalūna","khabīran",null],"verseTiming":[[1,0,2830],[2,2830,3830],[3,3830,4860],[4,4860,5690],[5,5690,7080],[6,7080,8100],[7,8100,10240],[8,10240,11240],[9,11240,11820],[10,11820,13470],[11,13470,15600],[12,15600,16320],[13,16320,18080],[14,18080,19860],[15,19860,20290],[16,20290,21650],[17,21650,24610],[18,24610,25360],[19,25360,25930],[20,25930,26970],[21,26970,27310],[22,27310,28550],[23,28550,30130],[24,30130,30970],[25,30970,31920],[26,31920,32870],[27,32870,33900],[28,33900,36170],[29,36170,36980],[30,36980,38160],[31,38160,39690],[32,39690,41840],[33,41840,42180],[34,42180,43240],[35,43240,44560],[36,44560,45420],[37,45420,46220],[38,46220,46880],[39,46880,48370],[40,48370,50385]]}}],"dua":{"id":26,"name":"Dua for Moral Courage","arabicName":"دعاء الشجاعة الأخلاقية","reference":"4:135","verseTitle":"The Justice and Integrity Supplication","significanceReason":"Encourages standing firm for truth, justice, and ethical principles despite personal challenges."},"version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."}}