{"data":[{"name":"25:65","price":"اور جو یہ دعا کرتے ہیں کہ اے ہمارے پروردگار! ہم سے دوزخ کا عذاب پرے ہی پرے رکھ، کیونکہ اس کا عذاب چمٹ جانے واﻻ ہے.(1)","arabic":"وَٱلَّذِينَ يَقُولُونَ رَبَّنَا ٱصۡرِفۡ عَنَّا عَذَابَ جَهَنَّمَۖ إِنَّ عَذَابَهَا كَانَ غَرَامًا","category":["25 (Al-Furqan)","Al-Furqan","Surah Al-Furqan"],"ayahNumber":2920,"juzNumber":19,"footnotes":"(1) اس سے معلوم ہوا کہ رحمٰن کےبندے وہ ہیں جو ایک طرف راتوں کو اٹھ کر اللہ کی عبادت کرتے ہیں اور دوسری طرف وہ ڈرتے بھی ہیں کہ کہیں کسی غلطی یا کوتاہی پر اللہ کی گرفت میں نہ آجائیں، اس لیے وہ عذاب جہنم سے بھی پناہ طلب کرتے ہیں۔ گویا اللہ کی عبادت و اطاعت کےباوجود اللہ کےعذاب اور اس کےمواخذے سے انسان کو بے خوف اور اپنی عبادات و طاعات الٰہی پر کسی غرور اور گھمنڈ میں مبتلا نہیں ہونا چاہیے۔ اسی مفہوم کو دوسرے مقام پر اس طرح بیان فرمایاگیا ہے۔ «وَالَّذِينَ يُؤْتُونَ مَا آتَوْا وَقُلُوبُهُمْ وَجِلَةٌ أَنَّهُمْ إِلَى رَبِّهِمْ رَاجِعُونَ» (المؤمنون: 60) ”اور وہ لوگ کہ جو کچھ دیتے ہیں۔ اور ان کے دل ڈرتے ہیں کہ وہ اپنے رب کی طرف لوٹنے والے ہیں“ ڈر صرف اسی بات کا نہیں کہ انہیں بارگاہ الٰہی میں حاضر ہونا ہے، بلکہ اس کے ساتھ، اس کا بھی کہ ان کا صدقہ و خیرات قبول ہوتا ہے یا نہیں؟ حدیث میں آیت کی تفسیر میں آتا ہے کہ حضرت عائشہ (رضی الله عنها) نے رسول اللہ (صلى الله عليه وسلم) سے اس آیت کی بابت پوچھا کہ کیا اس سے مراد وہ لوگ ہیں جو شراب پیتے اور چوری کرتے ہیں؟ آپ (صلى الله عليه وسلم) نے فرمایا، نہیں، اے ابوبکر کی بیٹی! بلکہ یہ وہ لوگ ہیں جو روزے رکھتے،نماز پڑھتے اور صدقہ کرتے ہیں، لیکن اس کے باوجود ڈرتے ہیں کہ کہیں ان کے یہ اعمال نامقبول نہ ہوجائیں۔ (الترمذي، كتاب التفسير، سورة المؤمنون)۔","lang":"ur","meta":{"transliteration":"wa-alladhīna yaqūlūna rabbanā iṣ'rif ʿannā ʿadhāba jahannama inna ʿadhābahā kāna gharāman ","translations":["And those who","say","Our Lord","Avert","from us","the punishment","(of) Hell","Indeed","its punishment","is","inseparable","(65)"],"transliterationArr":["wa-alladhīna","yaqūlūna","rabbanā","iṣ'rif","ʿannā","ʿadhāba","jahannama","inna","ʿadhābahā","kāna","gharāman",null],"verseTiming":[[1,0,1240],[2,1240,2720],[3,2720,3500],[4,3500,4210],[5,4210,5680],[6,5680,6620],[7,6620,8490],[8,8490,10320],[9,10320,11610],[10,11610,12340],[11,12340,14025]]}},{"name":"25:66","price":"بے شک وه ٹھہرنے اور رہنے کے لحاظ سے بدترین جگہ ہے.","arabic":"إِنَّهَا سَآءَتۡ مُسۡتَقَرّٗا وَمُقَامٗا","category":["25 (Al-Furqan)","Al-Furqan","Surah Al-Furqan"],"ayahNumber":2921,"juzNumber":19,"footnotes":"","lang":"ur","meta":{"transliteration":"innahā sāat mus'taqarran wamuqāman ","translations":["Indeed, it","(is) an evil","abode","and resting place","(66)"],"transliterationArr":["innahā","sāat","mus'taqarran","wamuqāman",null],"verseTiming":[[1,0,1860],[2,1860,4430],[3,4430,6110],[4,6110,8435]]}}],"dua":{"id":29,"name":"Dua for Guidance in Confusion","arabicName":"دعاء الهداية في الحيرة","reference":"25:65-66","verseTitle":"The Guidance Through Darkness Supplication","significanceReason":"Seeks divine guidance during periods of spiritual and personal confusion, asking for clarity and illumination of the path."},"version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."}}