{"data":[{"name":"2:186","price":"اور جب میرے بندے میرے بارے میں آپ سے سوال کریں تو آپ کہہ دیں کہ میں بہت ہی قریب ہوں ہر پکارنے والے کی پکار کو جب کبھی وه مجھے پکارے، قبول کرتا ہوں(1) اس لئے لوگوں کو بھی چاہئے کہ وه میری بات مان لیا کریں اور مجھ پر ایمان رکھیں، یہی ان کی بھلائی کا باعﺚ ہے","arabic":"وَإِذَا سَأَلَكَ عِبَادِي عَنِّي فَإِنِّي قَرِيبٌۖ أُجِيبُ دَعۡوَةَ ٱلدَّاعِ إِذَا دَعَانِۖ فَلۡيَسۡتَجِيبُواْ لِي وَلۡيُؤۡمِنُواْ بِي لَعَلَّهُمۡ يَرۡشُدُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":193,"juzNumber":2,"footnotes":"(1) رمضان المبارک کے احکام ومسائل کے درمیان دعا کا مسئلہ بیان کرکے یہ واضح کردیا گیا کہ رمضان میں دعا کی بھی بڑی فضیلت ہے، جس کا خوب اہتمام کرنا چاہیے، خصوصاً افطاری کے وقت کو قبولیت دعا کا خاص وقت بتلایا گیا ہے (مسند أحمد، ترمذي ، نسائي، ابن ماجه بحواله ابن كثير) تاہم قبولیت دعا کے لئے ضروری ہے کہ ان آداب وشرائط کو ملحوظ رکھا جائے جو قرآن وحدیث میں بیان ہوئے ہیں۔ جن میں سے دو یہاں بیان کئے گئے ہیں: ایک اللہ پر صحیح معنوں میں ایمان اور دوسرا اس کی اطاعت وفرمانبرداری۔ اسی طرح احادیث میں حرام خوراک سے بچنے اور خشوع وخضوع کا اہتمام کرنے کی تاکید کی گئی ہے۔","lang":"ur","meta":{"transliteration":"wa-idhā sa-alaka ʿibādī ʿannī fa-innī qarībun ujību daʿwata al-dāʿi idhā daʿāni falyastajībū lī walyu'minū bī laʿallahum yarshudūna ","translations":["And when","ask you","My servants","about Me","then indeed I am","near","I respond","(to the) invocation","(of) the supplicant","when","he calls Me","So let them respond","to Me","and let them believe","in Me","so that they may","(be) led aright","(186)"],"transliterationArr":["wa-idhā","sa-alaka","ʿibādī","ʿannī","fa-innī","qarībun","ujību","daʿwata","al-dāʿi","idhā","daʿāni","falyastajībū","lī","walyu'minū","bī","laʿallahum","yarshudūna",null],"verseTiming":[[1,0,910],[2,910,1730],[3,1730,2690],[4,2690,4130],[5,4130,5790],[6,5790,8670],[7,8670,9350],[8,9350,10130],[9,10130,10950],[10,10950,11500],[11,11500,14190],[12,14190,16260],[13,16260,16850],[14,16850,18250],[15,18250,18710],[16,18710,19870],[17,19870,23185]]}}],"dua":{"id":31,"name":"Dua for Divine Connection","arabicName":"دعاء الاتصال الإلهي","reference":"2:186","verseTitle":"The Intimate Supplication","significanceReason":"Emphasizes the direct and intimate connection between the believer and the Divine, highlighting that Allah is always near and responsive."},"version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."}}