{"data":[{"name":"20:52","price":"جواب دیا کہ ان کا علم میرے رب کے ہاں کتاب میں موجود ہے، نہ تو میرا رب غلطی کرتا ہے نہ بھولتا ہے.(1)","arabic":"قَالَ عِلۡمُهَا عِندَ رَبِّي فِي كِتَٰبٖۖ لَّا يَضِلُّ رَبِّي وَلَا يَنسَى","category":["20 (Ta-Ha)","Ta-Ha","Surah Ta-Ha"],"ayahNumber":2400,"juzNumber":16,"footnotes":"(1) حضرت موسیٰ (عليه السلام) نے جواب میں فرمایا، ان کا علم نہ تجھے ہے نہ مجھے۔ البتہ ان کا علم میرے رب کو ہے، جو اس کے پاس کتاب میں موجود ہے وہ اس کے مطابق جزا و سزا دے گا، پھر اس کا علم اس طرح ہرچیز کو محیط ہے کہ اس کی نظر سے کوئی چھوٹی بڑی چیز اوجھل نہیں ہو سکتی، نہ اسے بھول ہی لا حق ہو سکتی ہے۔ جب کہ مخلوق کے علم میں دونوں نقص موجود ہیں۔ ایک تو ان کا علم محیط کل نہیں، بلکہ ناقص ہے۔ دوسرا علم کے بعد وہ بھول بھی سکتے ہیں، میرا رب ان دونوں نقصوں سے پاک ہے۔ آگے، رب کی مزید صفات بیان کی جا رہی ہیں۔","lang":"ur","meta":{"transliteration":"qāla ʿil'muhā ʿinda rabbī fī kitābin lā yaḍillu rabbī walā yansā ","translations":["He said","Its knowledge","(is) with","my Lord","in","a Record","Not","errs","my Lord","and not","forgets","(52)"],"transliterationArr":["qāla","ʿil'muhā","ʿinda","rabbī","fī","kitābin","lā","yaḍillu","rabbī","walā","yansā",null],"verseTiming":[[1,0,740],[2,740,1850],[3,1850,3110],[4,3110,4010],[5,4010,4430],[6,4430,6940],[7,6940,7670],[8,7670,8630],[9,8630,9450],[10,9450,10170],[11,10170,12375]]}}],"dua":{"id":38,"name":"Dua for Inner Contentment","arabicName":"دعاء القناعة الداخلية","reference":"20:52","verseTitle":"The Comprehensive Knowledge Supplication","significanceReason":"Seeks understanding and acceptance of divine decree, promoting inner peace and contentment."},"version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."}}