{"data":[{"name":"2:45","price":"اور صبر اور نماز کے ساتھ مدد طلب کرو(1) یہ چیز شاق ہے، مگر ڈر رکھنے والوں پر(نہیں)۔(2)","arabic":"وَٱسۡتَعِينُواْ بِٱلصَّبۡرِ وَٱلصَّلَوٰةِۚ وَإِنَّهَا لَكَبِيرَةٌ إِلَّا عَلَى ٱلۡخَٰشِعِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":52,"juzNumber":1,"footnotes":"(1) صبر اور نماز ہر اللہ والے کے دو بڑے ہتھیار ہیں۔ نماز کے ذریعے سے ایک مومن کا رابطہ وتعلق اللہ تعالیٰ سے استوار ہوتا ہے، جس سے اسے اللہ تعالیٰ کی تائید ونصرت حاصل ہوتی ہے۔ صبر کے ذریعے سے کردار کی پختگی اور دین میں استقامت حاصل ہوتی ہے۔ حدیث میں آتا ہے «ِاِذَا حَزَبَه أَمْرٌ فَزِعَ إِلَى الصَّلاةِ» (احمد وابوداود بحوالہ فتح القدیر) ”نبی (صلى الله عليه وسلم) کو جب بھی کوئی اہم معاملہ پیش آتا آپ فوراً نماز کا اہتمام فرماتے۔“\n(2) نماز کی پابندی عام لوگوں کے لئے گراں ہے، لیکن خشوع وخضوع کرنے والوں کے لئے یہ آسان، بلکہ اطمینان اور راحت کا باعث ہے۔ یہ کون لوگ ہیں؟ وہ جو قیامت پر پورا یقین رکھتے ہیں۔ گویا قیامت پر یقین اعمال خیر کو آسان کر دیتا اور آخرت سے بےفکری انسان کو بےعمل، بلکہ بدعمل بنا دیتی ہے۔","lang":"ur","meta":{"transliteration":"wa-is'taʿīnū bil-ṣabri wal-ṣalati wa-innahā lakabīratun illā ʿalā al-khāshiʿīna ","translations":["And seek help","through patience","and the prayer","and indeed, it","(is) surely difficult","except","on","the humble ones","(45)"],"transliterationArr":["wa-is'taʿīnū","bil-ṣabri","wal-ṣalati","wa-innahā","lakabīratun","illā","ʿalā","al-khāshiʿīna",null],"verseTiming":[[1,0,1350],[2,1350,2280],[3,2280,5250],[4,5250,6950],[5,6950,8190],[6,8190,8990],[7,8990,9360],[8,9360,12295]]}}],"dua":{"id":48,"name":"Dua for Patience and Perseverance","arabicName":"دعاء الصبر والمثابرة","reference":"2:45","verseTitle":"The Steadfastness Supplication","significanceReason":"Emphasizes the power of patience, seeking divine support during challenging and trying times."},"version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."}}