{"data":[{"name":"49:13","price":"اے لوگو! ہم نے تم سب کو ایک (ہی) مرد وعورت سے پیدا کیا ہے(1) اور اس لئے کہ تم آپس میں ایک دوسرے کو پہچانو کنبے اور قبیلے بنا دیئے(2) ہیں، اللہ کے نزدیک تم سب میں باعزت وه ہے جو سب سے زیاده ڈرنے واﻻ ہے(3)۔ یقین مانو کہ اللہ دانا اور باخبر ہے.","arabic":"يَٰٓأَيُّهَا ٱلنَّاسُ إِنَّا خَلَقۡنَٰكُم مِّن ذَكَرٖ وَأُنثَىٰ وَجَعَلۡنَٰكُمۡ شُعُوبٗا وَقَبَآئِلَ لِتَعَارَفُوٓاْۚ إِنَّ أَكۡرَمَكُمۡ عِندَ ٱللَّهِ أَتۡقَىٰكُمۡۚ إِنَّ ٱللَّهَ عَلِيمٌ خَبِيرٞ","category":["49 (Al-Hujurat)","Al-Hujurat","Surah Al-Hujurat"],"ayahNumber":4625,"juzNumber":26,"footnotes":"(1) یعنی آدم وحوا علیہما السلام سے۔ یعنی تم سب کی اصل ایک ہی ہے ایک ہی ماں باپ کی اولاد ہو۔ مطلب ہے کسی کو محض خاندان اور نسب کی بنا پر فخر کرنےکا حق نہیں ہے، کیونکہ سب کا نسب حضرت آدم (عليه السلام) سے ہی جا کر ملتا ہے۔\n(2) شُعُوبٌ، شَعْبٌ کی جمع ہے۔ برادری یا بڑا قبیلہ شعب کے بعد قبیلہ، پھر عمارہ، پھر بطن، پھر فصیلہ اور پھر عشیرہ ہے (فتح القدیر) مطلب یہ ہے کہ مختلف خاندانوں، برادریوں اور قبیلوں کی تقسیم محض تعارف کے لئے ہے۔ تاکہ آپس میں صلۂ رحمی کر سکو۔ اس کا مقصد ایک دوسرے پر برتری کا اظہار نہیں ہے۔ جیسا کہ بدقسمتی سے حسب ونسب کو برتری کی بنیاد بنالیا گیا ہے۔ حالانکہ اسلام نے آکر اسے مٹایا تھا اور اسے جاہلیت سے تعبیر کیا تھا۔\n(3) یعنی اللہ کے ہاں برتری کا معیار خاندان، قبیلہ اور نسل ونسب نہیں ہے جو کسی انسان کےاختیار میں ہی نہیں ہے۔ بلکہ یہ معیار تقویٰ ہے جس کا اختیار کرنا انسان کے ارادہ واختیار میں ہے۔ یہی آیت ان علماء کی دلیل ہے جو نکاح میں کفائت نسب کو ضروری نہیں سمجھتے اور صرف دین کی بنیاد پر نکاح کو پسند کرتے ہیں (ابن کثیر)۔","lang":"ur","meta":{"transliteration":"yāayyuhā al-nāsu innā khalaqnākum min dhakarin wa-unthā wajaʿalnākum shuʿūban waqabāila litaʿārafū inna akramakum ʿinda al-lahi atqākum inna al-laha ʿalīmun khabīrun ","translations":["O mankind","O mankind","Indeed, We","created you","from","a male","and a female","and We made you","nations","and tribes","that you may know one another","Indeed","(the) most noble of you","near","Allah","(is the) most righteous of you","Indeed","Allah","(is) All-Knower","All-Aware","(13)"],"transliterationArr":["yāayyuhā","al-nāsu","innā","khalaqnākum","min","dhakarin","wa-unthā","wajaʿalnākum","shuʿūban","waqabāila","litaʿārafū","inna","akramakum","ʿinda","al-lahi","atqākum","inna","al-laha","ʿalīmun","khabīrun",null],"verseTiming":[[1,0,3200],[2,3200,4780],[3,4780,6300],[4,6300,7700],[5,7700,8780],[6,8780,9950],[7,9950,12380],[8,12380,14640],[9,14640,16220],[10,16220,18160],[11,18160,21090],[12,21090,22790],[13,22790,24600],[14,24600,25860],[15,25860,27140],[16,27140,28070],[17,28070,29910],[18,29910,31260],[19,31260,32170],[20,32170,33260],[21,33260,35775]]}}],"dua":{"id":51,"name":"Dua for Global Unity","arabicName":"دعاء الوحدة العالمية","reference":"49:13","verseTitle":"The Mutual Respect Supplication","significanceReason":"Promotes understanding, respect, and unity among diverse human communities and cultures."},"version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."}}