{"data":[{"name":"4:58","price":"اللہ تعالیٰ تمہیں تاکیدی حکم دیتا ہے کہ امانت والوں کی امانتیں انہیں پہنچاؤ!(1) اور جب لوگوں کا فیصلہ کرو تو عدل وانصاف سے فیصلہ کرو!(2) یقیناً وه بہتر چیز ہے جس کی نصیحت تمہیں اللہ تعالیٰ کر رہا ہے(3)۔ بے شک اللہ تعالیٰ سنتا ہے، دیکھتا ہے۔","arabic":"۞ إِنَّ ٱللَّهَ يَأۡمُرُكُمۡ أَن تُؤَدُّواْ ٱلۡأَمَٰنَٰتِ إِلَىٰٓ أَهۡلِهَا وَإِذَا حَكَمۡتُم بَيۡنَ ٱلنَّاسِ أَن تَحۡكُمُواْ بِٱلۡعَدۡلِۚ إِنَّ ٱللَّهَ نِعِمَّا يَعِظُكُم بِهِۦٓۗ إِنَّ ٱللَّهَ كَانَ سَمِيعَۢا بَصِيرٗا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa"],"ayahNumber":551,"juzNumber":5,"footnotes":"(1) اکثر مفسرین کے نزدیک یہ آیت حضرت عثمان بن طلحہ رضی اللہ عنہ کی شان میں، جو خاندانی طور پر خانہ کعبہ کے دربان وکلید بردار چلے آرہے تھے، نازل ہوئی ہے۔ مکہ فتح ہونے کے بعد جب رسول اللہ (صلى الله عليه وسلم) خانہ کعبہ میں تشریف لائے تو طواف وغیرہ کے بعد آپ (صلى الله عليه وسلم) نے حضرت عثمان بن طلحہ (رضي الله عنه) کو جو صلح حدیبیہ کے موقع پر مسلمان ہو چکے تھے، طلب فرمایا اور انہیں خانہ کعبہ کی چابیاں دے کر فرمایا یہ تمہاری چابیاں ہیں آج کا دن وفا اور نیکی کا دن ہے (ابن كثير) آیت کا یہ سبب نزول اگرچہ خاص ہے لیکن اس کا حکم عام ہے اور اس کے مخاطب عوام اور حکام دونوں ہیں۔ دونوں کو تاکید ہے کہ امانتیں انہیں پہنچاؤ جو امانتوں کے اہل ہیں۔ اس میں ایک تو وہ امانتیں شامل ہیں جو کسی نہ کسی کے پاس رکھوائی ہوں۔ ان میں خیانت نہ کی جائے بلکہ یہ بحفاظت عندالطلب لوٹا دی جائیں۔ دوسرے عہدے اور مناصب اہل لوگوں کو دیئے جائیں، محض سیاسی بنیاد یا نسلی ووطنی بنیاد یا قرابت وخاندان کی بنیاد یا کوٹہ سسٹم کی بنیاد پر عہدہ ومنصب دینا اس آیت کے خلاف ہے۔\n(2) اس میں حکام کو بطور خاص عدل وانصاف کا حکم دیا گیا ہے۔ ایک حدیث میں ہے ”حاکم جب تک ظلم نہ کرے، اللہ اس کے ساتھ ہوتا ہے جب وہ ظلم کا ارتکاب شروع کر دیتا ہے تو اللہ اسے اس کے اپنے نفس کے حوالے کر دیتا ہے“۔ (سنن ابن ماجہ کتاب الاحکام)\n(3) یعنی امانتیں اہل لوگوں کے سپرد کرنا اور عدل وانصاف مہیا کرنا۔","lang":"ur","meta":{"transliteration":"inna al-laha yamurukum an tu-addū al-amānāti ilā ahlihā wa-idhā ḥakamtum bayna al-nāsi an taḥkumū bil-ʿadli inna al-laha niʿimmā yaʿiẓukum bihi inna al-laha kāna samīʿan baṣīran ","translations":["Indeed","Allah","orders you","to","render","the trusts","to","their owners","and when","you judge","between","the people","to","judge","with justice","Indeed","Allah","excellently","advises you","with it","Indeed","Allah","is","All-Hearing","All-Seeing","(58)"],"transliterationArr":["inna","al-laha","yamurukum","an","tu-addū","al-amānāti","ilā","ahlihā","wa-idhā","ḥakamtum","bayna","al-nāsi","an","taḥkumū","bil-ʿadli","inna","al-laha","niʿimmā","yaʿiẓukum","bihi","inna","al-laha","kāna","samīʿan","baṣīran",null],"verseTiming":[[1,0,1080],[2,1080,1910],[3,1910,3120],[4,3120,3980],[5,3980,4770],[6,4770,6210],[7,6210,7810],[8,7810,8840],[9,8840,9500],[10,9500,11010],[11,11010,11490],[12,11490,12960],[13,12960,13690],[14,13690,14740],[15,14740,15630],[16,15630,17330],[17,17330,18170],[18,18170,19720],[19,19720,21250],[20,21250,22280],[21,22280,23170],[22,23170,24080],[23,24080,24690],[24,24690,26480],[25,26480,28135]]}}],"dua":{"id":53,"name":"Dua for Professional Integrity","arabicName":"دعاء النزاهة المهنية","reference":"4:58","verseTitle":"The Trust and Responsibility Supplication","significanceReason":"Emphasizes ethical conduct, trustworthiness, and responsible leadership in professional environments."},"version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."}}