{"data":[{"name":"4:114","price":"ان کے اکثر خفیہ مشوروں میں کوئی خیر نہیں(1) ، ہاں! بھلائی اس کے مشورے میں ہے جو خیرات کا یا نیک بات کا یا لوگوں میں صلح کرانے کا حکم کرے(2) اور جو شخص صرف اللہ تعالیٰ کی رضامندی حاصل کرنے کے ارادے سے یہ کام کرے(3) اسے ہم یقیناً بہت بڑا ﺛواب دیں گے۔","arabic":"۞ لَّا خَيۡرَ فِي كَثِيرٖ مِّن نَّجۡوَىٰهُمۡ إِلَّا مَنۡ أَمَرَ بِصَدَقَةٍ أَوۡ مَعۡرُوفٍ أَوۡ إِصۡلَٰحِۭ بَيۡنَ ٱلنَّاسِۚ وَمَن يَفۡعَلۡ ذَٰلِكَ ٱبۡتِغَآءَ مَرۡضَاتِ ٱللَّهِ فَسَوۡفَ نُؤۡتِيهِ أَجۡرًا عَظِيمٗا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa"],"ayahNumber":607,"juzNumber":5,"footnotes":"(1) نَجْوَى( سرگوشی) سے مراد وہ باتیں ہیں جو منافقین آپس میں مسلمانوں کے خلاف یا ایک دوسرے کے خلاف کرتے تھے۔\n(2) یعنی صدقہ خیرات، معروف (جو ہر قسم کی نیکی کو شامل ہے) اور اصلاح بین الناس کے بارے میں جو مشورے، خیر پر مبنی ہیں، جیسا کہ احادیث میں بھی ان امور کی فضیلت واہمیت بیان کی گئی ہے۔\n(3) کیونکہ اگر اخلاص (یعنی رضائے الٰہی کا مقصد) نہیں ہوگا تو بڑا سے بڑا عمل بھی نہ صرف ضائع جائے گا بلکہ وبال جان بن جائے گا۔ نعوذ بالله من الرياء والنفاق۔\n(4) احادیث میں اعمال مذکورہ کی بڑی فضیلت آئی ہے۔ اللہ کی راہ میں حلال کمائی سے ایک کھجور کے برابر صدقہ بھی احد پہاڑ جتنا ہو جائے گا (صحيح مسلم، كتاب الزكاة) نیک بات کی اشاعت بھی بڑی فضیلت ہے۔ اسی طرح رشتے داروں، دوستوں اور باہم ناراض دیگر لوگوں کے درمیان صلح کرا دینا، بہت بڑا عمل ہے۔ ایک حدیث میں اسے نفلی روزوں نفلی نمازوں اور نفلی صدقات وخیرات سے بھی افضل بتلایا گیا ہے۔ فرمایا: ”أَلا أُخْبِرُكُمْ بِأَفْضَلَ مِنْ دَرَجَةِ الصِّيَامِ وَالصَّلاةِ وَالصَّدَقَةِ؟ قَالُوا بَلَى:قال: إِصْلاحُ ذَاتِ الْبَيْنِ، قَالَ: وَفَسَادُ ذَاتِ الْبَيْنِ هِيَ الْحَالِقَةُ“ (ابوداود کتاب الادب۔ ترمذی،کتاب البرومسند احمد6 /444 ،445) حتی کہ صلح کرانے والے کو جھوٹ تک بولنے کی اجازت دے دی گئی تاکہ اسے ایک دوسرے کو قریب لانے کے لئے دروغ مصلحت آمیز کی ضرورت پڑے تو وہ اس میں بھی تامل نہ کرے ”لَيْسَ الْكَذَّابُ الَّذِي يُصْلِحُ بَيْنَ النَّاسِ، فَيَنْمِي خَيْرًا أو يَقُولُ خَيْرًا“ (بخاري، كتاب الصلح مسلم والترمذي، كتاب البر- أبو داود، كتاب الأدب)وہ شخص جھوٹا نہیں ہے جو لوگوں کے درمیان صلح کرانے کے لئے اچھی بات پھیلاتا یا اچھی بات کرتا ہے۔","lang":"ur","meta":{"transliteration":"lā khayra fī kathīrin min najwāhum illā man amara biṣadaqatin aw maʿrūfin aw iṣ'lāḥin bayna al-nāsi waman yafʿal dhālika ib'tighāa marḍāti al-lahi fasawfa nu'tīhi ajran ʿaẓīman ","translations":["(There is) no","good","in","much","of","their secret talk","except","(he) who","orders","charity","or","kindness","or","conciliation","between","the people","And who","does","that","seeking","pleasure","(of) Allah","then soon","We will give him","a reward","great","(114)"],"transliterationArr":["lā","khayra","fī","kathīrin","min","najwāhum","illā","man","amara","biṣadaqatin","aw","maʿrūfin","aw","iṣ'lāḥin","bayna","al-nāsi","waman","yafʿal","dhālika","ib'tighāa","marḍāti","al-lahi","fasawfa","nu'tīhi","ajran","ʿaẓīman",null],"verseTiming":[[1,0,460],[2,460,1110],[3,1110,1480],[4,1480,2250],[5,2250,3170],[6,3170,4740],[7,4740,5530],[8,5530,5870],[9,5870,6520],[10,6520,7730],[11,7730,8050],[12,8050,9300],[13,9300,9660],[14,9660,10890],[15,10890,11840],[16,11840,14510],[17,14510,15140],[18,15140,16640],[19,16640,17360],[20,17360,19630],[21,19630,20670],[22,20670,21460],[23,21460,22290],[24,22290,23310],[25,23310,23950],[26,23950,25475]]}}],"dua":{"id":56,"name":"Dua for Interpersonal Harmony","arabicName":"دعاء الوئام الاجتماعي","reference":"4:114","verseTitle":"The Reconciliation Supplication","significanceReason":"Encourages promoting peace, resolving conflicts, and maintaining positive social relationships."},"version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."}}