{"data":[{"name":"1:6","price":"ہمیں سیدھی (اور سچی) راه دکھا۔(1)","arabic":"ٱهۡدِنَا ٱلصِّرَٰطَ ٱلۡمُسۡتَقِيمَ","category":["1 (Al-Fatihah)","Al-Fatihah","Surah Al-Fatihah"],"ayahNumber":6,"juzNumber":1,"footnotes":"(1) ہدایت کے کئی مفہوم ہیں۔ راستے کی طرف رہنمائی کرنا، راستے پر چلا دینا، منزل مقصود پر پہنچا دینا۔ اسے عربی میں ارشاد، توفیق، الہام اور دلالت سے تعبیر کیا جاتا ہے، یعنی ہماری صراط مستقیم کی طرف رہنمائی فرما، اس پر چلنے کی توفیق اور اس پر استقامت نصیب فرما، تاکہ ہمیں تیری رضا (منزل مقصود) حاصل ہوجائے۔ یہ صراط مستقیم محض عقل اور ذہانت سے حاصل نہیں ہوسکتی۔ یہ صراط مستقیم وہی ”الإِسْلام“ ہے، جسے نبی (صلى الله عليه وسلم) نے دنیا کے سامنے پیش فرمایا اور جو اب قرآن واحادیث صحیحہ میں محفوظ ہے۔","lang":"ur","meta":{"transliteration":"ih'dinā al-ṣirāṭa al-mus'taqīma ","translations":["Guide us","(to) the path","the straight","(6)"],"transliterationArr":["ih'dinā","al-ṣirāṭa","al-mus'taqīma",null],"verseTiming":[[1,0,740],[2,740,1640],[3,1640,5525]]}},{"name":"1:7","price":"ان لوگوں کی راه جن پر تو نے انعام کیا(1) ان کی نہیں جن پر غضب کیا گیا (یعنی وه لوگ جنہوں نے حق کو پہچانا، مگر اس پر عمل پیرا نہیں ہوئے) اور نہ گمراہوں کی(2) (یعنی وه لوگ جو جہالت کے سبب راه حق سے برگشتہ ہوگئے)۔","arabic":"صِرَٰطَ ٱلَّذِينَ أَنۡعَمۡتَ عَلَيۡهِمۡ غَيۡرِ ٱلۡمَغۡضُوبِ عَلَيۡهِمۡ وَلَا ٱلضَّآلِّينَ","category":["1 (Al-Fatihah)","Al-Fatihah","Surah Al-Fatihah"],"ayahNumber":7,"juzNumber":1,"footnotes":"(1) یہ صراط مستقیم کی وضاحت ہے کہ یہ سیدھا راستہ وہ ہے جس پر وہ لوگ چلے، جن پر تیرا انعام ہوا، یہ منعم علیہ گروہ ہے انبیا شہدا صدیقین اور صالحین کا۔ جیسا کہ سورۂ نساء میں ہے: «وَمَنْ يُطِعِ اللَّهَ وَالرَّسُولَ فَأُولَئِكَ مَعَ الَّذِينَ أَنْعَمَ اللَّهُ عَلَيْهِمْ مِنَ النَّبِيِّينَ وَالصِّدِّيقِينَ وَالشُّهَدَاءِ وَالصَّالِحِينَ وَحَسُنَ أُولَئِكَ رَفِيقًا» (النساء: 69) ”اور جو اللہ اور اس کے رسول (صلى الله عليه وسلم) کی اطاعت کرتے ہیں، وہ قیامت کے روز ان لوگوں کے ساتھ ہوں گے جن پر اللہ نے انعام کیا، یعنی انبیا، صدیقین، شہدا، اور صالحین، اور ان لوگوں کی رفاقت بہت ہی خوب ہے۔“ اس آیت میں یہ بھی وضاحت کردی گئی ہے کہ انعام یافتہ لوگوں کا یہ راستہ اطاعت الٰہی اور اطاعت رسول (صلى الله عليه وسلم) ہی کا راستہ ہے، نہ کہ کوئی اور راستہ۔\n(2) بعض روایات سے ثابت ہے کہ «مَغْضُوبٌ عَلَيْهِمْ» ”جن پر اللہ کا غضب نازل ہوا“ سے مراد یہودی اور «ضَالِّيْنَ» ”گمراہوں“ سے مراد نصاریٰ (عیسائی) ہیں۔ ابن ابی حاتم کہتے ہیں کہ مفسرین کے درمیان اس میں کوئی اختلاف نہیں۔ ”لا أَعْلَمُ خِلافًا بَيْنَ الْمُفَسِّرِينَ فِي تَفْسِيرِ الْمَغْضُوبِ عَلَيْهِمْ : بِالْيَهُود وَ الضَّالِّينَ بالنَّصَارَى“ (فتح القدیر)، اس لئے صراط مستقیم پر چلنے کی خواہش رکھنے والوں کے لئے ضروری ہے کہ وہ یہود اور نصاریٰ دونوں کی گمراہیوں سے بچ کر رہیں۔ یہود کی بڑی گمراہی یہ تھی کہ وہ جانتے بوجھتے صحیح راستے پر نہیں چلتے تھے، آیات الٰہی میں تحریف اور حیلہ کرنے سے گریز نہیں کرتے تھے، حضرت عزیر (عليه السلام) کو ”ابن اللہ“ کہتے، اپنے احبار ورھبان کو حرام وحلال کرنے کا مجاز سمجھتے تھے۔ نصاریٰ کی بڑی غلطی یہ تھی کہ انہوں نے حضرت عیسیٰ (عليه السلام) کی شان میں غلو کیا اور انہیں ”ابْنُ اللهِ“ اور ”ثَالِثُ ثَلاثَةٍ“ (اللہ کا بیٹا اور تین خدا میں سے ایک) قرار دیا۔ افسوس ہے کہ امت محمدیہ میں بھی یہ گمراہیاں عام ہیں اور اسی وجہ سے وہ دنیا میں ذلیل و رسوا ہیں۔ اللہ تعالیٰ اسے ضلالت کے گڑھے سے نکالے، تاکہ ادبار ونکبت کے بڑھتے ہوئے سائے سے وہ محفوظ رہ سکیں۔\nسورۂ فاتحہ کے آخر میں آمین کہنے کی نبی (صلى الله عليه وسلم) نے بڑی تاکید اور فضیلت فرمائی ہے۔ اس لئے امام اور مقتدی ہر ایک کو آمین کہنی چاہیے۔ نبی (صلى الله عليه وسلم) جہری نمازوں میں اونچی آواز سے آمین کہا کرتے تھے اور صحابہ (رضي الله عنهم) بھی، حتیٰ کہ مسجد گونج اٹھتی۔ (ابن ماجہ۔ ابن کثیر)، بنابریں آمین اونچی آواز سے کہنا سنت اور صحابہ کرام (رضي الله عنهم) کا معمول بہ ہے۔ آمین کے معنی مختلف بیان کیے گئے ہیں۔ ”كَذَلِكَ فَلْيَكُنْ“ (اسی طرح ہو)، ”لا تُخَيِّبْ رَجَاءَنا“ (ہمیں نامراد نہ کرنا)، ”اللَّهُمَّ! اسْتَجِبْ لَنَا“ (اے اللہ ہماری دعا قبول فرمالے)۔","lang":"ur","meta":{"transliteration":"ṣirāṭa alladhīna anʿamta ʿalayhim ghayri al-maghḍūbi ʿalayhim walā al-ḍālīna ","translations":["(The) path","(of) those","You have bestowed (Your) Favors","on them","not (of)","those who earned (Your) wrath","on themselves","and not","(of) those who go astray","(7)"],"transliterationArr":["ṣirāṭa","alladhīna","anʿamta","ʿalayhim","ghayri","al-maghḍūbi","ʿalayhim","walā","al-ḍālīna",null],"verseTiming":[[1,0,750],[2,750,1670],[3,1670,2690],[4,2690,3620],[5,3620,4210],[6,4210,5380],[7,5380,6380],[8,6380,6670],[9,6670,13175]]}}],"dua":{"id":6,"name":"Dua of Right Guidance","arabicName":"دعاء الهداية","reference":"1:6-7","verseTitle":"The Guidance Supplication","significanceReason":"Most repeated dua in daily prayers, seeking divine guidance and protection from misguided paths. Muslims recite this in every prayer, making it universally recognized and spiritually powerful."},"version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."}}