{"data":[{"name":"33:33","price":"اور اپنے گھروں میں قرار سے رہو(1) اور قدیم جاہلیت کے زمانے کی طرح اپنے بناؤ کا اﻇہار نہ کرو(2) اور نماز ادا کرتی رہو اور زکوٰة دیتی رہو اور اللہ اور اس کے رسول کی اطاعت گزاری کرو(3)۔ اللہ تعالیٰ یہی چاہتا ہے کہ اے نبی کی گھر والیو(4)! تم سے وه (ہر قسم کی) گندگی کو دور کردے اور تمہیں خوب پاک کردے.","arabic":"وَقَرۡنَ فِي بُيُوتِكُنَّ وَلَا تَبَرَّجۡنَ تَبَرُّجَ ٱلۡجَٰهِلِيَّةِ ٱلۡأُولَىٰۖ وَأَقِمۡنَ ٱلصَّلَوٰةَ وَءَاتِينَ ٱلزَّكَوٰةَ وَأَطِعۡنَ ٱللَّهَ وَرَسُولَهُۥٓۚ إِنَّمَا يُرِيدُ ٱللَّهُ لِيُذۡهِبَ عَنكُمُ ٱلرِّجۡسَ أَهۡلَ ٱلۡبَيۡتِ وَيُطَهِّرَكُمۡ تَطۡهِيرٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3566,"juzNumber":22,"footnotes":"(1) یعنی ٹک کر رہو اور بغیر ضروری حاجت کے گھر سے باہر نہ نکلو۔ اس میں وضاحت کردی گئی ہے کہ عورت کا دائرہ عمل امور سیاست وجہاں بانی نہیں، معاشی جھمیلے بھی نہیں، بلکہ گھر کی چاردیواری کے اندر رہ کر امور خانہ داری سرانجام دینا ہے۔\n(2) اس میں گھر سے باہر نکلنے کے آداب بتلا دیئے کہ اگر باہر جانے کی ضرورت پیش آئے تو بناؤ سنگھار کرکے یا ایسے انداز سے، جس سے تمہارا بناؤ سنگھار ظاہر ہو، مت نکلو۔ جیسے بےپردہ ہو کر، جس سے تمہارا سر، چہرہ، بازو اور چھاتی وغیرہ لوگوں کو دعوت نظارہ دے۔ بلکہ بغیر خوشبو لگائے، سادہ لباس میں ملبوس اور باپردہ باہر نکلو تَبَرُّجٌ بےپردگی اور زیب وزینت کے اظہار کو کہتے ہیں۔ قرآن نے واضح کردیا ہے کہ یہ تبرج، جاہلیت ہے، جو اسلام سے پہلے تھی اور آئندہ بھی، جب کبھی اسے اختیار کیا جائے گا، یہ جاہلیت ہی ہوگی، اسلام سے اس کا کوئی تعلق نہیں ہے، چاہے اس کا نام کتنا ہی خوش نما، دل فریب رکھ لیا جائے۔\n(3) پچھلی ہدایات، برائی سے اجتناب سے متعلق تھیں، یہ ہدایات نیکی اختیار کرنے سے متعلق ہیں۔\n(4) اہل بیت سے کون مراد ہیں؟ اس کی تعیین میں کچھ اختلاف ہے۔ بعض نے ازواج مطہرات کو مراد لیا ہے، جیسا کہ یہاں قرآن کریم کے سیاق سے واضح ہے۔ قرآن نے یہاں ازواج مطہرات ہی کو اہل البیت کہا ہے۔ قرآن کے دوسرے مقامات پر بھی بیوی کو اہل بیت کہا گیا ہے۔ مثلاً سورۂ ھود، آیت 73 میں۔ اس لئے ازواج مطہرات کا اہل بیت ہونا نص قرآنی سے واضح ہے۔ بعض حضرات، بعض روایات کی رو سے اہل بیت کا مصداق صرف حضرت علی، حضرت فاطمہ اور حضرت حسن وحسین (رضي الله عنهم) کو مانتے ہیں اور ازواج مطہرات کو اس سے خارج سمجھتے ہیں، جب کہ اول الذکر، ان اصحاب اربعہ کو اس سے خارج سمجھتے ہیں۔ تاہم اعتدال کی راہ اور نقطہ متوسط یہ ہے کہ دونوں ہی اہل بیت ہیں۔ ازواج مطہرات تو اس نص قرانی کی وجہ سے اور داماد واولاد ان روایات کی رو سے جو صحیح سند سے ثابت ہیں جن میں نبی کریم (صلى الله عليه وسلم) نے ان کو اپنی چادر میں لے کر فرمایا کہ اے اللہ یہ میرے اہل بیت ہیں، جس کا مطلب یہ ہوگا کہ یہ بھی میرے اہل بیت سے ہیں یا یہ دعا ہے کہ یا اللہ ان کوبھی ازواج مطہرات کی طرح، میرے اہل بیت میں شامل فرما دے۔ اس طرح یہ تمام دلائل میں بھی تطبیق ہوجاتی ہے۔ (مزید تفصیل کے لئے دیکھئے فتح القدیر، للشوکانی)۔","lang":"ur","meta":{"transliteration":"waqarna fī buyūtikunna walā tabarrajna tabarruja al-jāhiliyati al-ūlā wa-aqim'na al-ṣalata waātīna al-zakata wa-aṭiʿ'na al-laha warasūlahu innamā yurīdu al-lahu liyudh'hiba ʿankumu al-rij'sa ahla al-bayti wayuṭahhirakum taṭhīran ","translations":["And stay","in","your houses","and (do) not","display yourselves","(as was the) display","(of the times of) ignorance","the former","And establish","the prayer","and give","zakah","and obey","Allah","and His Messenger","Only","Allah wishes","Allah wishes","to remove","from you","the impurity","(O) People","(of) the House","And to purify you","(with thorough) purification","(33)"],"transliterationArr":["waqarna","fī","buyūtikunna","walā","tabarrajna","tabarruja","al-jāhiliyati","al-ūlā","wa-aqim'na","al-ṣalata","waātīna","al-zakata","wa-aṭiʿ'na","al-laha","warasūlahu","innamā","yurīdu","al-lahu","liyudh'hiba","ʿankumu","al-rij'sa","ahla","al-bayti","wayuṭahhirakum","taṭhīran",null],"verseTiming":[[1,0,740],[2,740,1220],[3,1220,3390],[4,3390,3900],[5,3900,5040],[6,5040,6020],[7,6020,7680],[8,7680,8500],[9,8500,9500],[10,9500,11900],[11,11900,13180],[12,13180,14200],[13,14200,15250],[14,15250,16360],[15,16360,17210],[16,17210,18110],[17,18110,19660],[18,19660,21290],[19,21290,22110],[20,22110,22910],[21,22910,23890],[22,23890,25100],[23,25100,25940],[24,25940,26350],[25,26350,27280],[26,27280,28790],[27,28790,30485]]}}],"dua":{"id":69,"name":"Ayat al-Tathir","arabicName":"آية التطهير","reference":"33:33","verseTitle":"The Verse of Purification","significanceReason":"Emphasizes spiritual purification of the Prophet's household (Ahl al-Bayt), highlighting divine selection and spiritual cleansing. Significant in both theological and spiritual interpretations."},"version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."}}