{"data":[{"name":"20:114","price":"پس اللہ عالی شان واﻻ سچا اور حقیقی بادشاه(1) ہے۔ تو قرآن پڑھنے میں جلدی نہ کر اس سے پہلے کہ تیری طرف جو وحی کی جاتی ہے وه پوری کی جائے(2)، ہاں یہ دعا کر کہ پروردگار! میرا علم بڑھا.(3)","arabic":"فَتَعَٰلَى ٱللَّهُ ٱلۡمَلِكُ ٱلۡحَقُّۗ وَلَا تَعۡجَلۡ بِٱلۡقُرۡءَانِ مِن قَبۡلِ أَن يُقۡضَىٰٓ إِلَيۡكَ وَحۡيُهُۥۖ وَقُل رَّبِّ زِدۡنِي عِلۡمٗا","category":["20 (Ta-Ha)","Ta-Ha","Surah Ta-Ha"],"ayahNumber":2462,"juzNumber":16,"footnotes":"(1) جس کا وعدہ اور وعید حق ہے، جنت دوزخ حق ہے اور اس کی ہر بات حق ہے۔\n(2) جبرائیل (عليه السلام) جب وحی لے کر آتے اور سناتے تو نبی (صلى الله عليه وسلم) بھی جلدی جلدی ساتھ ساتھ پڑھتے جاتے، کہ کہیں کچھ بھول نہ جائیں، اللہ تعالٰی نے اس سے منع فرمایا اور تاکید کی کہ غور سے، پہلے وحی کو سنیں، اس کو یاد کرانا اور دل میں بٹھا دینا ہمارا کام ہے۔ جیسا کہ سورۃ القيامۃ میں آئے گا۔\n(3) یعنی اللہ تعالٰی سے زیادتی علم کی دعا فرماتے رہیں۔ اس میں علماء کے لئے بھی نصیحت ہے کہ وہ فتوٰی میں پوری تحقیق اور غور سے کام لیں، جلد بازی سے بچیں اور علم میں اضافہ کی صورتیں اختیار کرنے میں کوتاہی نہ کریں علاوہ ازیں علم سے مراد قرآن و حدیث کا علم ہے۔ قرآن میں اسی کو علم سے تعبیر کیا گیا اور ان کے حاملین کو علماء دیگر چیزوں کا علم، جو انسان کسب معاش کے لئے حاصل کرتا ہے، وہ سب فن ہیں، ہنر ہیں اور صنعت وحرفت ہیں۔ نبی کریم (صلى الله عليه وسلم) جس علم کے لئے دعا فرماتے تھے، وہ وحی و رسالت ہی کا علم ہے جو قرآن و حدیث میں محفوظ ہے، جس سے انسان کا ربط و تعلق اللہ تعالٰی کے ساتھ قائم ہوتا ہے، اس کے اخلاق و کردار کی اصلاح ہوتی اور اللہ کی رضا و عدم رضا کا پتہ چلتا ہے ایسی دعاؤں میں ایک دعا یہ ہے جو آپ پڑھا کرتے تھے۔ «اللَّهُمَّ انْفَعْنِي بِمَا عَلَّمْتَنِي، وَعَلِّمْنِي مَا يَنْفَعُنِي، وَزِدْنِي عِلْمًا، وَالْحَمْدُ للهِ عَلَى كُلِّ حَالٍ»۔ ( ابن ماجه، باب الانتفاع بالعلم والعمل المقدمة)","lang":"ur","meta":{"transliteration":"fataʿālā al-lahu al-maliku al-ḥaqu walā taʿjal bil-qur'āni min qabli an yuq'ḍā ilayka waḥyuhu waqul rabbi zid'nī ʿil'man ","translations":["So high (above all)","(is) Allah","the King","the True","And (do) not","hasten","with the Quran","before","before","[that]","is completed","to you","its revelation","and say","My Lord","Increase me","(in) knowledge","(114)"],"transliterationArr":["fataʿālā","al-lahu","al-maliku","al-ḥaqu","walā","taʿjal","bil-qur'āni","min","qabli","an","yuq'ḍā","ilayka","waḥyuhu","waqul","rabbi","zid'nī","ʿil'man",null],"verseTiming":[[1,0,1040],[2,1040,1900],[3,1900,2780],[4,2780,3930],[5,3930,4450],[6,4450,5390],[7,5390,6780],[8,6780,7560],[9,7560,8630],[10,8630,8820],[11,8820,11720],[12,11720,12580],[13,12580,13700],[14,13700,14080],[15,14080,15040],[16,15040,16080],[17,16080,17855]]}}],"dua":{"id":7,"name":"Dua for Knowledge and Wisdom","arabicName":"دعاء العلم والحكمة","reference":"20:114","verseTitle":"The Wisdom Increase Supplication","significanceReason":"Specifically requests increase in knowledge, extremely popular among students, scholars, and those seeking intellectual and spiritual enlightenment."},"version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."}}