{"data":[{"name":"24:35","price":"اللہ نور ہے آسمانوں اور زمین کا(1) ، اس کے نور کی مثال مثل ایک طاق کے ہے جس میں چراغ ہو اور چراغ شیشہ کی قندیل میں ہو اور شیشہ مثل چمکتے ہوئے روشن ستارے کے ہو وه چراغ ایک بابرکت درخت زیتون کے تیل سے جلایا جاتا ہو جو درخت نہ مشرقی ہے نہ مغربی خود وه تیل قریب ہے کہ آپ ہی روشنی دینے لگے اگرچہ اسے آگ نہ بھی چھوئے، نور پر نور ہے(2)، اللہ تعالیٰ اپنے نور کی طرف رہنمائی کرتا ہے جسے چاہے(3)، لوگوں (کے سمجھانے) کو یہ مثالیں اللہ تعالیٰ بیان فرما رہا ہے(4)، اور اللہ تعالیٰ ہر چیز کے حال سے بخوبی واقف ہے.","arabic":"۞ ٱللَّهُ نُورُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ مَثَلُ نُورِهِۦ كَمِشۡكَوٰةٖ فِيهَا مِصۡبَاحٌۖ ٱلۡمِصۡبَاحُ فِي زُجَاجَةٍۖ ٱلزُّجَاجَةُ كَأَنَّهَا كَوۡكَبٞ دُرِّيّٞ يُوقَدُ مِن شَجَرَةٖ مُّبَٰرَكَةٖ زَيۡتُونَةٖ لَّا شَرۡقِيَّةٖ وَلَا غَرۡبِيَّةٖ يَكَادُ زَيۡتُهَا يُضِيٓءُ وَلَوۡ لَمۡ تَمۡسَسۡهُ نَارٞۚ نُّورٌ عَلَىٰ نُورٖۚ يَهۡدِي ٱللَّهُ لِنُورِهِۦ مَن يَشَآءُۚ وَيَضۡرِبُ ٱللَّهُ ٱلۡأَمۡثَٰلَ لِلنَّاسِۗ وَٱللَّهُ بِكُلِّ شَيۡءٍ عَلِيمٞ","category":["24 (An-Nur)","An-Nur","Surah An-Nur"],"ayahNumber":2826,"juzNumber":18,"footnotes":"(1) یعنی اگر اللہ نہ ہوتا تو نہ آسمان میں نور ہوتا نہ زمین میں، نہ آسمان وزمین میں کسی کو ہدایت ہی نصیب ہوتی۔ پس وہ اللہ تعالیٰ ہی آسمان وزمین کو روشن کرنے والا ہے اس کی کتاب نور ہے، اس کا رسول (بہ حیثیت صفات کے) نور ہے۔ یعنی ان دونوں کے ذریعے سے زندگی کی تاریکیوں میں رہنمائی اور روشنی حاصل کی جاتی ہے، جس طرح چراغ اور بلب سے انسان روشنی حاصل کرتا ہے۔ حدیث میں بھی اللہ کا نور ہونا ثابت ہے۔ «وَلَكَ الْحَمْدُ أَنْتَ نُورُ السَّمَوَاتِ وَالأَرْضِ وَمَنْ فِيهِنَّ» (البخاري، باب التهجد بالليل، ومسلم كتاب صلاة المسافرين باب الدعاء في صلاة الليل) پس اللہ، اس کی ذات نور ہے، اس کا حجاب نور ہے اور ہر ظاہری اور معنوی نور کا خالق، اس کا عطا کرنے والا اور اس کی طرف ہدایت کرنے والا صرف ایک اللہ ہے (ایسرالتفاسیر)۔\n(2) یعنی جس طرح ایک طاق میں ایسا چراغ ہو، جو شیشے کی قندیل میں ہو، اس میں ایک بابرکت درخت کا ایسا خاص تیل ڈالا گیا ہو کہ وہ آگ (دیا سلائی) دکھائے بغیر ہی بذات خود روشن ہوجانے کے قریب ہو۔ یوں یہ ساری روشنیاں ایک طاق میں مجتمع ہوگئیں اور وہ بقعہ نور بن گیا۔ اسی طرح اللہ کے نازل کردہ دلائل وبراہین کی حیثیت ہے کہ وہ واضح بھی ہیں اور ایک سے ایک بڑھ کر بھی یعنی نور علیٰ نور جو مشرقی ہے، نہ مغربی کا مطلب ہے، وہ درخت ایسے کھلے میدان اور صحرا میں ہے کہ اس پر دھوپ صرف سورج کے چڑھنے کے وقت یا غروب کے وقت ہی نہیں پڑتی، بلکہ سارا دن وہ دھوپ میں رہتا ہے اور ایسے درخت کا پھل بہت عمدہ ہوتا ہے اور مراد اس سے زیتون کا درخت ہے جس کا پھل اور تیل سالن کے طور پر بھی استعمال ہوتا ہے اور چراغ میں تیل کے طور پر بھی۔\n(3) نُورٌ سے مراد ایمان و اسلام ہے، یعنی اللہ تعالیٰ جن کے اندر ایمان کی رغبت اور اس کی طلب دیکھتا ہے، ان کی اس نور کی طرف رہنمائی فرما دیتا ہے، جس سے دین و دنیا کی سعادتوں کے دروازے ان کے لئے کھل جاتے ہیں۔\n(4) جس طرح اللہ نے یہ مثال بیان فرمائی، جس میں اس نے ایمان کو اور اپنے مومن بندے کے دل میں اس کے راسخ ہونے اور بندوں کے احوال قلوب کا علم رکھنے کو واضح فرمایا کہ کون ہدایت کا اہل ہے اور کون نہیں۔","lang":"ur","meta":{"transliteration":"al-lahu nūru al-samāwāti wal-arḍi mathalu nūrihi kamish'katin fīhā miṣ'bāḥun al-miṣ'bāḥu fī zujājatin al-zujājatu ka-annahā kawkabun durriyyun yūqadu min shajaratin mubārakatin zaytūnatin lā sharqiyyatin walā gharbiyyatin yakādu zaytuhā yuḍīu walaw lam tamsashu nārun nūrun ʿalā nūrin yahdī al-lahu linūrihi man yashāu wayaḍribu al-lahu al-amthāla lilnnāsi wal-lahu bikulli shayin ʿalīmun ","translations":["Allah","(is the) Light","(of) the heavens","and the earth","(The) example","(of) His Light","(is) like a niche","in it","(is) a lamp","the lamp","(is) in","a glass","the glass","as if it were","a star","brilliant","(which) is lit","from","a tree","blessed ","an olive","not","(of the) east","and not","(of the) west","would almost","its oil","glow","even if","not","touched it","fire","Light","upon","Light","Allah guides","Allah guides","to His Light","whom","He wills","And Allah sets forth","And Allah sets forth","the examples","for the mankind","And Allah","of every","thing","(is) All-Knower","(35)"],"transliterationArr":["al-lahu","nūru","al-samāwāti","wal-arḍi","mathalu","nūrihi","kamish'katin","fīhā","miṣ'bāḥun","al-miṣ'bāḥu","fī","zujājatin","al-zujājatu","ka-annahā","kawkabun","durriyyun","yūqadu","min","shajaratin","mubārakatin","zaytūnatin","lā","sharqiyyatin","walā","gharbiyyatin","yakādu","zaytuhā","yuḍīu","walaw","lam","tamsashu","nārun","nūrun","ʿalā","nūrin","yahdī","al-lahu","linūrihi","man","yashāu","wayaḍribu","al-lahu","al-amthāla","lilnnāsi","wal-lahu","bikulli","shayin","ʿalīmun",null],"verseTiming":[[1,0,1140],[2,1140,1760],[3,1760,3360],[4,3360,4890],[5,4890,5730],[6,5730,6850],[7,6850,9190],[8,9190,10170],[9,10170,12540],[10,12540,14520],[11,14520,14950],[12,14950,16420],[13,16420,18040],[14,18040,20010],[15,20010,21950],[16,21950,23060],[17,23060,24899],[18,24899,25789],[19,25789,26799],[20,26799,29379],[21,29379,30369],[22,30369,30819],[23,30819,32359],[24,32359,34709],[25,34709,36579],[26,36579,37129],[27,37129,39389],[28,39389,39959],[29,39959,41349],[30,41349,43029],[31,43029,44169],[32,44169,46738],[33,46738,47968],[34,47968,49058],[35,49058,51488],[36,51488,52098],[37,52098,52588],[38,52588,55298],[39,55298,56368],[40,56368,57288],[41,57288,58008],[42,58008,60558],[43,60558,61258],[44,61258,62148],[45,62148,63428],[46,63428,63668],[47,63668,67778],[48,67778,68808],[49,68808,69768],[50,69768,71208],[51,71208,74807],[52,74807,75967],[53,75967,76807],[54,76807,77767],[55,77767,80192]]}}],"dua":{"id":70,"name":"Ayat al-Nur","arabicName":"آية النور","reference":"24:35","verseTitle":"The Light Verse","significanceReason":"A profound metaphorical description of divine guidance, comparing Allah's light to a luminous cosmic phenomenon. Represents spiritual enlightenment and the subtle nature of divine guidance."},"version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."}}