{"data":[{"name":"42:23","price":"یہی وه ہے جس کی بشارت اللہ تعالیٰ اپنے ان بندوں کو دے رہا ہے جو ایمان ﻻئے اور (سنت کے مطابق) نیک عمل کیے تو کہہ دیجئے! کہ میں اس پر تم سے کوئی بدلہ نہیں چاہتا مگر محبت رشتہ داری کی(1) ، جو شخص کوئی نیکی کرے ہم اس کے لیے اس کی نیکی میں اور نیکی بڑھا دیں گے(2)۔ بیشک اللہ تعالیٰ بخشنے واﻻ (اور) بہت قدر دان ہے.(3)","arabic":"ذَٰلِكَ ٱلَّذِي يُبَشِّرُ ٱللَّهُ عِبَادَهُ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِۗ قُل لَّآ أَسۡـَٔلُكُمۡ عَلَيۡهِ أَجۡرًا إِلَّا ٱلۡمَوَدَّةَ فِي ٱلۡقُرۡبَىٰۗ وَمَن يَقۡتَرِفۡ حَسَنَةٗ نَّزِدۡ لَهُۥ فِيهَا حُسۡنًاۚ إِنَّ ٱللَّهَ غَفُورٞ شَكُورٌ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura"],"ayahNumber":4295,"juzNumber":25,"footnotes":"(1) قبائل قریش اور نبی (صلى الله عليه وسلم) کے درمیان رشتے داری کا تعلق تھا، آیت کا مطلب بالکل واضح ہے کہ میں وعظ ونصیحت اور تبلیغ ودعوت کی کوئی اجرت تم سے نہیں مانگتا، البتہ ایک چیز کا سوال ضرور ہے کہ میرے اور تمہارے درمیان جو رشتے داری ہے، اس کا لحاظ کرو، تم میری دعوت کو نہیں مانتے تو نہ مانو، تمہاری مرضی۔ لیکن مجھے نقصان پہنچانے سے تو باز رہو، تم میرے دست وبازو نہیں بن سکتے تو رشتہ داری وقرابت کے ناطے مجھے ایذا تو نہ پہنچاؤ اور میرے راستے کا روڑہ تو نہ بنو کہ میں فریضۂ رسالت ادا کرسکوں۔ حضرت ابن عباس ب نے اس کے معنی کیے ہیں کہ میرے اور تمہارے درمیان جو قرابت (رشتہ داری) ہے اس کو قائم رکھو۔ (صحيح البخاري، تفسير سور الشورىٰ) نبی کریم (صلى الله عليه وسلم) کی آل، یقیناً حسب ونسب کے اعتبار سے دنیا کی اشرف ترین آل ہے اس سے محبت، اس کی تعظیم وتوقیر جزو ایمان ہے۔ اس لیے کہ نبی (صلى الله عليه وسلم) نے بھی احادیث میں ان کی تکریم اور حفاظت کی تاکید فرمائی ہے لیکن اس آیت کا کوئی تعلق اس موضوع سے نہیں ہے، جیسا کہ شیعہ حضرات کھینچا تانی کرکے اس آیت کو آل محمد (صلى الله عليه وسلم) کی محبت کے ساتھ جوڑتے ہیں اور پھر آل کو بھی انہوں نے محدود کردیا ہے، حضرت علی رضی اللہ عنہ و حضرت فاطمہ رضی الله عنها اور حسنین رضی اللہ عنہما تک۔ نیز محبت کا مفہوم بھی ان کے نزدیک یہ ہے کہ انہیں معصوم اور الٰہی اختیارات سے متصف مانا جائے۔ علاوہ ازیں کفار مکہ سے اپنے گھرانے کی محبت کا سوال بطور اجرت تبلیغ نہایت عجیب بات ہے جو نبی (صلى الله عليه وسلم) کی شان ارفع سے بہت ہی فروتر ہے آپ (صلى الله عليه وسلم) کی تبلیغ کو قبول نہ کرنے کے باوجود آپ (صلى الله عليه وسلم) کی طلب تو صرف قرابت اور صلۂ رحمی کی بنیاد پر محبت برقرار رکھنے کی تھی پھر یہ آیت اور سورت مکی ہے جب کہ حضرت علی ﺅ اور حضرت فاطمہ (رضی الله عنها) کے درمیان ابھی عقد زواج بھی قائم نہیں ہوا تھا۔ یعنی ابھی وہ گھرانہ معرض وجود میں ہی نہیں آیا تھا جس کی خودساختہ محبت کا اثبات اس آیت سے کیا جاتا ہے۔\n(2) یعنی اجر وثواب میں اضافہ کریں گے۔ یا نیکی کے بعد اس کا بدلہ مزید نیکی کی توفیق کی صورت میں دیں گے جس طرح بدی کا بدلہ مزید بدیوں کا ارتکاب ہے۔\n(3) اس لیے وہ پردہ پوشی فرماتا اور معاف کردیتا ہے اور زیادہ سے زیادہ اجر دیتا ہے۔","lang":"ur","meta":{"transliteration":"dhālika alladhī yubashiru al-lahu ʿibādahu alladhīna āmanū waʿamilū al-ṣāliḥāti qul lā asalukum ʿalayhi ajran illā al-mawadata fī al-qur'bā waman yaqtarif ḥasanatan nazid lahu fīhā ḥus'nan inna al-laha ghafūrun shakūrun ","translations":["That","(is of) which","Allah gives glad tidings","Allah gives glad tidings","(to) His slaves ","those who","believe","and do","righteous deeds","Say","Not","I ask you","for it","any payment","except","the love","among","the relatives","And whoever","earns","any good","We increase","for him","therein","good","Indeed","Allah","(is) Oft-Forgiving","All-Appreciative","(23)"],"transliterationArr":["dhālika","alladhī","yubashiru","al-lahu","ʿibādahu","alladhīna","āmanū","waʿamilū","al-ṣāliḥāti","qul","lā","asalukum","ʿalayhi","ajran","illā","al-mawadata","fī","al-qur'bā","waman","yaqtarif","ḥasanatan","nazid","lahu","fīhā","ḥus'nan","inna","al-laha","ghafūrun","shakūrun",null],"verseTiming":[[1,0,970],[2,970,1850],[3,1850,2780],[4,2780,3660],[5,3660,4720],[6,4720,5740],[7,5740,6920],[8,6920,7640],[9,7640,9450],[10,9450,9550],[11,9550,10500],[12,10500,11590],[13,11590,13480],[14,13480,14660],[15,14660,15570],[16,15570,16360],[17,16360,16900],[18,16900,18200],[19,18200,18430],[20,18430,19650],[21,19650,20570],[22,20570,21570],[23,21570,22520],[24,22520,23510],[25,23510,24880],[26,24880,25450],[27,25450,26300],[28,26300,27820],[29,27820,28950],[30,28950,29860],[31,29860,31500],[32,31500,34245]]}}],"dua":{"id":72,"name":"Ayat al-Mawaddah","arabicName":"آية المودة","reference":"42:23","verseTitle":"The Verse of Affection","significanceReason":"Instructs believers to show love and respect to the Prophet's family, emphasizing familial and spiritual connections as a path to divine proximity."},"version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."}}