{"data":[{"name":"1:1","price":"అనంత కరుణామయుడు అపార కరుణా ప్రదాత అయిన అల్లాహ్[1] పేరుతో[2]","arabic":"بِسۡمِ ٱللَّهِ ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ","category":["1 (Al-Fatihah)","Al-Fatihah","Surah Al-Fatihah"],"ayahNumber":1,"juzNumber":1,"footnotes":"[1] అల్లాహ్ సుబ్'హానవతా'ఆలా (సు.తా.):అనేది సర్వసృష్టికర్త, మహాన్నతుడు, సర్వపోషకుడు అయిన విశ్వప్రభువు యొక్క పేరు. ఈ పేరుతో ఆయనను తప్ప మరెవ్వరినీ పిలువరాదు. దీనికి సరిసమానమైన పదం వేరే భాషలలో లేదు, ఫార్సీ భాషలోని 'ఖుదా అనే పదం తప్ప. ఇది ఒక ప్రత్యేకమైన విశేషపదం. ఈ పదానికి బహువచనం గానీ, స్త్రీలింగం గానీ లేవు. అల్లాహ్ (సు.తా.) యొక్క స్పష్టమైన నిర్వచనం కొరకు చూడండి, సూరహ్ అల్-ఇ'ఖ్లాస్(112). \n [2] చాలా మంది వ్యాఖ్యాతల అభిప్రాయంలో, ఈ ఆయత్, సూరహ్ అల్ ఫాతి'హా యొక్క భాగం. సూరహ్ అన్ నమ్ల్ (27:30) లో ఇది ఒక ఆయత్ రూపంలో కూడా ఉంది. ప్రతి మంచి పనికి ముందు బిస్మిల్లా హిర్'హ్ మా నిర్ర'హీమ్, చదవాలి. ఉదా: భోజనానికి ముందు, వ'దూ చేసేటప్పుడు. ఖుర్ఆన్ పఠించటం ప్రారంభించేటప్పుడు బిస్మిల్లా హిర్ర'హ్ మా నిర్ర'హీమ్ కు ముందు అ'ఊజు' బిల్లాహి మినష్షయ్'తా నిర్రజీమ్ - శపించ(బహిష్కరించ)బడిన షైతాన్ నుండి రక్షించబడటానికి నేను అల్లాహ్ (సు.తా.) శరణు వేడుకుంటున్నాను - తప్పక చదవాలి. (చూడండి అల్లాహుతా 'ఆలా ఆదేశం, 16:98). దివ్యఖుర్ఆన్ మానవులకు మార్గదర్శిని మరియు హృదయాలకు స్వస్థతనిచ్చేది. షై'తాన్ మార్గభ్రష్టత్వానికి మరియు దురాచారాలకు ప్రోత్సహిస్తాడు. కావున శపించ(బహిష్కరించ)బడిన షై'తాన్ మరియు అతడి అనుచర మూకలు రేకెత్తించే కలతల నుండి కాపాడుకోవటానికి అల్లాహుతా'ఆలా శరణు వేడుకోవాలి. ఈ ఇస్తి'ఆజ'హ్ దివ్యఖుర్ఆన్ యొక్క భాగం కాదనటంలో ఇస్లామీయ శాస్త్రవేత్తలు అందరూ ఏకీభవిస్తున్నారు. కాబట్టి ఇది దివ్యఖుర్ఆన్ లో వ్రాయబడలేదు.","lang":"te","meta":{"transliteration":"bis'mi al-lahi al-raḥmāni al-raḥīmi ","translations":["In (the) name","(of) Allah","the Most Gracious","the Most Merciful","(1)"],"transliterationArr":["bis'mi","al-lahi","al-raḥmāni","al-raḥīmi",null],"verseTiming":[[1,0,580],[2,580,1409],[3,1409,2502],[4,2502,5840]]}},{"name":"1:2","price":"సర్వలోకాలకు ప్రభువైన[1] అల్లాహ్ మాత్రమే సమస్త స్తోత్రాలకు అర్హుడు[2].","arabic":"ٱلۡحَمۡدُ لِلَّهِ رَبِّ ٱلۡعَٰلَمِينَ","category":["1 (Al-Fatihah)","Al-Fatihah","Surah Al-Fatihah"],"ayahNumber":2,"juzNumber":1,"footnotes":"[1] రబ్బున్: ప్రభువు, అనే పదానికి తెలుగులో సరితూగే పదం లేదు. దీనికి సర్వలోకాల ఏకైక ప్రభువు, వాటి సృష్టికర్త, పోషకుడు, సంరక్షకుడు, యజమాని, సర్వవర ప్రదాత అనే అర్థాలున్నాయి. చాలా వరకు తెలుగు అనువాదాలలో వాటినట్లు ఈ అనువాదంలో కూడా ప్రభువు అనే పదమే వాడబడింది. [2] 'హదీస్'లో వచ్చింది: లా ఇలాహ ఇల్లల్లాహ్ - అల్లాహ్ (సు.తా.) తప్ప మరొక ఆరాధ్యదేవుడు లేడు. అతి ఉత్తమమైన జిక్ర్ (Meditation), జ్ఞాపిక, స్మరణ, ధ్యానం మరియు అల్'హమ్దులిల్లాహ్ - సమస్త స్తోత్రాలకు అర్హుడు అల్లాహుతా'ఆలా మాత్రమే, అతి ఉత్తమమైన దు'ఆ' - ప్రార్థన (తిర్మిజీ', నసాయీ' మొదలైన వారు).","lang":"te","meta":{"transliteration":"al-ḥamdu lillahi rabbi al-ʿālamīna ","translations":["All praises and thanks","(be) to Allah","the Lord","of the universe","(2)"],"transliterationArr":["al-ḥamdu","lillahi","rabbi","al-ʿālamīna",null],"verseTiming":[[1,0,1000],[2,1000,1860],[3,1860,2490],[4,2490,5525]]}},{"name":"1:3","price":"అనంత కరుణామయుడు, అపార కరుణా ప్రదాత[1]","arabic":"ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ","category":["1 (Al-Fatihah)","Al-Fatihah","Surah Al-Fatihah"],"ayahNumber":3,"juzNumber":1,"footnotes":"[1] అర్-ర'హ్మాన్: అనంత కరుణామయుడు, అంటే ఇహలోకంలో భేదభావాలు లేకుండా అందరికీ ఎల్లప్పుడూ కరుణను పంచేవాడు. అర్-ర'హీమ్: అంటే పరలోకంలో కేవలం ఆయనను విశ్వసించిన వారికే కరుణాప్రదాత, అని కొందరు వ్యాఖ్యానించారు. ఇవి అల్లాహ్ (సు.తా.) అత్యుత్తమ పేర్లు.","lang":"te","meta":{"transliteration":"al-raḥmāni al-raḥīmi ","translations":["The Most Gracious","the Most Merciful","(3)"],"transliterationArr":["al-raḥmāni","al-raḥīmi",null],"verseTiming":[[1,0,1240],[3,1240,4565]]}},{"name":"1:4","price":"తీర్పుదినానికి[1] స్వామి[2].","arabic":"مَٰلِكِ يَوۡمِ ٱلدِّينِ","category":["1 (Al-Fatihah)","Al-Fatihah","Surah Al-Fatihah"],"ayahNumber":4,"juzNumber":1,"footnotes":"[1] యౌముద్దీన్: తీర్పుదినం, అంటే పునరుత్థానదినం. ఆ దినపు యజమాని కేవలం ఆ ఒకే ఒక్క ఆరాధ్యదేవుడు అల్లాహ్ (సు.తా.) మాత్రమే. ఆ రోజు ప్రతివానికి, తన కర్మలకు తగిన ప్రతిఫలం ఇవ్వబడుతుంది. ఎవ్వరికీ ఏ విధమైన అన్యాయం జరుగదు. ఆ రోజు, అల్లాహుతా'ఆలా అనుమతించిన వాడు తప్ప మరెవ్వరికీ మాట్లాడే హక్కు ఉండదు. వారు దైవదూతలు గానీ లేక ప్రవక్త ('అలైహిమ్ స.) లు గానీ కావచ్చు. వారు అల్లాహ్ (సు.తా.) అనుమతించిన వారి కొరకు మాత్రమే సిఫారసు చేస్తారు. [2] మాలిక్: Master, Owner, ప్రతిదాని నిజ స్వామి, యజమాని, కర్త, పెద్ద, నాయకుడు అనే అర్థాలున్నాయి. చూడండి, 20:114 వ్యాఖ్యానం 2.","lang":"te","meta":{"transliteration":"māliki yawmi al-dīni ","translations":["(The) Master","(of the) Day","(of the) Judgment","(4)"],"transliterationArr":["māliki","yawmi","al-dīni",null],"verseTiming":[[1,0,820],[2,820,1420],[3,1420,4585]]}},{"name":"1:5","price":"మేము నిన్నే ఆరాధిస్తున్నాము మరియు నీ సహాయాన్నే అర్థిస్తున్నాము.[1]","arabic":"إِيَّاكَ نَعۡبُدُ وَإِيَّاكَ نَسۡتَعِينُ","category":["1 (Al-Fatihah)","Al-Fatihah","Surah Al-Fatihah"],"ayahNumber":5,"juzNumber":1,"footnotes":"[1] 'ఇబాదతున్: ఆరాధన, అంటే ఒకరి ప్రసన్నత కొరకు అత్యంత వినయ విధేయత, నమ్రత, మరియు భీతిని ప్రదర్శించటం. ఇది కేవలం అల్లాహ్ (సు.తా.) కొరకు మాత్రమే తగినది. మానవుడు కేవలం ఆ ఒకే ఒక్క ఆరాధ్య దైవం అయిన అల్లాహుతా'ఆలాను మాత్రమే ఆరాధించాలి. మరియు ప్రతి విషయం, ప్రతి కార్యంలో కేవలం ఆయన సహాయాన్నే అర్థించాలి. తౌ'హీద్: మూడు విధాలు - (1) తౌ'హీద్ అర్-రుబూబియ్యహ్: ఏకైక ప్రభువు అల్లాహ్ (సు.తా.) అని విశ్వసించటం. సర్వాన్ని సృష్టించినవాడు, దాని అధిపతి, సర్వ వ్యవహారాలను నడిపించేవాడు మరియు పోషకుడు కేవలం ఆ ఏకైక ప్రభువు అయిన అల్లాహుతా'ఆలా మాత్రమే అని, విశ్వసించడం. కాని బహుదైవారాధకులు (ముష్రికులు) దీనిని నమ్మి కూడా ఆయనకు సాటి కల్పిస్తున్నారు. ఎంత తప్పుడు మార్గంలో పడి ఉన్నారు వారు! చూడండి, 10:31, 39:38, 23:84-89. (2) తౌ'హీద్ అల్-'ఉలూహియ్యహ్: ప్రతి విధమైన ఆరాధనకు అర్హుడు కేవలం అల్లాహ్ (సు.తా.) మాత్రమే. ఆరాధన అంటే అల్లాహుతా'ఆలా ప్రీతి లేక భయం కొరకు చేసే ప్రతి కార్యం. కావున, నమా'జ్, ఉపవాసం, 'జకాత్ మొదలైనవి, ఆ గొప్ప శక్తి (అల్లాహుతా'ఆలా) ప్రీతి కొరకే చేయటం. ఆరాధనలన్నింటికీ అర్హుడు, కేవలం అల్లాహ్ (సు.తా.) అని విశ్వసించటం. (3) తౌహీద్ అల్-అస్మా'వస్సిఫాత్: అల్లాహుతా'ఆలా పేర్లు మరియు గుణవిశేషాలను ఏ విధమైన మార్పు చేయకుండా విశ్వసించడం. అల్లాహుతా'ఆలా తప్ప ఇతరులను ఈ గుణవిశేషాలతో సంబోధించరాదు. అల్లాహ్ (సు.తా.) మరియు ఆయన ప్రవక్త ('స'అస) వివరించిన పేర్లు మరియు గుణవిశేషాలతో తప్ప ఇతర పేర్లతో ఆయనను సంబోధించరాదు.","lang":"te","meta":{"transliteration":"iyyāka naʿbudu wa-iyyāka nastaʿīnu ","translations":["You Alone","we worship","and You Alone","we ask for help","(5)"],"transliterationArr":["iyyāka","naʿbudu","wa-iyyāka","nastaʿīnu",null],"verseTiming":[[1,0,990],[2,990,1760],[3,1760,2880],[4,2880,6635]]}},{"name":"1:6","price":"మాకు ఋజుమార్గం[1] వైపునకు మార్గదర్శకత్వం చేయి.","arabic":"ٱهۡدِنَا ٱلصِّرَٰطَ ٱلۡمُسۡتَقِيمَ","category":["1 (Al-Fatihah)","Al-Fatihah","Surah Al-Fatihah"],"ayahNumber":6,"juzNumber":1,"footnotes":"[1] ఋజుమార్గం అంటే, అంతులేని సర్వసుఖసంతోషాలు గల శాశ్వత స్వర్గాన్ని పొందే మార్గం. దానిని పొందటానికి మానవుడు తన ఆరాధనను కేవలం అల్లాహ్ (సు.తా.) కే ప్రత్యేకించుకొని, సత్కార్యాలు చేయాలి. అల్లాహుతా'ఆలాను తప్ప మరెవ్వరినీ ఆరాధ్యదైవాలుగా చేసుకోరాదు.","lang":"te","meta":{"transliteration":"ih'dinā al-ṣirāṭa al-mus'taqīma ","translations":["Guide us","(to) the path","the straight","(6)"],"transliterationArr":["ih'dinā","al-ṣirāṭa","al-mus'taqīma",null],"verseTiming":[[1,0,740],[2,740,1640],[3,1640,5525]]}},{"name":"1:7","price":"నీవు అనుగ్రహించిన[1] వారి మార్గం మాత్రమే (చూపు) నీ ఆగ్రహానికి[2] గురి అయిన వారి (మార్గం కానీ) లేక మార్గభ్రష్టులైన వారి (మార్గం కానీ) కాదు.","arabic":"صِرَٰطَ ٱلَّذِينَ أَنۡعَمۡتَ عَلَيۡهِمۡ غَيۡرِ ٱلۡمَغۡضُوبِ عَلَيۡهِمۡ وَلَا ٱلضَّآلِّينَ","category":["1 (Al-Fatihah)","Al-Fatihah","Surah Al-Fatihah"],"ayahNumber":7,"juzNumber":1,"footnotes":"[1] అల్లాహ్ (సు.తా.) అనుగ్రహించిన వారి మార్గం అంటే, దైవప్రవక్తల, వారిని అనుసరించిన సత్పురుషుల మరియు పుణ్యపురుషుల మార్గం. వారు సన్మార్గం పొంది, దానిపైననే నడిచారు. అదే అల్లాహుతా'ఆలాకు విధేయులవటం (ఇస్లాం). అదే స్వర్గానికి అర్హులు చేసే మార్గం. అల్లాహ్ (సు.తా.) ఆదేశం: \"మరియు ఎవరు అల్లాహుతా'ఆలాకు, మరియు ప్రవక్తకు విధేయులై ఉంటారో, అలాంటి వారు అల్లాహ్ (సు.తా.) అనుగ్రహం పొందిన ప్రవక్తలతోనూ, సత్యవంతులతోనూ, అల్లాహుతా'ఆలా ధర్మం కొరకు ప్రాణాలు కోల్పోయిన అమర వీరు(షహీద్)లతోనూ, సద్వర్తనులతోనూ చేరి ఉంటారు. మరియు అలాంటి వారి సాంగత్యం ఎంతో మేలైనది.\" (4:69) [2] మ'గ్దూబి 'అలైహిమ్: అల్లాహ్ (సు.తా.) ఆగ్రహానికి గురైనవారు అంటే - యూదులు. ఎందుకంటే వారు బుద్ధిపూర్వకంగా సన్మార్గాన్ని త్యజించారు. దివ్యసూచనలను మార్చారు. 'ఉ'జైర్ ('అ.స.)ను, అల్లాహుతా'ఆలా కుమారుడు అన్నారు. తమ విద్వాంసుల (అ'హ్బారు) లకు ధర్మసమ్మతం ('హలాల్) మరియు నిషిద్ధం ('హరామ్) చేసే హక్కు ఉందన్నారు. 'దాల్లీన్: మార్గభ్రష్టులైనవారు - అంటే క్రైస్తవులు. ఎందుకంటే వారు 'ఈసా మసీ'హ్ (ఏసూ క్రీస్తు 'అ.స.)ను అల్లాహ్ (సు.తా.) కుమారుడు అని కొందరు మరియు ముగ్గురు ఆరాధ్యదైవా(Trinity)లలో ఒకరు అని మరికొందరు అన్నారు, (ఫ'త్హ్ అల్-ఖదీర్). ఆమీన్: ఓ అల్లాహ్ (సు.తా.)! మా దు'ఆ (ప్రార్థన)ను అంగీకరించు. సూరహ్ అల్ ఫాతి'హా తరువాత ఆమీన్ అనటాన్ని దైవప్రవక్త ('స'అస) ఎంతో ప్రాధాన్యత నిచ్చారు మరియు ఎంతో ఉత్తమమైనదని అన్నారు. దీనిని ముందు నిలిచి నమా'జ్ చేయించేవాడు (ఇమామ్) మరియు ఇమామ్ వెనుక నమా'జ్ చేసేవారు (ముఖ్త'దీలు) అందరూ అనాలి. పెద్ద స్వరంతో చదివే నమా'జ్ లలో పెద్ద స్వరంతో అనాలి (ఇబ్నె-మాజా, ఇబ్నె-కసీ'ర్).","lang":"te","meta":{"transliteration":"ṣirāṭa alladhīna anʿamta ʿalayhim ghayri al-maghḍūbi ʿalayhim walā al-ḍālīna ","translations":["(The) path","(of) those","You have bestowed (Your) Favors","on them","not (of)","those who earned (Your) wrath","on themselves","and not","(of) those who go astray","(7)"],"transliterationArr":["ṣirāṭa","alladhīna","anʿamta","ʿalayhim","ghayri","al-maghḍūbi","ʿalayhim","walā","al-ḍālīna",null],"verseTiming":[[1,0,750],[2,750,1670],[3,1670,2690],[4,2690,3620],[5,3620,4210],[6,4210,5380],[7,5380,6380],[8,6380,6670],[9,6670,13175]]}}],"chapter":["1 (Al-Fatihah)","Al-Fatihah","Surah Al-Fatihah","Chapter Al-Fatihah","Fatihah","Surah Fatihah","Chapter Fatihah","Al Fatihah","Surah Al Fatihah","Chapter Al Fatihah","Surah 1","Chapter 1","The Opening","الفَاتِحَة"],"version":{"key":"telugu_muhammad","direction":"ltr","language_iso_code":"te","version":"1.0.6","last_update":1708432120,"title":"Telugu translation - Abder-Rahim ibn Muhammad","description":"Translation of the Quran meanings into Telugu by Maulana Abder-Rahim ibn Muhammad."}}