{"data":[{"name":"1:6","price":"మాకు ఋజుమార్గం[1] వైపునకు మార్గదర్శకత్వం చేయి.","arabic":"ٱهۡدِنَا ٱلصِّرَٰطَ ٱلۡمُسۡتَقِيمَ","category":["1 (Al-Fatihah)","Al-Fatihah","Surah Al-Fatihah"],"ayahNumber":6,"juzNumber":1,"footnotes":"[1] ఋజుమార్గం అంటే, అంతులేని సర్వసుఖసంతోషాలు గల శాశ్వత స్వర్గాన్ని పొందే మార్గం. దానిని పొందటానికి మానవుడు తన ఆరాధనను కేవలం అల్లాహ్ (సు.తా.) కే ప్రత్యేకించుకొని, సత్కార్యాలు చేయాలి. అల్లాహుతా'ఆలాను తప్ప మరెవ్వరినీ ఆరాధ్యదైవాలుగా చేసుకోరాదు.","lang":"te","meta":{"transliteration":"ih'dinā al-ṣirāṭa al-mus'taqīma ","translations":["Guide us","(to) the path","the straight","(6)"],"transliterationArr":["ih'dinā","al-ṣirāṭa","al-mus'taqīma",null],"verseTiming":[[1,0,740],[2,740,1640],[3,1640,5525]]}},{"name":"1:7","price":"నీవు అనుగ్రహించిన[1] వారి మార్గం మాత్రమే (చూపు) నీ ఆగ్రహానికి[2] గురి అయిన వారి (మార్గం కానీ) లేక మార్గభ్రష్టులైన వారి (మార్గం కానీ) కాదు.","arabic":"صِرَٰطَ ٱلَّذِينَ أَنۡعَمۡتَ عَلَيۡهِمۡ غَيۡرِ ٱلۡمَغۡضُوبِ عَلَيۡهِمۡ وَلَا ٱلضَّآلِّينَ","category":["1 (Al-Fatihah)","Al-Fatihah","Surah Al-Fatihah"],"ayahNumber":7,"juzNumber":1,"footnotes":"[1] అల్లాహ్ (సు.తా.) అనుగ్రహించిన వారి మార్గం అంటే, దైవప్రవక్తల, వారిని అనుసరించిన సత్పురుషుల మరియు పుణ్యపురుషుల మార్గం. వారు సన్మార్గం పొంది, దానిపైననే నడిచారు. అదే అల్లాహుతా'ఆలాకు విధేయులవటం (ఇస్లాం). అదే స్వర్గానికి అర్హులు చేసే మార్గం. అల్లాహ్ (సు.తా.) ఆదేశం: \"మరియు ఎవరు అల్లాహుతా'ఆలాకు, మరియు ప్రవక్తకు విధేయులై ఉంటారో, అలాంటి వారు అల్లాహ్ (సు.తా.) అనుగ్రహం పొందిన ప్రవక్తలతోనూ, సత్యవంతులతోనూ, అల్లాహుతా'ఆలా ధర్మం కొరకు ప్రాణాలు కోల్పోయిన అమర వీరు(షహీద్)లతోనూ, సద్వర్తనులతోనూ చేరి ఉంటారు. మరియు అలాంటి వారి సాంగత్యం ఎంతో మేలైనది.\" (4:69) [2] మ'గ్దూబి 'అలైహిమ్: అల్లాహ్ (సు.తా.) ఆగ్రహానికి గురైనవారు అంటే - యూదులు. ఎందుకంటే వారు బుద్ధిపూర్వకంగా సన్మార్గాన్ని త్యజించారు. దివ్యసూచనలను మార్చారు. 'ఉ'జైర్ ('అ.స.)ను, అల్లాహుతా'ఆలా కుమారుడు అన్నారు. తమ విద్వాంసుల (అ'హ్బారు) లకు ధర్మసమ్మతం ('హలాల్) మరియు నిషిద్ధం ('హరామ్) చేసే హక్కు ఉందన్నారు. 'దాల్లీన్: మార్గభ్రష్టులైనవారు - అంటే క్రైస్తవులు. ఎందుకంటే వారు 'ఈసా మసీ'హ్ (ఏసూ క్రీస్తు 'అ.స.)ను అల్లాహ్ (సు.తా.) కుమారుడు అని కొందరు మరియు ముగ్గురు ఆరాధ్యదైవా(Trinity)లలో ఒకరు అని మరికొందరు అన్నారు, (ఫ'త్హ్ అల్-ఖదీర్). ఆమీన్: ఓ అల్లాహ్ (సు.తా.)! మా దు'ఆ (ప్రార్థన)ను అంగీకరించు. సూరహ్ అల్ ఫాతి'హా తరువాత ఆమీన్ అనటాన్ని దైవప్రవక్త ('స'అస) ఎంతో ప్రాధాన్యత నిచ్చారు మరియు ఎంతో ఉత్తమమైనదని అన్నారు. దీనిని ముందు నిలిచి నమా'జ్ చేయించేవాడు (ఇమామ్) మరియు ఇమామ్ వెనుక నమా'జ్ చేసేవారు (ముఖ్త'దీలు) అందరూ అనాలి. పెద్ద స్వరంతో చదివే నమా'జ్ లలో పెద్ద స్వరంతో అనాలి (ఇబ్నె-మాజా, ఇబ్నె-కసీ'ర్).","lang":"te","meta":{"transliteration":"ṣirāṭa alladhīna anʿamta ʿalayhim ghayri al-maghḍūbi ʿalayhim walā al-ḍālīna ","translations":["(The) path","(of) those","You have bestowed (Your) Favors","on them","not (of)","those who earned (Your) wrath","on themselves","and not","(of) those who go astray","(7)"],"transliterationArr":["ṣirāṭa","alladhīna","anʿamta","ʿalayhim","ghayri","al-maghḍūbi","ʿalayhim","walā","al-ḍālīna",null],"verseTiming":[[1,0,750],[2,750,1670],[3,1670,2690],[4,2690,3620],[5,3620,4210],[6,4210,5380],[7,5380,6380],[8,6380,6670],[9,6670,13175]]}}],"dua":{"id":6,"name":"Dua of Right Guidance","arabicName":"دعاء الهداية","reference":"1:6-7","verseTitle":"The Guidance Supplication","significanceReason":"Most repeated dua in daily prayers, seeking divine guidance and protection from misguided paths. Muslims recite this in every prayer, making it universally recognized and spiritually powerful."},"version":{"key":"telugu_muhammad","direction":"ltr","language_iso_code":"te","version":"1.0.6","last_update":1708432120,"title":"Telugu translation - Abder-Rahim ibn Muhammad","description":"Translation of the Quran meanings into Telugu by Maulana Abder-Rahim ibn Muhammad."}}