{"data":[{"name":"1:1","price":"شروع کرتا ہوں اللہ تعالیٰ کے نام سے جو بڑا مہربان نہایت رحم واﻻ ہے۔(1)","arabic":"بِسۡمِ ٱللَّهِ ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ","category":["1 (Al-Fatihah)","Al-Fatihah","Surah Al-Fatihah"],"ayahNumber":1,"juzNumber":1,"footnotes":"(1) بسم اللہ کے آغاز میں أَقْرَأُ، أَبْدَأُ یا أَتْلُوا محذوف ہے یعنی اللہ کے نام سے پڑھتا، یا شروع کرتا یا تلاوت کرتا ہوں۔ ہر اہم کام کے شروع کرنے سے پہلے بسم اللہ پڑھنے کی تاکید کی گئی ہے۔ چنانچہ حکم دیا گیا ہے کہ کھانے، ذبح، وضو اور جماع سے پہلے بسم اللہ پڑھو۔ تاہم قرآن کریم کی تلاوت کے وقت ”بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ“ سے پہلے ”أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيمِ“ پڑھنا بھی ضروری ہے «فَإِذَا قَرَأْتَ الْقُرْآنَ فَاسْتَعِذْ بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجِيمِ» (النحل:98) ”جب تم قرآن کریم پڑھنے لگو تو اللہ کی جناب میں شیطان رجیم سے پناہ مانگو۔“","lang":"ur","meta":{"transliteration":"bis'mi al-lahi al-raḥmāni al-raḥīmi ","translations":["In (the) name","(of) Allah","the Most Gracious","the Most Merciful","(1)"],"transliterationArr":["bis'mi","al-lahi","al-raḥmāni","al-raḥīmi",null],"verseTiming":[[1,0,580],[2,580,1409],[3,1409,2502],[4,2502,5840]]}},{"name":"1:2","price":"سب تعریف اللہ تعالیٰ کے لئے ہے(1) جو تمام جہانوں کا پالنے واﻻ ہے۔(2)","arabic":"ٱلۡحَمۡدُ لِلَّهِ رَبِّ ٱلۡعَٰلَمِينَ","category":["1 (Al-Fatihah)","Al-Fatihah","Surah Al-Fatihah"],"ayahNumber":2,"juzNumber":1,"footnotes":"(1) اَلْحَمْدُ میں ”ال“ استغراق یا اختصاص کے لئے ہے، یعنی تمام تعریفیں اللہ کے لئے ہیں، یا اس کے لئے خاص ہیں، کیوں کہ تعریف کا اصل مستحق اور سزاوار صرف اللہ تعالیٰ ہے۔ کسی کے اندر کوئی خوبی، حسن یا کمال ہے تو وہ بھی الله تعالیٰ کا پیدا کردہ ہے اس لئے حمد (تعریف) کا مستحق بھی وہی ہے۔ ”اللہ“ یہ اللہ کا ذاتی نام ہے، اس کا استعمال کسی اور کے لئے جائز نہیں۔ الْحَمْدُ للهِ یہ کلمہ شکر ہے جس کی بڑی فضیلت احادیث میں آئی ہے۔ ایک حدیث میں لا إِلَهَ إلا اللهُ أَفْضَلُ الذِّكْرِ اور الْحَمْدُ للهِ کو أَفْضَلُ الدُّعَاءِ کہا گیا ہے۔ (ترمذی، نسائی وغیرہ) صحیح مسلم اور نسائی کی روایت میں ہے «الْحَمْدُ للهِ تَمْلأُ الْمِيزَانَ» ”الْحَمْدُ للهِ میزان کو بھر دیتا ہے۔“ اسی لئے ایک اور حدیث میں آتا ہے کہ اللہ اس بات کو پسند فرماتا ہے کہ ہر کھانے اور پینے پر بندہ اللہ کی حمد کرے۔ (صحیح مسلم) ۔\n(2) رَبِّ، اللہ تعالیٰ کے اسمائے حسنیٰ میں سے ہے، جس کے معنی ہیں ہر چیز کو پیدا کرکے اس کی ضروریات مہیا کرنے اور اس کو تکمیل تک پہنچانے والا۔ اس کا استعمال بغیر اضافت کے کسی اور کے لئے جائز نہیں۔ عَالَمِينَ عَالَمٌ (جہان) کی جمع ہے۔ ویسے تو تمام خلائق کے مجموعے کو عالم کہا جاتا ہے، اسی لئے اس کی جمع نہیں لائی جاتی۔ لیکن یہاں اس کی ربوبیت کاملہ کے اظہار کے لئے عالم کی بھی جمع لائی گئی ہے، جس سے مراد مخلوقات کی الگ الگ جنسیں ہیں۔ مثلاً عالم جن، عالم انس، عالم ملائکہ اور عالم وحوش وطیور وغیرہ۔ ان تمام مخلوقات کی ضرورتیں ایک دوسرے سے قطعاً مختلف ہیں، لیکن رَبِّ الْعَالَمِينَ سب کی ضروریات، ان کے احوال وظروف اور طباع و اجسام کے مطابق مہیا فرماتا ہے۔","lang":"ur","meta":{"transliteration":"al-ḥamdu lillahi rabbi al-ʿālamīna ","translations":["All praises and thanks","(be) to Allah","the Lord","of the universe","(2)"],"transliterationArr":["al-ḥamdu","lillahi","rabbi","al-ʿālamīna",null],"verseTiming":[[1,0,1000],[2,1000,1860],[3,1860,2490],[4,2490,5525]]}},{"name":"1:3","price":"بڑا مہربان نہایت رحم کرنے واﻻ۔(1)","arabic":"ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ","category":["1 (Al-Fatihah)","Al-Fatihah","Surah Al-Fatihah"],"ayahNumber":3,"juzNumber":1,"footnotes":"(1) رَحْمَن بر وزن فَعْلان اور رَحِيمٌ بر وزن فَعِيلٌ ہے۔ دونوں مبالغے کے صیغے ہیں، جن میں کثرت اور دوام کا مفہوم پایا جاتا ہے۔ یعنی اللہ تعالیٰ بہت رحم کرنے والا ہے اور اس کی یہ صفت دیگر صفات کی طرح دائمی ہے۔ بعض علما کہتے ہیں: رحمٰن میں رحیم کی نسبت زیادہ مبالغہ ہے، اسی لئے رَحْمَنَ الدُّنْيَا وَالآخِرَةِ کہا جاتا ہے۔ دنیا میں اس کی رحمت عام ہے جس سے بلا تخصیص کافر ومومن سب فیض یاب ہو رہے ہیں اور آخرت میں وہ صرف رحیم ہوگا، یعنی اس کی رحمت صرف مومنین کے لئے خاص ہوگی۔ اللَّهُمَّ! اجْعَلْنَا مِنْهُمْ (آمين)","lang":"ur","meta":{"transliteration":"al-raḥmāni al-raḥīmi ","translations":["The Most Gracious","the Most Merciful","(3)"],"transliterationArr":["al-raḥmāni","al-raḥīmi",null],"verseTiming":[[1,0,1240],[3,1240,4565]]}},{"name":"1:4","price":"بدلے کے دن (یعنی قیامت) کا مالک ہے۔(1)","arabic":"مَٰلِكِ يَوۡمِ ٱلدِّينِ","category":["1 (Al-Fatihah)","Al-Fatihah","Surah Al-Fatihah"],"ayahNumber":4,"juzNumber":1,"footnotes":"(1) دنیا میں بھی اگرچہ مکافات عمل کا سلسلہ ایک حد تک جاری رہتا ہے، تاہم اس کا مکمل ظہور آخرت میں ہوگا اور اللہ تعالیٰ ہر شخص کو اس کے اچھے یا برے اعمال کے مطابق مکمل جزا اور سزا دے گا۔ اسی طرح دنیا میں عارضی طور پر اور بھی کئی لوگوں کے پاس تحت الاسباب اختیارات ہوتے ہیں، لیکن آخرت میں تمام اختیارات کا مالک صرف اور صرف اللہ تعالیٰ ہی ہوگا۔ اللہ تعالیٰ اس روز فرمائے گا: «لِّمَنِ ٱلۡمُلۡكُ ٱلۡيَوۡمَ» (غافر: 16) ”آج کس کی بادشاہی ہے؟“ پھر وہی جواب دے گا: «لِلَّهِ ٱلۡوَٰحِدِ ٱلۡقَهَّارِ» (غافر: 16) ”صرف ایک غالب اللہ کے لئے“ «يَوۡمَ لَا تَمۡلِكُ نَفۡسٞ لِّنَفۡسٖ شَيۡ‍ٔٗاۖ وَٱلۡأَمۡرُ يَوۡمَئِذٖ لِّلَّهِ» (الانفطار: 19) ”اس دن کوئی ہستی کسی کے لئے اختیار نہیں رکھے گی، سارا معاملہ اللہ کے ہاتھ میں ہوگا۔“ یہ ہوگا جزا کا دن۔","lang":"ur","meta":{"transliteration":"māliki yawmi al-dīni ","translations":["(The) Master","(of the) Day","(of the) Judgment","(4)"],"transliterationArr":["māliki","yawmi","al-dīni",null],"verseTiming":[[1,0,820],[2,820,1420],[3,1420,4585]]}},{"name":"1:5","price":"ہم صرف تیری ہی عبادت کرتے ہیں اور صرف تجھ ہی سے مدد چاہتے ہیں۔(1)","arabic":"إِيَّاكَ نَعۡبُدُ وَإِيَّاكَ نَسۡتَعِينُ","category":["1 (Al-Fatihah)","Al-Fatihah","Surah Al-Fatihah"],"ayahNumber":5,"juzNumber":1,"footnotes":"(1) عبادت کے معنی ہیں کسی کی رضا کے لئے انتہائی تذلل وعاجزی اور کمال خشوع کا اظہار اور بقول ابن کثیر”شریعت میں کمال محبت، خضوع اور خوف کے مجموعے کا نام ہے“ یعنی جس ذات کے ساتھ محبت بھی ہو، اس کی مافوق الاسباب طاقت کے سامنے عاجزی وبے بسی کا اظہار بھی ہو اور اسباب ومافوق الاسباب ذرائع سے اس کی گرفت کا خوف بھی ہو۔ سیدھی عبارت ”نَعْبُدُكَ وَنَسْتَعِينُكَ“ ”ہم تیری عبادت کرتے اور تجھ سے مدد چاہتے ہیں“ ہوتی، لیکن اللہ تعالیٰ نے یہاں مفعول کو فعل پر مقدم کرکے «إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ»‌ فرمایا، جس سے مقصد اختصاص پیدا کرنا ہے، یعنی ”ہم تیری ہی عبادت کرتے اور تجھ ہی سے مدد چاہتے ہیں“ نہ عبادت اللہ کے سوا کسی اور کی جائز ہے اور نہ استعانت ہی کسی اور سے جائز ہے۔ ان الفاظ سے شرک کا سدباب کردیا گیا ہے، لیکن جن کے دلوں میں شرک کا روگ راہ پاگیا ہے، وہ مافوق الاسباب اور ماتحت الاسباب استعانت میں فرق کو نظرانداز کرکے عوام کو مغالطے میں ڈال دیتے ہیں اور کہتے ہیں کہ دیکھو ہم بیمار ہوجاتے ہیں تو ڈاکٹر سے مدد حاصل کرتے ہیں، بیوی سے مدد چاہتے ہیں، ڈرائیور اور دیگر انسانوں سے مدد کے طالب ہوتے ہیں۔ اس طرح وہ یہ باور کراتے ہیں کہ اللہ کے سوا اوروں سے مدد مانگنا بھی جائز ہے۔ حالانکہ اسباب کے ماتحت ایک دوسرے سے مدد چاہنا اور مدد کرنا یہ شرک نہیں ہے، یہ تو اللہ تعالیٰ کا بنایا ہوا نظام ہے، جس میں سارے کام ظاہری اسباب کے مطابق ہی ہوتے ہیں، حتیٰ کہ انبیا بھی انسانوں کی مدد حاصل کرتے ہیں۔ حضرت عیسیٰ عليه السلام نے فرمایا: «مَنْ أَنْصَارِي إِلَى اللَّهِ» (الصف: 14) ”اللہ کے دین کے لئے کون میرا مددگار ہے؟“۔ اللہ تعالیٰ نے اہل ایمان کو فرمایا:«وَتَعَاوَنُوا عَلَى الْبِرِّ وَالتَّقْوَى» (المائدة: 2) ”نیکی اور تقویٰ کے کاموں پر ایک دوسرے کی مدد کرو“، ظاہر بات ہے کہ یہ تعاون ممنوع ہے، نہ شرک، بلکہ مطلوب ومحمود ہے۔ اس کا اصطلاحی شرک سے کیا تعلق؟ شرک تو یہ ہے کہ ایسے شخص سے مدد طلب کی جائے جو ظاہری اسباب کے لحاظ سے مدد نہ کرسکتا ہو، جیسے کسی فوت شدہ شخص کو مدد کے لئے پکارنا ، اس کو مشکل کشا اور حاجت روا سمجھنا، اس کو نافع وضار باور کرنا اور دور ونزدیک سے ہر ایک کی فریاد سننے کی صلاحیت سے بہرہ ور تسلیم کرنا۔ اس کا نام ہے مافوق الاسباب طریقے سے مدد طلب کرنا، اور اسے خدائی صفات سے متصف ماننا۔ اسی کا نام شرک ہے، جو بدقسمتی سے محبت اولیاء کے نام پر مسلمان ملکوں میں عام ہے۔ أَعَاذَنَا اللهُ مِنْهُ۔\nتوحید کی تین قسمیں : اس موقع پر مناسب معلوم ہوتا ہے کہ توحید کی تین اہم قسمیں بھی مختصراً بیان کردی جائیں۔ یہ قسمیں ہیں۔ توحید ربوبیت، توحید الوہیت اور توحید صفات۔ 1۔ توحید ربوبیت کا مطلب ہے کہ اس کائنات کا خالق، مالک، رازق اور مدبر صرف اللہ تعالیٰ ہے۔ اس توحید کو ملاحدہ وزنادقہ کے علاوہ تمام لوگ مانتے ہیں، حتیٰ کہ مشرکین بھی اس کے قائل رہے ہیں اور ہیں، جیسا کہ قرآن کریم نے مشرکین مکہ کا اعتراف نقل کیا ہے۔ مثلاً فرمایا: ”اے پیغمبر (صلى الله عليه وسلم)! ان سے پوچھیں کہ تم کو آسمان وزمین میں رزق کون دیتا ہے، یا تمہارے کانوں اور آنکھوں کا مالک کون ہےاور بےجان سے جاندار اور جاندار سے بے جان کون پیدا کرتا ہے اور دنیا کے کاموں کا انتظام کون کرتا ہے؟ جھٹ کہہ دیں گے کہ اللہ (یعنی یہ سب کام کرنے والا اللہ ہے)۔“ (یونس: 31) دوسرے مقام پر فرمایا: ”اگر آپ (صلى الله عليه وسلم) ان سے پوچھیں کہ آسمان وزمین کا خالق کون ہے؟ تو یقیناً یہی کہیں گے کہ اللہ۔“ (الزمر: 38) ایک اور مقام پر فرمایا: ”اگر آپ (صلى الله عليه وسلم) ان سے پوچھیں کہ زمین اور زمین میں جو کچھ ہے، یہ سب کس کا مال ہے، ساتوں آسمان اور عرش عظیم کا مالک کون ہے؟ ہر چیز کی بادشاہی کس کے ہاتھ میں ہے؟ اور وہ سب کو پناہ دیتا ہے، اور اس کے مقابل کوئی پناہ دینے والا نہیں۔ ان سب کے جواب میں یہ یہی کہیں گے کہ اللہ (یعنی یہ سارے کام اللہ ہی کے ہیں)۔“ (المؤمنون: 84۔ 89) وَغَيْرهَا مِنَ الآيَاتِ۔ 2۔ توحید الوہیت کا مطلب ہے کہ عبادت کی تمام اقسام کا مستحق صرف اللہ تعالیٰ ہے اور عبادت ہر وہ کام ہے جو کسی مخصوص ہستی کی رضا کے لئے، یا اس کی ناراضی کے خوف سے کیا جائے، اس لئے نماز، روزہ، حج اور زکٰوہ صرف یہی عبادات نہیں ہیں بلکہ کسی مخصوص ہستی سے دعا والتجا کرنا، اس کے نام کی نذرونیاز دینا، اس کے سامنے دست بستہ کھڑا ہونا، اس کا طواف کرنا، اس سے طمع اور خوف رکھنا وغیرہ بھی عبادات ہیں۔ توحید الوہیت یہ ہے کہ یہ تمام کام صرف اللہ تعالیٰ ہی کے لئے کئے جائیں۔ قبرپرستی کے مرض میں مبتلا عوام وخواص اس توحید الوہیت میں شرک کا ارتکاب کرتے ہیں اور مذکورہ عبادات کی بہت سی قسمیں وہ قبروں میں مدفون افراد اور فوت شدہ بزرگوں کے لئے بھی کرتے ہیں جو سراسر شرک ہے۔ 3۔ توحید صفات کا مطلب ہے کہ اللہ تعالیٰ کی جو صفات قرآن وحدیث میں بیان ہوئی ہیں، ان کو بغیر کسی تاویل اور تحریف کے تسلیم کریں اور وہ صفات اس انداز میں کسی اور کے اندر نہ مانیں۔ مثلاً جس طرح اس کی صفت علم غیب ہے، یا دور اور نزدیک سے ہر ایک کی فریاد سننے پر وہ قادر ہے، کائنات میں ہر طرح کا تصرف کرنے کا اسے اختیار حاصل ہے، یہ یا اس قسم کی اور صفات الٰہیہ ان میں سے کوئی صفت بھی اللہ کے سوا کسی نبی، ولی یا کسی بھی شخص کے اندر تسلیم نہ کی جائیں۔ اگر تسلیم کی جائیں گی تو یہ شرک ہوگا۔ افسوس ہے کہ قبرپرستوں میں شرک کی یہ قسم بھی عام ہے اور انہوں نے اللہ کی مذکورہ صفات میں بہت سے بندوں کو بھی شریک کر رکھا ہے۔ أَعَاذَنَا اللهُ مِنْهُ۔","lang":"ur","meta":{"transliteration":"iyyāka naʿbudu wa-iyyāka nastaʿīnu ","translations":["You Alone","we worship","and You Alone","we ask for help","(5)"],"transliterationArr":["iyyāka","naʿbudu","wa-iyyāka","nastaʿīnu",null],"verseTiming":[[1,0,990],[2,990,1760],[3,1760,2880],[4,2880,6635]]}},{"name":"1:6","price":"ہمیں سیدھی (اور سچی) راه دکھا۔(1)","arabic":"ٱهۡدِنَا ٱلصِّرَٰطَ ٱلۡمُسۡتَقِيمَ","category":["1 (Al-Fatihah)","Al-Fatihah","Surah Al-Fatihah"],"ayahNumber":6,"juzNumber":1,"footnotes":"(1) ہدایت کے کئی مفہوم ہیں۔ راستے کی طرف رہنمائی کرنا، راستے پر چلا دینا، منزل مقصود پر پہنچا دینا۔ اسے عربی میں ارشاد، توفیق، الہام اور دلالت سے تعبیر کیا جاتا ہے، یعنی ہماری صراط مستقیم کی طرف رہنمائی فرما، اس پر چلنے کی توفیق اور اس پر استقامت نصیب فرما، تاکہ ہمیں تیری رضا (منزل مقصود) حاصل ہوجائے۔ یہ صراط مستقیم محض عقل اور ذہانت سے حاصل نہیں ہوسکتی۔ یہ صراط مستقیم وہی ”الإِسْلام“ ہے، جسے نبی (صلى الله عليه وسلم) نے دنیا کے سامنے پیش فرمایا اور جو اب قرآن واحادیث صحیحہ میں محفوظ ہے۔","lang":"ur","meta":{"transliteration":"ih'dinā al-ṣirāṭa al-mus'taqīma ","translations":["Guide us","(to) the path","the straight","(6)"],"transliterationArr":["ih'dinā","al-ṣirāṭa","al-mus'taqīma",null],"verseTiming":[[1,0,740],[2,740,1640],[3,1640,5525]]}},{"name":"1:7","price":"ان لوگوں کی راه جن پر تو نے انعام کیا(1) ان کی نہیں جن پر غضب کیا گیا (یعنی وه لوگ جنہوں نے حق کو پہچانا، مگر اس پر عمل پیرا نہیں ہوئے) اور نہ گمراہوں کی(2) (یعنی وه لوگ جو جہالت کے سبب راه حق سے برگشتہ ہوگئے)۔","arabic":"صِرَٰطَ ٱلَّذِينَ أَنۡعَمۡتَ عَلَيۡهِمۡ غَيۡرِ ٱلۡمَغۡضُوبِ عَلَيۡهِمۡ وَلَا ٱلضَّآلِّينَ","category":["1 (Al-Fatihah)","Al-Fatihah","Surah Al-Fatihah"],"ayahNumber":7,"juzNumber":1,"footnotes":"(1) یہ صراط مستقیم کی وضاحت ہے کہ یہ سیدھا راستہ وہ ہے جس پر وہ لوگ چلے، جن پر تیرا انعام ہوا، یہ منعم علیہ گروہ ہے انبیا شہدا صدیقین اور صالحین کا۔ جیسا کہ سورۂ نساء میں ہے: «وَمَنْ يُطِعِ اللَّهَ وَالرَّسُولَ فَأُولَئِكَ مَعَ الَّذِينَ أَنْعَمَ اللَّهُ عَلَيْهِمْ مِنَ النَّبِيِّينَ وَالصِّدِّيقِينَ وَالشُّهَدَاءِ وَالصَّالِحِينَ وَحَسُنَ أُولَئِكَ رَفِيقًا» (النساء: 69) ”اور جو اللہ اور اس کے رسول (صلى الله عليه وسلم) کی اطاعت کرتے ہیں، وہ قیامت کے روز ان لوگوں کے ساتھ ہوں گے جن پر اللہ نے انعام کیا، یعنی انبیا، صدیقین، شہدا، اور صالحین، اور ان لوگوں کی رفاقت بہت ہی خوب ہے۔“ اس آیت میں یہ بھی وضاحت کردی گئی ہے کہ انعام یافتہ لوگوں کا یہ راستہ اطاعت الٰہی اور اطاعت رسول (صلى الله عليه وسلم) ہی کا راستہ ہے، نہ کہ کوئی اور راستہ۔\n(2) بعض روایات سے ثابت ہے کہ «مَغْضُوبٌ عَلَيْهِمْ» ”جن پر اللہ کا غضب نازل ہوا“ سے مراد یہودی اور «ضَالِّيْنَ» ”گمراہوں“ سے مراد نصاریٰ (عیسائی) ہیں۔ ابن ابی حاتم کہتے ہیں کہ مفسرین کے درمیان اس میں کوئی اختلاف نہیں۔ ”لا أَعْلَمُ خِلافًا بَيْنَ الْمُفَسِّرِينَ فِي تَفْسِيرِ الْمَغْضُوبِ عَلَيْهِمْ : بِالْيَهُود وَ الضَّالِّينَ بالنَّصَارَى“ (فتح القدیر)، اس لئے صراط مستقیم پر چلنے کی خواہش رکھنے والوں کے لئے ضروری ہے کہ وہ یہود اور نصاریٰ دونوں کی گمراہیوں سے بچ کر رہیں۔ یہود کی بڑی گمراہی یہ تھی کہ وہ جانتے بوجھتے صحیح راستے پر نہیں چلتے تھے، آیات الٰہی میں تحریف اور حیلہ کرنے سے گریز نہیں کرتے تھے، حضرت عزیر (عليه السلام) کو ”ابن اللہ“ کہتے، اپنے احبار ورھبان کو حرام وحلال کرنے کا مجاز سمجھتے تھے۔ نصاریٰ کی بڑی غلطی یہ تھی کہ انہوں نے حضرت عیسیٰ (عليه السلام) کی شان میں غلو کیا اور انہیں ”ابْنُ اللهِ“ اور ”ثَالِثُ ثَلاثَةٍ“ (اللہ کا بیٹا اور تین خدا میں سے ایک) قرار دیا۔ افسوس ہے کہ امت محمدیہ میں بھی یہ گمراہیاں عام ہیں اور اسی وجہ سے وہ دنیا میں ذلیل و رسوا ہیں۔ اللہ تعالیٰ اسے ضلالت کے گڑھے سے نکالے، تاکہ ادبار ونکبت کے بڑھتے ہوئے سائے سے وہ محفوظ رہ سکیں۔\nسورۂ فاتحہ کے آخر میں آمین کہنے کی نبی (صلى الله عليه وسلم) نے بڑی تاکید اور فضیلت فرمائی ہے۔ اس لئے امام اور مقتدی ہر ایک کو آمین کہنی چاہیے۔ نبی (صلى الله عليه وسلم) جہری نمازوں میں اونچی آواز سے آمین کہا کرتے تھے اور صحابہ (رضي الله عنهم) بھی، حتیٰ کہ مسجد گونج اٹھتی۔ (ابن ماجہ۔ ابن کثیر)، بنابریں آمین اونچی آواز سے کہنا سنت اور صحابہ کرام (رضي الله عنهم) کا معمول بہ ہے۔ آمین کے معنی مختلف بیان کیے گئے ہیں۔ ”كَذَلِكَ فَلْيَكُنْ“ (اسی طرح ہو)، ”لا تُخَيِّبْ رَجَاءَنا“ (ہمیں نامراد نہ کرنا)، ”اللَّهُمَّ! اسْتَجِبْ لَنَا“ (اے اللہ ہماری دعا قبول فرمالے)۔","lang":"ur","meta":{"transliteration":"ṣirāṭa alladhīna anʿamta ʿalayhim ghayri al-maghḍūbi ʿalayhim walā al-ḍālīna ","translations":["(The) path","(of) those","You have bestowed (Your) Favors","on them","not (of)","those who earned (Your) wrath","on themselves","and not","(of) those who go astray","(7)"],"transliterationArr":["ṣirāṭa","alladhīna","anʿamta","ʿalayhim","ghayri","al-maghḍūbi","ʿalayhim","walā","al-ḍālīna",null],"verseTiming":[[1,0,750],[2,750,1670],[3,1670,2690],[4,2690,3620],[5,3620,4210],[6,4210,5380],[7,5380,6380],[8,6380,6670],[9,6670,13175]]}}],"chapter":["1 (Al-Fatihah)","Al-Fatihah","Surah Al-Fatihah","Chapter Al-Fatihah","Fatihah","Surah Fatihah","Chapter Fatihah","Al Fatihah","Surah Al Fatihah","Chapter Al Fatihah","Surah 1","Chapter 1","The Opening","الفَاتِحَة"],"version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."}}