{"data":[{"name":"108:1","price":"یقیناً ہم نے تجھے (حوض) کوﺛر (اور بہت کچھ) دیا ہے.(1)","arabic":"إِنَّآ أَعۡطَيۡنَٰكَ ٱلۡكَوۡثَرَ","category":["108 (Al-Kawthar)","Al-Kawthar","Surah Al-Kawthar"],"ayahNumber":6205,"juzNumber":30,"footnotes":"(1) كَوْثَرٌ، کثرت سے ہے۔ اس کے معتدد معنی بیان کیے گئے ہیں۔ ابن کثیر نے (خیر کثیر) کے مفہوم کو ترجیح دی ہے کیوں کہ اس میں ایسا عموم ہے کہ جس میں دوسرے معنی بھی آجاتے ہیں۔ مثلاً صحیح احادیث میں بتلایا گیا ہے، کہ اس سے ایک نہر مراد ہےجو جنت میں آپ (صلى الله عليه وسلم) کو عطا کی جائے گی۔ اسی طرح بعض احادیث میں اس کا مصداق حوض بتلایا گیا ہے، جس سے اہل ایمان جنت میں جانے سے قبل نبی (صلى الله عليه وسلم) کے دست مبارک سے پانی پئیں گے۔ اس حوض میں پھر پانی اسی جنت والی نہر سے آرہا ہوگا۔ اسی طرح دنیا کی فتوحات اور آپ (صلى الله عليه وسلم) کا رفع ودوام ذکر اور آخرت کا اجر وثواب، سب ہی چیزیں (خیر کثیر) میں آجاتی ہیں۔ (ابن کثیر) ۔","lang":"ur","meta":{"transliteration":"innā aʿṭaynāka al-kawthara ","translations":["Indeed, We","We have given you","Al-Kauthar","(1)"],"transliterationArr":["innā","aʿṭaynāka","al-kawthara",null],"verseTiming":[[1,0,3510],[2,3510,5010],[3,5010,6245]]}},{"name":"108:2","price":"پس تو اپنے رب کے لئے نماز پڑھ اور قربانی کر.(1)","arabic":"فَصَلِّ لِرَبِّكَ وَٱنۡحَرۡ","category":["108 (Al-Kawthar)","Al-Kawthar","Surah Al-Kawthar"],"ayahNumber":6206,"juzNumber":30,"footnotes":"(1) یعنی نماز بھی صرف ایک اللہ کے لئے اور قربانی بھی صرف ایک اللہ کے نام پر۔ مشرکین کی طرح ان میں دوسروں کو شریک نہ کر۔ نَحْرٌ کے اصل معنی ہیں اونٹ کے حلقوم میں نیزہ یا چھری مار کر اسے ذبح کرنا۔ دوسرے جانوروں کو زمین پر لٹا کر ان کے گلوں پر چھری پھیری جاتی ہے اسے ذبح کرنا کہتے ہیں۔ لیکن یہاں نحر سے مراد مطلق قربانی ہے، علاوہ ازیں اس میں بطور صدقہ وخیرات جانور قربان کرنا۔ حج کے موقعے پر منیٰ میں اور عیدالاضحیٰ کے موقعے پر قربانی کرنا، سب شامل ہیں۔","lang":"ur","meta":{"transliteration":"faṣalli lirabbika wa-in'ḥar ","translations":["So pray","to your Lord","and sacrifice","(2)"],"transliterationArr":["faṣalli","lirabbika","wa-in'ḥar",null],"verseTiming":[[1,0,810],[2,810,2020],[3,2020,3435]]}},{"name":"108:3","price":"یقیناً تیرا دشمن ہی ﻻوارث اور بے نام ونشان ہے.(1)","arabic":"إِنَّ شَانِئَكَ هُوَ ٱلۡأَبۡتَرُ","category":["108 (Al-Kawthar)","Al-Kawthar","Surah Al-Kawthar"],"ayahNumber":6207,"juzNumber":30,"footnotes":"(1) أَبْتَرُ ایسے شخص کوکہتے ہیں جو مقطوع النسل یا مقطوع الذکر ہو، یعنی اس کی ذات پر اس کی نسل کا خاتمہ ہوجائے یا کوئی اس کا نام لیوا نہ رہے۔ جب نبی (صلى الله عليه وسلم) کی اولاد نرینہ زندہ نہ رہی تو بعض کفار نے نبی (صلى الله عليه وسلم) کو ابتر کہا، جس پر اللہ تعالیٰ نے آپ (صلى الله عليه وسلم) کو تسلی دی کہ ابتر تو نہیں، تیرے دشمن ہی ہوں گے۔ چنانچہ اللہ تعالیٰ نے آپ (صلى الله عليه وسلم) کی نسل کو باقی رکھا گو اس کا سلسلہ لڑکی کی طرف سے ہی ہے۔ اسی طرح آپ (صلى الله عليه وسلم) کی امت بھی آپ (صلى الله عليه وسلم) کی اوالاد معنوی ہی ہے، جس کی کثرت پر آپ (صلى الله عليه وسلم) قیامت والے دن فخر کریں گے، علاوہ ازیں آپ (صلى الله عليه وسلم) کا ذکر پوری دنیا میں نہایت عزت واحترام سے کیا جاتا ہے، جبکہ آپ (صلى الله عليه وسلم) سے بغض وعناد رکھنے والے صرف صفحات تاریخ پر ہی موجود رہ گئے ہیں لیکن کسی دل میں ان کا احترام نہیں اور کسی زبان پر ان کا ذکر خیرنہیں۔","lang":"ur","meta":{"transliteration":"inna shāni-aka huwa al-abtaru ","translations":["Indeed","your enemy ","he (is)","the one cut off","(3)"],"transliterationArr":["inna","shāni-aka","huwa","al-abtaru",null],"verseTiming":[[1,0,1670],[2,1670,2840],[3,2840,3210],[4,3210,4835]]}}],"chapter":["108 (Al-Kawthar)","Al-Kawthar","Surah Al-Kawthar","Chapter Al-Kawthar","Kawthar","Surah Kawthar","Chapter Kawthar","Al Kawthar","Surah Al Kawthar","Chapter Al Kawthar","Surah 108","Chapter 108","Abundance","الكَوْثَر"],"version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."}}