{"data":[{"name":"13:1","price":"ا ل م رٰ۔ یہ قرآن کی آیتیں ہیں، اور جو کچھ آپ کی طرف آپ کے رب کی جانب سے اتارا جاتا ہے، سب حق ہے لیکن اکثر لوگ ایمان نہیں ﻻتے.","arabic":"الٓمٓرۚ تِلۡكَ ءَايَٰتُ ٱلۡكِتَٰبِۗ وَٱلَّذِيٓ أُنزِلَ إِلَيۡكَ مِن رَّبِّكَ ٱلۡحَقُّ وَلَٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا يُؤۡمِنُونَ","category":["13 (Ar-Ra'd)","Ar-Ra'd","Surah Ar-Ra'd"],"ayahNumber":1708,"juzNumber":13,"footnotes":"","lang":"ur","meta":{"transliteration":"alif-lam-meem-ra til'ka āyātu al-kitābi wa-alladhī unzila ilayka min rabbika al-ḥaqu walākinna akthara al-nāsi lā yu'minūna ","translations":["Alif Laam Mim Ra","These","(are) the Verses","(of) the Book","And that which","has been revealed","to you","from","your Lord","(is) the truth","but","most","(of) the mankind","(do) not","believe","(1)"],"transliterationArr":["alif-lam-meem-ra","til'ka","āyātu","al-kitābi","wa-alladhī","unzila","ilayka","min","rabbika","al-ḥaqu","walākinna","akthara","al-nāsi","lā","yu'minūna",null],"verseTiming":[[1,0,10930],[2,10930,11580],[3,11580,12800],[4,12800,15480],[5,15480,18450],[6,18450,19940],[7,19940,20820],[8,20820,20970],[9,20970,22170],[10,22170,23230],[11,23230,25130],[12,25130,26010],[13,26010,27550],[14,27550,28020],[15,28020,30925]]}},{"name":"13:2","price":"اللہ وه ہے جس نے آسمانوں کو بغیر ستونوں کے بلند کر رکھا ہے کہ تم اسے دیکھ رہے ہو۔ پھر وه عرش پر قرار پکڑے ہوئے ہے(1) ، اسی نے سورج اور چاند کو ماتحتی میں لگا رکھا ہے۔ ہر ایک میعاد معین پر گشت کر رہا ہے(2)، وہی کام کی تدبیر کرتا ہے وه اپنے نشانات کھول کھول کر بیان کر رہا ہے کہ تم اپنے رب کی ملاقات کا یقین کر لو.","arabic":"ٱللَّهُ ٱلَّذِي رَفَعَ ٱلسَّمَٰوَٰتِ بِغَيۡرِ عَمَدٖ تَرَوۡنَهَاۖ ثُمَّ ٱسۡتَوَىٰ عَلَى ٱلۡعَرۡشِۖ وَسَخَّرَ ٱلشَّمۡسَ وَٱلۡقَمَرَۖ كُلّٞ يَجۡرِي لِأَجَلٖ مُّسَمّٗىۚ يُدَبِّرُ ٱلۡأَمۡرَ يُفَصِّلُ ٱلۡأٓيَٰتِ لَعَلَّكُم بِلِقَآءِ رَبِّكُمۡ تُوقِنُونَ","category":["13 (Ar-Ra'd)","Ar-Ra'd","Surah Ar-Ra'd"],"ayahNumber":1709,"juzNumber":13,"footnotes":"(1) ”اسْتَوَىٰ عَلَى الْعَرْشِ“ کا مفہوم اس سے قبل بیان ہو چکا ہے کہ اس سے مراد اللہ تعالٰی کا عرش پر قرار پکڑنا ہے۔ محدثین کا یہی مسلک ہے وہ اس کی تاویل نہیں کرتے، جیسے بعض دوسرے گروہ اس میں اور دیگر صفات الٰہی میں تاویل کرتے ہیں۔ تاہم محدثین کہتے ہیں کہ اس کی کیفیت نہ بیان کی جاسکتی ہے اور نہ اسے کسی چیز سے تشبیہ دی جاسکتی ہے۔ «لَيْسَ كَمِثْلِهِ شَيْءٌ وَهُوَ السَّمِيعُ الْبَصِيرُ»(الشورى: 11)\n(2) اس کے ایک معنی یہ ہیں کہ یہ ایک وقت مقرر تک یعنی قیامت تک اللہ کے حکم سے چلتے رہیں گے جیسا کہ فرمایا «وَالشَّمْسُ تَجْرِي لِمُسْتَقَرٍّ لَهَا ذَلِكَ تَقْدِيرُ الْعَزِيزِ الْعَلِيمِ» (يٰس: 38)۔ ”اور سورج اپنے ٹھہرنے کے وقت تک چل رہا ہے“۔ دوسرے معنی یہ ہیں کہ چاند اور سورج دونوں اپنی اپنی منزلوں پر رواں دواں رہتے ہیں سورج اپنا دورہ ایک سال میں اور چاند ایک ماہ میں مکمل کر لیتا ہے جس طرح فرمایا «وَالْقَمَرَ قَدَّرْنَاهُ مَنَازِلَ» (يٰس: 39)۔ ”ہم نے چاند کی منزلیں مقرر کر دی ہیں“ سات بڑے بڑے سیارے ہیں جن میں سے دو چاند اور سورج ہیں یہاں صرف ان دو کا ذکر کیا ہے کیونکہ یہی دو سب سے زیادہ بڑے اور اہم ہیں جب یہ دونوں بھی اللہ کے حکم کے تابع ہیں تو دوسرے سیارے تو بطریق اولی اس کے تابع ہونگے اور جب یہ اللہ کے حکم کے تابع ہیں تو یہ معبود نہیں ہو سکتے معبود تو وہی ہے جس نے ان کو مسخر کیا ہوا ہے اس لیے فرمایا «لَا تَسْجُدُوْا لِلشَّمْسِ وَلَا لِلْقَمَرِ وَاسْجُدُوْا لِلّٰهِ الَّذِيْ خَلَقَهُنَّ اِنْ كُنْتُمْ اِيَّاهُ تَعْبُدُوْنَ» (فصلت: 37) ”سورج اور چاند کو سجدہ نہ کرو اس اللہ کو سجدہ کرو جس نے انہیں پیدا کیا اگر تم صرف اس کی عبادت کرنا چاہتے ہو“۔ «وَالشَّمْسَ وَالْقَمَرَ وَالنُّجُومَ مُسَخَّرَاتٍ بِأَمْرِهِ» (الأعراف: 54) ”سورج چاند اور تارے سب اس کے حکم کے تابع ہیں“۔","lang":"ur","meta":{"transliteration":"al-lahu alladhī rafaʿa al-samāwāti bighayri ʿamadin tarawnahā thumma is'tawā ʿalā al-ʿarshi wasakhara al-shamsa wal-qamara kullun yajrī li-ajalin musamman yudabbiru al-amra yufaṣṣilu al-āyāti laʿallakum biliqāi rabbikum tūqinūna ","translations":["Allah","(is) the One Who","raised","the heavens","without","pillars","that you see","then","He established","on","the Throne","and subjected","the sun","and the moon","each","running","for a term","appointed","He arranges","the matter","He details","the Signs","so that you may","in the meeting","(with) your Lord","believe with certainty","(2)"],"transliterationArr":["al-lahu","alladhī","rafaʿa","al-samāwāti","bighayri","ʿamadin","tarawnahā","thumma","is'tawā","ʿalā","al-ʿarshi","wasakhara","al-shamsa","wal-qamara","kullun","yajrī","li-ajalin","musamman","yudabbiru","al-amra","yufaṣṣilu","al-āyāti","laʿallakum","biliqāi","rabbikum","tūqinūna",null],"verseTiming":[[1,0,1270],[2,1270,2190],[3,2190,2950],[4,2950,4680],[5,4680,5550],[6,5550,7180],[7,7180,8750],[8,8750,10380],[9,10380,11490],[10,11490,11940],[11,11940,12810],[12,12810,14210],[13,14210,15260],[14,15260,16470],[15,16470,17150],[16,17150,18750],[17,18750,19740],[18,19740,23130],[19,23130,24200],[20,24200,25160],[21,25160,26330],[22,26330,27830],[23,27830,29790],[24,29790,32310],[25,32310,33540],[26,33540,36365]]}},{"name":"13:3","price":"اسی نے زمین پھیلا کر بچھا دی ہے اور اس میں پہاڑ اور نہریں پیدا کردی ہیں(1) ۔ اور اس میں ہر قسم کے پھلوں کے جوڑے دوہرے دوہرے پیدا کردیئے ہیں(2)، وه رات کو دن سے چھپا دیتا ہے۔ یقیناً غور وفکر کرنے والوں کے لئے اس میں بہت سی نشانیاں ہیں.","arabic":"وَهُوَ ٱلَّذِي مَدَّ ٱلۡأَرۡضَ وَجَعَلَ فِيهَا رَوَٰسِيَ وَأَنۡهَٰرٗاۖ وَمِن كُلِّ ٱلثَّمَرَٰتِ جَعَلَ فِيهَا زَوۡجَيۡنِ ٱثۡنَيۡنِۖ يُغۡشِي ٱلَّيۡلَ ٱلنَّهَارَۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّقَوۡمٖ يَتَفَكَّرُونَ","category":["13 (Ar-Ra'd)","Ar-Ra'd","Surah Ar-Ra'd"],"ayahNumber":1710,"juzNumber":13,"footnotes":"(1) زمین میں طول و عرض کا اندازہ بھی عام لوگوں کے لئے مشکل ہے اور بلند و بالا پہاڑوں کے ذریعے سے زمین میں گویا میخیں گاڑی ہیں، نہروں دریاؤں اور چشموں کا ایسا سلسلہ قائم کیا کہ جس سے انسان خود بھی سیراب ہوتے ہیں اور اپنے کھیتوں کو بھی سیراب کرتے ہیں جن سے انواع و اقسام کے غلے اور پھل پیدا ہوتے ہیں، جن کی شکلیں بھی ایک دوسرے سے مختلف اور ذائقے بھی جداگانہ ہوتے ہیں۔\n(2) اس کا ایک مطلب تو یہ ہے کہ نر مادہ دونوں بنائے، جیسا کہ موجودہ تحقیقات نے بھی اس کی تصدیق کر دی ہے۔ دوسرا مطلب (جوڑے جوڑے کا) یہ ہے میٹھا اور کھٹا، سرد اور گرم، سیاہ اور سفید اور ذائقہ، اس طرح ایک دوسرے سے مختلف اور متضاد قسمیں پیدا کیں۔","lang":"ur","meta":{"transliteration":"wahuwa alladhī madda al-arḍa wajaʿala fīhā rawāsiya wa-anhāran wamin kulli al-thamarāti jaʿala fīhā zawjayni ith'nayni yugh'shī al-layla al-nahāra inna fī dhālika laāyātin liqawmin yatafakkarūna ","translations":["And He","(is) the One Who","spread","the earth","and placed","in it","firm mountains","and rivers","and from","all","(of) the fruits","He made","in it","pairs","two","He covers","the night","(with) the day","Indeed","in","that","surely (are) Signs","for a people","who ponder","(3)"],"transliterationArr":["wahuwa","alladhī","madda","al-arḍa","wajaʿala","fīhā","rawāsiya","wa-anhāran","wamin","kulli","al-thamarāti","jaʿala","fīhā","zawjayni","ith'nayni","yugh'shī","al-layla","al-nahāra","inna","fī","dhālika","laāyātin","liqawmin","yatafakkarūna",null],"verseTiming":[[1,0,700],[2,700,1690],[3,1690,2330],[4,2330,3430],[5,3430,4330],[6,4330,5100],[7,5100,6420],[8,6420,8550],[9,8550,9720],[10,9720,10330],[11,10330,11800],[12,11800,12520],[13,12520,13400],[14,13400,14620],[15,14620,17420],[16,17420,18150],[17,18150,19120],[18,19120,23730],[19,23730,24790],[20,24790,25330],[21,25330,26240],[22,26240,27730],[23,27730,29700],[24,29700,33375]]}},{"name":"13:4","price":"اور زمین میں مختلف ٹکڑے ایک دوسرے سے لگتے لگاتے ہیں(1) اور انگوروں کے باغات ہیں اور کھیت ہیں اور کھجوروں کے درخت ہیں، شاخ دار اور بعض ایسے ہیں(2) جو بے شاخ ہیں سب ایک ہی پانی پلائے جاتے ہیں۔ پھر بھی ہم ایک کو ایک پر پھلوں میں برتری دیتے ہیں(3) اس میں عقل مندوں کے لئے بہت سی نشانیاں ہیں.","arabic":"وَفِي ٱلۡأَرۡضِ قِطَعٞ مُّتَجَٰوِرَٰتٞ وَجَنَّٰتٞ مِّنۡ أَعۡنَٰبٖ وَزَرۡعٞ وَنَخِيلٞ صِنۡوَانٞ وَغَيۡرُ صِنۡوَانٖ يُسۡقَىٰ بِمَآءٖ وَٰحِدٖ وَنُفَضِّلُ بَعۡضَهَا عَلَىٰ بَعۡضٖ فِي ٱلۡأُكُلِۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّقَوۡمٖ يَعۡقِلُونَ","category":["13 (Ar-Ra'd)","Ar-Ra'd","Surah Ar-Ra'd"],"ayahNumber":1711,"juzNumber":13,"footnotes":"(1) ”مُتَجَٰوِرَاتٌ“ ایک دوسرے کے قریب اور متصل یعنی زمین کا ایک حصہ شاداب اور زرخیز ہے۔ خوب پیداوار دیتا ہے اس کے ساتھ ہی زمین شور ہے، جس میں کسی قسم کی بھی پیدا نہیں ہوتی۔\n(2) ”صِنْوانٌ“ کے ایک معنی ملے ہوئے اور ”غَيْرُ صِنْوانٍ۔“ کے جدا جدا کیے گئے ہیں دوسرا معنی صِنْوانٌ ایک درخت، جس کی کئی شاخیں اور تنے ہوں، جیسے انار، انجیر اور بعض کھجوریں۔ اور غَيْرُ صِنْوانٍ جو اس طرح نہ ہو بلکہ ایک ہی تنے والا ہو۔\n(3) یعنی زمین بھی ایک، پانی، ہوا بھی ایک۔ لیکن پھل اور غلہ مختلف قسم اور ان کے ذائقے اور شکلیں بھی ایک دوسرے سے مختلف۔","lang":"ur","meta":{"transliteration":"wafī al-arḍi qiṭaʿun mutajāwirātun wajannātun min aʿnābin wazarʿun wanakhīlun ṣin'wānun waghayru ṣin'wānin yus'qā bimāin wāḥidin wanufaḍḍilu baʿḍahā ʿalā baʿḍin fī al-ukuli inna fī dhālika laāyātin liqawmin yaʿqilūna ","translations":["And in","the earth","are tracks","neighboring","and gardens","of","grapevines","and crops","and date-palms","trees (growing) from a single root","and not","trees (growing) from a single root","watered","with water","one","but We cause to exceed","some of them","over","others","in","the fruit","Indeed","in","that","surely (are) Signs","for a people","who use reason","(4)"],"transliterationArr":["wafī","al-arḍi","qiṭaʿun","mutajāwirātun","wajannātun","min","aʿnābin","wazarʿun","wanakhīlun","ṣin'wānun","waghayru","ṣin'wānin","yus'qā","bimāin","wāḥidin","wanufaḍḍilu","baʿḍahā","ʿalā","baʿḍin","fī","al-ukuli","inna","fī","dhālika","laāyātin","liqawmin","yaʿqilūna",null],"verseTiming":[[1,0,530],[2,530,1440],[3,1440,2240],[4,2240,5380],[5,5380,7270],[6,7270,8430],[7,8430,10180],[8,10180,11930],[9,11930,13710],[10,13710,15650],[11,15650,16440],[12,16440,18940],[13,18940,21470],[14,21470,22270],[15,22270,23880],[16,23880,25130],[17,25130,28080],[18,28080,29770],[19,29770,31100],[20,31100,32420],[21,32420,34320],[22,34320,35460],[23,35460,36160],[24,36160,37770],[25,37770,38040],[26,38040,39010],[27,39010,40350],[28,40350,40950],[29,40950,41900],[30,41900,43490],[31,43490,45600],[32,45600,48635]]}},{"name":"13:5","price":"اگر تجھے تعجب ہو تو واقعی ان کا یہ کہنا عجیب ہے کہ کیا جب ہم مٹی ہو جائیں گے۔ تو کیا ہم نئی پیدائش میں ہوں گے(1) ؟ یہی وه لوگ ہیں جنہوں نے اپنے پروردگار سے کفر کیا۔ یہی ہیں جن کی گردنوں میں طوق ہوں گے اور یہی ہیں جو جہنم کے رہنے والے ہیں جو اس میں ہمیشہ ہمیشہ رہیں گے.","arabic":"۞ وَإِن تَعۡجَبۡ فَعَجَبٞ قَوۡلُهُمۡ أَءِذَا كُنَّا تُرَٰبًا أَءِنَّا لَفِي خَلۡقٖ جَدِيدٍۗ أُوْلَٰٓئِكَ ٱلَّذِينَ كَفَرُواْ بِرَبِّهِمۡۖ وَأُوْلَٰٓئِكَ ٱلۡأَغۡلَٰلُ فِيٓ أَعۡنَاقِهِمۡۖ وَأُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلنَّارِۖ هُمۡ فِيهَا خَٰلِدُونَ","category":["13 (Ar-Ra'd)","Ar-Ra'd","Surah Ar-Ra'd"],"ayahNumber":1712,"juzNumber":13,"footnotes":"(1) یعنی جس ذات نے پہلی مرتبہ پیدا کیا، اس کے لئے دوبارہ اس چیز کا بنانا کوئی مشکل کام نہیں۔ لیکن کفار یہ عجیب بات کہتے ہیں کہ دوبارہ ہم کیسے پیدا کئے جائیں گے؟۔","lang":"ur","meta":{"transliteration":"wa-in taʿjab faʿajabun qawluhum a-idhā kunnā turāban a-innā lafī khalqin jadīdin ulāika alladhīna kafarū birabbihim wa-ulāika al-aghlālu fī aʿnāqihim wa-ulāika aṣḥābu al-nāri hum fīhā khālidūna ","translations":["And if","you (are) astonished","then astonishing","(is) their saying","When","we are","dust","will we","(be) indeed, in","a creation","new","Those","(are) the ones who","disbelieved","in their Lord","and those","the iron chains","(will be) in","their necks","those","(are the) companions","(of) the Fire","they","in it","(will) abide forever","(5)"],"transliterationArr":["wa-in","taʿjab","faʿajabun","qawluhum","a-idhā","kunnā","turāban","a-innā","lafī","khalqin","jadīdin","ulāika","alladhīna","kafarū","birabbihim","wa-ulāika","al-aghlālu","fī","aʿnāqihim","wa-ulāika","aṣḥābu","al-nāri","hum","fīhā","khālidūna",null],"verseTiming":[[1,0,1280],[2,1280,2290],[3,2290,3390],[4,3390,5150],[5,5150,6050],[6,6050,7490],[7,7490,8740],[8,8740,10490],[9,10490,11140],[10,11140,12090],[11,12090,16030],[12,16030,19130],[13,19130,20250],[14,20250,21290],[15,21290,22720],[16,22720,25590],[17,25590,27040],[18,27040,28580],[19,28580,30670],[20,30670,33579],[21,33579,34609],[22,34609,36289],[23,36289,36719],[24,36719,37639],[25,37639,41004]]}},{"name":"13:6","price":"اور جو تجھ سے (سزا کی طلبی میں) جلد کر رہے ہیں راحت سے پہلے ہی، یقیناً ان سے پہلے سزائیں (بطور مثال) گزر چکی ہیں(1) ، اور بیشک تیرا رب البتہ بخشنے واﻻ ہے لوگوں کے بے جا ﻇلم پر بھی(2)۔ اور یہ بھی یقینی بات ہے کہ تیرا رب بڑی سخت سزا دینے واﻻ بھی ہے.(3)","arabic":"وَيَسۡتَعۡجِلُونَكَ بِٱلسَّيِّئَةِ قَبۡلَ ٱلۡحَسَنَةِ وَقَدۡ خَلَتۡ مِن قَبۡلِهِمُ ٱلۡمَثُلَٰتُۗ وَإِنَّ رَبَّكَ لَذُو مَغۡفِرَةٖ لِّلنَّاسِ عَلَىٰ ظُلۡمِهِمۡۖ وَإِنَّ رَبَّكَ لَشَدِيدُ ٱلۡعِقَابِ","category":["13 (Ar-Ra'd)","Ar-Ra'd","Surah Ar-Ra'd"],"ayahNumber":1713,"juzNumber":13,"footnotes":"(1) یعنی عذاب الٰہی سے قوموں اور بستیوں کی تباہی کی کئی مثالیں پہلے گزر چکی ہیں، اس کے باوجود یہ عذاب جلدی مانگتے ہیں؟ یہ کفار کے جواب میں کہا گیا جو کہتے تھے کہ اے پیغمبر! اگر تو سچا ہے تو عذاب ہم پر لے آ۔ جس سے تو ہمیں ڈراتا رہتا ہے۔\n(2) یعنی لوگوں کے ظلم و معصیت کے باوجود وہ عذاب میں جلدی نہیں کرتا بلکہ مہلت دیتا ہے اور بعض دفعہ تو اتنی تاخیر کرتا ہے کہ معاملہ قیامت پر چھوڑ دیتا ہے، یہ اس کے حلم و کرم اور عفو و درگزر کا نتیجہ ہے ورنہ وہ فوراً مواخذہ کرنے اور عذاب دینے پر آجائے تو روئے زمین پر کوئی انسان ہی باقی نہ رہے۔ «وَلَوْ يُؤَاخِذُ اللّٰهُ النَّاسَ بِمَا كَسَبُوْا مَا تَرَكَ عَلٰي ظَهْرِهَا مِنْ دَاۗبَّةٍ» (فاطر:45) ”اور اگر اللہ تعالٰی لوگوں پر ان کے اعمال کے سبب پکڑ دھکڑ فرمانے لگتا تو روئے زمین پر ایک تنفس کو نہ چھوڑتا“۔\n(3) یہ اللہ کی دوسری صفت کا بیان ہے تاکہ انسان صرف ایک ہی پہلو پر نظر نہ رکھے اس کے دوسرے پہلو کو بھی دیکھتا رہے کیونکہ ایک ہی رخ اور ایک ہی پہلو کو مسلسل دیکھنے رہنے سے بہت سی چیزیں اوجھل رہ جاتی ہیں اسی لیے قرآن کریم میں جہاں اللہ کی صفت رحیمی وغفوری کا بیان ہوتا ہے تو اس کے ساتھ ہی اس کی دوسری صفت قہاری و جباری کا بیان بھی ملتا ہے جیسا کہ یہاں بھی ہے تاکہ رجاء امید اور خوف دونوں پہلو سامنے رہیں کیونکہ اگر امید ہی امید سامنے رہے تو انسان معصیت الہی پر دلیر ہو جاتا ہے اور اگر خوف ہی خوف ہر وقت دل ودماغ پر مسلط رہے تو اللہ کی رحمت سے مایوسی ہو جاتی ہے اور دونوں ہی باتیں غلط اور انسان کے لیے تباہ کن ہیں اسی لیے کہا جاتا ہے«الإِيمَانُ بَيْنَ الْخَوْفِ وَالرَّجَاءِ» ”ایمان خوف اور امید کے درمیان ہے“ یعنی دونوں باتوں کے درمیان اعتدال وتوازن کا نام ایمان ہے انسان اللہ کے عذاب کے خوف سے بےپروا ہو اور نہ اس کی رحمت سے مایوس۔ اس مضمون کے ملاحظہ کے لیے دیکھئے (سورۃ الانعام:47، سورۃ الاعراف:167، سورۃ الحجر:49، 50)","lang":"ur","meta":{"transliteration":"wayastaʿjilūnaka bil-sayi-ati qabla al-ḥasanati waqad khalat min qablihimu al-mathulātu wa-inna rabbaka ladhū maghfiratin lilnnāsi ʿalā ẓul'mihim wa-inna rabbaka lashadīdu al-ʿiqābi ","translations":["And they ask you to hasten","the evil","before","the good","and verily","has occurred","from","before them","[the] similar punishments","And indeed","your Lord","(is) full","(of) forgiveness","for mankind","for","their wrongdoing","and indeed","your Lord","(is) severe","(in) the penalty","(6)"],"transliterationArr":["wayastaʿjilūnaka","bil-sayi-ati","qabla","al-ḥasanati","waqad","khalat","min","qablihimu","al-mathulātu","wa-inna","rabbaka","ladhū","maghfiratin","lilnnāsi","ʿalā","ẓul'mihim","wa-inna","rabbaka","lashadīdu","al-ʿiqābi",null],"verseTiming":[[1,0,2440],[2,2440,4160],[3,4160,4780],[4,4780,5970],[5,5970,6540],[6,6540,7350],[7,7350,8410],[8,8410,9480],[9,9480,13150],[10,13150,14550],[11,14550,15460],[12,15460,16150],[13,16150,17400],[14,17400,19530],[15,19530,20179],[16,20179,21729],[17,21729,22869],[18,22869,23789],[19,23789,24999],[20,24999,27404]]}},{"name":"13:7","price":"اور کافر کہتے ہیں کہ اس پر اس کے رب کی طرف سے کوئی نشانی (معجزه) کیوں نہیں اتاری گئی۔ بات یہ ہے کہ آپ تو صرف آگاه کرنے والے ہیں.(1) ۔ اور ہر قوم کے لئے ہادی ہے.(2)","arabic":"وَيَقُولُ ٱلَّذِينَ كَفَرُواْ لَوۡلَآ أُنزِلَ عَلَيۡهِ ءَايَةٞ مِّن رَّبِّهِۦٓۗ إِنَّمَآ أَنتَ مُنذِرٞۖ وَلِكُلِّ قَوۡمٍ هَادٍ","category":["13 (Ar-Ra'd)","Ar-Ra'd","Surah Ar-Ra'd"],"ayahNumber":1714,"juzNumber":13,"footnotes":"(1) ہر نبی کو اللہ نے حالات و ضروریات اور اپنی مشیت و مصلحت کے مطابق کچھ نشانیاں اور معجزات عطا فرمائے لیکن کافر اپنے حسب منشا معجزات کے طالب ہوتے رہے ہیں۔ جیسے کفار مکہ نبی (صلى الله عليه وسلم) کو کہتے کہ کوہ صفا کو سونے کا بنا دیا جائے یا پہاڑوں کی جگہ نہریں اور چشمے جاری ہوجائیں، وغیرہ وغیرہ جب ان کی خواہش کے مطابق معجزہ صادر کر کے نہ دکھایا جاتا تو کہتے کہ اس پر کوئی نشان (معجزہ) نازل کیوں نہیں کیا گیا؟ اللہ تعالٰی نے فرمایا، اے پیغمبر! تیرا کام صرف تبلیغ ہے۔ وہ تو کرتا رہ کوئی مانے نہ مانے، اس سے تجھے کوئی غرض نہیں، اس لئے کہ ہدایت دینا یہ ہمارا کام ہے۔ تیرا کام راستہ دکھانا ہے، اس راستے پر چلا دینا، یہ تیرا کام نہیں، ہمارا کام ہے۔\n(2) یعنی ہر قوم کی ہدایت و رہنمائی کے لئے اللہ تعالٰی نے ہادی ضرور بھیجا ہے۔ یہ الگ بات ہے کہ قوموں نے ہدایت کا راستہ اپنایا یا نہیں اپنایا۔ لیکن سیدھے راستے کی نشان دہی کرنے کے لئے پیغمبر ہر قوم کے اندر ضرور آیا۔ «وَإِنْ مِنْ أُمَّةٍ إِلا خَلا فِيهَا نَذِيرٌ» ( فاطر:24)۔ ”ہر امت میں ایک نذیر ضرور آیا ہے“۔","lang":"ur","meta":{"transliteration":"wayaqūlu alladhīna kafarū lawlā unzila ʿalayhi āyatun min rabbihi innamā anta mundhirun walikulli qawmin hādin ","translations":["And say","those who","disbelieved","Why not","has been sent down","to him","a sign","from","his Lord","Only","you","(are) a warner","and for every","people","(is) a guide","(7)"],"transliterationArr":["wayaqūlu","alladhīna","kafarū","lawlā","unzila","ʿalayhi","āyatun","min","rabbihi","innamā","anta","mundhirun","walikulli","qawmin","hādin",null],"verseTiming":[[1,0,1160],[2,1160,2240],[3,2240,3300],[4,3300,5680],[5,5680,7180],[6,7180,8170],[7,8170,9250],[8,9250,10070],[9,10070,11710],[10,11710,14650],[11,14650,15880],[12,15880,18350],[13,18350,19420],[14,19420,20260],[15,20260,23045]]}},{"name":"13:8","price":"ماده اپنے شکم میں جو کچھ رکھتی ہے اسے اللہ بخوبی جانتا ہے(1) اور پیٹ کا گھٹنا بڑھنا بھی(2)، ہر چیز اس کے پاس اندازے سے ہے.(3)","arabic":"ٱللَّهُ يَعۡلَمُ مَا تَحۡمِلُ كُلُّ أُنثَىٰ وَمَا تَغِيضُ ٱلۡأَرۡحَامُ وَمَا تَزۡدَادُۚ وَكُلُّ شَيۡءٍ عِندَهُۥ بِمِقۡدَارٍ","category":["13 (Ar-Ra'd)","Ar-Ra'd","Surah Ar-Ra'd"],"ayahNumber":1715,"juzNumber":13,"footnotes":"(1) رحم مادر میں کیا ہے، نر یا مادہ، خوبصورت یا بد صورت، نیک ہے یا بد، طویل العمر ہے یا قصیر العمر؟ یہ سب باتیں صرف اللہ تعالٰی ہی جانتا ہے۔\n(2) اس سے مراد حمل مدت ہے جو عام طور پر ٩ مہینے ہوتی ہے لیکن گھٹتی بڑھتی بھی ہے، کسی وقت یہ مدت 10مہینے اور کسی وقت 7،8 مہینے ہو جاتی ہے، اس کا علم بھی اللہ کے سوا کسی کو نہیں۔\n(3) یعنی کسی کی زندگی کتنی ہے؟ اسے رزق سے کتنا حصہ ملے گا؟ اس کا پورا اندازہ اللہ کو ہے۔","lang":"ur","meta":{"transliteration":"al-lahu yaʿlamu mā taḥmilu kullu unthā wamā taghīḍu al-arḥāmu wamā tazdādu wakullu shayin ʿindahu bimiq'dārin ","translations":["Allah","knows","what","carries","every","female","and what","fall short","the womb","and what","they exceed","And every","thing","with Him","(is) in due proportion","(8)"],"transliterationArr":["al-lahu","yaʿlamu","mā","taḥmilu","kullu","unthā","wamā","taghīḍu","al-arḥāmu","wamā","tazdādu","wakullu","shayin","ʿindahu","bimiq'dārin",null],"verseTiming":[[1,0,1150],[2,1150,2110],[3,2110,2570],[4,2570,3550],[5,3550,4260],[6,4260,5890],[7,5890,6570],[8,6570,7580],[9,7580,9020],[10,9020,9730],[11,9730,10650],[12,10650,12630],[13,12630,14150],[14,14150,15060],[15,15060,16950],[16,16950,20374]]}},{"name":"13:9","price":"ﻇاہر وپوشیده کا وه عالم ہے (سب سے) بڑا اور (سب سے) بلند وباﻻ.","arabic":"عَٰلِمُ ٱلۡغَيۡبِ وَٱلشَّهَٰدَةِ ٱلۡكَبِيرُ ٱلۡمُتَعَالِ","category":["13 (Ar-Ra'd)","Ar-Ra'd","Surah Ar-Ra'd"],"ayahNumber":1716,"juzNumber":13,"footnotes":"","lang":"ur","meta":{"transliteration":"ʿālimu al-ghaybi wal-shahādati al-kabīru al-mutaʿāli ","translations":["Knower","(of) the unseen","and the witnessed","the Most Great","the Most High","(9)"],"transliterationArr":["ʿālimu","al-ghaybi","wal-shahādati","al-kabīru","al-mutaʿāli",null],"verseTiming":[[1,0,1010],[2,1010,2070],[3,2070,3820],[4,3820,4970],[5,4970,7895]]}},{"name":"13:10","price":"تم میں سے کسی کا اپنی بات کو چھپا کر کہنا اور بﺂواز بلند اسے کہنا اور جو رات کو چھپا ہوا ہو اور جو دن میں چل رہا ہو، سب اللہ پر برابر ویکساں ہیں.","arabic":"سَوَآءٞ مِّنكُم مَّنۡ أَسَرَّ ٱلۡقَوۡلَ وَمَن جَهَرَ بِهِۦ وَمَنۡ هُوَ مُسۡتَخۡفِۭ بِٱلَّيۡلِ وَسَارِبُۢ بِٱلنَّهَارِ","category":["13 (Ar-Ra'd)","Ar-Ra'd","Surah Ar-Ra'd"],"ayahNumber":1717,"juzNumber":13,"footnotes":"","lang":"ur","meta":{"transliteration":"sawāon minkum man asarra al-qawla waman jahara bihi waman huwa mus'takhfin bi-al-layli wasāribun bil-nahāri ","translations":["(It is) same (to Him)","[of you]","(one) who","conceals","the speech","or (one) who","publicizes","it","and (one) who","[he]","(is) hidden","by night","or goes freely","by day","(10)"],"transliterationArr":["sawāon","minkum","man","asarra","al-qawla","waman","jahara","bihi","waman","huwa","mus'takhfin","bi-al-layli","wasāribun","bil-nahāri",null],"verseTiming":[[1,0,2230],[2,2230,4650],[3,4650,5660],[4,5660,6520],[5,6520,7640],[6,7640,8580],[7,8580,9450],[8,9450,10120],[9,10120,10950],[10,10950,11360],[11,11360,12750],[12,12750,14160],[13,14160,16610],[14,16610,17030],[15,17030,19180],[16,19180,20350],[17,20350,22480],[18,22480,26095]]}},{"name":"13:11","price":"اس کے پہرے دار(1) انسان کے آگے پیچھے مقرر ہیں، جو اللہ کے حکم سے اس کی نگہبانی کرتے ہیں۔ کسی قوم کی حالت اللہ تعالیٰ نہیں بدلتا جب تک کہ وه خود اسے نہ بدلیں جو ان کے دلوں میں ہے(2)۔ اللہ تعالیٰ جب کسی قوم کی سزا کا اراده کر لیتا ہے تو وه بدﻻ نہیں کرتا اور سوائے اس کے کوئی بھی ان کا کارساز نہیں.","arabic":"لَهُۥ مُعَقِّبَٰتٞ مِّنۢ بَيۡنِ يَدَيۡهِ وَمِنۡ خَلۡفِهِۦ يَحۡفَظُونَهُۥ مِنۡ أَمۡرِ ٱللَّهِۗ إِنَّ ٱللَّهَ لَا يُغَيِّرُ مَا بِقَوۡمٍ حَتَّىٰ يُغَيِّرُواْ مَا بِأَنفُسِهِمۡۗ وَإِذَآ أَرَادَ ٱللَّهُ بِقَوۡمٖ سُوٓءٗا فَلَا مَرَدَّ لَهُۥۚ وَمَا لَهُم مِّن دُونِهِۦ مِن وَالٍ","category":["13 (Ar-Ra'd)","Ar-Ra'd","Surah Ar-Ra'd"],"ayahNumber":1718,"juzNumber":13,"footnotes":"(1) مُعَقِّبَاتٌ، مُعَقِّبَةٌ۔ کی جمع ہے ایک دوسرے کے پیچھے آنے والے، مراد فرشتے ہیں جو باری باری ایک دوسرے کے بعد آتے ہیں۔ دن کے فرشتے جاتے ہیں تو شام کے آجاتے ہیں شام کے جاتے ہیں تو دن کے آجاتے ہیں۔\n(2) اس کی تشریح کے لئے دیکھئے سورہ انفال آیت 53 کا حاشیہ۔","lang":"ur","meta":{"transliteration":"lahu muʿaqqibātun min bayni yadayhi wamin khalfihi yaḥfaẓūnahu min amri al-lahi inna al-laha lā yughayyiru mā biqawmin ḥattā yughayyirū mā bi-anfusihim wa-idhā arāda al-lahu biqawmin sūan falā maradda lahu wamā lahum min dūnihi min wālin ","translations":["For him","(are) successive (Angels)","from","(before)","(him)","and from","and behind him","who guard him","by","(the) command","(of) Allah","Indeed","Allah","(does) not","change","(the condition)","of a people","until","they change","what","(is) in themselves","And when","wills","Allah","for a people","misfortune","then (there is) no","turning away","of it","and not","for them","from","besides Him","any","protector","(11)"],"transliterationArr":["lahu","muʿaqqibātun","min","bayni","yadayhi","wamin","khalfihi","yaḥfaẓūnahu","min","amri","al-lahi","inna","al-laha","lā","yughayyiru","mā","biqawmin","ḥattā","yughayyirū","mā","bi-anfusihim","wa-idhā","arāda","al-lahu","biqawmin","sūan","falā","maradda","lahu","wamā","lahum","min","dūnihi","min","wālin",null],"verseTiming":[[1,0,800],[2,800,2390],[3,2390,3870],[4,3870,4840],[5,4840,5790],[6,5790,6330],[7,6330,7810],[8,7810,9670],[9,9670,10180],[10,10180,10830],[11,10830,13840],[12,13840,14940],[13,14940,15890],[14,15890,16490],[15,16490,17720],[16,17720,18150],[17,18150,19320],[18,19320,20300],[19,20300,21750],[20,21750,22170],[21,22170,25030],[22,25030,27430],[23,27430,28330],[24,28330,29320],[25,29320,30380],[26,30380,33690],[27,33690,34490],[28,34490,35550],[29,35550,36350],[30,36350,37110],[31,37110,38010],[32,38010,38710],[33,38710,39410],[34,39410,40630],[35,40630,41010],[36,41010,43275]]}},{"name":"13:12","price":"وه اللہ ہی ہے جو تمہیں بجلی کی چمک ڈرانے اور امید دﻻنے کے لئے دکھاتا ہے(1) اور بھاری بادلوں کو پیدا کرتا ہے.(2)","arabic":"هُوَ ٱلَّذِي يُرِيكُمُ ٱلۡبَرۡقَ خَوۡفٗا وَطَمَعٗا وَيُنشِئُ ٱلسَّحَابَ ٱلثِّقَالَ","category":["13 (Ar-Ra'd)","Ar-Ra'd","Surah Ar-Ra'd"],"ayahNumber":1719,"juzNumber":13,"footnotes":"(1) جس سے راہ گیر مسافر ڈرتے ہیں اور گھروں میں مقیم کسان اور کاشت کار اس کی برکت و منفعت کی امید رکھتے ہیں۔\n(2) بھاری بادلوں سے مراد، وہ بادل ہیں جس میں بارش کا پانی ہوتا ہے۔","lang":"ur","meta":{"transliteration":"huwa alladhī yurīkumu al-barqa khawfan waṭamaʿan wayunshi-u al-saḥāba al-thiqāla ","translations":["He","(is) the One Who","shows you","the lightning","a fear","and a hope","and brings up","the clouds","the heavy","(12)"],"transliterationArr":["huwa","alladhī","yurīkumu","al-barqa","khawfan","waṭamaʿan","wayunshi-u","al-saḥāba","al-thiqāla",null],"verseTiming":[[1,0,350],[2,350,1530],[3,1530,2690],[4,2690,3700],[5,3700,4940],[6,4940,7150],[7,7150,8690],[8,8690,9880],[9,9880,12865]]}},{"name":"13:13","price":"گرج اس کی تسبیح وتعریف کرتی ہے اور فرشتے بھی، اس کے خوف سے(1) ۔ وہی آسمان سے بجلیاں گراتا ہے اور جس پر چاہتا ہے اس پر ڈالتا ہے(2) کفار اللہ کی بابت لڑ جھگڑ رہے ہیں اور اللہ سخت قوت والا ہے.(3)","arabic":"وَيُسَبِّحُ ٱلرَّعۡدُ بِحَمۡدِهِۦ وَٱلۡمَلَٰٓئِكَةُ مِنۡ خِيفَتِهِۦ وَيُرۡسِلُ ٱلصَّوَٰعِقَ فَيُصِيبُ بِهَا مَن يَشَآءُ وَهُمۡ يُجَٰدِلُونَ فِي ٱللَّهِ وَهُوَ شَدِيدُ ٱلۡمِحَالِ","category":["13 (Ar-Ra'd)","Ar-Ra'd","Surah Ar-Ra'd"],"ayahNumber":1720,"juzNumber":13,"footnotes":"(1) جیسے دوسرے مقام پر فرمایا «وَإِنْ مِنْ شَيْءٍ إِلا يُسَبِّحُ بِحَمْدِهِ» ( بني إسرائيل:44) ”ہر چیز اللہ کی تسبیح بیان کرتی ہے“۔\n(2) یعنی اس کے ذریعے جس کو چاہتا ہے، ہلاک کر ڈالتا ہے۔\n(3) مِحَالٌ ۔ کے معنی قوت مواخذہ اور تدبیر وغیرہ کے کیے گئے ہیں یعنی وہ بڑی قوت والا، نہایت مواخذہ کرنے والا اور تدبیر کرنے والا ہے۔","lang":"ur","meta":{"transliteration":"wayusabbiḥu al-raʿdu biḥamdihi wal-malāikatu min khīfatihi wayur'silu al-ṣawāʿiqa fayuṣību bihā man yashāu wahum yujādilūna fī al-lahi wahuwa shadīdu al-miḥāli ","translations":["And glorifies","the thunder","with his praise ","and the Angels","for","fear of Him","And He sends","the thunderbolts","and strikes","with it","whom","He wills","yet they","dispute","about","Allah","And He","(is) Mighty","(in) Strength","(13)"],"transliterationArr":["wayusabbiḥu","al-raʿdu","biḥamdihi","wal-malāikatu","min","khīfatihi","wayur'silu","al-ṣawāʿiqa","fayuṣību","bihā","man","yashāu","wahum","yujādilūna","fī","al-lahi","wahuwa","shadīdu","al-miḥāli",null],"verseTiming":[[1,0,1400],[2,1400,2370],[3,2370,3870],[4,3870,6840],[5,6840,7240],[6,7240,8690],[7,8690,9900],[8,9900,11390],[9,11390,12970],[10,12970,14390],[11,14390,15600],[12,15600,16240],[13,16240,16680],[14,16680,19769],[15,19769,20349],[16,20349,22089],[17,22089,22359],[18,22359,23339],[19,23339,23959],[20,23959,24959],[21,24959,27404]]}},{"name":"13:14","price":"اسی کو پکارنا حق ہے(1) ۔ جو لوگ اوروں کو اس کے سوا پکارتے ہیں وه ان (کی پکار) کا کچھ بھی جواب نہیں دیتے مگر جیسے کوئی شخص اپنے دونوں ہاتھ پانی کی طرف پھیلائے ہوئے ہو کہ اس کے منھ میں پڑ جائے حاﻻنکہ وه پانی اس کے منھ میں پہنچنے واﻻ نہیں(2)، ان منکروں کی جتنی پکار ہے سب گمراہی میں ہے.(3)","arabic":"لَهُۥ دَعۡوَةُ ٱلۡحَقِّۚ وَٱلَّذِينَ يَدۡعُونَ مِن دُونِهِۦ لَا يَسۡتَجِيبُونَ لَهُم بِشَيۡءٍ إِلَّا كَبَٰسِطِ كَفَّيۡهِ إِلَى ٱلۡمَآءِ لِيَبۡلُغَ فَاهُ وَمَا هُوَ بِبَٰلِغِهِۦۚ وَمَا دُعَآءُ ٱلۡكَٰفِرِينَ إِلَّا فِي ضَلَٰلٖ","category":["13 (Ar-Ra'd)","Ar-Ra'd","Surah Ar-Ra'd"],"ayahNumber":1721,"juzNumber":13,"footnotes":"(1) یعنی خوف اور امید کے وقت اسی ایک اللہ کو پکارنا صحیح ہے کیونکہ وہی ہر ایک کی پکار سنتا ہے اور قبول فرماتا ہے یا دعوت۔ عبادت کے معنی میں ہے یعنی، اسی کی عبادت حق اور صحیح ہے اس کے سوا کوئی عبادت کا مستحق نہیں، کیونکہ کائنات کا خالق، مالک اور مدبر صرف وہی ہے اس لئے عبادت صرف اسی کا حق ہے۔\n(2) یعنی جو اللہ کو چھوڑ کر دوسروں کو مدد کے لئے پکارتے ہیں۔ ان کی مثال ایسی ہے جیسے کوئی شخص دور سے پانی کی طرف اپنی دونوں ہتھلیاں پھیلا کر پانی سے کہے کہ میرے منہ تک آجا، ظاہر بات ہے کہ پانی جامد چیز ہے، اسے پتہ ہی نہیں کہ ہتھیلیاں پھیلانے والے کی حاجت کیا ہے، اور نہ اسے پتہ ہے کہ وہ مجھ سے اپنے منہ تک پہنچنے کا مطالبہ کر رہا ہے۔ اور نہ اس میں یہ قدرت ہے کہ اپنی جگہ سے حرکت کر کے اس کے ہاتھ یا منہ تک پہنچ جائے اسی طرح یہ مشرک اللہ کے سوا جن کو پکارتے ہیں انہیں نہ یہ پتہ ہے کہ کوئی انہیں پکار رہا ہے اور اس کی فلاں حاجت ہے اور نہ اس حاجت روائی کی ان میں قدرت ہی ہے۔\n(3) اور بےفائدہ بھی ہے، کیونکہ اس سے ان کو کئی نفع نہیں ہوگا۔","lang":"ur","meta":{"transliteration":"lahu daʿwatu al-ḥaqi wa-alladhīna yadʿūna min dūnihi lā yastajībūna lahum bishayin illā kabāsiṭi kaffayhi ilā al-māi liyablugha fāhu wamā huwa bibālighihi wamā duʿāu al-kāfirīna illā fī ḍalālin ","translations":["To Him","(is) supplication","(of) the truth","And those whom","they invoke","besides Him","besides Him","not","they respond","to them","with a thing","except","like one who stretches","his hands","towards","water","to reach","his mouth","but not","it","reaches it","And not","(is) the supplication","(of) the disbelievers","but","in","error","(14)"],"transliterationArr":["lahu","daʿwatu","al-ḥaqi","wa-alladhīna","yadʿūna","min","dūnihi","lā","yastajībūna","lahum","bishayin","illā","kabāsiṭi","kaffayhi","ilā","al-māi","liyablugha","fāhu","wamā","huwa","bibālighihi","wamā","duʿāu","al-kāfirīna","illā","fī","ḍalālin",null],"verseTiming":[[1,0,690],[2,690,1740],[3,1740,2940],[4,2940,4540],[5,4540,5630],[6,5630,6930],[7,6930,8130],[8,8130,8610],[9,8610,10510],[10,10510,11630],[11,11630,12850],[12,12850,13720],[13,13720,15090],[14,15090,16410],[15,16410,17600],[16,17600,17970],[17,17970,20500],[18,20500,21620],[19,21620,22490],[20,22490,23040],[21,23040,23470],[22,23470,25370],[23,25370,26050],[24,26050,28450],[25,28450,29990],[26,29990,30950],[27,30950,31430],[28,31430,33985]]}},{"name":"13:15","price":"اللہ ہی کے لئے زمین اور آسمانوں کی سب مخلوق خوشی اور ناخوشی سے سجده کرتی ہے اور ان کے سائے بھی صبح وشام.(1)","arabic":"وَلِلَّهِۤ يَسۡجُدُۤ مَن فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ طَوۡعٗا وَكَرۡهٗا وَظِلَٰلُهُم بِٱلۡغُدُوِّ وَٱلۡأٓصَالِ۩","category":["13 (Ar-Ra'd)","Ar-Ra'd","Surah Ar-Ra'd"],"ayahNumber":1722,"juzNumber":13,"footnotes":"(1) اس میں اللہ تعالٰی کی عظمت و قدرت کا بیان ہے کہ ہرچیز پر اس کا غلبہ ہے اور ہرچیز اس کے ما تحت اور اس کے سامنے سجدہ ریز ہے، چاہے مومنوں کی طرح خوشی سے کریں یا مشرکوں کی طرح ناخوشی سے۔ اور ان کے سائے بھی صبح و شام سجدہ کرتے ہیں۔ جیسے دوسرے مقام پر فرمایا۔ «اَوَلَمْ يَرَوْا اِلٰى مَا خَلَقَ اللّٰهُ مِنْ شَيْءٍ يَّتَفَيَّؤُا ظِلٰلُهٗ عَنِ الْيَمِيْنِ وَالشَّمَاۗىِٕلِ سُجَّدًا لِّلّٰهِ وَهُمْ دٰخِرُوْنَ» (النحل:48) ”کیا انہوں نے نہیں دیکھا کہ اللہ نے جو چیز بھی پیدا کی ہے ان کے سائے داہنے اور بائیں سے اللہ کو سجدہ کرتے ہوئے ڈھلتے ہیں اور وہ عاجزی کرتے ہیں“۔ اس سجدے کی کیفیت کیا ہے؟ یہ اللہ تعالٰی بہتر جانتا ہے یا دوسرا مفہوم اس کا یہ ہے کہ کافر سمیت تمام مخلوق اللہ کے حکم کے تابع ہے کسی میں اسی سے سرتابی کی مجال نہیں اللہ تعالٰی کسی کو صحت دے بیمار کرے غنی کر دے یا فقیر بنا دے زندگی دے یا موت سے ہمکنار کرے ان تکوینی احکام میں کسی کافر کو بھی مجال انکار نہیں۔","lang":"ur","meta":{"transliteration":"walillahi yasjudu man fī al-samāwāti wal-arḍi ṭawʿan wakarhan waẓilāluhum bil-ghuduwi wal-āṣāli ","translations":["And to Allah","prostrates","whoever","(is) in","the heavens","and the earth","willingly","or unwillingly","and (so do) their shadows","in the mornings","and in the afternoons","(15)"],"transliterationArr":["walillahi","yasjudu","man","fī","al-samāwāti","wal-arḍi","ṭawʿan","wakarhan","waẓilāluhum","bil-ghuduwi","wal-āṣāli",""],"verseTiming":[[1,0,1580],[2,1580,2470],[3,2470,3480],[4,3480,3730],[5,3730,5440],[6,5440,6580],[7,6580,7940],[8,7940,9510],[9,9510,11510],[10,11510,13710],[11,13710,17205]]}},{"name":"13:16","price":"آپ پوچھئے کہ آسمانوں اور زمین کا پروردگار کون ہے؟ کہہ دیجئے! اللہ(1) ۔ کہہ دیجئے! کیا تم پھر بھی اس کے سوا اوروں کو حمایتی بنا رہے ہو جو خود اپنی جان کے بھی بھلے برے کا اختیار نہیں رکھتے(2)۔ کہہ دیجئے کہ کیا اندھا اور بینا برابر ہو سکتا ہے؟ یا کیا اندھیریاں اور روشنی برابر ہو سکتی ہے(3)۔ کیا جنہیں یہ اللہ کے شریک ٹھہرا رہے ہیں انہوں نے بھی اللہ کی طرح مخلوق پیدا کی ہے کہ ان کی نظر میں پیدائش مشتبہ ہوگئی ہو، کہہ دیجئے کہ صرف اللہ ہی تمام چیزوں کا خالق ہے وه اکیلا ہے(4) اور زبردست غالب ہے.","arabic":"قُلۡ مَن رَّبُّ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ قُلِ ٱللَّهُۚ قُلۡ أَفَٱتَّخَذۡتُم مِّن دُونِهِۦٓ أَوۡلِيَآءَ لَا يَمۡلِكُونَ لِأَنفُسِهِمۡ نَفۡعٗا وَلَا ضَرّٗاۚ قُلۡ هَلۡ يَسۡتَوِي ٱلۡأَعۡمَىٰ وَٱلۡبَصِيرُ أَمۡ هَلۡ تَسۡتَوِي ٱلظُّلُمَٰتُ وَٱلنُّورُۗ أَمۡ جَعَلُواْ لِلَّهِ شُرَكَآءَ خَلَقُواْ كَخَلۡقِهِۦ فَتَشَٰبَهَ ٱلۡخَلۡقُ عَلَيۡهِمۡۚ قُلِ ٱللَّهُ خَٰلِقُ كُلِّ شَيۡءٖ وَهُوَ ٱلۡوَٰحِدُ ٱلۡقَهَّٰرُ","category":["13 (Ar-Ra'd)","Ar-Ra'd","Surah Ar-Ra'd"],"ayahNumber":1723,"juzNumber":13,"footnotes":"(1) یہاں تو پیغمبر کی زبان سے اقرار ہے۔ لیکن قرآن کے دوسرے مقامات سے واضح ہے کہ مشرکین کا جواب بھی یہی ہوتا تھا۔\n(2) یعنی جب تمہیں اقرار و اعتراف ہے کہ آسمان و زمین کا رب اللہ ہے جو تمام اختیارات کا بلا شرکت غیر مالک ہے پھر تم اسے چھوڑ کر ایسوں کو کیوں دوست اور حمائتی سمجھتے ہو جو اپنی بابت بھی نفع نقصان کا اختیار نہیں رکھتے۔\n(3) یعنی جس طرح اندھا اور بینا برابر نہیں ہو سکتے اسی طرح موحد اور مشرک برابر نہیں ہو سکتے اس لئے کہ موحد توحید کی بصیرت سے معمور ہے جب کہ مشرک اس سے محروم ہے۔ موحد کی آنکھیں ہیں، وہ توحید کا نور دیکھتا ہے اور مشرک کو یہ نور توحید نظر نہیں آتا، اس لئے وہ اندھا ہے۔ اسی طرح، جس طرح اندھیریاں اور روشنی برابر نہیں ہو سکتی۔ ایک اللہ کا پجاری، جس کا دل نورانیت سے بھرا ہوا ہے، اور ایک مشرک، جو جہالت و توہمات کے اندھیروں میں بھٹک رہا ہے، برابر نہیں ہو سکتے۔\n(4) یعنی ایسی بات نہیں ہے کہ یہ کسی شبے کا شکار ہوگئے ہوں بلکہ یہ مانتے ہیں کہ ہرچیز کا خالق صرف اور صرف اللہ ہی ہے۔","lang":"ur","meta":{"transliteration":"qul man rabbu al-samāwāti wal-arḍi quli al-lahu qul afa-ittakhadhtum min dūnihi awliyāa lā yamlikūna li-anfusihim nafʿan walā ḍarran qul hal yastawī al-aʿmā wal-baṣīru am hal tastawī al-ẓulumātu wal-nūru am jaʿalū lillahi shurakāa khalaqū kakhalqihi fatashābaha al-khalqu ʿalayhim quli al-lahu khāliqu kulli shayin wahuwa al-wāḥidu al-qahāru ","translations":["Say","Who","(is) the Lord","(of) the heavens","and the earth","Say","Allah","Say","Have you then taken","from","besides Him","protectors","not","they have power","for themselves","(to) benefit","and not","(to) harm","Say","Is","equal","the blind","and the seeing","Or","is","equal","the darkness[es]","and the light","Or","they attribute","to Allah","partners","who created","like His creation","so that seemed alike","the creation","to them","Say","Allah","(is) the Creator","of all","things","and He","(is) the One","the Irresistible","(16)"],"transliterationArr":["qul","man","rabbu","al-samāwāti","wal-arḍi","quli","al-lahu","qul","afa-ittakhadhtum","min","dūnihi","awliyāa","lā","yamlikūna","li-anfusihim","nafʿan","walā","ḍarran","qul","hal","yastawī","al-aʿmā","wal-baṣīru","am","hal","tastawī","al-ẓulumātu","wal-nūru","am","jaʿalū","lillahi","shurakāa","khalaqū","kakhalqihi","fatashābaha","al-khalqu","ʿalayhim","quli","al-lahu","khāliqu","kulli","shayin","wahuwa","al-wāḥidu","al-qahāru",null],"verseTiming":[[1,0,340],[2,340,420],[3,420,1340],[4,1340,2850],[5,2850,3860],[6,3860,4280],[7,4280,6760],[8,6760,7110],[9,7110,8640],[10,8640,10030],[11,10030,12140],[12,12140,14530],[13,14530,14890],[14,14890,16140],[15,16140,17980],[16,17980,19180],[17,19180,19710],[18,19710,21320],[19,21320,21660],[20,21660,22030],[21,22030,22840],[22,22840,23940],[23,23940,25160],[24,25160,25530],[25,25530,25920],[26,25920,26790],[27,26790,28130],[28,28130,31320],[29,31320,31690],[30,31690,32550],[31,32550,33630],[32,33630,35880],[33,35880,36670],[34,36670,38010],[35,38010,39230],[36,39230,40220],[37,40220,41720],[38,41720,42100],[39,42100,42920],[40,42920,43820],[41,43820,44400],[42,44400,45980],[43,45980,46510],[44,46510,47610],[45,47610,50315]]}},{"name":"13:17","price":"اسی نے آسمان سے پانی برسایا پھر اپنی اپنی وسعت کے مطابق نالے بہہ نکلے(1) ۔ پھر پانی کے ریلے نے اوپر چڑھے جھاگ کو اٹھا لیا(2)، اور اس چیز میں بھی جس کو آگ میں ڈال کر تپاتے ہیں زیور یا ساز وسامان کے لئے اسی طرح کے جھاگ ہیں(3)، اسی طرح اللہ تعالیٰ حق وباطل کی مثال بیان فرماتا ہے(4)، اب جھاگ تو ناکاره ہو کر چلا جاتا ہے(5) لیکن جو لوگوں کو نفع دینے والی چیز ہے وه زمین میں ٹھہری رہتی ہے(6)، اللہ تعالیٰ اسی طرح مثالیں بیان فرماتا ہے.(7)","arabic":"أَنزَلَ مِنَ ٱلسَّمَآءِ مَآءٗ فَسَالَتۡ أَوۡدِيَةُۢ بِقَدَرِهَا فَٱحۡتَمَلَ ٱلسَّيۡلُ زَبَدٗا رَّابِيٗاۖ وَمِمَّا يُوقِدُونَ عَلَيۡهِ فِي ٱلنَّارِ ٱبۡتِغَآءَ حِلۡيَةٍ أَوۡ مَتَٰعٖ زَبَدٞ مِّثۡلُهُۥۚ كَذَٰلِكَ يَضۡرِبُ ٱللَّهُ ٱلۡحَقَّ وَٱلۡبَٰطِلَۚ فَأَمَّا ٱلزَّبَدُ فَيَذۡهَبُ جُفَآءٗۖ وَأَمَّا مَا يَنفَعُ ٱلنَّاسَ فَيَمۡكُثُ فِي ٱلۡأَرۡضِۚ كَذَٰلِكَ يَضۡرِبُ ٱللَّهُ ٱلۡأَمۡثَالَ","category":["13 (Ar-Ra'd)","Ar-Ra'd","Surah Ar-Ra'd"],"ayahNumber":1724,"juzNumber":13,"footnotes":"(1) بِقَدَرِهَا (وسعت کے مطابق) کا مطلب ہے نالے یعنی وادی (دو پہاڑوں کے درمیان کی جگہ) تنگ ہو تو کم پانی کشادہ ہو تو زیادہ پانی اٹھاتی ہے یعنی نزول قرآن کو جو ہدایت اور بیان کا جاع ہے بارش کے نزول سے تشبیہ دی ہے اس لیے کہ قرآن کا نفع بھی بارش کے نفع کی طرح عام ہے اور وادیوں کو تشبیہ دی ہے دلوں کے ساتھ اس لیے کہ وادیوں نالوں میں پانی جا کر ٹھہرتا ہے جس طرح قرآن قرآن کا اور ایمان مومنوں کے دلوں میں قرار پکڑتا ہے۔\n(2) اس جھاگ سے جب پانی اوپر آجاتا ہے اور جو ناکارہ ہو ختم ہو جاتا ہے اور ہوائیں جسے اڑا لے جاتی ہیں کفر مراد ہے، جو جھاگ ہی کی طرح اڑ جانے والا اور ختم ہو جانے والا ہے۔\n(3) یہ دوسری شکل ہے کہ تانبے پیتل، سیسے یا سونے چاندی کو زیور یا سامان وغیرہ بنانے کے لئے آگ میں تپایا جاتا ہے تو اس پر بھی جھاگ کی شکل میں اوپر آجاتا ہے۔ پھر یہ جھاگ دیکھتے دیکھتے ختم ہو جاتا ہے اور دھات اصلی شکل میں باقی رہ جاتی ہے۔\n(4) یعنی جب حق اور باطل کا آپس میں اجتماع اور ٹکراؤ ہوتا ہے تو باطل کو اسی طرح اثبات اور دوام نہیں ہوتا، جس طرح سیلابی ریلے کا جھاگ پانی کے ساتھ، دھاتوں کا جھاگ، جن کو آگ میں تپایا جاتا ہے دھاتوں کے ساتھ باقی نہیں رہتا بلکہ مضمحل اور ختم ہو جاتا ہے۔\n(5) یعنی اس سے کوئی نفع نہیں ہوتا، کیونکہ جھاگ پانی یا دھات کے باقی رہتا ہی نہیں بلکہ آہستہ آہستہ بیٹھ جاتا ہے یا ہوائیں اسے اڑا لے جاتی ہیں۔ باطل کی مثال بھی جھاگ ہی کی طرح ہے۔\n(6) یعنی پانی اور سونا، چاندی، تانبا، پیتل وغیرۃ یہ چیزیں باقی رہتی ہیں جن سے لوگ فائدہ اٹھاتے اور فیض یاب ہوتے ہیں، اسی طرح حق باقی رہتا ہے جس کے وجود کو بھی زوال نہیں اور جس کا نفع بھی دائمی ہے۔\n(7) یعنی بات کو سمجھانے اور ذہن نشین کرانے کے لئے مثالیں بیان فرماتا ہے، جیسے یہیں دو مثالیں بیان فرمائیں اور اسی طرح سورہ بقرہ کے آغاز میں منافقین کے لئے مثالیں بیان فرمائیں۔ اسی طرح سورہ نور، آیات 39،40 میں کافروں کے لئے دو مثالیں بیان فرمائیں۔ اور احادیث میں بھی نبی (صلى الله عليه وسلم) نے مثالوں کے ذریعے سے لوگوں کو بہت سی باتیں سمجھائیں۔ (تفصیل کے لیے دیکھئے تفسیر ابن کثیر)","lang":"ur","meta":{"transliteration":"anzala mina al-samāi māan fasālat awdiyatun biqadarihā fa-iḥ'tamala al-saylu zabadan rābiyan wamimmā yūqidūna ʿalayhi fī al-nāri ib'tighāa ḥil'yatin aw matāʿin zabadun mith'luhu kadhālika yaḍribu al-lahu al-ḥaqa wal-bāṭila fa-ammā al-zabadu fayadhhabu jufāan wa-ammā mā yanfaʿu al-nāsa fayamkuthu fī al-arḍi kadhālika yaḍribu al-lahu al-amthāla ","translations":["He sends down","from","the sky","water","and flows","the valleys","according to their measure","and carries","the torrent","a foam","rising","And from what","they heat","[on] it","in","the fire","in order to make","ornaments","or","utensils","a foam","like it","Thus","sets forth","Allah","the truth","and the falsehood","Then as for","the foam","it passes away","(as) scum","and as for","what","benefits","the mankind","remains","in","the earth","Thus","Allah sets forth","Allah sets forth","the examples","(17)"],"transliterationArr":["anzala","mina","al-samāi","māan","fasālat","awdiyatun","biqadarihā","fa-iḥ'tamala","al-saylu","zabadan","rābiyan","wamimmā","yūqidūna","ʿalayhi","fī","al-nāri","ib'tighāa","ḥil'yatin","aw","matāʿin","zabadun","mith'luhu","kadhālika","yaḍribu","al-lahu","al-ḥaqa","wal-bāṭila","fa-ammā","al-zabadu","fayadhhabu","jufāan","wa-ammā","mā","yanfaʿu","al-nāsa","fayamkuthu","fī","al-arḍi","kadhālika","yaḍribu","al-lahu","al-amthāla",null],"verseTiming":[[1,0,1770],[2,1770,2100],[3,2100,4760],[4,4760,7380],[5,7380,8510],[6,8510,10170],[7,10170,11440],[8,11440,12420],[9,12420,13370],[10,13370,13980],[11,13980,15970],[12,15970,17480],[13,17480,18730],[14,18730,19710],[15,19710,19960],[16,19960,21320],[17,21320,23580],[18,23580,24690],[19,24690,25020],[20,25020,26560],[21,26560,27190],[22,27190,28690],[23,28690,30250],[24,30250,31110],[25,31110,32000],[26,32000,32930],[27,32930,34210],[28,34210,36000],[29,36000,36930],[30,36930,38100],[31,38100,41460],[32,41460,42980],[33,42980,43470],[34,43470,44930],[35,44930,46370],[36,46370,47550],[37,47550,47810],[38,47810,48630],[39,48630,50040],[40,50040,50880],[41,50880,51820],[42,51820,55415]]}},{"name":"13:18","price":"جن لوگوں نے اپنے رب کے حکم کی بجا آوری کی ان کے لئے بھلائی ہے اور جن لوگوں نے اس کی حکم برداری نہ کی اگر ان کے لئے زمین میں جو کچھ ہے سب کچھ ہو اور اسی کے ساتھ ویسا ہی اور بھی ہو تو وه سب کچھ اپنے بدلے میں دے دیں(1) ۔ یہی ہیں جن کے لئے برا حساب ہے(2) اور جن کا ٹھکانہ جہنم ہے جو بہت بری جگہ ہے.","arabic":"لِلَّذِينَ ٱسۡتَجَابُواْ لِرَبِّهِمُ ٱلۡحُسۡنَىٰۚ وَٱلَّذِينَ لَمۡ يَسۡتَجِيبُواْ لَهُۥ لَوۡ أَنَّ لَهُم مَّا فِي ٱلۡأَرۡضِ جَمِيعٗا وَمِثۡلَهُۥ مَعَهُۥ لَٱفۡتَدَوۡاْ بِهِۦٓۚ أُوْلَٰٓئِكَ لَهُمۡ سُوٓءُ ٱلۡحِسَابِ وَمَأۡوَىٰهُمۡ جَهَنَّمُۖ وَبِئۡسَ ٱلۡمِهَادُ","category":["13 (Ar-Ra'd)","Ar-Ra'd","Surah Ar-Ra'd"],"ayahNumber":1725,"juzNumber":13,"footnotes":"(1) یہ مضمون اس سے قبل بھی دو تین جگہ گزر چکا ہے۔\n(2) کیونکہ ان سے ہر چھوٹے بڑے عمل کا حساب لیا جائے گا اور ان کا معاملہ ”مَنْ نُوقِشَ الحِسَابَ عُذِّبَ“ (جس سے حساب میں جرح کی گئی اس کا بچنا مشکل ہوگا، وہ عذاب سے دو چار ہو کر ہی رہے گا) کا آئینہ دار ہوگا۔ اسی لئے آگے فرمایا اور ان کا ٹھکانا جہنم ہے۔","lang":"ur","meta":{"transliteration":"lilladhīna is'tajābū lirabbihimu al-ḥus'nā wa-alladhīna lam yastajībū lahu law anna lahum mā fī al-arḍi jamīʿan wamith'lahu maʿahu la-if'tadaw bihi ulāika lahum sūu al-ḥisābi wamawāhum jahannamu wabi'sa al-mihādu ","translations":["For those who","responded","to their Lord","(is) the bliss","And for those who","(did) not","respond","to Him","if","that","they had","whatever","(is) in","the earth","all","and like of it","with it","surely they would offer ransom","with it","Those","for them","(is) a terrible","reckoning","and their abode","(is) Hell","and wretched","(is) the resting place","(18)"],"transliterationArr":["lilladhīna","is'tajābū","lirabbihimu","al-ḥus'nā","wa-alladhīna","lam","yastajībū","lahu","law","anna","lahum","mā","fī","al-arḍi","jamīʿan","wamith'lahu","maʿahu","la-if'tadaw","bihi","ulāika","lahum","sūu","al-ḥisābi","wamawāhum","jahannamu","wabi'sa","al-mihādu",null],"verseTiming":[[1,0,1280],[2,1280,2710],[3,2710,4030],[4,4030,5330],[5,5330,6950],[6,6950,7430],[7,7430,8980],[8,8980,9640],[9,9640,10140],[10,10140,11400],[11,11400,11990],[12,11990,12940],[13,12940,13190],[14,13190,14090],[15,14090,15300],[16,15300,16850],[17,16850,17790],[18,17790,18930],[19,18930,19880],[20,19880,22269],[21,22269,22809],[22,22809,24369],[23,24369,25669],[24,25669,27239],[25,27239,29259],[26,29259,31309],[27,31309,33469],[28,33469,34299],[29,34299,38064]]}},{"name":"13:19","price":"کیا وه ایک شخص جو یہ علم رکھتا ہو کہ آپ کی طرف آپ کے رب کی جانب سے جو اتارا گیا ہے وه حق ہے، اس شخص جیسا ہو سکتا ہے جو اندھا ہو(1) نصیحت تو وہی قبول کرتے ہیں جو عقلمند ہوں.(2)","arabic":"۞ أَفَمَن يَعۡلَمُ أَنَّمَآ أُنزِلَ إِلَيۡكَ مِن رَّبِّكَ ٱلۡحَقُّ كَمَنۡ هُوَ أَعۡمَىٰٓۚ إِنَّمَا يَتَذَكَّرُ أُوْلُواْ ٱلۡأَلۡبَٰبِ","category":["13 (Ar-Ra'd)","Ar-Ra'd","Surah Ar-Ra'd"],"ayahNumber":1726,"juzNumber":13,"footnotes":"(1) یعنی ایک وہ شخص جو قرآن کی حقانیت و صداقت پر یقین رکھتا ہو اور دوسرا اندھا ہو یعنی اسے قرآن کی صداقت میں شک ہوگیا یہ دونوں برابر ہو سکتے ہیں؟ استفہام انکار کے لیے ہے یعنی یہ دونوں اسی طرح برابر نہیں ہو سکتے جس طرح جھاگ اور پانی یا سونا تانبا اور اس کی میل کچیل برابر نہیں ہو سکتے۔\n(2) یعنی جن کے پاس قلب سلیم اور عقل صحیح نہ ہو اور جنہوں نے اپنے دلوں کو گناہوں کے زنگ سے آلودہ اور اپنی عقلوں کو خراب کر لیا ہو، وہ اس قرآن سے نصیحت حاصل نہیں کر سکتے۔","lang":"ur","meta":{"transliteration":"afaman yaʿlamu annamā unzila ilayka min rabbika al-ḥaqu kaman huwa aʿmā innamā yatadhakkaru ulū al-albābi ","translations":["Then is (he) who","knows","that which","has been revealed","to you","from","your Lord","(is) the truth","like (one) who","[he]","(is) blind","Only","pay heed","men","(of) understanding","(19)"],"transliterationArr":["afaman","yaʿlamu","annamā","unzila","ilayka","min","rabbika","al-ḥaqu","kaman","huwa","aʿmā","innamā","yatadhakkaru","ulū","al-albābi",null],"verseTiming":[[1,0,1090],[2,1090,2570],[3,2570,6030],[4,6030,7450],[5,7450,8330],[6,8330,8530],[7,8530,9640],[8,9640,10660],[9,10660,11310],[10,11310,11790],[11,11790,12690],[12,12690,15070],[13,15070,16400],[14,16400,16870],[15,16870,19645]]}},{"name":"13:20","price":"جو اللہ کے عہد (وپیمان) کو پورا کرتے ہیں (1) اور قول وقرار کو توڑتے نہیں.(2)","arabic":"ٱلَّذِينَ يُوفُونَ بِعَهۡدِ ٱللَّهِ وَلَا يَنقُضُونَ ٱلۡمِيثَٰقَ","category":["13 (Ar-Ra'd)","Ar-Ra'd","Surah Ar-Ra'd"],"ayahNumber":1727,"juzNumber":13,"footnotes":"(1) یہ اہل دانش کی صفات بیان کی جا رہی ہیں، اللہ کے عہد سے مراد، اس کے احکام (اوامر و نواہی) ہیں جنہیں بجا لاتے ہیں۔ یا وہ عہد ہے، جو عَھْدِ الَسْت کہلاتا ہے، جس کی تفصیل سورہ اعراف میں گزر چکی ہے۔\n(2) اس سے مراد وہ باہمی معاہدے اور وعدے ہیں جو وہ آپس میں ایک دوسرے سے کرتے ہیں یا وہ جو ان کے اور ان کے رب کے درمیان ہیں۔","lang":"ur","meta":{"transliteration":"alladhīna yūfūna biʿahdi al-lahi walā yanquḍūna al-mīthāqa ","translations":["Those who","fulfill","the covenant","(of) Allah","and not","they break","the contract","(20)"],"transliterationArr":["alladhīna","yūfūna","biʿahdi","al-lahi","walā","yanquḍūna","al-mīthāqa",null],"verseTiming":[[1,0,1390],[2,1390,2680],[3,2680,3680],[4,3680,4600],[5,4600,5250],[6,5250,7420],[7,7420,10795]]}},{"name":"13:21","price":"اور اللہ نے جن چیزوں کے جوڑنے کا حکم دیا ہے وه اسے جوڑتے ہیں(1) اور وه اپنے پروردگار سے ڈرتے ہیں اور حساب کی سختی کا اندیشہ رکھتے ہیں.","arabic":"وَٱلَّذِينَ يَصِلُونَ مَآ أَمَرَ ٱللَّهُ بِهِۦٓ أَن يُوصَلَ وَيَخۡشَوۡنَ رَبَّهُمۡ وَيَخَافُونَ سُوٓءَ ٱلۡحِسَابِ","category":["13 (Ar-Ra'd)","Ar-Ra'd","Surah Ar-Ra'd"],"ayahNumber":1728,"juzNumber":13,"footnotes":"(1) یعنی رشتوں اور قرابتوں کو توڑتے نہیں ہیں، بلکہ ان کو جوڑتے اور صلہ رحمی کرتے ہیں۔","lang":"ur","meta":{"transliteration":"wa-alladhīna yaṣilūna mā amara al-lahu bihi an yūṣala wayakhshawna rabbahum wayakhāfūna sūa al-ḥisābi ","translations":["And those who","join","what","(has been) commanded","(by) Allah","[for it]","to","be joined","and fear","their Lord","and are afraid","(of) the evil","the account","(21)"],"transliterationArr":["wa-alladhīna","yaṣilūna","mā","amara","al-lahu","bihi","an","yūṣala","wayakhshawna","rabbahum","wayakhāfūna","sūa","al-ḥisābi",null],"verseTiming":[[1,0,1340],[2,1340,2680],[3,2680,4480],[4,4480,5100],[5,5100,6120],[6,6120,7840],[7,7840,8100],[8,8100,9750],[9,9750,11050],[10,11050,12690],[11,12690,14040],[12,14040,15260],[13,15260,16840],[14,16840,18780],[15,18780,20020],[16,20020,21785]]}},{"name":"13:22","price":"اور وه اپنے رب کی رضا مندی کی طلب کے لئے صبر کرتے ہیں(1) ، اور نمازوں کو برابر قائم رکھتے ہیں (2)اور جو کچھ ہم نے انہیں دے رکھا ہے اسے چھپے کھلے خرچ کرتے ہیں(3) اور برائی کو بھی بھلائی سے ٹالتے ہیں، ان ہی کے لئے عاقبت کا گھر ہے.(4)","arabic":"وَٱلَّذِينَ صَبَرُواْ ٱبۡتِغَآءَ وَجۡهِ رَبِّهِمۡ وَأَقَامُواْ ٱلصَّلَوٰةَ وَأَنفَقُواْ مِمَّا رَزَقۡنَٰهُمۡ سِرّٗا وَعَلَانِيَةٗ وَيَدۡرَءُونَ بِٱلۡحَسَنَةِ ٱلسَّيِّئَةَ أُوْلَٰٓئِكَ لَهُمۡ عُقۡبَى ٱلدَّارِ","category":["13 (Ar-Ra'd)","Ar-Ra'd","Surah Ar-Ra'd"],"ayahNumber":1729,"juzNumber":13,"footnotes":"(1) اللہ کی نافرمانی اور گناہوں سے بچتے ہیں۔ یہ صبر کی ایک قسم ہے۔ تکلیفوں اور آزمائشوں پر صبر کرتے ہیں، یہ دوسری قسم ہے۔ اہل دانش دونوں قسم کا صبر کرتے ہیں۔\n(2) ان کی حدود و مواقیت، خشوع و خضوع اور اعتدال ارکان کے ساتھ۔ نہ کہ اپنے من مانے طریقے سے۔\n(3) یعنی جہاں جہاں اور جب بھی، خرچ کرنے کی ضرورت پیش آتی ہے، اپنوں اور بیگانوں میں اور خفیہ اور اعلانیہ خرچ کرتے ہیں۔\n(4) یعنی ان کے ساتھ کوئی برائی سے پیش آتا ہے تو وہ اس کا جواب اچھائی سے دیتے ہیں، یا عفو و درگزر اور صبر جمیل سے کام لیتے ہیں۔ جس طرح دوسرے مقام پر اللہ تعالٰی نے فرمایا :«اِدْفَعْ بِالَّتِيْ هِىَ اَحْسَنُ فَاِذَا الَّذِيْ بَيْنَكَ وَبَيْنَهٗ عَدَاوَةٌ كَاَنَّهٗ وَلِيٌّ حَمِيْمٌ» (حم السجدۃ:34) ”برائی کا جواب ایسے طریقے سے دو جو اچھا ہو (اگر تم ایسا کرو گے) تو وہ شخص جو تمہارا دشمن ہے، ایسا ہو جائے گا گویا وہ تمہارا گہرا دوست ہے“۔\n(5) یعنی جو اعلٰی اخلاق کے حامل اور مزکورہ خوبیوں سے متصف ہوں گے، ان کے لئے عاقبت کا گھر ہے۔","lang":"ur","meta":{"transliteration":"wa-alladhīna ṣabarū ib'tighāa wajhi rabbihim wa-aqāmū al-ṣalata wa-anfaqū mimmā razaqnāhum sirran waʿalāniyatan wayadraūna bil-ḥasanati al-sayi-ata ulāika lahum ʿuq'bā al-dāri ","translations":["And those who","(are) patient","seeking","(the) Face","(of) their Lord","and establish","the prayer","and spend","from what","We have provided them","secretly","and publicly","and they repel","with the good","the evil ","those","for them","(is) the final attainment","(of) the Home ","(22)"],"transliterationArr":["wa-alladhīna","ṣabarū","ib'tighāa","wajhi","rabbihim","wa-aqāmū","al-ṣalata","wa-anfaqū","mimmā","razaqnāhum","sirran","waʿalāniyatan","wayadraūna","bil-ḥasanati","al-sayi-ata","ulāika","lahum","ʿuq'bā","al-dāri",null],"verseTiming":[[1,0,1400],[2,1400,2140],[3,2140,4610],[4,4610,5180],[5,5180,6400],[6,6400,7480],[7,7480,8710],[8,8710,10990],[9,10990,13490],[10,13490,14950],[11,14950,16510],[12,16510,17360],[13,17360,19810],[14,19810,22070],[15,22070,23450],[16,23450,24850],[17,24850,27000],[18,27000,27670],[19,27670,28370],[20,28370,31195]]}},{"name":"13:23","price":"ہمیشہ رہنے کے باغات(1) جہاں یہ خود جائیں گے اور ان کے باپ دادوں اور بیویوں اور اوﻻدوں میں سے بھی جو نیکو کار ہوں گے(2)، ان کے پاس فرشتے ہر ہر دروازے سے آئیں گے.","arabic":"جَنَّٰتُ عَدۡنٖ يَدۡخُلُونَهَا وَمَن صَلَحَ مِنۡ ءَابَآئِهِمۡ وَأَزۡوَٰجِهِمۡ وَذُرِّيَّٰتِهِمۡۖ وَٱلۡمَلَٰٓئِكَةُ يَدۡخُلُونَ عَلَيۡهِم مِّن كُلِّ بَابٖ","category":["13 (Ar-Ra'd)","Ar-Ra'd","Surah Ar-Ra'd"],"ayahNumber":1730,"juzNumber":13,"footnotes":"(1) عدن کے معنی ہیں اقامت۔ یعنی ہمیشہ رہنے والے باغات۔\n(2) یعنی اس طرح نیک قرابت داروں کو آپس میں جمع کر دے گا تاکہ ایک دوسرے کو دیکھ کر ان کی آنکھیں ٹھنڈی ہوں حتٰی کہ ادنٰی درجے کے جنتی کو اعلٰی درجہ عطا فرما دے گا تاکہ وہ اپنے قرابت دار کے ساتھ جمع ہو جائے۔ فرمایا :\n«وَالَّذِينَ آمَنُوا وَاتَّبَعَتْهُمْ ذُرِّيَّتُهُمْ بِإِيمَانٍ أَلْحَقْنَا بِهِمْ ذُرِّيَّتَهُمْ وَمَا أَلَتْنَاهُمْ مِنْ عَمَلِهِمْ مِنْ شَيْءٍ» (الطور:21) ”اور وہ لوگ جو ایمان لائے اور ان کی اولاد نے ایمان کے ساتھ ان کی پیروی کی تو ہم ملا دیں گے ان کے ساتھ ان کی اولاد کو اور ان کے عملوں سے ہم کچھ گھٹائیں گے نہیں“۔ اس سے جہاں یہ معلوم ہوا کہ نیک رشتے داروں کو اللہ تعالٰی جنت میں جمع فرما دے گا، وہیں یہ بھی معلوم ہوا کہ اگر کسی کے پاس ایمان اور عمل صالح کی پونجی نہیں ہوگی، تو وہ جنت میں نہیں جائے گا، چاہے اس کے دوسرے نہایت قریبی رشتے دار جنت میں چلے گئے ہوں۔ کیونکہ جنت میں داخلہ حسب نسب کی بنیاد پر نہیں، ایمان و عمل کی بنیاد پر ہوگا۔«مَنْ بَطَّأَ بِهِ عَمَلُهُ لَمْ يُسْرِعْ بِهِ نَسَبُهُ»، (صحيح مسلم، كتاب الذكر والدعاء، باب فضل الاجتماع على تلاوة القرآن)۔ جسے اس کا عمل پیچھے چھوڑ گیا اس کا نسب اسے آگے نہیں بڑھائے گا۔","lang":"ur","meta":{"transliteration":"jannātu ʿadnin yadkhulūnahā waman ṣalaḥa min ābāihim wa-azwājihim wadhurriyyātihim wal-malāikatu yadkhulūna ʿalayhim min kulli bābin ","translations":["Gardens","of Eden","they will enter them","and whoever","(were) righteous","among","their fathers","and their spouses","and their offsprings","And the Angels","will enter","upon them","from","every","gate","(23)"],"transliterationArr":["jannātu","ʿadnin","yadkhulūnahā","waman","ṣalaḥa","min","ābāihim","wa-azwājihim","wadhurriyyātihim","wal-malāikatu","yadkhulūna","ʿalayhim","min","kulli","bābin",null],"verseTiming":[[1,0,1880],[2,1880,3510],[3,3510,5370],[4,5370,6690],[5,6690,7510],[6,7510,7960],[7,7960,10750],[8,10750,12660],[9,12660,15120],[10,15120,18610],[11,18610,19980],[12,19980,20980],[13,20980,22050],[14,22050,23110],[15,23110,23760],[16,23760,26085]]}},{"name":"13:24","price":"کہیں گے کہ تم پر سلامتی ہو، صبر کے بدلے، کیا ہی اچھا (بدلہ) ہے اس دار آخرت کا.","arabic":"سَلَٰمٌ عَلَيۡكُم بِمَا صَبَرۡتُمۡۚ فَنِعۡمَ عُقۡبَى ٱلدَّارِ","category":["13 (Ar-Ra'd)","Ar-Ra'd","Surah Ar-Ra'd"],"ayahNumber":1731,"juzNumber":13,"footnotes":"","lang":"ur","meta":{"transliteration":"salāmun ʿalaykum bimā ṣabartum faniʿ'ma ʿuq'bā al-dāri ","translations":["(Saying), \"Peace","(be) upon you","for what","you patiently endured","And excellent","(is) the final attainment","(of) the Home","(24)"],"transliterationArr":["salāmun","ʿalaykum","bimā","ṣabartum","faniʿ'ma","ʿuq'bā","al-dāri",null],"verseTiming":[[1,0,1130],[2,1130,3270],[3,3270,3890],[4,3890,5190],[5,5190,6110],[6,6110,6780],[7,6780,7310],[8,7310,8490],[9,8490,9525]]}},{"name":"13:25","price":"اور جو اللہ کے عہد کو اس کی مضبوطی کے بعد توڑ دیتے ہیں اور جن چیزوں کےجوڑنے کا اللہ نے حکم دیا ہے انہیں توڑتے ہیں اور زمین میں فساد پھیلاتے ہیں، ان کے لئے لعنتیں ہیں اور ان کے لئے برا گھر ہے.(1)","arabic":"وَٱلَّذِينَ يَنقُضُونَ عَهۡدَ ٱللَّهِ مِنۢ بَعۡدِ مِيثَٰقِهِۦ وَيَقۡطَعُونَ مَآ أَمَرَ ٱللَّهُ بِهِۦٓ أَن يُوصَلَ وَيُفۡسِدُونَ فِي ٱلۡأَرۡضِ أُوْلَٰٓئِكَ لَهُمُ ٱللَّعۡنَةُ وَلَهُمۡ سُوٓءُ ٱلدَّارِ","category":["13 (Ar-Ra'd)","Ar-Ra'd","Surah Ar-Ra'd"],"ayahNumber":1732,"juzNumber":13,"footnotes":"(1) یہ نیکوں کے ساتھ بروں کا حشر بیان فرما دیا تاکہ انسان اس حشر سے بچنے کی کوشش کرے۔","lang":"ur","meta":{"transliteration":"wa-alladhīna yanquḍūna ʿahda al-lahi min baʿdi mīthāqihi wayaqṭaʿūna mā amara al-lahu bihi an yūṣala wayuf'sidūna fī al-arḍi ulāika lahumu al-laʿnatu walahum sūu al-dāri ","translations":["And those who","break","the covenant","(of) Allah","from","after","contracting it","and sever","what","(has been) commanded","(by) Allah","for it","to","be joined","and spread corruption","in","the earth","Those ","for them","(is) the curse","and for them","(is) an evil","home","(25)"],"transliterationArr":["wa-alladhīna","yanquḍūna","ʿahda","al-lahi","min","baʿdi","mīthāqihi","wayaqṭaʿūna","mā","amara","al-lahu","bihi","an","yūṣala","wayuf'sidūna","fī","al-arḍi","ulāika","lahumu","al-laʿnatu","walahum","sūu","al-dāri",null],"verseTiming":[[1,0,1360],[2,1360,3200],[3,3200,3990],[4,3990,4970],[5,4970,5870],[6,5870,6640],[7,6640,8270],[8,8270,13480],[9,13480,15070],[10,15070,15700],[11,15700,16710],[12,16710,18560],[13,18560,19520],[14,19520,20480],[15,20480,22040],[16,22040,22370],[17,22370,23360],[18,23360,29140],[19,29140,29740],[20,29740,31120],[21,31120,31900],[22,31900,34179],[23,34179,37264]]}},{"name":"13:26","price":"اللہ تعالیٰ جس کی روزی چاہتا ہے بڑھاتا ہے اور گھٹاتا ہے(1) یہ تو دنیا کی زندگی میں مست ہو گئے(2)۔ حاﻻنکہ دنیا آخرت کے مقابلے میں نہایت (حقیر) پونجی ہے.(3)","arabic":"ٱللَّهُ يَبۡسُطُ ٱلرِّزۡقَ لِمَن يَشَآءُ وَيَقۡدِرُۚ وَفَرِحُواْ بِٱلۡحَيَوٰةِ ٱلدُّنۡيَا وَمَا ٱلۡحَيَوٰةُ ٱلدُّنۡيَا فِي ٱلۡأٓخِرَةِ إِلَّا مَتَٰعٞ","category":["13 (Ar-Ra'd)","Ar-Ra'd","Surah Ar-Ra'd"],"ayahNumber":1733,"juzNumber":13,"footnotes":"(1) جب کافروں اور مشرکوں کے لئے یہ کہا کہ ان کے لئے برا گھر ہے، تو ذہن میں یہ اشکال آ سکتا ہے کہ دنیا میں تو انہیں ہر طرح کی آسائشیں اور سہولتیں مہیا ہیں۔ اس کے ازالے کے لئے فرمایا کہ دنیاوی اسباب اور رزق کی کمی بیشی یہ اللہ کے اختیار میں ہے وہ اپنی حکمت و مشیت، جس کو صرف وہی جانتا ہے، کے مطابق کسی کو زیادہ دیتا ہے کسی کو کم رزق کی فروانی، اس بات کی دلیل؛ نہیں کہ اللہ تعالٰی اس سے خوش ہے اور کمی کا مطلب یہ نہیں کہ اللہ تعالٰی اس پر ناراض ہے۔\n(2) کسی کو اگر دنیا کا مال زیادہ مل رہا ہے، باوجودیکہ وہ اللہ کا نافرمان ہے تو یہ مقام فرحت و مسرت نہیں، کیونکہ یہ استدراج ہے، مہلت ہے پتہ نہیں کب یہ مہلت ختم ہو جائے اور اللہ کی پکڑ کے شکنجے میں آجائے۔\n(3) حدیث میں آتا ہے کہ دنیا کی حیثیت، آخرت کے مقابلے میں اس طرح ہے جیسے کوئی شخص اپنی انگلی سمندر میں ڈال کر نکالے، تو دیکھے سمندر کے پانی کے مقابلے میں اس کی انگلی میں کتنا پانی آیا ہے؟ (صحيح مسلم، كتاب الجنة ، باب فناء الدنيا وبيان الحسر يوم القيامة) ایک دوسری حدیث میں ہے کہ رسول اللہ (صلى الله عليه وسلم) کا گزر بکری کے ایک مردہ بچے کے پاس سے ہوا، تو اسے دیکھ کر آپ نے فرمایا، اللہ کی قسم دنیا، اللہ کے نزدیک اس سے بھی زیادہ حقیر ہے جتنا یہ مردہ، اپنے مالکوں کے نزدیک اس وقت حقیر تھا جب انہوں نے اسے پھینکا (صحيح مسلم، كتاب الزهد والرقاق)","lang":"ur","meta":{"transliteration":"al-lahu yabsuṭu al-riz'qa liman yashāu wayaqdiru wafariḥū bil-ḥayati al-dun'yā wamā al-ḥayatu al-dun'yā fī al-ākhirati illā matāʿun ","translations":["Allah","extends","the provision","for whom","He wills","and restricts","And they rejoice","in the life","(of) the world","and nothing","(is) the life","of the world","in (comparison to)","the Hereafter","except","an enjoyment","(26)"],"transliterationArr":["al-lahu","yabsuṭu","al-riz'qa","liman","yashāu","wayaqdiru","wafariḥū","bil-ḥayati","al-dun'yā","wamā","al-ḥayatu","al-dun'yā","fī","al-ākhirati","illā","matāʿun",null],"verseTiming":[[1,0,1250],[2,1250,2170],[3,2170,3100],[4,3100,3590],[5,3590,6810],[6,6810,8350],[7,8350,9470],[8,9470,10920],[9,10920,12140],[10,12140,12630],[11,12630,13800],[12,13800,14800],[13,14800,15320],[14,15320,16860],[15,16860,17700],[16,17700,20475]]}},{"name":"13:27","price":"کافر کہتے ہیں کہ اس پر کوئی نشانی (معجزه) کیوں نازل نہیں کیا گیا؟ جواب دے دیجئے کہ جسے اللہ گمراه کرنا چاہے کر دیتا ہے اور جو اس کی طرف جھکے اسے راستہ دکھا دیتا ہے.","arabic":"وَيَقُولُ ٱلَّذِينَ كَفَرُواْ لَوۡلَآ أُنزِلَ عَلَيۡهِ ءَايَةٞ مِّن رَّبِّهِۦۚ قُلۡ إِنَّ ٱللَّهَ يُضِلُّ مَن يَشَآءُ وَيَهۡدِيٓ إِلَيۡهِ مَنۡ أَنَابَ","category":["13 (Ar-Ra'd)","Ar-Ra'd","Surah Ar-Ra'd"],"ayahNumber":1734,"juzNumber":13,"footnotes":"","lang":"ur","meta":{"transliteration":"wayaqūlu alladhīna kafarū lawlā unzila ʿalayhi āyatun min rabbihi qul inna al-laha yuḍillu man yashāu wayahdī ilayhi man anāba ","translations":["And say","those who","disbelieved","Why has not","been sent down","upon him","a Sign","from","his Lord","Say","Indeed","Allah","lets go astray","whom","He wills","and guides","to Himself","whoever","turns back","(27)"],"transliterationArr":["wayaqūlu","alladhīna","kafarū","lawlā","unzila","ʿalayhi","āyatun","min","rabbihi","qul","inna","al-laha","yuḍillu","man","yashāu","wayahdī","ilayhi","man","anāba",null],"verseTiming":[[1,0,1140],[2,1140,2220],[3,2220,3270],[4,3270,5690],[5,5690,7060],[6,7060,7970],[7,7970,9170],[8,9170,9740],[9,9740,11600],[10,11600,11980],[11,11980,13060],[12,13060,14120],[13,14120,14970],[14,14970,15980],[15,15980,18500],[16,18500,20910],[17,20910,21890],[18,21890,25190],[19,25190,25875]]}},{"name":"13:28","price":"جو لوگ ایمان ﻻئے ان کے دل اللہ کے ذکر سے اطمینان حاصل کرتے ہیں۔ یاد رکھو اللہ کے ذکر سے ہی دلوں کو تسلی حاصل ہوتی ہے.(1)","arabic":"ٱلَّذِينَ ءَامَنُواْ وَتَطۡمَئِنُّ قُلُوبُهُم بِذِكۡرِ ٱللَّهِۗ أَلَا بِذِكۡرِ ٱللَّهِ تَطۡمَئِنُّ ٱلۡقُلُوبُ","category":["13 (Ar-Ra'd)","Ar-Ra'd","Surah Ar-Ra'd"],"ayahNumber":1735,"juzNumber":13,"footnotes":"(1) اللہ کا ذکر سے مراد، اس کی توحید کا بیان ہے، جس سے مشرکوں کے دلوں میں وسوسہ پیدا ہو جاتا ہے، یا اس کی عبادت، تلاوت قرآن، نوافل اور دعا و مناجات ہے جو اہل ایمان کے دلوں کی خوراک ہے یا اس کے احکام و فرامین کی اطاعت و بجا آوری ہے، جس کے بغیر اہل ایمان و تقویٰ بےقرار رہتے ہیں۔","lang":"ur","meta":{"transliteration":"alladhīna āmanū wataṭma-innu qulūbuhum bidhik'ri al-lahi alā bidhik'ri al-lahi taṭma-innu al-qulūbu ","translations":["Those who","believed","and find satisfaction","their hearts","in the remembrance","(of) Allah","No doubt","in the remembrance","(of) Allah","find satisfaction","the hearts","(28)"],"transliterationArr":["alladhīna","āmanū","wataṭma-innu","qulūbuhum","bidhik'ri","al-lahi","alā","bidhik'ri","al-lahi","taṭma-innu","al-qulūbu",null],"verseTiming":[[1,0,1360],[2,1360,2720],[3,2720,4740],[4,4740,6740],[5,6740,7560],[6,7560,8360],[7,8360,10060],[8,10060,10920],[9,10920,11570],[10,11570,12530],[11,12530,13470],[12,13470,15550],[13,15550,17975]]}},{"name":"13:29","price":"جو لوگ ایمان ﻻئے اور جنہوں نے نیک کام بھی کئے ان کے لئے خوشحالی ہے(1) اور بہترین ٹھکانا.","arabic":"ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ طُوبَىٰ لَهُمۡ وَحُسۡنُ مَـَٔابٖ","category":["13 (Ar-Ra'd)","Ar-Ra'd","Surah Ar-Ra'd"],"ayahNumber":1736,"juzNumber":13,"footnotes":"(1) طُوْبٰی کے مختلف معانی بیان کئے گئے ہیں مثلاً خیر، حسنٰی، کرامت، رشک، جنت میں مخصوص درخت یا مخصوص مقام وغیرہ مفہوم سب کا ایک ہی ہے یعنی جنت میں اچھا مقام اور اس کی نعمتیں اور لذتیں۔","lang":"ur","meta":{"transliteration":"alladhīna āmanū waʿamilū al-ṣāliḥāti ṭūbā lahum waḥus'nu maābin ","translations":["Those who","believed","and did","righteous deeds","blessedness","(is) for them","and a beautiful","place of return","(29)"],"transliterationArr":["alladhīna","āmanū","waʿamilū","al-ṣāliḥāti","ṭūbā","lahum","waḥus'nu","maābin",null],"verseTiming":[[1,0,1330],[2,1330,2700],[3,2700,3490],[4,3490,5110],[5,5110,6140],[6,6140,6880],[7,6880,7740],[8,7740,10625]]}},{"name":"13:30","price":"اسی طرح ہم نے آپ کو اس امت میں بھیجا ہے(1) جس سے پہلے بہت سی امتیں گزر چکی ہیں کہ آپ انہیں ہماری طرف سے جو وحی آپ پر اتری ہے پڑھ کر سنایئے یہ اللہ رحمٰن کے منکر ہیں(2)، آپ کہہ دیجئے کہ میرا پالنے واﻻ تو وہی ہے اس کے سوا درحقیقت کوئی بھی ﻻئق عبادت نہیں(3)، اسی کے اوپر میرا بھروسہ ہے اور اسی کی جانب میرا رجوع ہے.","arabic":"كَذَٰلِكَ أَرۡسَلۡنَٰكَ فِيٓ أُمَّةٖ قَدۡ خَلَتۡ مِن قَبۡلِهَآ أُمَمٞ لِّتَتۡلُوَاْ عَلَيۡهِمُ ٱلَّذِيٓ أَوۡحَيۡنَآ إِلَيۡكَ وَهُمۡ يَكۡفُرُونَ بِٱلرَّحۡمَٰنِۚ قُلۡ هُوَ رَبِّي لَآ إِلَٰهَ إِلَّا هُوَ عَلَيۡهِ تَوَكَّلۡتُ وَإِلَيۡهِ مَتَابِ","category":["13 (Ar-Ra'd)","Ar-Ra'd","Surah Ar-Ra'd"],"ayahNumber":1737,"juzNumber":13,"footnotes":"(1) جس طرح ہم نے آپ کو تبلیغ رسالت کے لئے بھیجا ہے، اسی طرح آپ سے پہلی امتوں میں بھی رسول بھیجے تھے، ان کی بھی اسی طرح تکذیب کی گئی جس طرح آپ کی کی گئی اور جس طرح تکذیب کے نتیجے میں وہ قومیں عذاب الٰہی سے دو چار ہوئیں، انہیں بھی اس انجام سے بےفکر نہیں رہنا چاہیے۔\n(2) مشرکین مکہ رحمٰن کے لفظ سے بڑا بدکتے تھے، صلح حدیبیہ کے موقع پر بھی جب بسم اللہ الرحمٰن الرحیم کے الفاظ لکھے گئے تو انہوں نے کہا یہ رحمٰن رحیم کیا ہے؟ ہم نہیں جانتے۔ (ابن کثیر)\n(3) یعنی رحمٰن، میرا وہ رب ہے جس کے سوا کوئی معبود نہیں۔","lang":"ur","meta":{"transliteration":"kadhālika arsalnāka fī ummatin qad khalat min qablihā umamun litatluwā ʿalayhimu alladhī awḥaynā ilayka wahum yakfurūna bil-raḥmāni qul huwa rabbī lā ilāha illā huwa ʿalayhi tawakkaltu wa-ilayhi matābi ","translations":["Thus","We have sent you","to","a nation","verily","have passed away","from","before it","nations","so that you might recite","to them","what","We revealed","to you","while they","disbelieve","in the Most Gracious","Say","He","(is) my Lord","(there is) no","god","except","Him","Upon Him","I put my trust","and to Him","(is) my return","(30)"],"transliterationArr":["kadhālika","arsalnāka","fī","ummatin","qad","khalat","min","qablihā","umamun","litatluwā","ʿalayhimu","alladhī","awḥaynā","ilayka","wahum","yakfurūna","bil-raḥmāni","qul","huwa","rabbī","lā","ilāha","illā","huwa","ʿalayhi","tawakkaltu","wa-ilayhi","matābi",null],"verseTiming":[[1,0,1170],[2,1170,2770],[3,2770,4040],[4,4040,6950],[5,6950,7250],[6,7250,8000],[7,8000,9000],[8,9000,11650],[9,11650,12210],[10,12210,13200],[11,13200,13960],[12,13960,14850],[13,14850,17510],[14,17510,18230],[15,18230,19440],[16,19440,20620],[17,20620,22640],[18,22640,25359],[19,25359,27869],[20,27869,29089],[21,29089,30269],[22,30269,32309],[23,32309,34739],[24,34739,35679],[25,35679,36269],[26,36269,37719],[27,37719,41039],[28,41039,41429],[29,41429,41809],[30,41809,42819],[31,42819,44409],[32,44409,45289],[33,45289,45909],[34,45909,46679],[35,46679,47659],[36,47659,49179],[37,49179,50299],[38,50299,51524]]}},{"name":"13:31","price":"اگر (بالفرض) کسی قرآن (آسمانی کتاب) کے ذریعے پہاڑ چلا دیئے جاتے یا زمین ٹکڑے ٹکڑے کر دی جاتی یا مردوں سے باتیں کرا دی جاتیں (پھر بھی وه ایمان نہ ﻻتے)، بات یہ ہے کہ سب کام اللہ کے ہاتھ میں ہے(1) ، تو کیا ایمان والوں کو اس بات پر دل جمعی نہیں کہ اگر اللہ تعالیٰ چاہے تو تمام لوگوں کو ہدایت دے دے۔ کفار کو تو ان کے کفر کے بدلے ہمیشہ ہی کوئی نہ کوئی سخت سزا پہنچتی رہے گی یا ان کے مکانوں کے قریب نازل ہوتی رہے گی(2) تاوقتیکہ وعدہٴ الٰہی آپہنچے(3)۔ یقیناً اللہ تعالیٰ وعده خلافی نہیں کرتا.","arabic":"وَلَوۡ أَنَّ قُرۡءَانٗا سُيِّرَتۡ بِهِ ٱلۡجِبَالُ أَوۡ قُطِّعَتۡ بِهِ ٱلۡأَرۡضُ أَوۡ كُلِّمَ بِهِ ٱلۡمَوۡتَىٰۗ بَل لِّلَّهِ ٱلۡأَمۡرُ جَمِيعًاۗ أَفَلَمۡ يَاْيۡـَٔسِ ٱلَّذِينَ ءَامَنُوٓاْ أَن لَّوۡ يَشَآءُ ٱللَّهُ لَهَدَى ٱلنَّاسَ جَمِيعٗاۗ وَلَا يَزَالُ ٱلَّذِينَ كَفَرُواْ تُصِيبُهُم بِمَا صَنَعُواْ قَارِعَةٌ أَوۡ تَحُلُّ قَرِيبٗا مِّن دَارِهِمۡ حَتَّىٰ يَأۡتِيَ وَعۡدُ ٱللَّهِۚ إِنَّ ٱللَّهَ لَا يُخۡلِفُ ٱلۡمِيعَادَ","category":["13 (Ar-Ra'd)","Ar-Ra'd","Surah Ar-Ra'd"],"ayahNumber":1738,"juzNumber":13,"footnotes":"(1) امام ابن کثیر فرماتے ہیں کہ ہر آسمانی کتاب کو قرآن کہا جاتا ہے، جس طرح ایک حدیث میں آتا ہے کہ \"حضرت داؤد علیہ السلام، جانور کو تیار کرنے کا حکم دیتے اور اتنی دیر میں ایک مرتبہ قرآن کا ورد کر لیتے \"۔ (صحيح بخاري كتاب الأنبياء، باب قول الله تعالى: وآتينا داود زبورا) یہاں ظاہر بات ہے قرآن سے مراد زبور ہے۔ مطلب آیت کا یہ ہے کہ اگر پہلے کوئی آسمانی کتاب ایسی نازل ہوئی ہوتی کہ جسے سن کر پہاڑ رواں دواں ہو جاتے یا زمین کی مسافت طے ہو جاتی یا مردے بول اٹھتے تو قرآن کریم کے اندر یہ خصوصیت بدرجہ اولیٰ موجود ہوتی، کیونکہ یہ اعجاز و بلاغت میں پچھلی کتابوں سے فائق ہے۔ اور بعض نے اس کا مطلب یہ بیان کیا ہے کہ اگر اس قرآن کے ذریعے سے معجزات ظاہر ہوتے، تب بھی کفار ایمان نہ لاتے، کیونکہ ایمان لانا نہ لانا یہ اللہ کی مشیت پر موقوف ہے، معجزوں پر نہیں۔ اسی لئے فرمایا، سب کام اللہ کے ہاتھ میں ہیں۔\n(2) جو ان کے مشاہدے یا علم میں ضرور آئے گا تاکہ وہ عبرت پکڑ سکیں۔\n(3) یعنی قیامت واقعہ ہو جائے، یا اہل اسلام کو قطعی فتح و غلبہ حاصل ہو جائے۔","lang":"ur","meta":{"transliteration":"walaw anna qur'ānan suyyirat bihi al-jibālu aw quṭṭiʿat bihi al-arḍu aw kullima bihi al-mawtā bal lillahi al-amru jamīʿan afalam yāy'asi alladhīna āmanū an law yashāu al-lahu lahadā al-nāsa jamīʿan walā yazālu alladhīna kafarū tuṣībuhum bimā ṣanaʿū qāriʿatun aw taḥullu qarīban min dārihim ḥattā yatiya waʿdu al-lahi inna al-laha lā yukh'lifu al-mīʿāda ","translations":["And if","that was","any Quran","could be moved","by it","the mountains","or","could be cloven asunder","by it","the earth","or","could be made to speak","by it","the dead","Nay","with Allah","(is) the command","all","Then do not","know","those who","believe","that","if","had willed","Allah","surely, He would have guided","all","all of the mankind","And not","will cease","those who","disbelieve","to strike them","for what","they did","a disaster","or","it settles","close","from","their homes","until","comes","(the) promise","(of) Allah","Indeed","Allah","(will) not","fail","(in) the Promise","(31)"],"transliterationArr":["walaw","anna","qur'ānan","suyyirat","bihi","al-jibālu","aw","quṭṭiʿat","bihi","al-arḍu","aw","kullima","bihi","al-mawtā","bal","lillahi","al-amru","jamīʿan","afalam","yāy'asi","alladhīna","āmanū","an","law","yashāu","al-lahu","lahadā","al-nāsa","jamīʿan","walā","yazālu","alladhīna","kafarū","tuṣībuhum","bimā","ṣanaʿū","qāriʿatun","aw","taḥullu","qarīban","min","dārihim","ḥattā","yatiya","waʿdu","al-lahi","inna","al-laha","lā","yukh'lifu","al-mīʿāda",null],"verseTiming":[[1,0,800],[2,800,2250],[3,2250,3970],[4,3970,5330],[5,5330,5850],[6,5850,7100],[7,7100,7560],[8,7560,8710],[9,8710,9190],[10,9190,10090],[11,10090,10540],[12,10540,11500],[13,11500,12020],[14,12020,13360],[15,13360,14120],[16,14120,15480],[17,15480,16410],[18,16410,18200],[19,18200,19060],[20,19060,20050],[21,20050,21210],[22,21210,23290],[23,23290,23440],[24,23440,24140],[25,24140,26310],[26,26310,27310],[27,27310,27880],[28,27880,29400],[29,29400,31070],[30,31070,31820],[31,31820,32750],[32,32750,33970],[33,33970,34850],[34,34850,36930],[35,36930,37460],[36,37460,38520],[37,38520,39930],[38,39930,40370],[39,40370,41330],[40,41330,42350],[41,42350,44060],[42,44060,45240],[43,45240,46170],[44,46170,47220],[45,47220,48170],[46,48170,50320],[47,50320,51380],[48,51380,52360],[49,52360,53370],[50,53370,53980],[51,53980,56870],[52,56870,57910],[53,57910,58960],[54,58960,59480],[55,59480,60370],[56,60370,63175]]}},{"name":"13:32","price":"یقیناً آپ سے پہلے کے پیغمبروں کا مذاق اڑایا گیا تھا اور میں نے بھی کافروں کو ڈھیل دی تھی پھر انہیں پکڑ لیا تھا، پس میرا عذاب کیسا رہا؟(1)","arabic":"وَلَقَدِ ٱسۡتُهۡزِئَ بِرُسُلٖ مِّن قَبۡلِكَ فَأَمۡلَيۡتُ لِلَّذِينَ كَفَرُواْ ثُمَّ أَخَذۡتُهُمۡۖ فَكَيۡفَ كَانَ عِقَابِ","category":["13 (Ar-Ra'd)","Ar-Ra'd","Surah Ar-Ra'd"],"ayahNumber":1739,"juzNumber":13,"footnotes":"(1) حدیث میں آتا ہے «إِنَّ اللهَ لَيُمْلِي لِلظَّالِمِ حَتَّى إِذَا أَخَذَهُ لَمْ يُفْلِتْهُ»، ”اللہ ظالم کو مہلت دیئے جاتا ہے حتٰی کہ جب اسے پکڑتا ہے تو پھر چھوڑتا نہیں“۔اس کے بعد نبی (صلى الله عليه وسلم) نے یہ آیت تلاوت فرمائی: «وَكَذَلِكَ أَخْذُ رَبِّكَ إِذَا أَخَذَ الْقُرَى وَهِيَ ظَالِمَةٌ إِنَّ أَخْذَهُ أَلِيمٌ شَدِيدٌ» (سورۂ ھود:102) ”اسی طرح تیرے رب کی پکڑ ہے جب وہ ظلم کی مرتکب بستیوں کو پکڑتا ہے۔ یقینا اس کی پکڑ بہت ہی الم ناک اور سخت ہے“۔ (صحيح بخاري تفسير سورة هود ومسلم، كتاب البر، باب تحريم الظلم)۔","lang":"ur","meta":{"transliteration":"walaqadi us'tuh'zi-a birusulin min qablika fa-amlaytu lilladhīna kafarū thumma akhadhtuhum fakayfa kāna ʿiqābi ","translations":["And certainly","were mocked","Messengers","from","before you","but I granted respite","to those who","disbelieved","then","I seized them","and how","was","My penalty","(32)"],"transliterationArr":["walaqadi","us'tuh'zi-a","birusulin","min","qablika","fa-amlaytu","lilladhīna","kafarū","thumma","akhadhtuhum","fakayfa","kāna","ʿiqābi",null],"verseTiming":[[1,0,980],[2,980,2120],[3,2120,3010],[4,3010,4930],[5,4930,5790],[6,5790,7110],[7,7110,8570],[8,8570,9370],[9,9370,10680],[10,10680,12660],[11,12660,13840],[12,13840,15200],[13,15200,16230],[14,16230,16890],[15,16890,19045]]}},{"name":"13:33","price":"آیا وه اللہ جو نگہبانی کرنے واﻻ ہے ہر شخص کی، اس کے کئے ہوئے اعمال پر(1) ، ان لوگوں نے اللہ کے شریک ٹھہرائے ہیں کہہ دیجئے ذرا ان کے نام تو لو(2)، کیا تم اللہ کو وه باتیں بتاتے ہو جو وه زمین میں جانتا ہی نہیں، یا صرف اوپری اوپری باتیں بتا رہے(3) ہو، بات اصل یہ ہے کہ کفر کرنے والوں کے لئے ان کے مکر سجا دیئے گئے ہیں(4)، اور وه صحیح راه سے روک دیئے گئے ہیں، اور جس کو اللہ گمراه کر دے اس کو راه دکھانے واﻻ کوئی نہیں.(5)","arabic":"أَفَمَنۡ هُوَ قَآئِمٌ عَلَىٰ كُلِّ نَفۡسِۭ بِمَا كَسَبَتۡۗ وَجَعَلُواْ لِلَّهِ شُرَكَآءَ قُلۡ سَمُّوهُمۡۚ أَمۡ تُنَبِّـُٔونَهُۥ بِمَا لَا يَعۡلَمُ فِي ٱلۡأَرۡضِ أَم بِظَٰهِرٖ مِّنَ ٱلۡقَوۡلِۗ بَلۡ زُيِّنَ لِلَّذِينَ كَفَرُواْ مَكۡرُهُمۡ وَصُدُّواْ عَنِ ٱلسَّبِيلِۗ وَمَن يُضۡلِلِ ٱللَّهُ فَمَا لَهُۥ مِنۡ هَادٖ","category":["13 (Ar-Ra'd)","Ar-Ra'd","Surah Ar-Ra'd"],"ayahNumber":1740,"juzNumber":13,"footnotes":"(1) یہاں اس کا جواب محذوف ہے یعنی کیا رب العزت اور وہ معبودان باطل برابر ہو سکتے ہیں جن کی یہ عبادت کرتے ہیں، جو کسی کو نفع پہنچانے پرقادر ہیں نہ نقصان پہنچانے پر، نہ وہ دیکھتے ہیں اور نہ عقل وشعور سے بہرہ ور ہیں۔\n(2) یعنی ہمیں بھی تو بتاؤ تاکہ انہیں پہچان سکیں اس لئے کہ ان کی کوئی حقیقت ہی نہیں ہے۔ اس لئے آگے فرمایا، کیا تم اللہ کو وہ باتیں بتاتے ہو جو وہ زمین میں جانتا ہی نہیں، یعنی ان کا وجود ہی نہیں۔ اس لئے کہ اگر زمین میں ان کا وجود ہوتا تو اللہ تعالٰی کے علم میں ضرور ہوتا، اس پر تو کوئی چیز مخفی نہیں ہے۔\n(3) یہاں ظاہر ظن کے معنی میں ہے یعنی یا یہ صرف ان کی ظنی باتیں ہیں، مطلب یہ ہے کہ تم ان بتوں کی عبادت اس گمان پر کرتے ہو کہ یہ نفع نقصان پہنچا سکتے ہیں اور تم ان کے نام بھی معبود رکھے ہوئے ہیں، حالانکہ، \"یہ تمہارے اور تمہارے باپوں کے رکھے ہوئے نام ہیں، جن کی کوئی دلیل اللہ نے نہیں اتاری۔ یہ صرف گمان اور خواہش نفس کی پیروی کرتے ہیں\"۔ (النجم۔23)\n(4) مکر سے مراد، ان کے وہ غلط عقائد و اعمال ہیں جن میں شیطان نے ان کو پھنسا رکھا ہے، شیطان نے گمراہیوں پر بھی حسین غلاف چڑھا رکھے ہیں۔\n(5) جس طرح دوسرے مقام پر فرمایا، «وَمَنْ يُرِدِ اللَّهُ فِتْنَتَهُ فَلَنْ تَمْلِكَ لَهُ مِنَ اللَّهِ شَيْئًا»(المائدہ:41)۔ ”جس کو اللہ گمراہ کرنے کا ارادہ کر لے تو اللہ اس کے لئے کچھ اختیار نہیں رکھتا“، اور فرمایا۔ «اِنْ تَحْرِصْ عَلٰي هُدٰىهُمْ فَاِنَّ اللّٰهَ لَا يَهْدِيْ مَنْ يُّضِلُّ وَمَا لَهُمْ مِّنْ نّٰصِرِيْنَ» ( النحل:37)۔ ”اگر تم ان کی ہدایت کی خواہش رکھتے ہو تو (یاد رکھو) اللہ تعالٰی اسے ہدایت نہیں دیتا جسے وہ گمراہ کرتا ہے اور ان کا کوئی مددگار نہیں ہوگا“۔","lang":"ur","meta":{"transliteration":"afaman huwa qāimun ʿalā kulli nafsin bimā kasabat wajaʿalū lillahi shurakāa qul sammūhum am tunabbiūnahu bimā lā yaʿlamu fī al-arḍi am biẓāhirin mina al-qawli bal zuyyina lilladhīna kafarū makruhum waṣuddū ʿani al-sabīli waman yuḍ'lili al-lahu famā lahu min hādin ","translations":["Is then He Who","(He)","(is) a Maintainer","of","every","soul","for what","it has earned","Yet they ascribe","to Allah","partners","Say","Name them","Or","(do) you inform Him","of what","not","He knows","in","the earth","or","of the apparent","of","the words","Nay","(is) made fair-seeming","to those who","disbelieve","their plotting","and they are hindered","from","the Path","And whoever","(by) Allah","Allah lets go astray","then not","for him","any","guide","(33)"],"transliterationArr":["afaman","huwa","qāimun","ʿalā","kulli","nafsin","bimā","kasabat","wajaʿalū","lillahi","shurakāa","qul","sammūhum","am","tunabbiūnahu","bimā","lā","yaʿlamu","fī","al-arḍi","am","biẓāhirin","mina","al-qawli","bal","zuyyina","lilladhīna","kafarū","makruhum","waṣuddū","ʿani","al-sabīli","waman","yuḍ'lili","al-lahu","famā","lahu","min","hādin",null],"verseTiming":[[1,0,930],[2,930,1470],[3,1470,4289],[4,4289,5049],[5,5049,5869],[6,5869,7259],[7,7259,7999],[8,7999,9369],[9,9369,10589],[10,10589,11709],[11,11709,13849],[12,13849,14259],[13,14259,16789],[14,16789,17169],[15,17169,19429],[16,19429,20159],[17,20159,20649],[18,20649,21579],[19,21579,21839],[20,21839,22749],[21,22749,22979],[22,22979,24689],[23,24689,25939],[24,25939,27929],[25,27929,28909],[26,28909,29819],[27,29819,31169],[28,31169,32139],[29,32139,33339],[30,33339,34489],[31,34489,34889],[32,34889,37609],[33,37609,38079],[34,38079,38939],[35,38939,39879],[36,39879,40699],[37,40699,41399],[38,41399,42059],[39,42059,42619],[40,42619,44874]]}},{"name":"13:34","price":"ان کے لئے دنیا کی زندگی میں بھی عذاب ہے(1) ، اور آخرت کا عذاب تو بہت ہی زیاده سخت ہے(2)، انہیں اللہ کے غضب سے بچانے واﻻ کوئی بھی نہیں.","arabic":"لَّهُمۡ عَذَابٞ فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَاۖ وَلَعَذَابُ ٱلۡأٓخِرَةِ أَشَقُّۖ وَمَا لَهُم مِّنَ ٱللَّهِ مِن وَاقٖ","category":["13 (Ar-Ra'd)","Ar-Ra'd","Surah Ar-Ra'd"],"ayahNumber":1741,"juzNumber":13,"footnotes":"(1) اس سے مراد قتل اور اسیری ہے جو مسلمانوں کے ساتھ جنگ میں ان کافروں کے حصے آتی ہے۔\n(2) جس طرح نبی (صلى الله عليه وسلم) نے بھی لعنت ملامت کرنے والے جوڑے سے فرمایا تھا «إِنَّ عَذَابَ الدُّنْيَا أَهْوَنُ مِنْ عَذَابِ الآخِرَةِ»۔ (صحيح مسلم كتاب اللعان) «دنیا کا عذاب، آخرت سے بہت ہلکا ہے » علاوہ ازیں دنیا کا عذاب (جیسا کچھ اور جتنا کچھ بھی ہو) عارضی اور فانی ہے اور آخرت کا عذاب دائمی ہے، اسے زوال و فنا نہیں، مزید برآں جہنم کی آگ، دنیا کی آگ کی نسبت 69 گنا تیز ہے، اور اس طرح دوسری چیزیں ہیں۔ اس لئے عذاب کے سخت ہونے میں کیا شبہ ہو سکتا ہے۔","lang":"ur","meta":{"transliteration":"lahum ʿadhābun fī al-ḥayati al-dun'yā walaʿadhābu al-ākhirati ashaqqu wamā lahum mina al-lahi min wāqin ","translations":["For them","(is) a punishment","in","the life","(of) the world","and surely the punishment","(of) the Hereafter","(is) harder","And not","for them","against","Allah","any","defender","(34)"],"transliterationArr":["lahum","ʿadhābun","fī","al-ḥayati","al-dun'yā","walaʿadhābu","al-ākhirati","ashaqqu","wamā","lahum","mina","al-lahi","min","wāqin",null],"verseTiming":[[1,0,670],[2,670,2120],[3,2120,2900],[4,2900,4080],[5,4080,5300],[6,5300,6660],[7,6660,8110],[8,8110,9190],[9,9190,10080],[10,10080,10670],[11,10670,11420],[12,11420,12470],[13,12470,12850],[14,12850,16005]]}},{"name":"13:35","price":"اس جنت کی صفت، جس کا وعده پرہیزگاروں کو دیا گیا ہے یہ ہے کہ اس کے نیچے سے نہریں بہہ رہی ہیں۔ اس کا میوه ہمیشگی واﻻ ہے اور اس کا سایہ بھی۔ یہ ہے انجام پرہیزگاروں کا(1) ، اور کافروں کا انجام کار دوزخ ہے.","arabic":"۞ مَّثَلُ ٱلۡجَنَّةِ ٱلَّتِي وُعِدَ ٱلۡمُتَّقُونَۖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُۖ أُكُلُهَا دَآئِمٞ وَظِلُّهَاۚ تِلۡكَ عُقۡبَى ٱلَّذِينَ ٱتَّقَواْۚ وَّعُقۡبَى ٱلۡكَٰفِرِينَ ٱلنَّارُ","category":["13 (Ar-Ra'd)","Ar-Ra'd","Surah Ar-Ra'd"],"ayahNumber":1742,"juzNumber":13,"footnotes":"(1) اہل کفار کے انجام بد کے ساتھ اہل ایمان کا حسن انجام بیان فرما دیا تاکہ جنت کے حصول میں رغبت اور شوق پیدا ہو، اس مقام پر امام ابن کثیر نے جنت کی نعمتوں، لذتوں اور ان کی خصوصی کیفیات پر مشتمل احادیث بیان فرمائی ہیں۔ جنہیں وہاں ملاحظہ کر لیا جائے۔","lang":"ur","meta":{"transliteration":"mathalu al-janati allatī wuʿida al-mutaqūna tajrī min taḥtihā al-anhāru ukuluhā dāimun waẓilluhā til'ka ʿuq'bā alladhīna ittaqaw waʿuq'bā al-kāfirīna al-nāru ","translations":["The example","of Paradise","which","(is) promised","(to) the righteous","flows","from","underneath it","the rivers","Its food","(is) everlasting","and its shade","This","(is the) end","of those who","(are) righteous","and (the) end","(of) the disbelievers","(is) the Fire","(35)"],"transliterationArr":["mathalu","al-janati","allatī","wuʿida","al-mutaqūna","tajrī","min","taḥtihā","al-anhāru","ukuluhā","dāimun","waẓilluhā","til'ka","ʿuq'bā","alladhīna","ittaqaw","waʿuq'bā","al-kāfirīna","al-nāru",null],"verseTiming":[[1,0,760],[2,760,2420],[3,2420,3270],[4,3270,3950],[5,3950,7630],[6,7630,8510],[7,8510,9740],[8,9740,10630],[9,10630,14020],[10,14020,15160],[11,15160,18100],[12,18100,19380],[13,19380,20720],[14,20720,21330],[15,21330,22480],[16,22480,23480],[17,23480,24320],[18,24320,25960],[19,25960,28755]]}},{"name":"13:36","price":"جنہیں ہم نے کتاب دی ہے(1) وه تو جو کچھ آپ پر اتارا جاتا ہے اس سے خوش ہوتے ہیں(2) اور دوسرے فرقے اس کی بعض باتوں کے منکر ہیں(3)۔ آپ اعلان کر دیجئے کہ مجھے تو صرف یہی حکم دیا گیا ہے کہ میں اللہ کی عبادت کروں اور اس کے ساتھ شریک نہ کروں، میں اسی کی طرف بلا رہا ہوں اور اسی کی جانب میرا لوٹنا ہے.","arabic":"وَٱلَّذِينَ ءَاتَيۡنَٰهُمُ ٱلۡكِتَٰبَ يَفۡرَحُونَ بِمَآ أُنزِلَ إِلَيۡكَۖ وَمِنَ ٱلۡأَحۡزَابِ مَن يُنكِرُ بَعۡضَهُۥۚ قُلۡ إِنَّمَآ أُمِرۡتُ أَنۡ أَعۡبُدَ ٱللَّهَ وَلَآ أُشۡرِكَ بِهِۦٓۚ إِلَيۡهِ أَدۡعُواْ وَإِلَيۡهِ مَـَٔابِ","category":["13 (Ar-Ra'd)","Ar-Ra'd","Surah Ar-Ra'd"],"ayahNumber":1743,"juzNumber":13,"footnotes":"(1) اس سے مراد مسلمان ہیں اور مطلب ہے جو قرآن کے احکام پر عمل کرتے ہیں۔\n(2) یعنی قرآن کے صدق کے دلائل و شواہد دیکھ کر مزید خوش ہوتے ہیں۔\n(3) اس سے مراد یہود و نصاریٰ اور کفار و مشرکین ہیں۔ بعض کے نزدیک کتاب سے مراد تورات وانجیل ہے، ان میں سے جو مسلمان ہوئے، وہ خوش ہوتے ہیں اور انکار کرنے والے وہ یہود و انصاریٰ ہیں جو مسلمان نہیں ہوئے۔","lang":"ur","meta":{"transliteration":"wa-alladhīna ātaynāhumu al-kitāba yafraḥūna bimā unzila ilayka wamina al-aḥzābi man yunkiru baʿḍahu qul innamā umir'tu an aʿbuda al-laha walā ush'rika bihi ilayhi adʿū wa-ilayhi maābi ","translations":["And those (to) whom","We have given them","the Book","rejoice","at what","has been revealed","to you","but among","the groups","(those) who","deny","a part of it","Say","Only","I have been commanded","that","I worship","Allah","and not","I associate partners","with Him","To Him","I call","and to Him","(is) my return","(36)"],"transliterationArr":["wa-alladhīna","ātaynāhumu","al-kitāba","yafraḥūna","bimā","unzila","ilayka","wamina","al-aḥzābi","man","yunkiru","baʿḍahu","qul","innamā","umir'tu","an","aʿbuda","al-laha","walā","ush'rika","bihi","ilayhi","adʿū","wa-ilayhi","maābi",null],"verseTiming":[[1,0,1430],[2,1430,3270],[3,3270,4550],[4,4550,5920],[5,5920,7960],[6,7960,9220],[7,9220,10060],[8,10060,10700],[9,10700,12180],[10,12180,12370],[11,12370,13220],[12,13220,16160],[13,16160,16530],[14,16530,19570],[15,19570,20460],[16,20460,20880],[17,20880,21700],[18,21700,22740],[19,22740,24470],[20,24470,25350],[21,25350,25820],[22,25820,27140],[23,27140,28130],[24,28130,29220],[25,29220,32045]]}},{"name":"13:37","price":"اسی طرح ہم نے اس قرآن کو عربی زبان کا فرمان اتارا ہے(1) ۔ اگر آپ نے ان کی خواہشوں(2) کی پیروی کر لی اس کے بعد کہ آپ کے پاس علم آچکا ہے(3) تو اللہ (کے عذابوں) سے آپ کو کوئی حمایتی ملے گا اور نہ بچانے واﻻ.(4)","arabic":"وَكَذَٰلِكَ أَنزَلۡنَٰهُ حُكۡمًا عَرَبِيّٗاۚ وَلَئِنِ ٱتَّبَعۡتَ أَهۡوَآءَهُم بَعۡدَ مَا جَآءَكَ مِنَ ٱلۡعِلۡمِ مَا لَكَ مِنَ ٱللَّهِ مِن وَلِيّٖ وَلَا وَاقٖ","category":["13 (Ar-Ra'd)","Ar-Ra'd","Surah Ar-Ra'd"],"ayahNumber":1744,"juzNumber":13,"footnotes":"(1) یعنی جس طرح آپ سے پہلے رسولوں پر کتابیں مقامی زبانوں میں نازل کیں، اسی طرح آپ پر قرآن ہم نے عربی زبان میں اتارا، اس لئے کہ آپ کے مخاطب اولین اہل عرب ہیں، جو صرف عربی زبان ہی جانتے ہیں۔ اگر قرآن کسی اور زبان میں نازل ہوتا تو ان کی سمجھ سے بالا ہوتا اور قبول ہدایت میں ان کے لئے عذر بن جاتا۔ ہم نے قرآن کو عربی میں اتار کر یہ عذر بھی دور کر دیا۔\n(2) اس سے مراد اہل کتاب کی بعض وہ خواہشیں ہیں جو وہ چاہتے تھے کہ پیغمبر آخر الزماں انہیں اختیار کریں۔ مثلاً بیت المقدس کو ہمیشہ کے لئے قبلہ بنائے رکھنا اور ان کے معتقدات کی مخالفت نہ کرنا وغیرہ۔\n(3) اس سے مراد علم ہے جو وحی کے ذریعے سے آپ کو عطا کیا گیا، جس میں اہل کتاب کے معتقدات کی حقیقت بھی آپ پر واضح کر دی گئی۔\n(4) یہ دراصل امت کے اہل علم کو تنبیہ ہے کہ وہ دنیا کے عارضی مفادات کی خاطر قرآن و حدیث کے واضح احکام کے مقابلے میں لوگوں کی خواہشات کے پیچھے نہ لگیں، اگر وہ ایسا کریں گے تو انہیں اللہ کے عذاب سے بچانے والا کوئی نہیں ہوگا۔","lang":"ur","meta":{"transliteration":"wakadhālika anzalnāhu ḥuk'man ʿarabiyyan wala-ini ittabaʿta ahwāahum baʿdamā jāaka mina al-ʿil'mi mā laka mina al-lahi min waliyyin walā wāqin ","translations":["And thus","We have revealed it","(to be) a judgment of authority","(in) Arabic","And if","you follow","their desires","after what","came to you","of","the knowledge","not","for you","against","Allah","any","protector","and not","defender","(37)"],"transliterationArr":["wakadhālika","anzalnāhu","ḥuk'man","ʿarabiyyan","wala-ini","ittabaʿta","ahwāahum","baʿdamā","jāaka","mina","al-ʿil'mi","mā","laka","mina","al-lahi","min","waliyyin","walā","wāqin",null],"verseTiming":[[1,0,1450],[2,1450,3920],[3,3920,4760],[4,4760,6600],[5,6600,7510],[6,7510,8640],[7,8640,11900],[8,11900,12940],[9,12940,15230],[10,15230,15590],[11,15590,16610],[12,16610,17110],[13,17110,17530],[14,17530,17880],[15,17880,18930],[16,18930,19260],[17,19260,21080],[18,21080,22270],[19,22270,24435]]}},{"name":"13:38","price":"ہم آپ سے پہلے بھی بہت سے رسول بھیج چکے ہیں اور ہم نے ان سب کو بیوی بچوں واﻻ بنایا تھا(1) ، کسی رسول سے نہیں ہو سکتا کہ کوئی نشانی بغیر اللہ کی اجازت کے لے آئے(2)۔ ہر مقرره وعدے کی ایک لکھت ہے.(3)","arabic":"وَلَقَدۡ أَرۡسَلۡنَا رُسُلٗا مِّن قَبۡلِكَ وَجَعَلۡنَا لَهُمۡ أَزۡوَٰجٗا وَذُرِّيَّةٗۚ وَمَا كَانَ لِرَسُولٍ أَن يَأۡتِيَ بِـَٔايَةٍ إِلَّا بِإِذۡنِ ٱللَّهِۗ لِكُلِّ أَجَلٖ كِتَابٞ","category":["13 (Ar-Ra'd)","Ar-Ra'd","Surah Ar-Ra'd"],"ayahNumber":1745,"juzNumber":13,"footnotes":"(1) یعنی آپ سمیت جتنے بھی رسول اور نبی آئے، سب بشر ہی تھے، جن کا اپنا خاندان اور قبیلہ تھا اور بیوی بچے تھے وہ فرشتے تھے نہ انسانی شکل میں کوئی نوری مخلوق بلکہ جنس بشر ہی میں سے تھے کیونکہ اگر وہ فرشتے ہوتے تو انسانوں کے لیے ان سے مانوس ہونا اور ان کے قریب ہونا ناممکن تھا جس سے ان کو بھیجنے کا اصل مقصد ہی فوت ہو جاتا اور اگر وہ فرشتے بشری جامے میں آتے تو دنیا میں نہ ان کا خاندان اور قبیلہ ہوتا اور نہ ان کے بیوی بچے ہوتے جس سے یہ معلوم ہوا کہ تمام انبیاء بحثییت جنس کے بشر ہی تھے بشری شکل میں فرشتے یا کوئی نوری مخلوق نہیں تھے مزکورہ آیت میں ازواجا سے رہبانیت کی تردید اور ذریۃ سے خاندانی منصوبہ بندی کی تردید بھی ہوتی ہے کیونکہ ذریۃ جمع ہے کم از کم تین ہوں گے۔\n(2) یعنی معجزات کا صدور، رسولوں کے اختیار میں نہیں کہ جب ان سے مطالبہ کیا جائے تو وہ صادر کر کے دکھا دیں بلکہ یہ اللہ کے اختیار میں ہے وہ اپنی حکمت و مشیت کے مطابق فیصلہ کرتا ہے کہ معجزے کی ضرورت ہے یا نہیں؟ اگر ہے تو کس طرح اور کب دکھایا جائے۔\n(3) یعنی اللہ نے جس چیز کا وعدہ کیا، اس کا ایک وقت مقرر ہے، اس وقت موعود پر یہ واقع ہو کر رہے گا اس لئے کہ اللہ کا وعدہ خلاف نہیں ہوتا۔اور بعض کہتے ہیں کہ کلام میں تقدیم و تاخیر ہے۔ اصل عبارت ہر وہ امر، جسے اللہ نے لکھ رکھا ہے، اس کا ایک وقت مقرر ہے، یعنی معاملہ، کفار کے ارادے اور منشاء پر نہیں بلکہ صرف اور صرف اللہ کی مشیت پر موقوف ہے۔","lang":"ur","meta":{"transliteration":"walaqad arsalnā rusulan min qablika wajaʿalnā lahum azwājan wadhurriyyatan wamā kāna lirasūlin an yatiya biāyatin illā bi-idh'ni al-lahi likulli ajalin kitābun ","translations":["And certainly","We sent","Messengers","from","before you","and We made","for them","wives","and offspring","And not","was","for a Messenger","that","he comes","with a sign","except","by the leave","(of) Allah","For everything","(is) a time","prescribed","(38)"],"transliterationArr":["walaqad","arsalnā","rusulan","min","qablika","wajaʿalnā","lahum","azwājan","wadhurriyyatan","wamā","kāna","lirasūlin","an","yatiya","biāyatin","illā","bi-idh'ni","al-lahi","likulli","ajalin","kitābun",null],"verseTiming":[[1,0,920],[2,920,2090],[3,2090,3060],[4,3060,4380],[5,4380,5840],[6,5840,6970],[7,6970,7720],[8,7720,9470],[9,9470,12010],[10,12010,12660],[11,12660,13300],[12,13300,14680],[13,14680,14880],[14,14880,16650],[15,16650,17990],[16,17990,19070],[17,19070,19990],[18,19990,22490],[19,22490,23260],[20,23260,24120],[21,24120,27545]]}},{"name":"13:39","price":"اللہ جو چاہے مٹا دے اور جو چاہے ﺛابت رکھے، لوح محفوظ اسی کے پاس ہے.(1)","arabic":"يَمۡحُواْ ٱللَّهُ مَا يَشَآءُ وَيُثۡبِتُۖ وَعِندَهُۥٓ أُمُّ ٱلۡكِتَٰبِ","category":["13 (Ar-Ra'd)","Ar-Ra'd","Surah Ar-Ra'd"],"ayahNumber":1746,"juzNumber":13,"footnotes":"(1) اس کے ایک معنی تو یہ ہیں وہ جس حکم کو چاہے منسوخ کردے اور جسے چاہے باقی رکھے۔ دوسرے معنی یہ ہیں اس نے جو تقدیر لکھ رکھی ہے، اس میں محو و اثبات کرتا رہتا ہے، اس کے پاس لوح محفوط ہے۔ اس کی تائید بعض احادیث و آثار سے ہوتی ہے۔ مثلاً ایک حدیث میں آتا ہے کہ ”آدمی گناہوں کی وجہ سے رزق سے محروم کر دیا جاتا ہے، دعا سے تقدیر بدل جاتی ہے اور صلہ رحمی سے عمر میں اضافہ ہوتا ہے“ (مسند احمد جلد۔5 ص۔277) بعض صحابہ سے یہ دعا منقول ہے «اللَّهُمَّ إِنْ كُنْتَ كَتَبْتَنَا أَشْقِيَاءَ فَامْحُنَا وَاكْتُبْنَا سُعَدَاءَ، وَإِنْ كُنْتَ كَتَبْتَنَا سُعَدَاءَ فَأَثْبِتْنَا، فَإِنَّكَ تَمْحُو مَا تَشَاءُ وَتُثْبِتُ وَعِنْدَكَ أُمُّ الْكِتَابِ» حضرت عمر (رضي الله عنه) سے منقول ہے کہ وہ دوران طواف روتے ہوئے یہ دعا پڑھتے ـ«اللَّهُمَّ إِنْ كُنْتَ كَتَبْتَ عَلَيّ شِقْوَةً أَوْ ذَنْبًا فَامْحُهُ، فَإِنَّكَ تَمْحُو مَا تَشَاءُ وَتُثْبِتُ وَعِنْدَكَ أُمُّ الْكِتَابِ فَاجْعَلْهُ سَعَادَةً وَمَغْفِرَةً»۔( ابن کثیر)۔ ”اے اللہ اگر تو نے مجھ پر بدبختی اور گناہ لکھا ہے تو اسے مٹا دے، اس لئے کہ تو جو چاہے مٹائے اور جو چاہے باقی رکھے، تیرے پاس ہی لوح محفوظ ہے، پس تو بدبختی کو سعادت اور مغفرت سے بدل دے“۔ اس مفہوم پر یہ اعتراض ہو سکتا ہے کہ حدیث میں تو آتا ہے «جَفَّ الْقَلَمُ بِمَا هُوَ كَائِنٌ»۔ (صحیح بخاری نمبر 5076)۔ ”جو کچھ ہونے والا ہے قلم اسے لکھ کر خشک ہو چکا ہے“ اس کا جواب یہ دیا گیا کہ یہ محو واثبات بھی منجملہ قضاء وتقدیر ہی کے ہے۔( فتح القدیر)۔","lang":"ur","meta":{"transliteration":"yamḥū al-lahu mā yashāu wayuth'bitu waʿindahu ummu al-kitābi ","translations":["(Is) eliminated","(by) Allah","what","He wills","and confirms","and with Him","(is) the Mother (of) the Book","(is) the Mother (of) the Book","(39)"],"transliterationArr":["yamḥū","al-lahu","mā","yashāu","wayuth'bitu","waʿindahu","ummu","al-kitābi",null],"verseTiming":[[1,0,690],[2,690,1620],[3,1620,2050],[4,2050,4400],[5,4400,5490],[6,5490,9180],[7,9180,10590],[8,10590,13015]]}},{"name":"13:40","price":"ان سے کیے ہوئے وعدوں میں سے کوئی اگر ہم آپ کو دکھا دیں یا آپ کو ہم فوت کر لیں تو آپ پر تو صرف پہنچا دینا ہی ہے۔ حساب تو ہمارے ذمہ ہی ہے.","arabic":"وَإِن مَّا نُرِيَنَّكَ بَعۡضَ ٱلَّذِي نَعِدُهُمۡ أَوۡ نَتَوَفَّيَنَّكَ فَإِنَّمَا عَلَيۡكَ ٱلۡبَلَٰغُ وَعَلَيۡنَا ٱلۡحِسَابُ","category":["13 (Ar-Ra'd)","Ar-Ra'd","Surah Ar-Ra'd"],"ayahNumber":1747,"juzNumber":13,"footnotes":"","lang":"ur","meta":{"transliteration":"wa-in mā nuriyannaka baʿḍa alladhī naʿiduhum aw natawaffayannaka fa-innamā ʿalayka al-balāghu waʿalaynā al-ḥisābu ","translations":["And whether","(what)","We show you","a part","(of) what","We have promised them","or","We cause you to die","so only","on you","(is) the conveyance","and on Us","(is) the reckoning","(40)"],"transliterationArr":["wa-in","mā","nuriyannaka","baʿḍa","alladhī","naʿiduhum","aw","natawaffayannaka","fa-innamā","ʿalayka","al-balāghu","waʿalaynā","al-ḥisābu",null],"verseTiming":[[1,0,520],[2,520,1770],[3,1770,3970],[4,3970,4640],[5,4640,5560],[6,5560,6730],[7,6730,7110],[8,7110,9520],[9,9520,11290],[10,11290,12260],[11,12260,13580],[12,13580,14610],[13,14610,17795]]}},{"name":"13:41","price":"کیا وه نہیں دیکھتے؟ کہ ہم زمین کو اس کے کناروں سے گھٹاتے چلے آرہے ہیں(1) ، اللہ حکم کرتا ہے کوئی اس کے احکام پیچھے ڈالنے واﻻ نہیں(2)، وه جلد حساب لینے واﻻ ہے.","arabic":"أَوَلَمۡ يَرَوۡاْ أَنَّا نَأۡتِي ٱلۡأَرۡضَ نَنقُصُهَا مِنۡ أَطۡرَافِهَاۚ وَٱللَّهُ يَحۡكُمُ لَا مُعَقِّبَ لِحُكۡمِهِۦۚ وَهُوَ سَرِيعُ ٱلۡحِسَابِ","category":["13 (Ar-Ra'd)","Ar-Ra'd","Surah Ar-Ra'd"],"ayahNumber":1748,"juzNumber":13,"footnotes":"(1) یعنی عرب کی سرزمین مشرکین پر بتدریج تنگ ہو رہی ہے اور اسلام کو غلبہ عروج حاصل ہو رہا ہے۔\n(2) یعنی کوئی اللہ کے حکموں کو رد نہیں کر سکتا۔","lang":"ur","meta":{"transliteration":"awalam yaraw annā natī al-arḍa nanquṣuhā min aṭrāfihā wal-lahu yaḥkumu lā muʿaqqiba liḥuk'mihi wahuwa sarīʿu al-ḥisābi ","translations":["Did not","they see","that We","come","(to) the land","reducing it","from","its borders","And Allah","judges","(there is) no","adjuster","(of) His Judgment","And He","(is) Swift","(in) the reckoning","(41)"],"transliterationArr":["awalam","yaraw","annā","natī","al-arḍa","nanquṣuhā","min","aṭrāfihā","wal-lahu","yaḥkumu","lā","muʿaqqiba","liḥuk'mihi","wahuwa","sarīʿu","al-ḥisābi",null],"verseTiming":[[1,0,860],[2,860,1600],[3,1600,3270],[4,3270,3900],[5,3900,4840],[6,4840,6660],[7,6660,7060],[8,7060,8750],[9,8750,10200],[10,10200,11150],[11,11150,11640],[12,11640,12820],[13,12820,14260],[14,14260,14870],[15,14870,15860],[16,15860,18145]]}},{"name":"13:42","price":"ان سے پہلے لوگوں نے بھی اپنی مکاری میں کمی نہ کی تھی(1) ، لیکن تمام تدبیریں اللہ ہی کی ہیں، جو شخص جو کچھ کر رہا ہے اللہ کے علم میں ہے(2)۔عنقريب کافروں کو معلوم ہو جائے گا کہ (اس) جہان کی جزا کس کے لئے ہے؟","arabic":"وَقَدۡ مَكَرَ ٱلَّذِينَ مِن قَبۡلِهِمۡ فَلِلَّهِ ٱلۡمَكۡرُ جَمِيعٗاۖ يَعۡلَمُ مَا تَكۡسِبُ كُلُّ نَفۡسٖۗ وَسَيَعۡلَمُ ٱلۡكُفَّٰرُ لِمَنۡ عُقۡبَى ٱلدَّارِ","category":["13 (Ar-Ra'd)","Ar-Ra'd","Surah Ar-Ra'd"],"ayahNumber":1749,"juzNumber":13,"footnotes":"(1) یعنی مشرکین مکہ سے قبل بھی لوگ رسولوں کے مقابلے میں مکر کرتے رہے ہیں، لیکن اللہ کی تدبیر کے مقابلے میں ان کی کوئی تدبیر اور حیلہ کارگر نہیں ہوا، اسی طرح آئندہ بھی ان کا کوئی مکر اللہ کی مشیت کے سامنے نہیں ٹھر سکے گا۔\n(2) وہ اس کے مطابق جزا اور سزا دے گا، نیک کو اس کی نیکی کی جزا اور بد کو اس کی بد کی سزا ۔","lang":"ur","meta":{"transliteration":"waqad makara alladhīna min qablihim falillahi al-makru jamīʿan yaʿlamu mā taksibu kullu nafsin wasayaʿlamu al-kufāru liman ʿuq'bā al-dāri ","translations":["And certainly","plotted","those who","(were) from","before them","but for Allah","(is) the plot","all","He knows","what","earns","every","soul","and will know","the disbelievers","for whom","(is) the final","the home","(42)"],"transliterationArr":["waqad","makara","alladhīna","min","qablihim","falillahi","al-makru","jamīʿan","yaʿlamu","mā","taksibu","kullu","nafsin","wasayaʿlamu","al-kufāru","liman","ʿuq'bā","al-dāri",null],"verseTiming":[[1,0,680],[2,680,1280],[3,1280,2330],[4,2330,3520],[5,3520,4570],[6,4570,5990],[7,5990,6870],[8,6870,8520],[9,8520,9470],[10,9470,9860],[11,9860,10880],[12,10880,11590],[13,11590,12490],[14,12490,13870],[15,13870,15290],[16,15290,15880],[17,15880,16560],[18,16560,18985]]}},{"name":"13:43","price":"یہ کافر کہتے ہیں کہ آپ اللہ کے رسول نہیں۔ آپ جواب دیجئے کہ مجھ میں اور تم میں اللہ گواہی دینے واﻻ کافی ہے(1) اور وه جس کے پاس کتاب کا علم ہے.(2)","arabic":"وَيَقُولُ ٱلَّذِينَ كَفَرُواْ لَسۡتَ مُرۡسَلٗاۚ قُلۡ كَفَىٰ بِٱللَّهِ شَهِيدَۢا بَيۡنِي وَبَيۡنَكُمۡ وَمَنۡ عِندَهُۥ عِلۡمُ ٱلۡكِتَٰبِ","category":["13 (Ar-Ra'd)","Ar-Ra'd","Surah Ar-Ra'd"],"ayahNumber":1750,"juzNumber":13,"footnotes":"(1) پس وہ جانتا ہے کہ میں اس کا سچا رسول اور اس کے پیغام کا داعی ہوں اور تم جھوٹے ہو۔\n(2) کتاب سے مراد جنس کتاب ہے اور مراد تورات اور انجیل کا علم ہے۔ یعنی اہل کتاب میں سے وہ لوگ جو مسلمان ہوگئے ہیں، جیسے عبد اللہ بن اسلام، سلمان فارسی اور تمیم داری وغیرہم (رضي الله عنه) م یعنی یہ بھی جانتے ہیں کہ میں اللہ کا رسول ہوں۔ عرب کے مشرکین اہم معاملات میں اہل کتاب کی طرف رجوع کرتے اور ان سے پوچھتے تھے، اللہ تعالٰی نے ان کی رہنمائی فرمائی کہ اہل کتاب جانتے ہیں، ان سے تم پوچھ لو۔ بعض کہتے ہیں کہ کتاب سے مراد قرآن ہے اور حاملین علم کتاب، مسلمان ہیں۔ اور بعض نے کتاب سے مراد لوح محفوظ لی ہے۔ یعنی جس کے پاس لوح محفوظ کا علم ہے یعنی اللہ تبارک و تعالیٰ، مگر پہلا مفہوم زیادہ درست ہے۔","lang":"ur","meta":{"transliteration":"wayaqūlu alladhīna kafarū lasta mur'salan qul kafā bil-lahi shahīdan baynī wabaynakum waman ʿindahu ʿil'mu al-kitābi ","translations":["And say","those who","disbelieve","You are not","a Messenger","Say","Sufficient","(is) Allah","(as) a Witness","between me","and between you","and whoever","[he] has","knowledge","(of) the Book","(43)"],"transliterationArr":["wayaqūlu","alladhīna","kafarū","lasta","mur'salan","qul","kafā","bil-lahi","shahīdan","baynī","wabaynakum","waman","ʿindahu","ʿil'mu","al-kitābi",null],"verseTiming":[[1,0,1250],[2,1250,2330],[3,2330,3370],[4,3370,4070],[5,4070,5330],[6,5330,5420],[7,5420,6110],[8,6110,6880],[9,6880,8040],[10,8040,9150],[11,9150,10630],[12,10630,12020],[13,12020,12860],[14,12860,14860],[15,14860,15700],[16,15700,19285]]}}],"chapter":["13 (Ar-Ra'd)","Ar-Ra'd","Surah Ar-Ra'd","Chapter Ar-Ra'd","Ra'd","Surah Ra'd","Chapter Ra'd","Ar Ra'd","Surah Ar Ra'd","Chapter Ar Ra'd","Surah 13","Chapter 13","The Thunder","الرَّعد"],"version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."}}