{"data":[{"name":"14:1","price":"الرٰ! یہ عالی شان کتاب ہم نے آپ کی طرف اتاری ہے کہ آپ لوگوں کو اندھیروں سے اجالے کی طرف ﻻئیں(1) ، ان کے پروردگار کے حکم(2) سے، زبردست اور تعریفوں والے اللہ کی طرف.","arabic":"الٓرۚ كِتَٰبٌ أَنزَلۡنَٰهُ إِلَيۡكَ لِتُخۡرِجَ ٱلنَّاسَ مِنَ ٱلظُّلُمَٰتِ إِلَى ٱلنُّورِ بِإِذۡنِ رَبِّهِمۡ إِلَىٰ صِرَٰطِ ٱلۡعَزِيزِ ٱلۡحَمِيدِ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim"],"ayahNumber":1751,"juzNumber":13,"footnotes":"(1) جس طرح دوسرے مقام پر بھی اللہ نے فرمایا '«هُوَ الَّذِيْ يُنَزِّلُ عَلٰي عَبْدِهٖٓ اٰيٰتٍۢ بَيِّنٰتٍ لِّيُخْرِجَكُمْ مِّنَ الظُّلُمٰتِ اِلَى النُّوْرِ»(سورہ الحدید:9) ۔« وہی ذات ہے جو اپنے بندے پر واضح آیات نازل فرماتی ہے تاکہ وہ تمہیں اندھیروں سے نکال کر نور کی طرف لائے »۔ «اَللّٰهُ وَلِيُّ الَّذِيْنَ اٰمَنُوْا ۙيُخْرِجُهُمْ مِّنَ الظُّلُمٰتِ اِلَى النُّوْرِ» ( البقرۃ:257)۔ ”اللہ ایمان داروں کا دوست ہے، وہ انہیں اندھیروں سے نکال کر نور کی طرف لاتا ہے“۔\n(2) یعنی پیغمبر کا کام ہدایت کا راستہ دکھانا ہے۔ لیکن اگر کوئی اس راستے کو اختیار کر لیتا ہے تو یہ صرف اللہ کے حکم اور مشیت سے ہوتا ہے کیونکہ اصل ہادی وہی ہے۔ اس کی مشیت اگر نہ ہو، تو پیغمبر کتنا بھی واعظ و نصیحت کر لے، لوگ ہدایت کا راستہ اپنانے کے لئے تیار نہیں ہوتے، جس کی متعدد مثالیں انبیائے سابقین میں موجود ہیں اور خود نبی (صلى الله عليه وسلم) باوجود شدید خواہش کے اپنے مہربان چچا ابو طالب کو مسلمان نہ کر سکے۔","lang":"ur","meta":{"transliteration":"alif-lam-ra kitābun anzalnāhu ilayka litukh'rija al-nāsa mina al-ẓulumāti ilā al-nūri bi-idh'ni rabbihim ilā ṣirāṭi al-ʿazīzi al-ḥamīdi ","translations":["Alif Laam Ra","A Book","which We have revealed","to you","so that you may bring out","the mankind","from","the darkness[es]","to","the light","by the permission","(of) their Lord","to","the Path","(of) the All-Mighty","the Praiseworthy","(1)"],"transliterationArr":["alif-lam-ra","kitābun","anzalnāhu","ilayka","litukh'rija","al-nāsa","mina","al-ẓulumāti","ilā","al-nūri","bi-idh'ni","rabbihim","ilā","ṣirāṭi","al-ʿazīzi","al-ḥamīdi",null],"verseTiming":[[1,0,5791],[2,5791,6840],[3,6840,8856],[4,8856,9568],[5,9568,11354],[6,11354,11971],[7,11971,12291],[8,12291,13428],[9,13428,13953],[10,13953,15013],[11,15013,15846],[12,15846,16705],[13,16705,17397],[14,17397,18299],[15,18299,19300],[16,19300,21635]]}},{"name":"14:2","price":"جس اللہ کا ہے جو کچھ آسمانوں اور زمین میں ہے۔ اور کافروں کے لئے تو سخت عذاب کی خرابی ہے.","arabic":"ٱللَّهِ ٱلَّذِي لَهُۥ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۗ وَوَيۡلٞ لِّلۡكَٰفِرِينَ مِنۡ عَذَابٖ شَدِيدٍ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim"],"ayahNumber":1752,"juzNumber":13,"footnotes":"","lang":"ur","meta":{"transliteration":"al-lahi alladhī lahu mā fī al-samāwāti wamā fī al-arḍi wawaylun lil'kāfirīna min ʿadhābin shadīdin ","translations":["Allah","(is) the One","to Him (belongs)","whatever","(is) in","the heavens","and whatever","(is) in","the earth","And woe","to the disbelievers","from","the punishment","severe","(2)"],"transliterationArr":["al-lahi","alladhī","lahu","mā","fī","al-samāwāti","wamā","fī","al-arḍi","wawaylun","lil'kāfirīna","min","ʿadhābin","shadīdin",null],"verseTiming":[[1,0,1100],[2,1100,1940],[3,1940,2540],[4,2540,2870],[5,2870,3080],[6,3080,4620],[7,4620,5160],[8,5160,5400],[9,5400,6610],[10,6610,7220],[11,7220,9250],[12,9250,9660],[13,9660,11300],[14,11300,13765]]}},{"name":"14:3","price":"جو آخرت کے مقابلے میں دنیوی زندگی کو پسند رکھتے ہیں اور اللہ کی راه سے روکتے ہیں اور اس میں ٹیڑھ پن پیدا کرنا چاہتے ہیں(1) ۔ یہی لوگ پرلے درجے کی گمراہی میں ہیں.(2)","arabic":"ٱلَّذِينَ يَسۡتَحِبُّونَ ٱلۡحَيَوٰةَ ٱلدُّنۡيَا عَلَى ٱلۡأٓخِرَةِ وَيَصُدُّونَ عَن سَبِيلِ ٱللَّهِ وَيَبۡغُونَهَا عِوَجًاۚ أُوْلَٰٓئِكَ فِي ضَلَٰلِۭ بَعِيدٖ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim"],"ayahNumber":1753,"juzNumber":13,"footnotes":"(1) اس کا ایک مطلب تو یہ ہے کہ اسلام کی تعلیمات میں لوگوں کو بدظن کرنے کے لئے مین میکھ نکالتے اور انہیں مسخ کر کے پیش کرتے ہیں۔ دوسرا مطلب یہ ہے کہ اپنی اغراض و خواہشات کے مطابق اس میں تبدیلی کرنا چاہتے ہیں۔\n(2) اس لئے کہ ان میں مزکورہ متعدد خرابیاں جمع ہوگئی ہیں۔ مثلاً آخرت کے مقابلے میں دنیا کو ترجیح دینا، اللہ کے راستے سے لوگوں کو روکنا اور اسلام میں کجی تلاش کرنا۔","lang":"ur","meta":{"transliteration":"alladhīna yastaḥibbūna al-ḥayata al-dun'yā ʿalā al-ākhirati wayaṣuddūna ʿan sabīli al-lahi wayabghūnahā ʿiwajan ulāika fī ḍalālin baʿīdin ","translations":["Those who","love more","the life","(of) the world","than","the Hereafter","and hinder","from","(the) Path","(of) Allah","and seek in it","crookedness","those","[in]","(are) far astray","(are) far astray","(3)"],"transliterationArr":["alladhīna","yastaḥibbūna","al-ḥayata","al-dun'yā","ʿalā","al-ākhirati","wayaṣuddūna","ʿan","sabīli","al-lahi","wayabghūnahā","ʿiwajan","ulāika","fī","ḍalālin","baʿīdin",null],"verseTiming":[[1,0,1230],[2,1230,2910],[3,2910,3950],[4,3950,5050],[5,5050,5440],[6,5440,6750],[7,6750,8200],[8,8200,8870],[9,8870,10150],[10,10150,10730],[11,10730,12450],[12,12450,13450],[13,13450,16190],[14,16190,16590],[15,16590,17610],[16,17610,20734]]}},{"name":"14:4","price":"ہم نے ہر ہر نبی کو اس کی قومی زبان میں ہی بھیجا ہے تاکہ ان کے سامنے وضاحت سے بیان کر دے(1) ۔ اب اللہ جسے چاہے گمراه کر دے، اور جسے چاہے راه دکھا دے، وه غلبہ اور حکمت واﻻ ہے.(2)","arabic":"وَمَآ أَرۡسَلۡنَا مِن رَّسُولٍ إِلَّا بِلِسَانِ قَوۡمِهِۦ لِيُبَيِّنَ لَهُمۡۖ فَيُضِلُّ ٱللَّهُ مَن يَشَآءُ وَيَهۡدِي مَن يَشَآءُۚ وَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim"],"ayahNumber":1754,"juzNumber":13,"footnotes":"(1) پھر جب اللہ تعالٰی نے اہل دنیا پر یہ احسان فرمایا کہ ان کی ہدایت کے لئے کتابیں نازل کیں اور رسول بھیجے، تو اس احسان کی تکمیل اس طرح فرمائی کہ ہر رسول کو قومی زبان میں بھیجا تاکہ کسی کو ہدایت کا راستہ سمجھنے میں دقت نہ ہو۔\n(2) لیکن اس بیان و تشریح کے باوجود ہدایت اسے ملے گی جسے اللہ چاہے گا۔","lang":"ur","meta":{"transliteration":"wamā arsalnā min rasūlin illā bilisāni qawmihi liyubayyina lahum fayuḍillu al-lahu man yashāu wayahdī man yashāu wahuwa al-ʿazīzu al-ḥakīmu ","translations":["And not","We sent","any","Messenger","except","with the language","(of) his people","so that he might make clear","for them","Then Allah lets go astray","Then Allah lets go astray","whom","He wills","and guides","whom","He wills","And He","(is) the All-Mighty","the All-Wise","(4)"],"transliterationArr":["wamā","arsalnā","min","rasūlin","illā","bilisāni","qawmihi","liyubayyina","lahum","fayuḍillu","al-lahu","man","yashāu","wayahdī","man","yashāu","wahuwa","al-ʿazīzu","al-ḥakīmu",null],"verseTiming":[[1,0,1920],[2,1920,3160],[3,3160,3280],[4,3280,4590],[5,4590,5420],[6,5420,6490],[7,6490,7660],[8,7660,8950],[9,8950,9950],[10,9950,10960],[11,10960,11880],[12,11880,12120],[13,12120,14690],[14,14690,15730],[15,15730,15930],[16,15930,19160],[17,19160,19690],[18,19690,20830],[19,20830,23175]]}},{"name":"14:5","price":"(یاد رکھو جب کہ) ہم نے موسیٰ کو اپنی نشانیاں دے کر بھیجا کہ تو اپنی قوم کو اندھیروں سے روشنی میں نکال(1) اور انہیں اللہ کے احسانات یاد دﻻ(2)۔ اس میں نشانیاں ہیں ہر ایک صبر شکر کرنے والے کے لئے.(3)","arabic":"وَلَقَدۡ أَرۡسَلۡنَا مُوسَىٰ بِـَٔايَٰتِنَآ أَنۡ أَخۡرِجۡ قَوۡمَكَ مِنَ ٱلظُّلُمَٰتِ إِلَى ٱلنُّورِ وَذَكِّرۡهُم بِأَيَّىٰمِ ٱللَّهِۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّكُلِّ صَبَّارٖ شَكُورٖ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim"],"ayahNumber":1755,"juzNumber":13,"footnotes":"(1) یعنی جس طرح اے محمد (صلى الله عليه وسلم) ہم نے آپ کو اپنی قوم کی طرف بھیجا اور کتاب نازل کی تاکہ آپ اپنی قوم کو کفر اور شرک کی تاریکیوں سے نکال کر ایمان کی روشنی کی طرف لائیں۔ اسی طرح ہم نے موسیٰ (عليه السلام) کو معجزات و دلائل دے کر ان کی قوم کی طرف بھیجا۔ تاکہ وہ انہیں کفر کی تاریکیوں سے نکال کر ایمان کی روشنی عطا کریں۔ آیات سے مراد وہ معجزات ہیں جو موسیٰ (عليه السلام) کو عطا کئے گئے تھے، یا وہ نو معجزات ہیں جن کا ذکر سورہ بنی اسرائیل میں کیا گیا ہے۔\n(2) اَ یَّامَ اللّٰہِ سے مراد اللہ کے وہ احسنات ہیں جو بنی اسرائیل پر کئے گئے جن کی تفصیل پہلے کئی مرتبہ گزر چکی ہے۔ یا ایام وقائع کے معنی میں ہے، یعنی وہ واقعات ان کو یاد دلا جن سے وہ گزر چکے ہیں جن میں ان پر اللہ تعالٰی کے خصوصی انعامات ہوئے۔ جن میں سے بعض کا تذکرہ یہاں بھی آرہا ہے۔\n(3) صبر اور شکر یہ دو بڑی خوبیاں ہیں اور ایمان کا مدار ان پر ہے، اس لئے یہاں صرف ان دو کا تذکرہ کیا گیا ہے دونوں مبالغے کے صیغے ہیں۔ صبار، بہت صبر کرنے والا، شکور، بہت شکر کرنے والا اور صبر کو شکر پر مقدم کیا ہے اس لئے کہ شکر، صبر ہی کا نتیجہ ہے۔ حدیث میں ہے رسول اللہ (صلى الله عليه وسلم) نے فرمایا \"مومن کا معاملہ بھی عجیب ہے۔ اللہ تعالٰی اس کے لئے جس امر کا بھی فیصلہ کرے، وہ اس کے حق میں بہتر ہوتا ہے، اگر اسے تکلیف پہنچے اور وہ صبر کرے تو یہ بھی اس کے حق میں بہتر ہے اور اگر اسے کوئی خوشی پہنچے، وہ اس پر اللہ کا شکر ادا کرے تو یہ بھی اس کے حق میں بہتر ہے \"۔(صحيح مسلم، كتاب الزهد، باب المؤمن أمره كله خير)","lang":"ur","meta":{"transliteration":"walaqad arsalnā mūsā biāyātinā an akhrij qawmaka mina al-ẓulumāti ilā al-nūri wadhakkir'hum bi-ayyāmi al-lahi inna fī dhālika laāyātin likulli ṣabbārin shakūrin ","translations":["And verily","We sent","Musa","with Our Signs","that","Bring out","your people","from","the darkness[es]","to","the light","And remind them","of the days","(of) Allah","Indeed","in","that","surely (are) the signs","for everyone","patient","and thankful","(5)"],"transliterationArr":["walaqad","arsalnā","mūsā","biāyātinā","an","akhrij","qawmaka","mina","al-ẓulumāti","ilā","al-nūri","wadhakkir'hum","bi-ayyāmi","al-lahi","inna","fī","dhālika","laāyātin","likulli","ṣabbārin","shakūrin",null],"verseTiming":[[1,0,790],[2,790,2090],[3,2090,2920],[4,2920,4400],[5,4400,6160],[6,6160,6920],[7,6920,7800],[8,7800,8170],[9,8170,9500],[10,9500,9850],[11,9850,11170],[12,11170,13070],[13,13070,14920],[14,14920,16290],[15,16290,18510],[16,18510,19500],[17,19500,19990],[18,19990,20900],[19,20900,22300],[20,22300,23230],[21,23230,24630],[22,24630,27645]]}},{"name":"14:6","price":"جس وقت موسیٰ نے اپنی قوم سے کہا کہ اللہ کے وه احسانات یاد کرو جو اس نے تم پر کیے ہیں، جبکہ اس نے تمہیں فرعونیوں سے نجات دی جو تمہیں بڑے دکھ پہنچاتے تھے۔ تمہارے لڑکوں کو قتل کرتے تھے اور تمہاری لڑکیوں کو زنده چھوڑتے تھے، اس میں تمہارے رب کی طرف سے تم پر بہت بڑی آزمائش تھی.(1)","arabic":"وَإِذۡ قَالَ مُوسَىٰ لِقَوۡمِهِ ٱذۡكُرُواْ نِعۡمَةَ ٱللَّهِ عَلَيۡكُمۡ إِذۡ أَنجَىٰكُم مِّنۡ ءَالِ فِرۡعَوۡنَ يَسُومُونَكُمۡ سُوٓءَ ٱلۡعَذَابِ وَيُذَبِّحُونَ أَبۡنَآءَكُمۡ وَيَسۡتَحۡيُونَ نِسَآءَكُمۡۚ وَفِي ذَٰلِكُم بَلَآءٞ مِّن رَّبِّكُمۡ عَظِيمٞ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim"],"ayahNumber":1756,"juzNumber":13,"footnotes":"(1) یعنی جس طرح یہ ایک بہت بڑی آزمائش تھی اسی طرح اس سے نجات اللہ کا بہت بڑا احسان تھا، اسی لئے بعض مترجمین نے بَلَاَء کا ترجمہ آزمائش اور بعض نے احسان کیا ہے۔","lang":"ur","meta":{"transliteration":"wa-idh qāla mūsā liqawmihi udh'kurū niʿ'mata al-lahi ʿalaykum idh anjākum min āli fir'ʿawna yasūmūnakum sūa al-ʿadhābi wayudhabbiḥūna abnāakum wayastaḥyūna nisāakum wafī dhālikum balāon min rabbikum ʿaẓīmun ","translations":["And when","said","Musa","to his people","Remember","(the) Favor of Allah","(the) Favor of Allah","upon you","when","He saved you","from","(the) people","(of) Firaun","they were afflicting you","(with) evil","torment","and were slaughtering","your sons","and letting live","your women","And in","that","(was) a trial","from","your Lord","great","(6)"],"transliterationArr":["wa-idh","qāla","mūsā","liqawmihi","udh'kurū","niʿ'mata","al-lahi","ʿalaykum","idh","anjākum","min","āli","fir'ʿawna","yasūmūnakum","sūa","al-ʿadhābi","wayudhabbiḥūna","abnāakum","wayastaḥyūna","nisāakum","wafī","dhālikum","balāon","min","rabbikum","ʿaẓīmun",null],"verseTiming":[[1,0,520],[2,520,1370],[3,1370,2180],[4,2180,3310],[5,3310,4060],[6,4060,4900],[7,4900,5810],[8,5810,6910],[9,6910,7310],[10,7310,9120],[11,9120,10170],[12,10170,10730],[13,10730,11790],[14,11790,14160],[15,14160,15840],[16,15840,17670],[17,17670,18760],[18,18760,20480],[19,20480,23070],[20,23070,24770],[21,24770,27830],[22,27830,28490],[23,28490,30190],[24,30190,32330],[25,32330,33040],[26,33040,34350],[27,34350,36485]]}},{"name":"14:7","price":"اور جب تمہارے پروردگار نے تمہیں آگاه (1) کر دیا کہ اگر تم شکر گزاری کرو گے تو بیشک میں تمہیں زیاده(2) دوں گا اور اگر تم ناشکری کرو گے تو یقیناً میرا عذاب بہت سخت ہے.(3)","arabic":"وَإِذۡ تَأَذَّنَ رَبُّكُمۡ لَئِن شَكَرۡتُمۡ لَأَزِيدَنَّكُمۡۖ وَلَئِن كَفَرۡتُمۡ إِنَّ عَذَابِي لَشَدِيدٞ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim"],"ayahNumber":1757,"juzNumber":13,"footnotes":"(1) تَأَذَّنَ کے معنی أَعْلَمَكُمْ بِوَعْدِهِ لَكُمْ، اس نے تمہیں اپنے وعدے سے تمہیں آگاہ اور خبردار کر دیا ہے۔ اور یہ احتمال بھی ہے کہ یہ قسم کے معنی میں ہو یعنی جب تمہارے رب نے اپنی عزت و جلال اور کبریائی کی قسم کھا کر کہا (ابن کثیر)\n(2) نعمت پر شکر کرنے پر مزید انعامات سے نوازوں گا۔\n(3) اس کا مطلب یہ ہوا کہ کفران نعمت (ناشکری) اللہ کو ناپسند ہے، جس پر اس نے سخت عذاب کی وعید بیان فرمائی ہے، اس لئے نبی (صلى الله عليه وسلم) نے بھی فرمایا کہ عورتوں کی اکثریت اپنے خاوندوں کی ناشکری کرنے کی وجہ سے جہنم میں جائے گی (صحيح مسلم، العيدين أوائل كتاب الصلاة)","lang":"ur","meta":{"transliteration":"wa-idh ta-adhana rabbukum la-in shakartum la-azīdannakum wala-in kafartum inna ʿadhābī lashadīdun ","translations":["And when","proclaimed","your Lord","If","you are thankful","surely I will increase you","but if","you are ungrateful","indeed","My punishment","(is) surely severe","(7)"],"transliterationArr":["wa-idh","ta-adhana","rabbukum","la-in","shakartum","la-azīdannakum","wala-in","kafartum","inna","ʿadhābī","lashadīdun",null],"verseTiming":[[1,0,690],[2,690,1720],[3,1720,2830],[4,2830,3700],[5,3700,5160],[6,5160,8200],[7,8200,9090],[8,9090,10790],[9,10790,11840],[10,11840,13050],[11,13050,15515]]}},{"name":"14:8","price":"موسیٰ (علیہ السلام) نے کہا کہ اگر تم سب اور روئے زمین کے تمام انسان اللہ کی ناشکری کریں تو بھی اللہ بے نیاز اور تعریفوں(1) واﻻ ہے.","arabic":"وَقَالَ مُوسَىٰٓ إِن تَكۡفُرُوٓاْ أَنتُمۡ وَمَن فِي ٱلۡأَرۡضِ جَمِيعٗا فَإِنَّ ٱللَّهَ لَغَنِيٌّ حَمِيدٌ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim"],"ayahNumber":1758,"juzNumber":13,"footnotes":"(1) مطلب یہ ہے کہ انسان اللہ کی شکر گزاری کرے گا تو اس میں اسی کا فائدہ ہے۔ ناشکری کرے گا تو اللہ کا اس میں کیا نقصان ہے؟ وہ تو بےنیاز ہے سارا جہان ناشکرگزار ہو جائے تو اس کا کیا بگڑے گا جس طرح حدیث قدسی میں آتا ہے اللہ تعالٰی فرماتا ہے:۔ «يَا عِبَادِي لَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ، وَإِنْسَكُمْ وَجِنَّكُمْ، كَانُوا عَلَى أَتْقَى قَلْبِ رَجُلٍ مِنْكُمْ ، مَا زَادَ ذَلِكَ فِي مُلْكِي شَيْئًا، يَا عِبَادِي لَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ، وَإِنْسَكُمْ وَجِنَّكُمْ، كَانُوا عَلَى أَفْجَرِ قَلْبِ رَجُلٍ وَاحِدٍ , مَا نَقَصَ ذَلِكَ فِي مُلْكِي شَيْئًا ، يَا عِبَادِي لَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ، وَإِنْسَكُمْ وَجِنَّكُمْ، ، قَامُوا فِي صَعِيدٍ وَاحِدٍ فَسَأَلُونِي فَأَعْطَيْتُ كُلَّ إِنْسَانٍ مَسْأَلَتَهُ مَا نَقَصَ ذَلِكَ مِنْ مُلْكِي شَيْئًا إِلا كَمَا يُنْقِصُ الْمِخْيَطُ إِذَا أُدْخِلَ فِي الْبَحْرِ»۔(صحيح مسلم كتاب البر ، باب تحريم الظلم) ”اے میرے بندو! اگر تمہارے اوّل اور آخر اور اسی طرح تمام انسان اور جن، اس ایک آدمی کے دل کی طرح ہوجائیں، جو تم میں سب سے زیادہ متقی اور پرہزگار ہو، (یعنی کوئی بھی نافرمان نہ رہے) تو اس سے میری حکومت اور بادشاہی میں اضافہ نہیں ہوگا اے میرے بندو! اگر تمہارے اول و آخر اور تمام انسان اور جن ایک آدمی کے دل کی طرح ہوجائیں، جو تم میں سب سے بڑا نافرمان اور فاجر ہو تو اس سے میری حکومت اور بادشاہی میں کوئی کمی واقع نہیں ہوگی۔ اے میرے بندو! اگر تمہارے اول اور آخر اور انسان و جن، سب ایک میدان میں جمع ہوجائیں اور مجھ سے سوال کریں، پس میں ہر انسان کو اس کے سوال کے مطابق عطا کر دوں تو اس سے میرے خزانے اور بادشاہی میں اتنی ہی کمی ہوگی جتنی سوئی کے سمندر میں ڈبو کر نکالنے سے سمندر کے پانی میں ہوتی ہے“۔ فَسُبْحَانَهُ وَتعَالَى الْغَنِيُّ الْحَمِيدُ۔","lang":"ur","meta":{"transliteration":"waqāla mūsā in takfurū antum waman fī al-arḍi jamīʿan fa-inna al-laha laghaniyyun ḥamīdun ","translations":["And said","Musa","If","you disbelieve","you","and whoever","(is) in","the earth","all","then indeed","Allah","certainly (is) Free of need","Praiseworthy","(8)"],"transliterationArr":["waqāla","mūsā","in","takfurū","antum","waman","fī","al-arḍi","jamīʿan","fa-inna","al-laha","laghaniyyun","ḥamīdun",null],"verseTiming":[[1,0,1040],[2,1040,2870],[3,2870,4070],[4,4070,6130],[5,6130,7820],[6,7820,8900],[7,8900,9120],[8,9120,9970],[9,9970,11420],[10,11420,12620],[11,12620,13640],[12,13640,14880],[13,14880,17505]]}},{"name":"14:9","price":"کیا تمہارے پاس تم سے پہلے کے لوگوں کی خبریں نہیں آئیں؟ یعنی قوم نوح کی اور عاد وﺛمود کی اور ان کے بعد والوں کی جنہیں سوائے اللہ تعالیٰ کے اور کوئی نہیں جانتا، ان کے پاس ان کے رسول معجزے ﻻئے، لیکن انہوں نے اپنے ہاتھ اپنے منھ میں دبالیے(1) اور صاف کہہ دیا کہ جو کچھ تمہیں دے کر بھیجا گیا ہے ہم اس کے منکر ہیں اور جس چیز کی طرف تم ہمیں بلا رہے ہو ہمیں تو اس میں بڑا بھاری شبہ(2) ہے.","arabic":"أَلَمۡ يَأۡتِكُمۡ نَبَؤُاْ ٱلَّذِينَ مِن قَبۡلِكُمۡ قَوۡمِ نُوحٖ وَعَادٖ وَثَمُودَ وَٱلَّذِينَ مِنۢ بَعۡدِهِمۡ لَا يَعۡلَمُهُمۡ إِلَّا ٱللَّهُۚ جَآءَتۡهُمۡ رُسُلُهُم بِٱلۡبَيِّنَٰتِ فَرَدُّوٓاْ أَيۡدِيَهُمۡ فِيٓ أَفۡوَٰهِهِمۡ وَقَالُوٓاْ إِنَّا كَفَرۡنَا بِمَآ أُرۡسِلۡتُم بِهِۦ وَإِنَّا لَفِي شَكّٖ مِّمَّا تَدۡعُونَنَآ إِلَيۡهِ مُرِيبٖ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim"],"ayahNumber":1759,"juzNumber":13,"footnotes":"(1) مفسرین نے اس کے مختلف معانی بیان کئے ہیں مثلاً (1)انہوں نے اپنے ہاتھ اپنے منہوں میں رکھ لئے اور کہا ہمارا تو صرف ایک ہی جواب ہے کہ ہم تمہاری رسالت کے منکر ہیں، (2)۔ انہوں نے اپنی انگلیوں سے اپنے مونہوں کی طرف اشارہ کر کے کہا کہ خاموش رہو اور یہ جو پیغام لے کر آئے ہیں ان کی طرف توجہ مت کرو،(3)۔ انہوں نے اپنے ہاتھ رسولوں کے مونہوں پر استہزاءً اور تعجب کے طور پر رکھ لیے جس طرح کوئی شخص ہنسی ضبط کرنے کے لیے ایسا کرتا ہے۔ (4)۔ انہوں نے اپنے ہاتھ اپنے رسولوں کے مونہوں پر رکھ کر کہا خاموش رہو،۔(5)۔ بطور غیظ وغضب کے اپنے ہاتھ اپنے مونہوں میں لے لیے جس طرح منافقین کی بابت دوسرے مقام پر آتا ہے«عَضُّوا عَلَيْكُمُ الأَنَامِلَ مِنَ الْغَيْظِ» (آل عمران:119)۔ ”وہ تم پر اپنی انگلیاں غیظ وغضب سے کاٹتے ہیں“۔ امام شوکانی اور امام طبری نے اسی آخری معنی کو ترجیح دی ہے۔\n(2) مُرِيبٌ یعنی ایسا شک، کہ جس سے نفس سخت قلق اور اضطراب میں مبتلا ہے۔","lang":"ur","meta":{"transliteration":"alam yatikum naba-u alladhīna min qablikum qawmi nūḥin waʿādin wathamūda wa-alladhīna min baʿdihim lā yaʿlamuhum illā al-lahu jāathum rusuluhum bil-bayināti faraddū aydiyahum fī afwāhihim waqālū innā kafarnā bimā ur'sil'tum bihi wa-innā lafī shakkin mimmā tadʿūnanā ilayhi murībin ","translations":["Has not","come to you","(the) news","(of) those who","(were) before you","(were) before you","the people","of Nuh","and Aad","and Thamud","and those who","(were) after them","(were) after them","None","knows them","except","Allah","Came to them","their Messengers","with clear proofs","but they returned","their hands","in","their mouths","and they said","Indeed we","[we] disbelieve","in what","you have been sent","with [it]","and indeed, we","(are) surely in","doubt","about what","you invite us","to it","suspicious","(9)"],"transliterationArr":["alam","yatikum","naba-u","alladhīna","min","qablikum","qawmi","nūḥin","waʿādin","wathamūda","wa-alladhīna","min","baʿdihim","lā","yaʿlamuhum","illā","al-lahu","jāathum","rusuluhum","bil-bayināti","faraddū","aydiyahum","fī","afwāhihim","waqālū","innā","kafarnā","bimā","ur'sil'tum","bihi","wa-innā","lafī","shakkin","mimmā","tadʿūnanā","ilayhi","murībin",null],"verseTiming":[[1,0,630],[2,630,1770],[3,1770,2330],[4,2330,3470],[5,3470,4570],[6,4570,5670],[7,5670,6300],[8,6300,7460],[9,7460,9020],[10,9020,10070],[11,10070,11240],[12,11240,12660],[13,12660,14140],[14,14140,14620],[15,14620,16030],[16,16030,16570],[17,16570,18850],[18,18850,21960],[19,21960,23610],[20,23610,25330],[21,25330,27200],[22,27200,28560],[23,28560,30200],[24,30200,31600],[25,31600,32910],[26,32910,35630],[27,35630,36940],[28,36940,38130],[29,38130,39840],[30,39840,41570],[31,41570,42180],[32,42180,43780],[33,43780,44390],[34,44390,45210],[35,45210,47360],[36,47360,49360],[37,49360,51045],[38,51045,52655]]}},{"name":"14:10","price":"ان کے رسولوں نے انہیں کہا کہ کیا حق تعالیٰ کے بارے میں تمہیں شک ہے جو آسمانوں اور زمین کا بنانے واﻻ ہے وه تو تمہیں اس لئے بلا رہا ہے کہ تمہارے گناه معاف فرما دے(1) ، اور ایک مقرر وقت تک تمہیں مہلت عطا فرمائے، انہوں نے کہا کہ تم تو ہم جیسے ہی انسان ہو(2) تم چاہتے ہو کہ ہمیں ان خداؤں کی عبادت سے روک دو جن کی عبادت ہمارے باپ دادا کرتے رہے(3)۔ اچھا تو ہمارے سامنے کوئی کھلی دلیل پیش کرو.(4)","arabic":"۞ قَالَتۡ رُسُلُهُمۡ أَفِي ٱللَّهِ شَكّٞ فَاطِرِ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ يَدۡعُوكُمۡ لِيَغۡفِرَ لَكُم مِّن ذُنُوبِكُمۡ وَيُؤَخِّرَكُمۡ إِلَىٰٓ أَجَلٖ مُّسَمّٗىۚ قَالُوٓاْ إِنۡ أَنتُمۡ إِلَّا بَشَرٞ مِّثۡلُنَا تُرِيدُونَ أَن تَصُدُّونَا عَمَّا كَانَ يَعۡبُدُ ءَابَآؤُنَا فَأۡتُونَا بِسُلۡطَٰنٖ مُّبِينٖ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim"],"ayahNumber":1760,"juzNumber":13,"footnotes":"(1) یعنی تمہیں اللہ کے بارے میں شک ہے، جو آسمان و زمین کا خالق ہے۔ علاوہ ازیں وہ ایمان و توحید کی دعوت بھی صرف اس لئے دے رہا ہے کہ تمہیں گناہوں سے پاک کر دے۔ اس کے باوجود تم اس خالق ارض و سماء کو ماننے کے لئے تیار نہیں اور اس کی دعوت سے تمہیں انکار ہے؟۔\n(2) یہ وہی اشکال ہے جو کافروں کو پیش آتا رہا کہ انسان ہو کر کس طرح کوئی وحی الٰہی اور نبوت و رسالت کا مستحق ہو سکتا ہے؟۔\n(3) یہ دوسری رکاوٹ ہے کہ ہم ان معبودوں کی عبادت کس طرح چھوڑ دیں جن کی عبادت ہمارے آباء و اجداد کرتے رہے ہیں؟ جب کہ تمہارا مقصد ہمیں ان کی عبادت سے ہٹا کر اللہ واحد کی عبادت پر لگانا ہے۔\n(4) دلائل و معجزات تو ہر نبی کے ساتھ ہوتے تھے، اس سے مراد ایسی دلیل یا معجزہ ہے جس سے دیکھنے کے وہ آرزومند ہوتے تھے جیسے مشرکین مکہ نے حضور (صلى الله عليه وسلم) سے مختلف قسم کے معجزات طلب کئے تھے، جس کا تذکرہ بنی اسرائیل میں آئے گا۔","lang":"ur","meta":{"transliteration":"qālat rusuluhum afī al-lahi shakkun fāṭiri al-samāwāti wal-arḍi yadʿūkum liyaghfira lakum min dhunūbikum wayu-akhirakum ilā ajalin musamman qālū in antum illā basharun mith'lunā turīdūna an taṣuddūnā ʿammā kāna yaʿbudu ābāunā fatūnā bisul'ṭānin mubīnin ","translations":["Said","their Messengers","Can (there) be about","Allah","any doubt","(the) Creator","(of) the heavens","and the earth","He invites you","so that He may forgive","for you","[of]","your sins","and give you respite","for","a term","appointed","They said","Not","you","(are) but","a human","like us","you wish","to","hinder us","from what","used to","worship","our forefathers","So bring us","an authority","clear","(10)"],"transliterationArr":["qālat","rusuluhum","afī","al-lahi","shakkun","fāṭiri","al-samāwāti","wal-arḍi","yadʿūkum","liyaghfira","lakum","min","dhunūbikum","wayu-akhirakum","ilā","ajalin","musamman","qālū","in","antum","illā","basharun","mith'lunā","turīdūna","an","taṣuddūnā","ʿammā","kāna","yaʿbudu","ābāunā","fatūnā","bisul'ṭānin","mubīnin",null],"verseTiming":[[1,0,1153],[2,1153,2448],[3,2448,3004],[4,3004,3465],[5,3465,4530],[6,4530,5937],[7,5937,7467],[8,7467,8879],[9,8879,10321],[10,10321,11513],[11,11513,12307],[12,12307,13621],[13,13621,14971],[14,14971,16661],[15,16661,17578],[16,17578,19332],[17,19332,22020],[18,22020,23917],[19,23917,24433],[20,24433,25613],[21,25613,26568],[22,26568,29057],[23,29057,27473],[24,27473,30435],[25,30435,31210],[26,31210,32735],[27,32735,34018],[28,34018,34879],[29,34879,35886],[30,35886,38468],[31,38468,39915],[32,39915,41559],[33,41559,43313],[34,43313,46211]]}},{"name":"14:11","price":"ان کے پیغمبروں نے ان سے کہا کہ یہ تو سچ ہے کہ ہم تم جیسے ہی انسان ہیں لیکن اللہ تعالیٰ اپنے بندوں میں سے جس پر چاہتا ہے اپنا فضل کرتا ہے(1) ۔ اللہ کے حکم کے بغیر ہماری مجال نہیں کہ ہم کوئی معجزه تمہیں ﻻ دکھائیں(2) اور ایمان والوں کو صرف اللہ تعالیٰ ہی پر بھروسہ رکھنا چاہئے.(3)","arabic":"قَالَتۡ لَهُمۡ رُسُلُهُمۡ إِن نَّحۡنُ إِلَّا بَشَرٞ مِّثۡلُكُمۡ وَلَٰكِنَّ ٱللَّهَ يَمُنُّ عَلَىٰ مَن يَشَآءُ مِنۡ عِبَادِهِۦۖ وَمَا كَانَ لَنَآ أَن نَّأۡتِيَكُم بِسُلۡطَٰنٍ إِلَّا بِإِذۡنِ ٱللَّهِۚ وَعَلَى ٱللَّهِ فَلۡيَتَوَكَّلِ ٱلۡمُؤۡمِنُونَ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim"],"ayahNumber":1761,"juzNumber":13,"footnotes":"(1) رسولوں نے پہلے اشکال کا جواب دیا کہ یقینا ہم تمہارے جیسے بشر ہیں۔ لیکن تمہارا یہ سمجھنا غلط ہے کہ بشر رسول نہیں ہو سکتا۔ اللہ تعالٰی انسانوں کی ہدایت کے لئے انسانوں میں سے ہی بعض انسانوں کو وحی و رسالت کے لئے چن لیتا ہے اور تم سب میں سے یہ احسان اللہ نے ہم پر فرمایا ہے۔\n(2) ان کے حسب منشاء معجزے کے سلسلے میں رسولوں نے جواب دیا کہ معجزے کا صدور ہمارے اختیار میں نہیں، یہ صرف اللہ کے اختیار میں ہے۔\n(3) یہاں مومنیں سے مراد اولا خود انبیاء ہیں یعنی ہمیں سارا بھروسہ اللہ پر ہی رکھنا چاہیے جیسا کہ آگے فرمایا آخر کیا وجہ ہے کہ ہم اللہ پر بھروسہ نہ رکھیں۔","lang":"ur","meta":{"transliteration":"qālat lahum rusuluhum in naḥnu illā basharun mith'lukum walākinna al-laha yamunnu ʿalā man yashāu min ʿibādihi wamā kāna lanā an natiyakum bisul'ṭānin illā bi-idh'ni al-lahi waʿalā al-lahi falyatawakkali al-mu'minūna ","translations":["Said","to them","their Messengers","Not","we (are)","but","a human","like you","but","Allah","bestows His Grace","on","whom","He wills","of","His slaves","And not","is","for us","that","we bring you","an authority","except","by the permission of Allah","by the permission of Allah","And upon","Allah","so let put (their) trust","the believers","(11)"],"transliterationArr":["qālat","lahum","rusuluhum","in","naḥnu","illā","basharun","mith'lukum","walākinna","al-laha","yamunnu","ʿalā","man","yashāu","min","ʿibādihi","wamā","kāna","lanā","an","natiyakum","bisul'ṭānin","illā","bi-idh'ni","al-lahi","waʿalā","al-lahi","falyatawakkali","al-mu'minūna",null],"verseTiming":[[1,0,940],[2,940,1600],[3,1600,2720],[4,2720,2940],[5,2940,4470],[6,4470,5450],[7,5450,6050],[8,6050,7830],[9,7830,9620],[10,9620,10530],[11,10530,11920],[12,11920,12630],[13,12630,12780],[14,12780,15920],[15,15920,18420],[16,18420,19410],[17,19410,20820],[18,20820,21510],[19,21510,21850],[20,21850,24640],[21,24640,25110],[22,25110,26710],[23,26710,27340],[24,27340,28170],[25,28170,30030],[26,30030,30300],[27,30300,32660],[28,32660,34260],[29,34260,35090],[30,35090,35980],[31,35980,38600],[32,38600,39250],[33,39250,40170],[34,40170,41850],[35,41850,45005]]}},{"name":"14:12","price":"آخر کیا وجہ ہے کہ ہم اللہ تعالیٰ پر بھروسہ نہ رکھیں جبکہ اسی نے ہمیں ہماری راہیں سمجھائی ہیں۔ واللہ جو ایذائیں تم ہمیں دو گے ہم ان پر صبر ہی کریں گے۔ توکل کرنے والوں کو یہی ﻻئق ہے کہ اللہ ہی پر توکل کریں.(1)","arabic":"وَمَا لَنَآ أَلَّا نَتَوَكَّلَ عَلَى ٱللَّهِ وَقَدۡ هَدَىٰنَا سُبُلَنَاۚ وَلَنَصۡبِرَنَّ عَلَىٰ مَآ ءَاذَيۡتُمُونَاۚ وَعَلَى ٱللَّهِ فَلۡيَتَوَكَّلِ ٱلۡمُتَوَكِّلُونَ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim"],"ayahNumber":1762,"juzNumber":13,"footnotes":"(1) کہ وہی کفار کی شرارتوں اور سفاہتوں سے بچانے والا ہے۔ یہ مطلب بھی ہو سکتا ہے کہ ہم سے معجزات طلب نہ کریں، اللہ پر توکل کریں، اس کی مشیت ہوگی تو معجزہ ظاہر فرما دے گا ورنہ نہیں۔","lang":"ur","meta":{"transliteration":"wamā lanā allā natawakkala ʿalā al-lahi waqad hadānā subulanā walanaṣbiranna ʿalā mā ādhaytumūnā waʿalā al-lahi falyatawakkali al-mutawakilūna ","translations":["And what","(is) for us","that not","we put our trust","upon","Allah","while certainly","He has guided us","to our ways","And surely we will bear with patience","on","what","harm you may cause us","And upon","Allah","so let put (their) trust","the ones who put (their) trust","(12)"],"transliterationArr":["wamā","lanā","allā","natawakkala","ʿalā","al-lahi","waqad","hadānā","subulanā","walanaṣbiranna","ʿalā","mā","ādhaytumūnā","waʿalā","al-lahi","falyatawakkali","al-mutawakilūna",null],"verseTiming":[[1,0,800],[2,800,3229],[3,3229,4199],[4,4199,5599],[5,5599,5929],[6,5929,6929],[7,6929,7639],[8,7639,8729],[9,8729,10009],[10,10009,12579],[11,12579,13379],[12,13379,15139],[13,15139,17259],[14,17259,18229],[15,18229,19219],[16,19219,21019],[17,21019,24554]]}},{"name":"14:13","price":"کافروں نے اپنے رسولوں سے کہا کہ ہم تمہیں ملک بدر کر دیں گے یا تم پھر سے ہمارے مذہب میں لوٹ آؤ۔ تو ان کے پروردگار نے ان کی طرف وحی بھیجی کہ ہم ان ﻇالموں کو ہی غارت کر دیں گے.(1)","arabic":"وَقَالَ ٱلَّذِينَ كَفَرُواْ لِرُسُلِهِمۡ لَنُخۡرِجَنَّكُم مِّنۡ أَرۡضِنَآ أَوۡ لَتَعُودُنَّ فِي مِلَّتِنَاۖ فَأَوۡحَىٰٓ إِلَيۡهِمۡ رَبُّهُمۡ لَنُهۡلِكَنَّ ٱلظَّٰلِمِينَ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim"],"ayahNumber":1763,"juzNumber":13,"footnotes":"(1) جیسے اور بھی کئی مقامات پر اللہ تعالٰی نے فرمایا :«وَلَقَدْ سَبَقَتْ كَلِمَتُنَا لِعِبَادِنَا الْمُرْسَلِينَ (1) إِنَّهُمْ لَهُمُ الْمَنْصُورُونَ (1) وَإِنَّ جُنْدَنَا لَهُمُ الْغَالِبُونَ» ( سورة الصافات: 171-173)۔ ”اور پہلے ہو چکا ہمارا حکم اپنے ان بندوں کے حق میں جو رسول ہیں کہ بیشک وہ منصور اور کامیاب ہونگے اور ہمارا لشکر بھی غالب ہوگا“ «كَتَبَ اللَّهُ لأَغْلِبَنَّ أَنَا وَرُسُلِي» (المجادلة ۔21)۔ ”اور اللہ نے یہ بات لکھ دی ہے کہ میں اور میرے رسول ہی غالب ہونگے“۔","lang":"ur","meta":{"transliteration":"waqāla alladhīna kafarū lirusulihim lanukh'rijannakum min arḍinā aw lataʿūdunna fī millatinā fa-awḥā ilayhim rabbuhum lanuh'likanna al-ẓālimīna ","translations":["And said","those who","disbelieved","to their Messengers","Surely we will drive you out","of","our land","or","surely you should return","to","our religion","So inspired","to them","their Lord","We will surely destroy","the wrongdoers","(13)"],"transliterationArr":["waqāla","alladhīna","kafarū","lirusulihim","lanukh'rijannakum","min","arḍinā","aw","lataʿūdunna","fī","millatinā","fa-awḥā","ilayhim","rabbuhum","lanuh'likanna","al-ẓālimīna",null],"verseTiming":[[1,0,870],[2,870,2050],[3,2050,3010],[4,3010,4270],[5,4270,7100],[6,7100,7900],[7,7900,10200],[8,10200,10650],[9,10650,13010],[10,13010,13490],[11,13490,14950],[12,14950,17990],[13,17990,19130],[14,19130,20380],[15,20380,22540],[16,22540,25235]]}},{"name":"14:14","price":"اور ان کے بعد ہم خود تمہیں اس زمین میں بسائیں گے(1) ۔ یہ ہے ان کے لئے جو میرے سامنے کھڑے ہونے کا ڈر رکھیں اور میری وعید سے خوفزده رہیں.(2)","arabic":"وَلَنُسۡكِنَنَّكُمُ ٱلۡأَرۡضَ مِنۢ بَعۡدِهِمۡۚ ذَٰلِكَ لِمَنۡ خَافَ مَقَامِي وَخَافَ وَعِيدِ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim"],"ayahNumber":1764,"juzNumber":13,"footnotes":"(1) یہ مضمون بھی اللہ نے کئی مقامات پر بیان فرمایا ہے مثلاً، «وَلَقَدْ كَتَبْنَا فِي الزَّبُورِ مِنْ بَعْدِ الذِّكْرِ أَنَّ الأَرْضَ يَرِثُهَا عِبَادِيَ الصَّالِحُونَ» (الأنبياء:105) ۔ ”ہم نے لکھ دیا زبور میں، نصیحت کے پیچھے کہ آخر زمین کے وارث ہوں گے میرے نیک بندے“۔ (مزید دیکھئے سورۃ الاعراف: 128، 137) چنانچہ اس کے مطابق اللہ تعالٰی نے نبی کریم (صلى الله عليه وسلم) کی مدد فرمائی، آپ کو با دل نخواستہ مکے سے نکلنا پڑا لیکن چند سالوں بعد ہی آپ فاتحانہ مکے میں داخل ہوئے اور آپ کو نکلنے پر مجبور کرنے والے ظالم مشرکین سر جھکائے، کھڑے آپ کے اشارہ ابرو کے منتظر تھے لیکن آپ (صلى الله عليه وسلم)نے خلق عظیم کا مظاہرہ کرتے ہوئے «لَا تَثْرِيْبَ عَلَيْكُمُ» (یوسف:92) کہہ کر سب کو معاف فرما دیا۔ صَلَوَاتُ اللهِ وَسَلاَمُهُ عَلَيْهِ\n(2) جس طرح دوسرے مقام پر فرمایا۔«وَأَمَّا مَنْ خَافَ مَقَامَ رَبِّهِ وَنَهَى النَّفْسَ عَنِ الْهَوَى ، فَإِنَّ الْجَنَّةَ هِيَ الْمَأْوَى» ( النازعات: 40-41)۔ ”جو اپنے رب کے سامنے کھڑا ہونے سے ڈر گیا اور اپنے نفس کو خواہش سے روکے رکھا یقینا جنت اس کا ٹھکانہ ہے“۔ «وَلِمَنْ خَافَ مَقَامَ رَبِّهِ جَنَّتَانِ» (النازعات :46)۔ ”جو اپنے رب کے سامنے کھڑا ہونے سے ڈر گیا اس کے لیے دو جنتیں ہیں“۔","lang":"ur","meta":{"transliteration":"walanus'kinannakumu al-arḍa min baʿdihim dhālika liman khāfa maqāmī wakhāfa waʿīdi ","translations":["And surely We will make you dwell","(in) the land","after them","after them","That","(is) for whoever","fears","standing before Me","and fears","My Threat","(14)"],"transliterationArr":["walanus'kinannakumu","al-arḍa","min","baʿdihim","dhālika","liman","khāfa","maqāmī","wakhāfa","waʿīdi",null],"verseTiming":[[1,0,2820],[2,2820,3760],[3,3760,4830],[4,4830,6360],[5,6360,7380],[6,7380,7880],[7,7880,8760],[8,8760,9970],[9,9970,10900],[10,10900,13215]]}},{"name":"14:15","price":"اور انہوں نے فیصلہ طلب کیا(1) اور تمام سرکش ضدی لوگ نامراد ہوگئے.","arabic":"وَٱسۡتَفۡتَحُواْ وَخَابَ كُلُّ جَبَّارٍ عَنِيدٖ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim"],"ayahNumber":1765,"juzNumber":13,"footnotes":"اس کا فاعل ظالم مشرک بھی ہو سکتے ہیں کہ انہوں نے بالآخر اللہ سے فیصلہ طلب کیا۔ یعنی اگر یہ رسول سچے ہیں تو یا اللہ ہم کو اپنے عذاب کے ذریعے سے ہلاک کر دے جیسے مشرکین مکہ نے کہا «اللّٰهُمَّ اِنْ كَانَ هٰذَا هُوَ الْحَقَّ مِنْ عِنْدِكَ فَاَمْطِرْ عَلَيْنَا حِجَارَةً مِّنَ السَّمَاۗءِ اَوِ ائْتِنَا بِعَذَابٍ اَلِيْمٍ» (الانفال:32) ”اور جب کہ ان لوگوں نے کہا، اے اللہ! اگر یہ قرآن آپ کی طرف سے واقعی ہے تو ہم پر آسمان سے پتھر برسا، یا ہم پر کوئی دردناک عذاب واقع کر دے“۔ جس طرح جنگ بدر کے موقع پر مشرکین مکہ نے اس قسم کی آرزو کی تھی جس کا ذکر اللہ نے (انفال:19) میں کیا ہے یا اس کا فاعل رسول ہوں کہ انہوں نے اللہ سے فتح و نصرت کی دعائیں کیں، جنہیں اللہ نے قبول کیا۔","lang":"ur","meta":{"transliteration":"wa-is'taftaḥū wakhāba kullu jabbārin ʿanīdin ","translations":["And they sought victory","and disappointed","every","tyrant","obstinate","(15)"],"transliterationArr":["wa-is'taftaḥū","wakhāba","kullu","jabbārin","ʿanīdin",null],"verseTiming":[[1,0,1700],[2,1700,2530],[3,2530,3280],[4,3280,4590],[5,4590,7005]]}},{"name":"14:16","price":"اس کے سامنے دوزخ ہے جہاں وه پیﭗ کا پانی پلایا جائے گا.(1)","arabic":"مِّن وَرَآئِهِۦ جَهَنَّمُ وَيُسۡقَىٰ مِن مَّآءٖ صَدِيدٖ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim"],"ayahNumber":1766,"juzNumber":13,"footnotes":"(1) صَدِیْد، پیپ اور خون جو جہنمیوں کے گوشت اور ان کی کھالوں سے بہا ہوگا۔ بعض احادیث میں اسے عُصَارَةُ أَهْلِ النَّارِ (ﻣﺴﻨﺪ ﺍﺣﻤﺪ ﺟﻠﺪ ۔ ٥، ﺻﻔﺤﮧ ١٧١) (جہنمیوں کے جسم سے نچوڑا ہوا) اور بعض احادیث میں ہے یہ صدید اتنا گرم اور کھولتا ہوا ہوگا کہ ان کے منہ کے قریب پہنچتے ہی ان کے چہرے کی کھال جھلس کر گر پڑے گی اور اس کا ایک گھونٹ پیتے ہی ان کے پیٹ کی آنتیں پاخانے کے راستے باہر نکل پڑیں گی۔ أَعَاذَنَا اللهُ مِنْهُ","lang":"ur","meta":{"transliteration":"min warāihi jahannamu wayus'qā min māin ṣadīdin ","translations":["of him","Ahead","(is) Hell","and he will be made to drink","of","water","purulent","(16)"],"transliterationArr":["min","warāihi","jahannamu","wayus'qā","min","māin","ṣadīdin",null],"verseTiming":[[1,0,470],[2,470,4050],[3,4050,5740],[4,5740,6990],[5,6990,7270],[6,7270,11540],[7,11540,14115]]}},{"name":"14:17","price":"جسے بمشکل گھونٹ گھونٹ پئے گا۔ پھر بھی اسے گلے سے اتار نہ سکے گا اور اسے ہر جگہ سے موت آتی دکھائی دے گی لیکن وه مرنے واﻻ نہیں(1) ۔ پھر اس کے پیچھے بھی سخت عذاب ہے.","arabic":"يَتَجَرَّعُهُۥ وَلَا يَكَادُ يُسِيغُهُۥ وَيَأۡتِيهِ ٱلۡمَوۡتُ مِن كُلِّ مَكَانٖ وَمَا هُوَ بِمَيِّتٖۖ وَمِن وَرَآئِهِۦ عَذَابٌ غَلِيظٞ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim"],"ayahNumber":1767,"juzNumber":13,"footnotes":"(1) یعنی انواع و اقسام کے عذاب چکھ چکھ کر وہ موت کی آرزو کرے گا۔ لیکن، موت وہاں کہاں؟ وہاں تو اسی طرح دائمی عذاب ہوگا۔","lang":"ur","meta":{"transliteration":"yatajarraʿuhu walā yakādu yusīghuhu wayatīhi al-mawtu min kulli makānin wamā huwa bimayyitin wamin warāihi ʿadhābun ghalīẓun ","translations":["He will sip it","but not","he will be near","(to) swallowing it","And will come to him","the death","from","every","side","but not","he","will die","And ahead of him","And ahead of him","(is) a punishment","harsh","(17)"],"transliterationArr":["yatajarraʿuhu","walā","yakādu","yusīghuhu","wayatīhi","al-mawtu","min","kulli","makānin","wamā","huwa","bimayyitin","wamin","warāihi","ʿadhābun","ghalīẓun",null],"verseTiming":[[1,0,2000],[2,2000,2620],[3,2620,3530],[4,3530,5030],[5,5030,6370],[6,6370,9060],[7,9060,10410],[8,10410,11320],[9,11320,12220],[10,12220,13040],[11,13040,15020],[12,15020,15610],[13,15610,16070],[14,16070,17310],[15,17310,18950],[16,18950,21930],[17,21930,23140],[18,23140,26195]]}},{"name":"14:18","price":"ان لوگوں کی مثال جنہوں نے اپنے پالنے والے سے کفر کیا، ان کے اعمال مثل اس راکھ کے ہیں جس پر تیز ہوا آندھی والے دن چلے(1) ۔ جو بھی انہوں نے کیا اس میں سے کسی چیز پر قادر نہ ہوں گے، یہی دور کی گمراہی ہے.","arabic":"مَّثَلُ ٱلَّذِينَ كَفَرُواْ بِرَبِّهِمۡۖ أَعۡمَٰلُهُمۡ كَرَمَادٍ ٱشۡتَدَّتۡ بِهِ ٱلرِّيحُ فِي يَوۡمٍ عَاصِفٖۖ لَّا يَقۡدِرُونَ مِمَّا كَسَبُواْ عَلَىٰ شَيۡءٖۚ ذَٰلِكَ هُوَ ٱلضَّلَٰلُ ٱلۡبَعِيدُ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim"],"ayahNumber":1768,"juzNumber":13,"footnotes":"(1) قیامت والے دن کافروں کے عملوں کا بھی یہی حال ہوگا کہ اس کا کوئی اجر و ثواب انہیں نہیں ملے گا۔","lang":"ur","meta":{"transliteration":"mathalu alladhīna kafarū birabbihim aʿmāluhum karamādin ish'taddat bihi al-rīḥu fī yawmin ʿāṣifin lā yaqdirūna mimmā kasabū ʿalā shayin dhālika huwa al-ḍalālu al-baʿīdu ","translations":["(The) example","(of) those who","disbelieve","in their Lord","their deeds","(are) like ashes","blows furiously","on it","the wind","in","a day","stormy","No","control (they have)","of what","they have earned","on","anything","That","[it]","(is) the straying","far","(18)"],"transliterationArr":["mathalu","alladhīna","kafarū","birabbihim","aʿmāluhum","karamādin","ish'taddat","bihi","al-rīḥu","fī","yawmin","ʿāṣifin","lā","yaqdirūna","mimmā","kasabū","ʿalā","shayin","dhālika","huwa","al-ḍalālu","al-baʿīdu",null],"verseTiming":[[1,0,730],[2,730,1860],[3,1860,2810],[4,2810,4790],[5,4790,5614],[6,5614,6907],[7,6907,8120],[8,8120,8618],[9,8618,9663],[10,9663,10700],[11,10700,10886],[12,10886,12301],[13,12301,12892],[14,12892,14198],[15,14198,15500],[16,15500,16543],[17,16543,17582],[18,17582,19434],[19,19434,20682],[20,20682,21454],[21,21454,22205],[22,22205,24491]]}},{"name":"14:19","price":"کیا تو نے نہیں دیکھا کہ اللہ تعالیٰ نے آسمانوں کو اور زمین کو بہترین تدبیر کے ساتھ پیدا کیا ہے۔ اگر وه چاہے تو تم سب کو فنا کردے اور نئی مخلوق ﻻئے.","arabic":"أَلَمۡ تَرَ أَنَّ ٱللَّهَ خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ بِٱلۡحَقِّۚ إِن يَشَأۡ يُذۡهِبۡكُمۡ وَيَأۡتِ بِخَلۡقٖ جَدِيدٖ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim"],"ayahNumber":1769,"juzNumber":13,"footnotes":"","lang":"ur","meta":{"transliteration":"alam tara anna al-laha khalaqa al-samāwāti wal-arḍa bil-ḥaqi in yasha yudh'hib'kum wayati bikhalqin jadīdin ","translations":["Do not","you see","that","Allah","created","the heavens","and the earth","in truth","If","He wills","He can remove you","and bring","a creation","new","(19)"],"transliterationArr":["alam","tara","anna","al-laha","khalaqa","al-samāwāti","wal-arḍa","bil-ḥaqi","in","yasha","yudh'hib'kum","wayati","bikhalqin","jadīdin",null],"verseTiming":[[1,0,650],[2,650,1200],[3,1200,2360],[4,2360,2493],[5,2493,3000],[6,3000,4613],[7,4613,5906],[8,5906,7205],[9,7205,8134],[10,8134,8830],[11,8830,10155],[12,10155,11314],[13,11314,12724],[14,12724,15339]]}},{"name":"14:20","price":"اللہ پر یہ کام کچھ بھی مشکل نہیں.(1)","arabic":"وَمَا ذَٰلِكَ عَلَى ٱللَّهِ بِعَزِيزٖ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim"],"ayahNumber":1770,"juzNumber":13,"footnotes":"(1) یعنی اگر تم نافرمانیوں سے باز نہ آئے تو اللہ تعالٰی اس پر قادر ہے کہ وہ تمہیں ہلاک کر کے، تمہاری جگہ نئی مخلوق پیدا کر دے۔","lang":"ur","meta":{"transliteration":"wamā dhālika ʿalā al-lahi biʿazīzin ","translations":["And not","(is) that","on","Allah","great","(20)"],"transliterationArr":["wamā","dhālika","ʿalā","al-lahi","biʿazīzin",null],"verseTiming":[[1,0,720],[2,720,1760],[3,1760,2100],[4,2100,3070],[5,3070,5645]]}},{"name":"14:21","price":"سب کے سب اللہ کے سامنے روبرو کھڑے ہوں گے(1) ۔ اس وقت کمزور لوگ بڑائی والوں سے کہیں گے کہ ہم تو تمہارے تابعدار تھے، تو کیا تم اللہ کے عذابوں میں سے کچھ عذاب ہم سے دور کرسکنے والے ہو؟ وه جواب دیں گے کہ اگر اللہ ہمیں ہدایت دیتا تو ہم بھی ضرور تمہاری رہنمائی کرتے، اب تو ہم پر بے قراری کرنا اور صبر کرنا دونوں ہی برابر ہے ہمارے لیے کوئی چھٹکارا نہیں.(2)","arabic":"وَبَرَزُواْ لِلَّهِ جَمِيعٗا فَقَالَ ٱلضُّعَفَٰٓؤُاْ لِلَّذِينَ ٱسۡتَكۡبَرُوٓاْ إِنَّا كُنَّا لَكُمۡ تَبَعٗا فَهَلۡ أَنتُم مُّغۡنُونَ عَنَّا مِنۡ عَذَابِ ٱللَّهِ مِن شَيۡءٖۚ قَالُواْ لَوۡ هَدَىٰنَا ٱللَّهُ لَهَدَيۡنَٰكُمۡۖ سَوَآءٌ عَلَيۡنَآ أَجَزِعۡنَآ أَمۡ صَبَرۡنَا مَا لَنَا مِن مَّحِيصٖ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim"],"ayahNumber":1771,"juzNumber":13,"footnotes":"(1) یعنی سب میدان محشر میں اللہ کے ربرو ہوں گے، کوئی کہیں چھپ نہ سکے گا۔\n(2) بعض کہتے ہیں کہ جہنمی آپس میں کہیں گے کہ جنتیوں کو جنت اس لئے ملی کہ وہ اللہ کے سامنے روتے اور گڑگڑاتے تھے، آؤ ہم بھی اللہ کی بارگاہ میں آہو زاری کریں چنانچہ وہ روئیں گے اور خوب آہو زاری کریں گے۔ لیکن اس کا کوئی فائدہ نہیں ہوگا، پھر کہیں گے کہ جنتیوں کو جنت ان کے صبر کرنے کی وجہ سے ملی، چلو ہم بھی صبر کرتے ہیں، وہ صبر کا بھرپور مظاہرہ کریں گے، لیکن اس کا بھی کوئی فائدہ نہیں ہوگا، پس اس وقت کہیں گے ہم صبر کریں یا جزع و فزع، اب چھٹکارے کی کوئی صورت نہیں۔ یہ ان کی باہمی گفتگو جہنم کے اندر ہوگی۔ قرآن کریم میں اس کو اور بھی کئی جگہ بیان کیا گیا ہے مثلاً سورہ مؤمن (48-47) سورہ اعراف (39-38) سورہ الاحزاب (68-66) اس کے علاوہ آپس میں جھگڑیں گے بھی اور ایک دوسرے پر گمراہ کرنے کا الزام دھریں گے۔ امام ابن کثیر فرماتے ہیں کہ جھگڑا میدان محشر میں ہوگا۔ اس کی مزید تفصیل اللہ تعالٰی نے سورہ سبا (31 ۔ 33) میں بیان فرمائی ہے۔","lang":"ur","meta":{"transliteration":"wabarazū lillahi jamīʿan faqāla al-ḍuʿafāu lilladhīna is'takbarū innā kunnā lakum tabaʿan fahal antum mugh'nūna ʿannā min ʿadhābi al-lahi min shayin qālū law hadānā al-lahu lahadaynākum sawāon ʿalaynā ajaziʿ'nā am ṣabarnā mā lanā min maḥīṣin ","translations":["And they will come forth","before Allah","all together","then will say","the weak","to those who","were arrogant","Indeed we","we were","your","followers","so can","you (be)","the one who avails","us","from","(the) punishment","(of) Allah","anything","anything","They will say","If","Allah had guided us","Allah had guided us","surely we would have guided you","(It is) same","for us","whether we show intolerance","or","we are patient","not","(is) for us","any","place of escape","(21)"],"transliterationArr":["wabarazū","lillahi","jamīʿan","faqāla","al-ḍuʿafāu","lilladhīna","is'takbarū","innā","kunnā","lakum","tabaʿan","fahal","antum","mugh'nūna","ʿannā","min","ʿadhābi","al-lahi","min","shayin","qālū","law","hadānā","al-lahu","lahadaynākum","sawāon","ʿalaynā","ajaziʿ'nā","am","ṣabarnā","mā","lanā","min","maḥīṣin",null],"verseTiming":[[1,0,1140],[2,1140,2270],[3,2270,3900],[4,3900,4880],[5,4880,8030],[6,8030,9270],[7,9270,10750],[8,10750,12190],[9,12190,15080],[10,15080,16240],[11,16240,19150],[12,19150,20470],[13,20470,22110],[14,22110,22830],[15,22830,24070],[16,24070,24810],[17,24810,27030],[18,27030,27660],[19,27660,29370],[20,29370,30730],[21,30730,32320],[22,32320,32690],[23,32690,33640],[24,33640,34620],[25,34620,34990],[26,34990,38560],[27,38560,39400],[28,39400,39860],[29,39860,40730],[30,40730,41740],[31,41740,43920],[32,43920,46140],[33,46140,48450],[34,48450,51140],[35,51140,51480],[36,51480,52650],[37,52650,52900],[38,52900,53910],[39,53910,54800],[40,54800,56865]]}},{"name":"14:22","price":"جب اور کام کا فیصلہ کردیا جائے گا تو شیطان(1) کہے گا کہ اللہ نے تو تمہیں سچا وعده دیا تھا اور میں نے تم سے جو وعدے کیے تھے ان کے خلاف کیا(2)، میرا تم پر کوئی دباؤ تو تھا ہی نہیں(3)، ہاں میں نے تمہیں پکارا اور تم نے میری مان لی(4)، پس تم مجھے الزام نہ لگاؤ بلکہ خود اپنے آپ کو ملامت کرو(5)، نہ میں تمہارا فریاد رس اور نہ تم میری فریاد کو پہنچنے والے(6)، میں تو سرے سے مانتا ہی نہیں کہ تم مجھے اس سے پہلے اللہ کا شریک مانتے رہے(7)، یقیناً ﻇالموں کے لیے دردناک عذاب ہے.(8)","arabic":"وَقَالَ ٱلشَّيۡطَٰنُ لَمَّا قُضِيَ ٱلۡأَمۡرُ إِنَّ ٱللَّهَ وَعَدَكُمۡ وَعۡدَ ٱلۡحَقِّ وَوَعَدتُّكُمۡ فَأَخۡلَفۡتُكُمۡۖ وَمَا كَانَ لِيَ عَلَيۡكُم مِّن سُلۡطَٰنٍ إِلَّآ أَن دَعَوۡتُكُمۡ فَٱسۡتَجَبۡتُمۡ لِيۖ فَلَا تَلُومُونِي وَلُومُوٓاْ أَنفُسَكُمۖ مَّآ أَنَا۠ بِمُصۡرِخِكُمۡ وَمَآ أَنتُم بِمُصۡرِخِيَّ إِنِّي كَفَرۡتُ بِمَآ أَشۡرَكۡتُمُونِ مِن قَبۡلُۗ إِنَّ ٱلظَّٰلِمِينَ لَهُمۡ عَذَابٌ أَلِيمٞ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim"],"ayahNumber":1772,"juzNumber":13,"footnotes":"(1) یعنی اہل ایمان جنت میں اور اہل کفر و شرک جہنم میں چلے جائیں گے تو شیطان جہنمیوں سے کہے گا۔\n(2) اللہ نے جو وعدے اپنے پیغمبروں کے ذریعے سے کئے تھے کہ نجات میرے پیغمبروں پر ایمان لانے میں ہے۔ وہ حق پر تھے ان کے مقابلے میں میرے وعدے تو سراسر دھوکا اور فریب تھے۔ جس طرح اللہ نے فرمایا «يَعِدُهُمْ وَيُمَنِّيهِمْ وَمَا يَعِدُهُمُ الشَّيْطَانُ إِلا غُرُورًا» ( النساء:120) ”شیطان ان سے وعدے کرتا ہے اور آرزوئیں دلاتا ہے لیکن شیطان کے یہ وعدے محض دھوکا ہیں“۔\n(3) دوسرا یہ کہ میری باتوں میں کوئی دلیل و حجت نہیں ہوتی تھی، نہ میرا کوئی دباؤ ہی تم پر تھا۔\n(4) ہاں میری دعوت اور پکار تھی، تم نے میری بےدلیل پکار کو مان لیا اور پیغمبروں کی دلیل و حجت سے بھرپور باتوں کو رد کر دیا۔\n(5) اس لئے قصور سارا تمہارا اپنا ہی ہے تم نے عقل و شعور سے ذرا کام نہ لیا، دلائل واضحہ کو تم نے نظر انداز کر دیا، اور مجرد دعوے کے پیچھے لگ رہے، جس کی پشت پر کوئی دلیل نہیں۔\n(6) یعنی نہ میں تمہیں عذاب سے نکلوا سکتا ہوں جس میں تم مبتلا ہو اور نہ تم اس قہر و غضب سے مجھے بچا سکتے ہو جو اللہ کی طرف سے مجھ پر ہے۔\n(7) مجھے اس بات سے بھی انکار ہے کہ میں اللہ کا شریک ہوں، اگر تم مجھے یا کسے اور کو اللہ کا شریک گردانتے رہے تو تمہاری اپنی غلطی اور نادانی تھی، جس اللہ نے ساری کائنات بنائی تھی اور اس کی تدبیر بھی وہی کرتا رہا، بھلا اس کا کوئی شریک کیونکر ہو سکتا تھا۔\n(8) بعض کہتے ہیں کہ یہ جملہ بھی شیطان ہی کا ہے اور یہ اس کے مذکورہ خطبے کا تتمہ ہے۔ بعض کہتے ہیں کہ شیطان کا کلام مِنْ قَبْلُ پر ختم ہوگیا، یہ اللہ کا کلام ہے۔","lang":"ur","meta":{"transliteration":"waqāla al-shayṭānu lammā quḍiya al-amru inna al-laha waʿadakum waʿda al-ḥaqi wawaʿadttukum fa-akhlaftukum wamā kāna liya ʿalaykum min sul'ṭānin illā an daʿawtukum fa-is'tajabtum lī falā talūmūnī walūmū anfusakum mā anā bimuṣ'rikhikum wamā antum bimuṣ'rikhiyya innī kafartu bimā ashraktumūni min qablu inna al-ẓālimīna lahum ʿadhābun alīmun ","translations":["And will say","the Shaitaan","when","has been decided","the matter","Indeed","Allah","promised you","a promise","(of) truth","And I promised you","but I betrayed you","But not","I had","I had","over you","any","authority","except","that","I invited you","and you responded","to me","So (do) not","blame me","but blame","yourselves","Not","(can) I","(be) your helper","and not","you (can)","(be) my helper","Indeed, I","deny","[of what]","your association of me (with Allah)","before","before","Indeed","the wrongdoers","for them","(is) a punishment","painful","(22)"],"transliterationArr":["waqāla","al-shayṭānu","lammā","quḍiya","al-amru","inna","al-laha","waʿadakum","waʿda","al-ḥaqi","wawaʿadttukum","fa-akhlaftukum","wamā","kāna","liya","ʿalaykum","min","sul'ṭānin","illā","an","daʿawtukum","fa-is'tajabtum","lī","falā","talūmūnī","walūmū","anfusakum","mā","anā","bimuṣ'rikhikum","wamā","antum","bimuṣ'rikhiyya","innī","kafartu","bimā","ashraktumūni","min","qablu","inna","al-ẓālimīna","lahum","ʿadhābun","alīmun",null],"verseTiming":[[1,0,990],[2,990,2520],[3,2520,3880],[4,3880,4570],[5,4570,5500],[6,5500,6580],[7,6580,7650],[8,7650,8800],[9,8800,9460],[10,9460,10450],[11,10450,11970],[12,11970,14170],[13,14170,15060],[14,15060,15740],[15,15740,16200],[16,16200,17290],[17,17290,18910],[18,18910,20350],[19,20350,22380],[20,22380,23160],[21,23160,24490],[22,24490,26210],[23,26210,27170],[24,27170,27850],[25,27850,29440],[26,29440,32080],[27,32080,34580],[28,34580,37009],[29,37009,37439],[30,37439,39019],[31,39019,39779],[32,39779,43729],[33,43729,45229],[34,45229,46350],[35,46350,47328],[36,47328,49231],[37,49231,51006],[38,51006,51884],[39,51884,53140],[40,53140,54490],[41,54490,56185],[42,56185,56890],[43,56890,58079],[44,58079,59459]]}},{"name":"14:23","price":"جو لوگ ایمان ﻻئے اور نیک عمل کیے وه ان جنتوں میں داخل کیے جائیں گے جن کے نیچے چشمے جاری ہیں جہاں انہیں ہمیشگی ہوگی اپنے رب کے حکم سے(1) ۔ جہاں ان کا خیر مقدم سلام سے ہوگا.(2)","arabic":"وَأُدۡخِلَ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَا بِإِذۡنِ رَبِّهِمۡۖ تَحِيَّتُهُمۡ فِيهَا سَلَٰمٌ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim"],"ayahNumber":1773,"juzNumber":13,"footnotes":"(1) یہ اہل شقاوت و اہل کفر کے مقابلے میں اہل سعادت اور اہل ایمان کا تذکرہ ہے۔ ان کا ذکر ان کے ساتھ اس لئے کیا گیا ہے تاکہ لوگوں کے اندر اہل ایمان والا کردار اپنانے کا شوق و رغبت پیدا ہو۔\n(2) یعنی آپس میں ان کا تحفہ ایک دوسرے کو سلام کرنا ہوگا۔ علاوہ ازیں فرشتے بھی ہر ہر دروازے سے داخل ہو ہو کر انہیں سلام عرض کریں گے۔","lang":"ur","meta":{"transliteration":"wa-ud'khila alladhīna āmanū waʿamilū al-ṣāliḥāti jannātin tajrī min taḥtihā al-anhāru khālidīna fīhā bi-idh'ni rabbihim taḥiyyatuhum fīhā salāmun ","translations":["And will be admitted","those who","believed","and did","righteous deeds","(to) Gardens","flows","from","underneath it","the rivers","(will) abide forever","in it","by the permission","(of) their Lord","their greetings","therein","(will be) peace","(23)"],"transliterationArr":["wa-ud'khila","alladhīna","āmanū","waʿamilū","al-ṣāliḥāti","jannātin","tajrī","min","taḥtihā","al-anhāru","khālidīna","fīhā","bi-idh'ni","rabbihim","taḥiyyatuhum","fīhā","salāmun",null],"verseTiming":[[1,0,1140],[2,1140,2300],[3,2300,3580],[4,3580,4360],[5,4360,6060],[6,6060,9540],[7,9540,11320],[8,11320,12960],[9,12960,13450],[10,13450,14224],[11,14224,15563],[12,15563,17050],[13,17050,17892],[14,17892,18942],[15,18942,20432],[16,20432,22205],[17,22205,22808],[18,22808,23658],[19,23658,24979],[20,24979,26854],[21,26854,27825],[22,27825,29956]]}},{"name":"14:24","price":"کیا آپ نے نہیں دیکھا کہ اللہ تعالیٰ نے پاکیزه بات کی مثال کس طرح بیان فرمائی، مثل ایک پاکیزه درخت کے جس کی جڑ مضبوط ہے اور جس کی ٹہنیاں آسمان میں ہیں.","arabic":"أَلَمۡ تَرَ كَيۡفَ ضَرَبَ ٱللَّهُ مَثَلٗا كَلِمَةٗ طَيِّبَةٗ كَشَجَرَةٖ طَيِّبَةٍ أَصۡلُهَا ثَابِتٞ وَفَرۡعُهَا فِي ٱلسَّمَآءِ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim"],"ayahNumber":1774,"juzNumber":13,"footnotes":"","lang":"ur","meta":{"transliteration":"alam tara kayfa ḍaraba al-lahu mathalan kalimatan ṭayyibatan kashajaratin ṭayyibatin aṣluhā thābitun wafarʿuhā fī al-samāi ","translations":["Do not","you see","how","Allah sets forth","Allah sets forth","the example","a word","good","(is) like a tree","good","its root","(is) firm","and its branches","(are) in","the sky","(24)"],"transliterationArr":["alam","tara","kayfa","ḍaraba","al-lahu","mathalan","kalimatan","ṭayyibatan","kashajaratin","ṭayyibatin","aṣluhā","thābitun","wafarʿuhā","fī","al-samāi",null],"verseTiming":[[1,0,62],[2,62,494],[3,494,1082],[4,1082,1563],[5,1563,2702],[6,2702,3900],[7,3900,5846],[8,5846,7602],[9,7602,9548],[10,9548,11112],[11,11112,12806],[12,12806,14264],[13,14264,15450],[14,15450,17065],[15,17065,18503],[16,18503,19250],[17,19250,21137]]}},{"name":"14:25","price":"جو اپنے پروردگار کے حکم سے ہر وقت اپنے پھل ﻻتا ہے(1) ، اور اللہ تعالیٰ لوگوں کے سامنے مثالیں بیان فرماتا ہے تاکہ وه نصیحت حاصل کریں.","arabic":"تُؤۡتِيٓ أُكُلَهَا كُلَّ حِينِۭ بِإِذۡنِ رَبِّهَاۗ وَيَضۡرِبُ ٱللَّهُ ٱلۡأَمۡثَالَ لِلنَّاسِ لَعَلَّهُمۡ يَتَذَكَّرُونَ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim"],"ayahNumber":1775,"juzNumber":13,"footnotes":"(1) اس کا مطلب ہے کہ مومن کی مثال اس درخت کی طرح ہے، جو گرمی ہو یا سردی ہر وقت پھل دیتا ہے۔ اسی طرح مومن کے اعمال صالحہ شب و روز کے لمحات میں ہر آن اور ہر گھڑی آسمان کی طرف لے جائے جاتے ہیں، كَلِمَةٌ طَيِّبَةٌسے اسلام، یا لا اِلٰہ الا اللہ اور شجرہ طیبہ سے کھجور کا درخت مراد ہے۔ جیسا کہ صحیح حدیث سے ثابت ہے۔ ( صحيح بخاري، كتاب العلم، باب الفهم في العلم، ومسلم، كتاب صفة القيامة، باب مثل المؤمن مثل النخلة)","lang":"ur","meta":{"transliteration":"tu'tī ukulahā kulla ḥīnin bi-idh'ni rabbihā wayaḍribu al-lahu al-amthāla lilnnāsi laʿallahum yatadhakkarūna ","translations":["Giving","its fruit","all","time","by the permission","of its Lord","And Allah sets forth","And Allah sets forth","the examples","for mankind","so that they may","remember","(25)"],"transliterationArr":["tu'tī","ukulahā","kulla","ḥīnin","bi-idh'ni","rabbihā","wayaḍribu","al-lahu","al-amthāla","lilnnāsi","laʿallahum","yatadhakkarūna",null],"verseTiming":[[1,0,2400],[2,2400,3440],[3,3440,4120],[4,4120,5660],[5,5660,6430],[6,6430,7670],[7,7670,9010],[8,9010,9940],[9,9940,11370],[10,11370,12240],[11,12240,13555],[12,13555,16265]]}},{"name":"14:26","price":"اور ناپاک بات کی مثال گندے درخت جیسی ہے جو زمین کے کچھ ہی اوپر سے اکھاڑ لیا گیا۔ اسے کچھ ﺛبات تو ہے نہیں.(1)","arabic":"وَمَثَلُ كَلِمَةٍ خَبِيثَةٖ كَشَجَرَةٍ خَبِيثَةٍ ٱجۡتُثَّتۡ مِن فَوۡقِ ٱلۡأَرۡضِ مَا لَهَا مِن قَرَارٖ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim"],"ayahNumber":1776,"juzNumber":13,"footnotes":"(1) کلمئہ خبیثہ سے مراد کفر اور شجرہ خبیثہ سے حنظل (اندرائن) کا درخت مراد ہے۔ جس کی جڑ زمین کے اوپر ہی ہوتی ہے اور ذرا سے اشارے سے اکھڑ جاتی ہے۔ یعنی کافر کے اعمال بالکل بےحیثیت۔ نہ وہ آسمان پر چڑھتے ہیں، نہ اللہ کی بارگاہ میں وہ قبولیت کا درجہ پاتے ہیں۔","lang":"ur","meta":{"transliteration":"wamathalu kalimatin khabīthatin kashajaratin khabīthatin uj'tuthat min fawqi al-arḍi mā lahā min qarārin ","translations":["And (the) example","(of) a word","evil","(is) like a tree","evil","uprooted","from","the surface","(of) the earth","not","for it","(is) any","stability","(26)"],"transliterationArr":["wamathalu","kalimatin","khabīthatin","kashajaratin","khabīthatin","uj'tuthat","min","fawqi","al-arḍi","mā","lahā","min","qarārin",null],"verseTiming":[[1,0,-323],[2,-323,737],[3,737,2123],[4,2123,3782],[5,3782,4952],[6,4952,6252],[7,6252,7140],[8,7140,8011],[9,8011,10110],[10,10110,11760],[11,11760,11378],[12,11378,13330],[13,13330,13026],[14,13026,13406],[15,13406,14094],[16,14094,14972],[17,14972,17997]]}},{"name":"14:27","price":"ایمان والوں کو اللہ تعالیٰ پکی بات کے ساتھ مضبوط رکھتا ہے، دنیا کی زندگی میں بھی اور آخرت میں بھی(1) ، ہاں ناانصاف لوگوں کو اللہ بہکا دیتا ہے اور اللہ جو چاہے کر گزرے.","arabic":"يُثَبِّتُ ٱللَّهُ ٱلَّذِينَ ءَامَنُواْ بِٱلۡقَوۡلِ ٱلثَّابِتِ فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَا وَفِي ٱلۡأٓخِرَةِۖ وَيُضِلُّ ٱللَّهُ ٱلظَّٰلِمِينَۚ وَيَفۡعَلُ ٱللَّهُ مَا يَشَآءُ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim"],"ayahNumber":1777,"juzNumber":13,"footnotes":"(1) اس کی تفسیر حدیث میں اس طرح آتی ہے کہ ”موت کے بعد قبر میں جب مسلمان سے سوال کیا جاتا ہے، تو وہ جواب میں اس بات کی گواہی دیتا ہے کہ اللہ کے سوا کوئی معبود نہیں اور محمد (صلى الله عليه وسلم) اللہ کے رسول ہیں“۔ پس یہی مطلب ہے اللہ کے فرمان، «يُثَبِّتُ اللَّهُ الَّذِينَ آمَنُوا» کا (صحيح بخاري، تفسير سورة إبراهيم، وصحيح مسلم، كتاب الجنة وصفة نعيمها ، باب عرض مقعد الميت عليه وإثبات عذاب القبر) ایک اور حدیث میں ہے کہ ”جب بندے کو قبر میں رکھ دیا جاتا ہے اور اس کے ساتھی چلے جاتے ہیں اور وہ ان کے جوتوں کی آہٹ سنتا ہے۔ پھر اس کے پاس دو فرشتے آتے ہیں اور اسے اٹھا کر اس سے پوچھتے ہیں کہ اس شخص کے بارے میں تیری کیا رائے ہے، وہ مومن ہوتا ہے تو جواب دیتا ہے کہ وہ اللہ کے بندے اور اس کے رسول ہیں۔ فرشتے اسے جہنم کا ٹھکانا دکھاتے ہیں اور کہتے ہیں کہ اللہ نے اس کی جگہ تیرے لئے جنت میں ٹھکانا بنا دیا ہے۔ پس وہ دونوں ٹھکانے دیکھتا ہے اور اس کی قبر ستر ہاتھ کشادہ کر دی جاتی ہے اور اس کی قبر کو قیامت تک نعمتوں سے بھر دیا جاتا ہے“۔ (صحیح مسلم، باب مذکور) ایک اثر میں ہے، اس سے پوچھا جاتا ہے «مَنْ رَبُّكَ؟ مَا دِينُكَ ؟ مَنْ نَبِيُّكَ؟»۔ ”تیرا رب کون ہے، تیرا دین کیا ہے اور تیرا پیغمبر کون ہے“؟ پس اللہ تعالٰی اسے ثابت قدمی عطا فرماتا ہے اور وہ جواب دیتا ہے رَبِّی اللّٰہُ (میرا رب اللہ ہے)، وَ دِیْنِیَ الاِ سْلَامُ (میرا دین اسلام ہے) وَ نَبِیِّی مُحَمَّد (اور میرے پیغمبر محمد صلى الله عليه وسلم ہیں) (تفسیر ابن کثیر)","lang":"ur","meta":{"transliteration":"yuthabbitu al-lahu alladhīna āmanū bil-qawli al-thābiti fī al-ḥayati al-dun'yā wafī al-ākhirati wayuḍillu al-lahu al-ẓālimīna wayafʿalu al-lahu mā yashāu ","translations":["Allah keeps firm","Allah keeps firm","those who","believe","with the firm word","with the firm word","in","the life","(of) the world","and in","the Hereafter","And Allah lets go astray","And Allah lets go astray","the wrongdoers","And Allah does","And Allah does","what","He wills","(27)"],"transliterationArr":["yuthabbitu","al-lahu","alladhīna","āmanū","bil-qawli","al-thābiti","fī","al-ḥayati","al-dun'yā","wafī","al-ākhirati","wayuḍillu","al-lahu","al-ẓālimīna","wayafʿalu","al-lahu","mā","yashāu",null],"verseTiming":[[1,0,-192],[2,-192,664],[3,664,1916],[4,1916,3049],[5,3049,4335],[6,4335,5383],[7,5383,5692],[8,5692,6732],[9,6732,8004],[10,8004,8706],[11,8706,10234],[12,10234,11340],[13,11340,12252],[14,12252,15822],[15,15822,16944],[16,16944,17818],[17,17818,19637],[18,19637,20983],[19,20983,21675],[20,21675,22286],[21,22286,25182]]}},{"name":"14:28","price":"کیا آپ نے ان کی طرف نظر نہیں ڈالی جنہوں نے اللہ کی نعمت کے بدلے ناشکری کی اور اپنی قوم کو ہلاکت کے گھر میں ﻻ اتارا.(1)","arabic":"۞ أَلَمۡ تَرَ إِلَى ٱلَّذِينَ بَدَّلُواْ نِعۡمَتَ ٱللَّهِ كُفۡرٗا وَأَحَلُّواْ قَوۡمَهُمۡ دَارَ ٱلۡبَوَارِ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim"],"ayahNumber":1778,"juzNumber":13,"footnotes":"(1) اس کی تفسیر صحیح بخاری میں ہے کہ اس سے مراد کفار مکہ ہیں، جنہوں نت رسالت محمدیہ کا انکار کر کے اور جنگ بدر میں مسلمانوں سے لڑ کر اپنے لوگوں کو ہلاک کروایا، تاہم اپنے مفہوم کے اعتبار سے یہ عام ہے اور مطلب یہ ہوگا کہ حضرت محمد (صلى الله عليه وسلم) کو اللہ تعالٰی نے رحمتہ للعالمین اور لوگوں کے لئے نعمت الٰہیہ بنا کر بھیجا، پس جس نے اس نعمت کی قدر کی، اسے قبول کیا، اس نے شکر ادا کیا، وہ جنتی ہوگیا اور جس نے اس نعمت کو رد کر دیا اور کفر اختیار کیے رکھا، وہ جہنمی قرار پایا۔","lang":"ur","meta":{"transliteration":"alam tara ilā alladhīna baddalū niʿ'mata al-lahi kuf'ran wa-aḥallū qawmahum dāra al-bawāri ","translations":["Have not","you seen","[to]","those who","(have) changed","(the) Favor","(of) Allah","(for) disbelief","and they led","their people","(to the) house","(of) destruction","(28)"],"transliterationArr":["alam","tara","ilā","alladhīna","baddalū","niʿ'mata","al-lahi","kuf'ran","wa-aḥallū","qawmahum","dāra","al-bawāri",null],"verseTiming":[[1,0,700],[2,700,-15],[3,-15,827],[4,827,1606],[5,1606,2707],[6,2707,3835],[7,3835,4514],[8,4514,5899],[9,5899,7496],[10,7496,8683],[11,8683,9343],[12,9343,11793]]}},{"name":"14:29","price":"یعنی دوزخ میں جس میں یہ سب جائیں گے، جو بدترین ٹھکانا ہے.","arabic":"جَهَنَّمَ يَصۡلَوۡنَهَاۖ وَبِئۡسَ ٱلۡقَرَارُ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim"],"ayahNumber":1779,"juzNumber":13,"footnotes":"","lang":"ur","meta":{"transliteration":"jahannama yaṣlawnahā wabi'sa al-qarāru ","translations":["Hell","(in) it they will burn","and a wretched","place to settle","(29)"],"transliterationArr":["jahannama","yaṣlawnahā","wabi'sa","al-qarāru",null],"verseTiming":[[1,0,591],[2,591,2906],[3,2906,4621],[4,4621,6168],[5,6168,7147],[6,7147,10597]]}},{"name":"14:30","price":"انہوں نے اللہ کے ہمسر بنالیے کہ لوگوں کو اللہ کی راه سے بہکائیں۔ آپ کہہ دیجئے کہ خیر مزے کرلو تمہاری بازگشت تو آخر جہنم ہی ہے.(1)","arabic":"وَجَعَلُواْ لِلَّهِ أَندَادٗا لِّيُضِلُّواْ عَن سَبِيلِهِۦۗ قُلۡ تَمَتَّعُواْ فَإِنَّ مَصِيرَكُمۡ إِلَى ٱلنَّارِ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim"],"ayahNumber":1780,"juzNumber":13,"footnotes":"(1) یہ تہدید و توبیخ ہے کہ دنیا میں تم جو کچھ چاہو کر لو، مگر کب تک؟ بالآخر تمہارا ٹھکانا جہنم ہے۔","lang":"ur","meta":{"transliteration":"wajaʿalū lillahi andādan liyuḍillū ʿan sabīlihi qul tamattaʿū fa-inna maṣīrakum ilā al-nāri ","translations":["And they set up","to Allah","equals","so that they mislead","from","His Path","Say","Enjoy","but indeed","your destination","(is) to","the Fire","(30)"],"transliterationArr":["wajaʿalū","lillahi","andādan","liyuḍillū","ʿan","sabīlihi","qul","tamattaʿū","fa-inna","maṣīrakum","ilā","al-nāri",null],"verseTiming":[[1,0,-317],[2,-317,647],[3,647,2913],[4,2913,4430],[5,4430,5752],[6,5752,7264],[7,7264,7741],[8,7741,9044],[9,9044,10839],[10,10839,12228],[11,12228,12909],[12,12909,16254]]}},{"name":"14:31","price":"میرے ایمان والے بندوں سے کہہ دیجئے کہ نمازوں کو قائم رکھیں اور جو کچھ ہم نے انہیں دے رکھا ہے اس میں سے کچھ نہ کچھ پوشیده اور ﻇاہر خرچ کرتے رہیں اس سے پہلے کہ وه دن آجائے جس میں نہ خرید وفروخت ہوگی نہ دوستی اور محبت.(1)","arabic":"قُل لِّعِبَادِيَ ٱلَّذِينَ ءَامَنُواْ يُقِيمُواْ ٱلصَّلَوٰةَ وَيُنفِقُواْ مِمَّا رَزَقۡنَٰهُمۡ سِرّٗا وَعَلَانِيَةٗ مِّن قَبۡلِ أَن يَأۡتِيَ يَوۡمٞ لَّا بَيۡعٞ فِيهِ وَلَا خِلَٰلٌ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim"],"ayahNumber":1781,"juzNumber":13,"footnotes":"(1) نماز کو قائم کرنے کا مطلب ہے کہ اسے اپنے وقت پر اور نماز کو ٹھیک طریقہ کے ساتھ اور خشوع و خضوع کے ساتھ ادا کیا جائے، جس طرح کہ نبی (صلى الله عليه وسلم) کی سنت ہے۔ انفاق کا مطلب ہے زکوۃ ادا کی جائے، اقارب کے ساتھ صلہ رحمی کی جائے اور دیگر ضرورت مندوں پر احسان کیا جائے یہ نہیں کہ صرف اپنی ذات اور اپنی ضروریات پر تو بلا دریغ خوب خرچ کیا جائے۔ اور اللہ تعالٰی کی بتلائی ہوئی جگہوں پر خرچ کرنے سے گریز کیا جائے۔ قیامت کا دن ایسا ہوگا کہ جہاں نہ خرید و فروخت ممکن ہوگی نہ کوئی دوستی ہی کسی کام آئے گی۔","lang":"ur","meta":{"transliteration":"qul liʿibādiya alladhīna āmanū yuqīmū al-ṣalata wayunfiqū mimmā razaqnāhum sirran waʿalāniyatan min qabli an yatiya yawmun lā bayʿun fīhi walā khilālun ","translations":["Say","to My slaves","those who","believe","(to) establish","the prayers","and (to) spend","from what","We have provided them","secretly","and publicly","before","before","[that]","comes","a Day","not","any trade","in it","and not","any friendship","(31)"],"transliterationArr":["qul","liʿibādiya","alladhīna","āmanū","yuqīmū","al-ṣalata","wayunfiqū","mimmā","razaqnāhum","sirran","waʿalāniyatan","min","qabli","an","yatiya","yawmun","lā","bayʿun","fīhi","walā","khilālun",null],"verseTiming":[[1,0,360],[2,360,270],[3,270,1557],[4,1557,2714],[5,2714,3662],[6,3662,4716],[7,4716,7253],[8,7253,8636],[9,8636,10543],[10,10543,11971],[11,11971,12841],[12,12841,15047],[13,15047,16631],[14,16631,17404],[15,17404,17893],[16,17893,19166],[17,19166,21424],[18,21424,22809],[19,22809,23560],[20,23560,24710],[21,24710,25369],[22,25369,26138],[23,26138,26871],[24,26871,28265],[25,28265,29168],[26,29168,29753],[27,29753,31714]]}},{"name":"14:32","price":"اللہ وه ہے جس نے آسمانوں اور زمین کو پیدا کیا ہے اور آسمانوں سے بارش برسا کر اس کے ذریعے سے تمہاری روزی کے لیے پھل نکالے ہیں اور کشتیوں کو تمہارے بس میں کردیا ہے کہ دریاؤں میں اس کے حکم سے چلیں پھریں۔ اسی نے ندیاں اور نہریں تمہارے اختیار میں کردی ہیں.(1)","arabic":"ٱللَّهُ ٱلَّذِي خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ وَأَنزَلَ مِنَ ٱلسَّمَآءِ مَآءٗ فَأَخۡرَجَ بِهِۦ مِنَ ٱلثَّمَرَٰتِ رِزۡقٗا لَّكُمۡۖ وَسَخَّرَ لَكُمُ ٱلۡفُلۡكَ لِتَجۡرِيَ فِي ٱلۡبَحۡرِ بِأَمۡرِهِۦۖ وَسَخَّرَ لَكُمُ ٱلۡأَنۡهَٰرَ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim"],"ayahNumber":1782,"juzNumber":13,"footnotes":"(1) اللہ تعالٰی نے مخلوقات پر جو انعامات کئے ہیں، ان میں بعض کا تذکرہ یہاں کیا جا رہا ہے۔ فرمایا آسمان کو چھت اور زمین کو بچھونا بنایا۔ آسمان سے بارش نازل فرما کر مختلف قسم کے درخت اور فصلیں اگائیں جن میں لذت و قوت کے لئے میوے اور فروٹ بھی ہیں اور انواع و اقسام کے غلے بھی جن کے رنگ اور شکلیں بھی ایک دوسرے سے مختلف ہیں اور ذائقے اور خوشبو اور فوائد بھی مختلف ہیں۔ کشتیوں اور جہازوں کو خدمت میں لگا دیا کہ وہ تلاطم خیز موجوں پر چلتے ہیں، انسانوں کو بھی ایک ملک سے دوسرے ملک میں پہنچاتے ہیں اور سامان تجارت بھی ایک جگہ سے دوسری جگہ منتقل کرتے ہیں۔ زمینوں اور پہاڑوں سے چشمے اور نہریں جاری کر دیں تاکہ تم بھی سیراب ہو اور اپنے کھیتوں کو بھی سیراب کرو۔","lang":"ur","meta":{"transliteration":"al-lahu alladhī khalaqa al-samāwāti wal-arḍa wa-anzala mina al-samāi māan fa-akhraja bihi mina al-thamarāti riz'qan lakum wasakhara lakumu al-ful'ka litajriya fī al-baḥri bi-amrihi wasakhara lakumu al-anhāra ","translations":["Allah","(is) the One Who","created","the heavens","and the earth","and sent down","from","the sky","water","then brought forth","from it","of","the fruits","(as) a provision","for you","and subjected","for you","the ships","so that they may sail","in","the sea","by His command","and subjected","for you","the rivers","(32)"],"transliterationArr":["al-lahu","alladhī","khalaqa","al-samāwāti","wal-arḍa","wa-anzala","mina","al-samāi","māan","fa-akhraja","bihi","mina","al-thamarāti","riz'qan","lakum","wasakhara","lakumu","al-ful'ka","litajriya","fī","al-baḥri","bi-amrihi","wasakhara","lakumu","al-anhāra",null],"verseTiming":[[1,0,1130],[2,1130,2000],[3,2000,2660],[4,2660,4310],[5,4310,5430],[6,5430,7340],[7,7340,7660],[8,7660,10160],[9,10160,12360],[10,12360,14130],[11,14130,14870],[12,14870,15960],[13,15960,16670],[14,16670,17000],[15,17000,18430],[16,18430,19110],[17,19110,20240],[18,20240,21380],[19,21380,21870],[20,21870,22890],[21,22890,23950],[22,23950,24220],[23,24220,25140],[24,25140,26420],[25,26420,27640],[26,27640,28250],[27,28250,31215]]}},{"name":"14:33","price":"اسی نے تمہارے لیے سورج چاند کو مسخر کردیا ہے کہ برابر ہی چل رہے ہیں(1) اور رات دن کو بھی تمہارے کام میں لگا رکھا ہے.(2)","arabic":"وَسَخَّرَ لَكُمُ ٱلشَّمۡسَ وَٱلۡقَمَرَ دَآئِبَيۡنِۖ وَسَخَّرَ لَكُمُ ٱلَّيۡلَ وَٱلنَّهَارَ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim"],"ayahNumber":1783,"juzNumber":13,"footnotes":"(1) یعنی مسلسل چلتے رہتے ہیں، کبھی ٹھرتے نہیں رات کو، نہ دن کو۔ علاوہ ازیں ایک دوسرے کے پیچھے چلتے ہیں لیکن کبھی ان کا باہمی تصادم اور ٹکراؤ نہیں ہوتا۔\n(2) رات اور دن، ان کا باہمی تفاوت جاری رہتا ہے، کبھی رات، دن کا کچھ حصہ لے کر لمبی ہو جاتی ہے اور کبھی دن، رات کا کچھ حصہ لے کر لمبا ہو جاتا ہے۔ اور یہ سلسلہ ابتدائے کائنات سے چل رہا ہے، اس میں ایک رائی فرق نہیں آیا۔","lang":"ur","meta":{"transliteration":"wasakhara lakumu al-shamsa wal-qamara dāibayni wasakhara lakumu al-layla wal-nahāra ","translations":["And He subjected","for you","the sun","and the moon","both constantly pursuing their courses","and subjected","for you","the night","and the day","(33)"],"transliterationArr":["wasakhara","lakumu","al-shamsa","wal-qamara","dāibayni","wasakhara","lakumu","al-layla","wal-nahāra",null],"verseTiming":[[1,0,1150],[2,1150,1760],[3,1760,2680],[4,2680,3760],[5,3760,8010],[6,8010,9070],[7,9070,9770],[8,9770,10630],[9,10630,12945]]}},{"name":"14:34","price":"اسی نے تمہیں تمہاری منہ مانگی کل چیزوں میں سے دے رکھا ہے(1) ۔ اگر تم اللہ کے احسان گننا چاہو تو انہیں پورے گن بھی نہیں سکتے(2)۔ یقیناً انسان بڑا ہی بے انصاف اور ناشکرا ہے.(3)","arabic":"وَءَاتَىٰكُم مِّن كُلِّ مَا سَأَلۡتُمُوهُۚ وَإِن تَعُدُّواْ نِعۡمَتَ ٱللَّهِ لَا تُحۡصُوهَآۗ إِنَّ ٱلۡإِنسَٰنَ لَظَلُومٞ كَفَّارٞ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim"],"ayahNumber":1784,"juzNumber":13,"footnotes":"(1) یعنی اس نے تمہاری ضرورت کی تمام چیزیں مہیا کیں جو تم اس سے طلب کرتے ہو، وہ بھی دیتا ہے اور جسے نہیں مانگتے، لیکن اسے پتہ ہے کہ وہ تمہاری ضرورت ہے، وہ بھی دے دیتا ہے۔ غرض تمہیں زندگی گزارنے کی تمام سہولتیں فراہم کرتا ہے۔\n(2) یعنی اللہ کی نعمتیں ان گنت ہیں انہیں کوئی شمار میں نہیں لا سکتا۔ چہ‌جائیکہ کوئی ان نعمتوں کے شکر کا حق ادا کرسکے۔ ایک اثر میں حضرت داؤد (عليه السلام) کا قول نقل کیا گیا ہے۔ انہوں نے کہا ' اے رب! میں تیرا شکر کس طرح ادا کروں؟ جب کہ شکر بجائے خود تیری طرف سے مجھ پر ایک نعمت ہے ' اللہ تعالٰی نے فرمایا ' اے داؤد اب تو نے میرا شکر ادا کر دیا جب کہ تو نے اعتراف کر لیا کہ یا اللہ میں تیری نعمتوں کا شکر ادا کرنے سے قاصر ہوں ' (تفسیر ابن کثیر)\n(3) اللہ کی نعمتوں پر شکر ادا کرنے سے غفلت کی وجہ سے انسان اپنے نفس کے ساتھ ظلم اور بے انصافی کرتا ہے۔ بالخصوص کافر، جو بالکل ہی اللہ سے غافل ہے۔","lang":"ur","meta":{"transliteration":"waātākum min kulli mā sa-altumūhu wa-in taʿuddū niʿ'mata al-lahi lā tuḥ'ṣūhā inna al-insāna laẓalūmun kaffārun ","translations":["And He gave you","of","all","what","you asked of Him","And if","you count","(the) Favor of Allah","(the) Favor of Allah","not","you will (be able to) count them","Indeed","the mankind","(is) surely unjust","(and) ungrateful","(34)"],"transliterationArr":["waātākum","min","kulli","mā","sa-altumūhu","wa-in","taʿuddū","niʿ'mata","al-lahi","lā","tuḥ'ṣūhā","inna","al-insāna","laẓalūmun","kaffārun",null],"verseTiming":[[1,0,570],[2,570,1544],[3,1544,2173],[4,2173,2533],[5,2533,6365],[6,6365,7562],[7,7562,8847],[8,8847,9654],[9,9654,10481],[10,10481,11080],[11,11080,12863],[12,12863,14202],[13,14202,16498],[14,16498,17479],[15,17479,20237]]}},{"name":"14:35","price":"(ابراہیم کی یہ دعا بھی یاد کرو) جب انہوں نے کہا کہ اے میرے پروردگار! اس شہر کو امن واﻻ بنادے(1) ، اور مجھے اور میری اوﻻد کو بت پرستی سے پناه دے.","arabic":"وَإِذۡ قَالَ إِبۡرَٰهِيمُ رَبِّ ٱجۡعَلۡ هَٰذَا ٱلۡبَلَدَ ءَامِنٗا وَٱجۡنُبۡنِي وَبَنِيَّ أَن نَّعۡبُدَ ٱلۡأَصۡنَامَ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim"],"ayahNumber":1785,"juzNumber":13,"footnotes":"(1) ”اس شہر“ سے مراد مکہ ہے۔ دیگر دعاؤں سے قبل یہ دعا کی کہ اسے امن والا بنا دے، اس لئے کہ امن ہوگا تو لوگ دوسری نعمتوں سے بھی صحیح معنوں میں فائدہ اٹھا سکیں گے، ورنہ امن و سکون کے بغیر تمام آسائشوں اور سہولتوں کے باوجود، خوف اور دہشت کے سائے انسان کو مضطرب اور پریشان رکھتے ہیں۔ جیسے آجکل کے عام معاشروں کا حال ہے۔ سوائے سعودی عرب کے۔ وہاں اس دعا کی برکت سے اور اسلامی حدود کے نفاذ سے آج بھی ایک مثالی امن قائم ہے۔ صَانَهَا اللهُ عَنِ الشُّرُورِ وَالْفِتَنِ۔ یہاں انعامات الہیہ کے ضمن میں اسے بیان فرما کر اشارہ کر دیا کہ قریش جہاں اللہ کے دیگر انعامات سے غافل ہیں اس خصوصی انعام سے بھی غافل ہیں کہ اس نے انہیں مکہ جیسے امن والے شہر کا باشندہ بنایا۔","lang":"ur","meta":{"transliteration":"wa-idh qāla ib'rāhīmu rabbi ij'ʿal hādhā al-balada āminan wa-uj'nub'nī wabaniyya an naʿbuda al-aṣnāma ","translations":["And when","said","Ibrahim","My Lord","Make","this","city","safe","and keep me away","and my sons","that","we worship","the idols","(35)"],"transliterationArr":["wa-idh","qāla","ib'rāhīmu","rabbi","ij'ʿal","hādhā","al-balada","āminan","wa-uj'nub'nī","wabaniyya","an","naʿbuda","al-aṣnāma",null],"verseTiming":[[1,0,-477],[2,-477,-270],[3,-270,1079],[4,1079,1794],[5,1794,2378],[6,2378,2935],[7,2935,4284],[8,4284,5320],[9,5320,7426],[10,7426,8503],[11,8503,9894],[12,9894,10577],[13,10577,12929]]}},{"name":"14:36","price":"اے میرے پالنے والے معبود! انہوں نے بہت سے لوگوں کو راه سے بھٹکا دیا ہے(1) ۔ پس میری تابعداری کرنے واﻻ میرا ہے اور جو میری نافرمانی کرے تو تو بہت ہی معاف اور کرم کرنے واﻻ ہے.","arabic":"رَبِّ إِنَّهُنَّ أَضۡلَلۡنَ كَثِيرٗا مِّنَ ٱلنَّاسِۖ فَمَن تَبِعَنِي فَإِنَّهُۥ مِنِّيۖ وَمَنۡ عَصَانِي فَإِنَّكَ غَفُورٞ رَّحِيمٞ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim"],"ayahNumber":1786,"juzNumber":13,"footnotes":"(1) گمراہ کرنے کی نسبت ان پتھروں کی مورتیوں کی طرف جن کی مشرکین عبادت کرتے تھے، باوجود اس بات کے کہ وہ غیر عاقل ہیں، کیونکہ وہ گمراہی کا باعث تھیں اور ہیں۔","lang":"ur","meta":{"transliteration":"rabbi innahunna aḍlalna kathīran mina al-nāsi faman tabiʿanī fa-innahu minnī waman ʿaṣānī fa-innaka ghafūrun raḥīmun ","translations":["My Lord","Indeed, they","have led astray","many","among","the mankind","So whoever","follows me","then indeed, he","(is) of me","and whoever","disobeys me","then indeed, You","(are) Oft-Forgiving","Most Merciful","(36)"],"transliterationArr":["rabbi","innahunna","aḍlalna","kathīran","mina","al-nāsi","faman","tabiʿanī","fa-innahu","minnī","waman","ʿaṣānī","fa-innaka","ghafūrun","raḥīmun",null],"verseTiming":[[1,0,-1076],[2,-1076,1327],[3,1327,2433],[4,2433,3387],[5,3387,4260],[6,4260,8161],[7,8161,10632],[8,10632,12420],[9,12420,12779],[10,12779,14660],[11,14660,15313],[12,15313,16603],[13,16603,18272],[14,18272,19599],[15,19599,21663]]}},{"name":"14:37","price":"اے ہمارے پروردگار! میں نے اپنی کچھ اوﻻد(1) اس بے کھیتی کی وادی میں تیرے حرمت والے گھر کے پاس بسائی ہے۔ اے ہمارے پروردگار! یہ اس لیے کہ وه نماز قائم رکھیں(2)، پس تو کچھ لوگوں(3) کے دلوں کو ان کی طرف مائل کردے۔ اور انہیں پھلوں کی روزیاں عنایت فرما(4) تاکہ یہ شکر گزاری کریں.","arabic":"رَّبَّنَآ إِنِّيٓ أَسۡكَنتُ مِن ذُرِّيَّتِي بِوَادٍ غَيۡرِ ذِي زَرۡعٍ عِندَ بَيۡتِكَ ٱلۡمُحَرَّمِ رَبَّنَا لِيُقِيمُواْ ٱلصَّلَوٰةَ فَٱجۡعَلۡ أَفۡـِٔدَةٗ مِّنَ ٱلنَّاسِ تَهۡوِيٓ إِلَيۡهِمۡ وَٱرۡزُقۡهُم مِّنَ ٱلثَّمَرَٰتِ لَعَلَّهُمۡ يَشۡكُرُونَ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim"],"ayahNumber":1787,"juzNumber":13,"footnotes":"(1) مِنْ ذُرِّیَّتِیْ میں مِن اولاد کے لئے ہے۔ یعنی بعض کہتے ہیں حضرت ابراہم (عليه السلام) کے آٹھ صلبی بیٹے تھے، جن میں سے صرف حضرت اسماعیل (عليه السلام) کو یہاں بسایا (فتح القدیر)\n(2) عبادت میں صرف نماز کا ذکر کیا، جس سے نماز کی اہمیت واضح ہے۔\n(3) یہاں بھی اولاد کے لئے ہے۔ کہ کچھ لوگ، مراد اس سے مسلمان ہیں۔ چنانچہ دیکھ لیجئے کہ کس طرح دنیا بھر کے مسلمان مکہ مکرمہ میں جمع ہوتے ہیں اور حج کے علاوہ بھی سارا سال یہ سلسلہ جاری رہتا ہے۔ اگر حضرت ابراہیم (عليه السلام) أَفْئِدَةَ النَّاس ِ (لوگوں کے دلوں) کہتے تو عیسائی، یہودی، مجوسی اور دیگر تمام لوگ مکہ پہنچتے۔ مِنَ النَّاسِ کے مِنْ نے اس دعا کو مسلمانوں تک محدود کر دیا (ابن کثیر)\n(4) اس دعا کی تاثیر بھی دیکھ لی جائے کہ مکہ جیسی بےآب و گیاہ سرزمین میں جہاں کوئی پھلدار درخت نہیں، دنیا بھر کے پھل اور میوے نہایت فراوانی کے ساتھ مہیا ہیں حج کے موقع پر بھی، جب لاکھوں افراد مزید وہاں پہنچ جاتے ہیں، پھلوں کی فراوانی میں کوئی کمی نہیں آتی، وَهَذَا مِنْ لُطْفِ اللهِ تَعَالَى وَكَرَمِهِ وَرَحْمَتِه وَبَرَكَتِهِ، اسْتِجَابَةً لِخَلِيلِهِ إِبْرَاهِيمَ - عَلَيْه السَّلام کہا جاتا ہے کہ یہ دعا خانہ کعبہ کی تعمیر کے بعد مانگی۔ جب کہ پہلی دعا اس وقت مانگی، جب اپنی اہلیہ اور شیر خوار بچے اسماعیل کو اللہ تعالٰی کے حکم پر وہاں چھوڑ کر چلے گئے (ابن کثیر)","lang":"ur","meta":{"transliteration":"rabbanā innī askantu min dhurriyyatī biwādin ghayri dhī zarʿin ʿinda baytika al-muḥarami rabbanā liyuqīmū al-ṣalata fa-ij'ʿal afidatan mina al-nāsi tahwī ilayhim wa-ur'zuq'hum mina al-thamarāti laʿallahum yashkurūna ","translations":["Our Lord","Indeed, I","[I] have settled","(some) of","my offsprings","in a valley","not","with","cultivation","near","Your Sacred House","Your Sacred House","our Lord","That they may establish","the prayers","So make","hearts","of","the men","incline","towards them","and provide them","with","the fruits","so that they may","be grateful","(37)"],"transliterationArr":["rabbanā","innī","askantu","min","dhurriyyatī","biwādin","ghayri","dhī","zarʿin","ʿinda","baytika","al-muḥarami","rabbanā","liyuqīmū","al-ṣalata","fa-ij'ʿal","afidatan","mina","al-nāsi","tahwī","ilayhim","wa-ur'zuq'hum","mina","al-thamarāti","laʿallahum","yashkurūna",null],"verseTiming":[[1,0,2460],[2,2460,3675],[3,3675,5252],[4,5252,5660],[5,5660,7736],[6,7736,8954],[7,8954,9915],[8,9915,10413],[9,10413,10982],[10,10982,12028],[11,12028,12844],[12,12844,14317],[13,14317,16043],[14,16043,17026],[15,17026,18262],[16,18262,19144],[17,19144,20174],[18,20174,21502],[19,21502,22497],[20,22497,23871],[21,23871,26486],[22,26486,27429],[23,27429,29144],[24,29144,31216],[25,31216,32257],[26,32257,33172],[27,33172,34538],[28,34538,37159]]}},{"name":"14:38","price":"اے ہمارے پروردگار! تو خوب جانتا ہے جو ہم چھپائیں اور جو ﻇاہر کریں۔ زمین و آسمان کی کوئی چیز اللہ پر پوشیده نہیں.(1)","arabic":"رَبَّنَآ إِنَّكَ تَعۡلَمُ مَا نُخۡفِي وَمَا نُعۡلِنُۗ وَمَا يَخۡفَىٰ عَلَى ٱللَّهِ مِن شَيۡءٖ فِي ٱلۡأَرۡضِ وَلَا فِي ٱلسَّمَآءِ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim"],"ayahNumber":1788,"juzNumber":13,"footnotes":"(1) مطلب یہ ہے کہ میری دعا کے مقصد کو تو بخوبی جانتا ہے، اس شہر کے لئے دعا سے اصل مقصد تیری رضا ہے تو تو ہرچیز کی حقیقت کو خوب جانتا ہے، آسمان و زمین کی کوئی چیز تجھ سے پوشیدہ نہیں۔","lang":"ur","meta":{"transliteration":"rabbanā innaka taʿlamu mā nukh'fī wamā nuʿ'linu wamā yakhfā ʿalā al-lahi min shayin fī al-arḍi walā fī al-samāi ","translations":["Our Lord","Indeed, You","You know","what","we conceal","and what","we proclaim","And not","(is) hidden","from","Allah","any","thing","in","the earth","and not","in","the heaven","(38)"],"transliterationArr":["rabbanā","innaka","taʿlamu","mā","nukh'fī","wamā","nuʿ'linu","wamā","yakhfā","ʿalā","al-lahi","min","shayin","fī","al-arḍi","walā","fī","al-samāi",null],"verseTiming":[[1,0,2190],[2,2190,2373],[3,2373,3281],[4,3281,3806],[5,3806,4535],[6,4535,5264],[7,5264,6785],[8,6785,7363],[9,7363,8661],[10,8661,9341],[11,9341,9833],[12,9833,10593],[13,10593,11349],[14,11349,12838],[15,12838,13415],[16,13415,13891],[17,13891,14781],[18,14781,17259]]}},{"name":"14:39","price":"اللہ کا شکر ہے جس نے مجھے اس بڑھاپے میں اسماعیل واسحاق (علیہما السلام) عطا فرمائے۔ کچھ شک نہیں کہ میرا پالنہار اللہ دعاؤں کا سننے واﻻ ہے.","arabic":"ٱلۡحَمۡدُ لِلَّهِ ٱلَّذِي وَهَبَ لِي عَلَى ٱلۡكِبَرِ إِسۡمَٰعِيلَ وَإِسۡحَٰقَۚ إِنَّ رَبِّي لَسَمِيعُ ٱلدُّعَآءِ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim"],"ayahNumber":1789,"juzNumber":13,"footnotes":"","lang":"ur","meta":{"transliteration":"al-ḥamdu lillahi alladhī wahaba lī ʿalā al-kibari is'māʿīla wa-is'ḥāqa inna rabbī lasamīʿu al-duʿāi ","translations":["All the Praise","(is) for Allah","the One Who","has granted","me","in","the old age","Ishmael","and Isaac","Indeed","my Lord","(is) All-Hearer","(of) the prayer","(39)"],"transliterationArr":["al-ḥamdu","lillahi","alladhī","wahaba","lī","ʿalā","al-kibari","is'māʿīla","wa-is'ḥāqa","inna","rabbī","lasamīʿu","al-duʿāi",null],"verseTiming":[[1,0,1130],[2,1130,1323],[3,1323,1707],[4,1707,2598],[5,2598,3153],[6,3153,3799],[7,3799,4577],[8,4577,6085],[9,6085,9395],[10,9395,11049],[11,11049,11927],[12,11927,13196],[13,13196,15794]]}},{"name":"14:40","price":"اے میرے پالنے والے! مجھے نماز کا پابند رکھ اور میری اوﻻد سے بھی(1) ، اے ہمارے رب میری دعا قبول فرما.","arabic":"رَبِّ ٱجۡعَلۡنِي مُقِيمَ ٱلصَّلَوٰةِ وَمِن ذُرِّيَّتِيۚ رَبَّنَا وَتَقَبَّلۡ دُعَآءِ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim"],"ayahNumber":1790,"juzNumber":13,"footnotes":"(1) اپنے ساتھ اپنی اولاد کے لئے بھی دعا مانگی، جیسے اس سے قبل بھی اپنے ساتھ اپنی اولاد کے لئے بھی دعا مانگی کہ انہیں پتھر کی مورتیوں کو پوجنے سے بچا رکھنا۔ جس سے معلوم ہوا کہ اللہ کے دین کے داعیوں کو اپنے گھر والوں کی ہدایت اور ان کی دینی تعلیم و تربیت سے غافل نہیں رہنا چاہیے تبلیغ و دعوت میں انہیں اولیت دینی چاہیے جیسا کہ اللہ تعالٰی نے اپنے آخری پیغمبر حضرت محمد (صلى الله عليه وسلم) کو بھی حکم دیا«وَأَنْذِرْ عَشِيرَتَكَ الأَقْرَبِينَ» (الشعراء:214) ”اپنے قریبی رشتہ داروں کو ڈرایئے“۔","lang":"ur","meta":{"transliteration":"rabbi ij'ʿalnī muqīma al-ṣalati wamin dhurriyyatī rabbanā wataqabbal duʿāi ","translations":["My Lord","Make me","an establisher","(of) the prayer","and from","my offsprings","Our Lord","and accept","my prayer","(40)"],"transliterationArr":["rabbi","ij'ʿalnī","muqīma","al-ṣalati","wamin","dhurriyyatī","rabbanā","wataqabbal","duʿāi",null],"verseTiming":[[1,0,78],[2,78,761],[3,761,1081],[4,1081,2436],[5,2436,3769],[6,3769,5934],[7,5934,7362],[8,7362,8722],[9,8722,11127]]}},{"name":"14:41","price":"اے ہمارے پروردگار! مجھے بخش دے اور میرے ماں باپ کو بھی بخش(1) اور دیگر مومنوں کو بھی بخش جس دن حساب ہونے لگے.","arabic":"رَبَّنَا ٱغۡفِرۡ لِي وَلِوَٰلِدَيَّ وَلِلۡمُؤۡمِنِينَ يَوۡمَ يَقُومُ ٱلۡحِسَابُ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim"],"ayahNumber":1791,"juzNumber":13,"footnotes":"(1) حضرت ابراہیم (عليه السلام) نے یہ دعا اس وقت کی جب کہ ابھی ان پر اپنے ماں باپ کا عَدُوُّ الله ِ ہونا واضح نہیں ہوا تھا، جب یہ واضح ہوگیا کہ میرا باپ اللہ کا دشمن ہے تو اس سے اظہار سبکدوشی کر دیا۔ اس لئے کہ مشرکین کے لئے دعا کرنا جائز نہیں چاہے وہ قرابت قریبہ ہی کیوں نہ رکھتے ہوں۔","lang":"ur","meta":{"transliteration":"rabbanā igh'fir lī waliwālidayya walil'mu'minīna yawma yaqūmu al-ḥisābu ","translations":["Our Lord","Forgive","me","and my parents","and the believers","(on) the Day","will (be) established","the account","(41)"],"transliterationArr":["rabbanā","igh'fir","lī","waliwālidayya","walil'mu'minīna","yawma","yaqūmu","al-ḥisābu",null],"verseTiming":[[1,0,1212],[2,1212,1891],[3,1891,2229],[4,2229,4243],[5,4243,6388],[6,6388,6975],[7,6975,8101],[8,8101,11903]]}},{"name":"14:42","price":"ناانصافوں کے اعمال سے اللہ کو غافل نہ سمجھ وه تو انہیں اس دن تک مہلت دیے ہوئے ہے جس دن آنکھیں پھٹی کی پھٹی ره جائیں گی.(1)","arabic":"وَلَا تَحۡسَبَنَّ ٱللَّهَ غَٰفِلًا عَمَّا يَعۡمَلُ ٱلظَّٰلِمُونَۚ إِنَّمَا يُؤَخِّرُهُمۡ لِيَوۡمٖ تَشۡخَصُ فِيهِ ٱلۡأَبۡصَٰرُ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim"],"ayahNumber":1792,"juzNumber":13,"footnotes":"(1) یعنی قیامت کی ہولناکیوں کی وجہ سے۔ اگر دنیا میں اگر اللہ نے کسی کو زیادہ مہلت دے دی اور اس کے مرنے تک اس کا مواخذہ نہیں کیا تو قیامت کے دن تو وہ مواخذہ الٰہی سے نہیں بچ سکے گا، جو کافروں کے لئے اتنا ہولناک دن ہوگا کہ آنکھیں پھٹی کی پھٹی رہ جائیں گی۔","lang":"ur","meta":{"transliteration":"walā taḥsabanna al-laha ghāfilan ʿammā yaʿmalu al-ẓālimūna innamā yu-akhiruhum liyawmin tashkhaṣu fīhi al-abṣāru ","translations":["And (do) not","think","(that) Allah","(is) unaware","of what","do","the wrongdoers","Only","He gives them respite","to a Day","will stare","in it","the eyes","(42)"],"transliterationArr":["walā","taḥsabanna","al-laha","ghāfilan","ʿammā","yaʿmalu","al-ẓālimūna","innamā","yu-akhiruhum","liyawmin","tashkhaṣu","fīhi","al-abṣāru",null],"verseTiming":[[1,0,1139],[2,1139,2833],[3,2833,4014],[4,4014,5195],[5,5195,6594],[6,6594,7572],[7,7572,11454],[8,11454,12963],[9,12963,14560],[10,14560,15832],[11,15832,17445],[12,17445,18129],[13,18129,20923]]}},{"name":"14:43","price":"وه اپنے سر اوپر اٹھائے دوڑ بھاگ کر رہے ہوں گے(1) ، خود اپنی طرف بھی ان کی نگاہیں نہ لوٹیں گی اور ان کے دل خالی اور اڑے ہوئے ہوں گے.(2)","arabic":"مُهۡطِعِينَ مُقۡنِعِي رُءُوسِهِمۡ لَا يَرۡتَدُّ إِلَيۡهِمۡ طَرۡفُهُمۡۖ وَأَفۡـِٔدَتُهُمۡ هَوَآءٞ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim"],"ayahNumber":1793,"juzNumber":13,"footnotes":"(1) مُهْطِعِينَ، تیزی سے دوڑ رہے ہونگے۔ دوسرے مقام پر فرمایا، مھطعین الی الداع۔ القمر بلانے والے کی طرف دوڑیں گے اور حیرت سے ان کے سر اٹھے ہوئے ہونگے۔\n(2) جو ہولناکیاں وہ دیکھیں گے اور جو فکر اور خوف اپنے بارے میں انہیں ہوگا، ان کے پیش نظر ان کی آنکھیں ایک لمحہ کے لئے بھی پست نہیں ہونگی اور کثرت خوف سے ان کے دل گرے ہوئے اور خالی ہونگے۔","lang":"ur","meta":{"transliteration":"muh'ṭiʿīna muq'niʿī ruūsihim lā yartaddu ilayhim ṭarfuhum wa-afidatuhum hawāon ","translations":["Racing ahead","raised up","their heads","not","returning","towards them","their gaze","and their hearts","(are) empty","(43)"],"transliterationArr":["muh'ṭiʿīna","muq'niʿī","ruūsihim","lā","yartaddu","ilayhim","ṭarfuhum","wa-afidatuhum","hawāon",null],"verseTiming":[[1,0,1799],[2,1799,2991],[3,2991,4329],[4,4329,4870],[5,4870,6023],[6,6023,7097],[7,7097,8245],[8,8245,10132],[9,10132,12427]]}},{"name":"14:44","price":"لوگوں کو اس دن سے ہوشیار کردے جب کہ ان کے پاس عذاب آجائے گا، اور ﻇالم کہیں گے کہ اے ہمارے رب ہمیں بہت تھوڑے قریب کے وقت تک کی ہی مہلت دے کہ ہم تیری تبلیﻎ مان لیں اور تیرے پیغمبروں کی تابعداری میں لگ جائیں۔ کیا تم اس سے پہلے بھی قسمیں نہیں کھا رہے تھے؟ کہ تمہارے لیے دنیا سے ٹلنا ہی نہیں.(1)","arabic":"وَأَنذِرِ ٱلنَّاسَ يَوۡمَ يَأۡتِيهِمُ ٱلۡعَذَابُ فَيَقُولُ ٱلَّذِينَ ظَلَمُواْ رَبَّنَآ أَخِّرۡنَآ إِلَىٰٓ أَجَلٖ قَرِيبٖ نُّجِبۡ دَعۡوَتَكَ وَنَتَّبِعِ ٱلرُّسُلَۗ أَوَلَمۡ تَكُونُوٓاْ أَقۡسَمۡتُم مِّن قَبۡلُ مَا لَكُم مِّن زَوَالٖ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim"],"ayahNumber":1794,"juzNumber":13,"footnotes":"(1) یعنی دنیا میں تم قسمیں کھا کھا کر کہا کرتے تھے کہ کوئی حساب کتاب اور جنت دوزخ نہیں، دوبارہ کسے زندہ ہونا ہے۔","lang":"ur","meta":{"transliteration":"wa-andhiri al-nāsa yawma yatīhimu al-ʿadhābu fayaqūlu alladhīna ẓalamū rabbanā akhir'nā ilā ajalin qarībin nujib daʿwataka wanattabiʿi al-rusula awalam takūnū aqsamtum min qablu mā lakum min zawālin ","translations":["And warn","the mankind","(of) a Day","(when) will come to them","the punishment","then will say","those who","did wrong","Our Lord","Respite us","for","a term","short","we will answer","Your call","and we will follow","the Messengers","Had not","you","sworn","before","before","not","for you","any","end","(44)"],"transliterationArr":["wa-andhiri","al-nāsa","yawma","yatīhimu","al-ʿadhābu","fayaqūlu","alladhīna","ẓalamū","rabbanā","akhir'nā","ilā","ajalin","qarībin","nujib","daʿwataka","wanattabiʿi","al-rusula","awalam","takūnū","aqsamtum","min","qablu","mā","lakum","min","zawālin",null],"verseTiming":[[1,0,2332],[2,2332,3799],[3,3799,4434],[4,4434,5777],[5,5777,6846],[6,6846,8140],[7,8140,9188],[8,9188,10840],[9,10840,12100],[10,12100,13054],[11,13054,14086],[12,14086,16584],[13,16584,19105],[14,19105,21257],[15,21257,22483],[16,22483,23600],[17,23600,24765],[18,24765,25933],[19,25933,27316],[20,27316,28731],[21,28731,29584],[22,29584,32491],[23,32491,34334],[24,34334,35149],[25,35149,35922],[26,35922,36325],[27,36325,37197],[28,37197,38743],[29,38743,41148]]}},{"name":"14:45","price":"اور کیا تم ان لوگوں کے گھروں میں رہتے سہتے نہ تھے جنہوں نے اپنی جانوں پر ﻇلم کیا اور کیا تم پر وه معاملہ کھلا نہیں کہ ہم نے ان کے ساتھ کیسا کچھ کیا۔ ہم نے تو (تمہارے سمجھانے کو) بہت سی مثالیں بیان کردی تھیں.(1)","arabic":"وَسَكَنتُمۡ فِي مَسَٰكِنِ ٱلَّذِينَ ظَلَمُوٓاْ أَنفُسَهُمۡ وَتَبَيَّنَ لَكُمۡ كَيۡفَ فَعَلۡنَا بِهِمۡ وَضَرَبۡنَا لَكُمُ ٱلۡأَمۡثَالَ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim"],"ayahNumber":1795,"juzNumber":13,"footnotes":"(1) یعنی عبرت کے لئے ہم نے تو ان کی پچھلی قوموں کے واقعات بیان کر دیئے ہیں، جن کے گھروں میں تم آباد ہو اور ان کے کھنڈرات بھی تمہیں دعوت غور و فکر دے رہے ہیں۔ اگر تم نے ان سے عبرت حاصل نہیں کی اور ان کے انجام سے بچنے کی فکر نہ کرو تو تمہاری مرضی۔ پھر تم بھی اسی انجام کے لئے تیار رہو۔","lang":"ur","meta":{"transliteration":"wasakantum fī masākini alladhīna ẓalamū anfusahum watabayyana lakum kayfa faʿalnā bihim waḍarabnā lakumu al-amthāla ","translations":["And you dwelt","in","the dwellings","(of) those who","wronged","themselves","and it had become clear","to you","how","We dealt","with them","and We put forth","for you","the examples","(45)"],"transliterationArr":["wasakantum","fī","masākini","alladhīna","ẓalamū","anfusahum","watabayyana","lakum","kayfa","faʿalnā","bihim","waḍarabnā","lakumu","al-amthāla",null],"verseTiming":[[1,0,2040],[2,2040,2667],[3,2667,4081],[4,4081,4855],[5,4855,6895],[6,6895,8887],[7,8887,10317],[8,10317,11576],[9,11576,12930],[10,12930,13574],[11,13574,14333],[12,14333,15564],[13,15564,16285],[14,16285,17717],[15,17717,18552],[16,18552,21410]]}},{"name":"14:46","price":"یہ اپنی اپنی چالیں چل رہے ہیں اور اللہ کو ان کی تمام چالوں کا علم ہے(1) اور ان کی چالیں ایسی نہ تھیں کہ ان سے پہاڑ اپنی جگہ سے ٹل جائیں.(2)","arabic":"وَقَدۡ مَكَرُواْ مَكۡرَهُمۡ وَعِندَ ٱللَّهِ مَكۡرُهُمۡ وَإِن كَانَ مَكۡرُهُمۡ لِتَزُولَ مِنۡهُ ٱلۡجِبَالُ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim"],"ayahNumber":1796,"juzNumber":13,"footnotes":"(1) یہ جملہ حالیہ ہے کہ ہم نے ان کے ساتھ جو کیا وہ کیا، درآنحالیکہ انہوں نے باطل کے اثبات اور حق کے رد کرنے کے لئے مقدور بھر حیلے اور مکر کیے اور اللہ کو ان تمام چالوں کا علم ہے یعنی اس کے پاس درج ہے جس کی وہ ان کو سزا دے گا۔\n(2) کیونکہ اگر پہاڑ ٹل گئے ہوتے تو اپنی جگہ برقرار نہ ہوتے، جب کہ سب پہاڑ اپنی اپنی جگہ ثابت اور برقرار ہیں۔ یہ ان نافیہ کی صورت میں ہے دوسرے معین ان مخففۃ من المثقلۃ کے لیے گئے ہیں یعنی یقینا ان کے مکر تو اتنے بڑے تھے کہ پہاڑ بھی اپنی جگہ سے ٹل جاتے یہ تو اللہ تعالٰی ہی ہے جس نے ان کے مکروں کو کامیاب نہیں ہوتے دیا جیسے مشریکن کے شرک کے بارے میں اللہ تعالٰی نے فرمایا۔ «تَكَادُ السَّمَاوَاتُ يَتَفَطَّرْنَ مِنْهُ وَتَنْشَقُّ الأَرْضُ وَتَخِرُّ الْجِبَالُ هَدًّا (1) أَنْ دَعَوْا لِلرَّحْمَنِ وَلَدًا» (سورة مريم: 90-91)۔ ”قریب ہے کہ آسمان پھٹ پڑیں اور زمین شق ہو جائے اور پہاڑ ریزہ ریزہ ہو جائیں اس بات پر کہ انہوں نے کہا اللہ رحمٰن کی اولاد ہے“۔","lang":"ur","meta":{"transliteration":"waqad makarū makrahum waʿinda al-lahi makruhum wa-in kāna makruhum litazūla min'hu al-jibālu ","translations":["And indeed","they planned","their plan","but with","Allah","(was) their plan","even if","was","their plan","that should be moved","by it","the mountains","(46)"],"transliterationArr":["waqad","makarū","makrahum","waʿinda","al-lahi","makruhum","wa-in","kāna","makruhum","litazūla","min'hu","al-jibālu",null],"verseTiming":[[1,0,1282],[2,1282,2287],[3,2287,3102],[4,3102,4376],[5,4376,5212],[6,5212,7046],[7,7046,8378],[8,8378,9381],[9,9381,10489],[10,10489,11756],[11,11756,12843],[12,12843,13849],[13,13849,15078],[14,15078,15641],[15,15641,18935]]}},{"name":"14:47","price":"آپ ہرگز یہ خیال نہ کریں کہ اللہ اپنے نبیوں سے وعده خلافی کرے گا(1) ، اللہ بڑا ہی غالب اور بدلہ لینے واﻻ ہے.(2)","arabic":"فَلَا تَحۡسَبَنَّ ٱللَّهَ مُخۡلِفَ وَعۡدِهِۦ رُسُلَهُۥٓۚ إِنَّ ٱللَّهَ عَزِيزٞ ذُو ٱنتِقَامٖ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim"],"ayahNumber":1797,"juzNumber":13,"footnotes":"(1) یعنی اللہ نے اپنے رسولوں سے دنیا اور آخرت میں مدد کرنے کا جو وعدہ کیا ہے، وہ یقینا ایسا ہے، اس سے وعدہ خلافی ممکن نہیں۔\n(2) یعنی اپنے دوستوں کے لئے اپنے دشمنوں سے بدلہ لینے والا ہے۔","lang":"ur","meta":{"transliteration":"falā taḥsabanna al-laha mukh'lifa waʿdihi rusulahu inna al-laha ʿazīzun dhū intiqāmin ","translations":["So (do) not","think","(that) Allah","will fail","(to) keep His Promise","(to) His Messengers","Indeed","Allah","(is) All-Mighty","Owner (of) Retribution","Owner (of) Retribution","(47)"],"transliterationArr":["falā","taḥsabanna","al-laha","mukh'lifa","waʿdihi","rusulahu","inna","al-laha","ʿazīzun","dhū","intiqāmin",null],"verseTiming":[[1,0,773],[2,773,2629],[3,2629,3679],[4,3679,4651],[5,4651,5682],[6,5682,7173],[7,7173,8362],[8,8362,9431],[9,9431,12285],[10,12285,15042]]}},{"name":"14:48","price":"جس دن زمین اس زمین کے سوا اور ہی بدل دی جائے گی اور آسمان بھی(1) ، اور سب کے سب اللہ واحد غلبے والے کے روبرو ہوں گے.","arabic":"يَوۡمَ تُبَدَّلُ ٱلۡأَرۡضُ غَيۡرَ ٱلۡأَرۡضِ وَٱلسَّمَٰوَٰتُۖ وَبَرَزُواْ لِلَّهِ ٱلۡوَٰحِدِ ٱلۡقَهَّارِ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim"],"ayahNumber":1798,"juzNumber":13,"footnotes":"(1) امام شوکانی فرماتے ہیں کہ آیت میں دونوں احتمال ہیں کہ یہ تبدیلی صفات کے لحاظ سے ہو یا ذات کے لحاظ سے۔ یعنی یہ آسمان و زمین اپنے صفات کے اعتبار سے بدل جائیں گے یا ویسے ہی ذاتی طور پر یہ تبدیلی آئے گی، نہ زمین رہے گی اور نہ یہ آسمان۔ زمین بھی کوئی اور ہوگی اور آسمان بھی کوئی اور۔ حدیث میں آتا ہے، رسول اللہ (صلى الله عليه وسلم) نے فرمایا :«يُحْشَرُ النَّاسُ يَوْمَ الْقِيَامَةِ عَلَى أَرْضٍ بَيْضَاءَ عَفْرَاءَ، كَقُرْصَةِ النَّقِيِّ لَيْس فِيهَا عَلَمٌ لأحَدٍ»۔ (صحيح مسلم، صفة القيامة، باب في البعث والنشور) « قیامت والے دن لوگ سفید بھوری زمین پر اکھٹے ہونگے جو میدہ کی روٹی کی طرح ہوگی۔ اس میں کسی کا کوئی جھنڈا (یا علامتی نشان) نہیں ہوگا»۔ حضرت عائشہ رضی اللہ نے پوچھا کہ جب یہ آسمان و زمین بدل دئیے جائیں گے تو پھر لوگ اس دن کہاں ہونگے؟ نبی (صلى الله عليه وسلم) نے فرمایا ”صراط پر“ یعنی پل صراط پر (حوالہ مذکور) ایک یہودی کے پوچھنے پر آپ نے فرمایا کہ ”لوگ اس دن پل کے قریب اندھیرے میں ہونگے“۔ (صحيح مسلم، كتاب الحيض، باب بيان صفة مني الرجل)","lang":"ur","meta":{"transliteration":"yawma tubaddalu al-arḍu ghayra al-arḍi wal-samāwātu wabarazū lillahi al-wāḥidi al-qahāri ","translations":["(On the) Day","will be changed","the earth","(to) other (than)","the earth","and the heavens","and they will come forth","before Allah","the One","the Irresistible","(48)"],"transliterationArr":["yawma","tubaddalu","al-arḍu","ghayra","al-arḍi","wal-samāwātu","wabarazū","lillahi","al-wāḥidi","al-qahāri",null],"verseTiming":[[1,0,1495],[2,1495,2031],[3,2031,2971],[4,2971,3629],[5,3629,4604],[6,4604,8396],[7,8396,9608],[8,9608,10664],[9,10664,11713],[10,11713,15336]]}},{"name":"14:49","price":"آپ اس دن گناه گاروں کو دیکھیں گے کہ زنجیروں میں ملے جلے ایک جگہ جکڑے ہوئے ہوں گے.","arabic":"وَتَرَى ٱلۡمُجۡرِمِينَ يَوۡمَئِذٖ مُّقَرَّنِينَ فِي ٱلۡأَصۡفَادِ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim"],"ayahNumber":1799,"juzNumber":13,"footnotes":"","lang":"ur","meta":{"transliteration":"watarā al-muj'rimīna yawma-idhin muqarranīna fī al-aṣfādi ","translations":["And you will see","the criminals","(on) that Day","bound together","in","the chains","(49)"],"transliterationArr":["watarā","al-muj'rimīna","yawma-idhin","muqarranīna","fī","al-aṣfādi",null],"verseTiming":[[1,0,1461],[2,1461,2387],[3,2387,4542],[4,4542,6100],[5,6100,7121],[6,7121,9905]]}},{"name":"14:50","price":"ان کے لباس گندھک کے ہوں گے(1) اور آگ ان کے چہروں پر بھی چڑھی ہوئی ہوگی.","arabic":"سَرَابِيلُهُم مِّن قَطِرَانٖ وَتَغۡشَىٰ وُجُوهَهُمُ ٱلنَّارُ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim"],"ayahNumber":1800,"juzNumber":13,"footnotes":"(1) جو آگ سے فوراً بھڑک اٹھتی ہے۔ علاوہ ازیں آگ نے ان کے چہروں کو بھی ڈھانپا ہوگا۔","lang":"ur","meta":{"transliteration":"sarābīluhum min qaṭirānin wataghshā wujūhahumu al-nāru ","translations":["Their garments","of","tar","and will cover","their faces","the Fire","(50)"],"transliterationArr":["sarābīluhum","min","qaṭirānin","wataghshā","wujūhahumu","al-nāru",null],"verseTiming":[[1,0,2797],[2,2797,3676],[3,3676,7315],[4,7315,9670],[5,9670,10595],[6,10595,11948],[7,11948,13956],[8,13956,15489],[9,15489,18263]]}},{"name":"14:51","price":"یہ اس لیے کہ اللہ تعالیٰ ہر شخص کو اس کے کیے ہوئے اعمال کا بدلہ دے، بیشک اللہ تعالیٰ کو حساب لیتے کچھ دیر نہیں لگنے کی.","arabic":"لِيَجۡزِيَ ٱللَّهُ كُلَّ نَفۡسٖ مَّا كَسَبَتۡۚ إِنَّ ٱللَّهَ سَرِيعُ ٱلۡحِسَابِ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim"],"ayahNumber":1801,"juzNumber":13,"footnotes":"","lang":"ur","meta":{"transliteration":"liyajziya al-lahu kulla nafsin mā kasabat inna al-laha sarīʿu al-ḥisābi ","translations":["So that Allah may recompense","So that Allah may recompense","each","soul","(for) what","it earned","Indeed","Allah","(is) Swift","(in) the reckoning","(51)"],"transliterationArr":["liyajziya","al-lahu","kulla","nafsin","mā","kasabat","inna","al-laha","sarīʿu","al-ḥisābi",null],"verseTiming":[[1,0,2265],[2,2265,2777],[3,2777,3439],[4,3439,5036],[5,5036,5477],[6,5477,6845],[7,6845,7977],[8,7977,8818],[9,8818,9967],[10,9967,13639]]}},{"name":"14:52","price":"یہ قرآن(1) تمام لوگوں کے لیے اطلاع نامہ ہے کہ اس کے ذریعہ سے وه ہوشیار کر دیے جائیں اور بخوبی معلوم کرلیں کہ اللہ ایک ہی معبود ہے اور تاکہ عقلمند لوگ سوچ سمجھ لیں.","arabic":"هَٰذَا بَلَٰغٞ لِّلنَّاسِ وَلِيُنذَرُواْ بِهِۦ وَلِيَعۡلَمُوٓاْ أَنَّمَا هُوَ إِلَٰهٞ وَٰحِدٞ وَلِيَذَّكَّرَ أُوْلُواْ ٱلۡأَلۡبَٰبِ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim"],"ayahNumber":1802,"juzNumber":13,"footnotes":"(1) یہ اشارہ قرآن کی طرف ہے، یا پچھلی تفصیلات کی طرف جو «وَلَا تَحْسَبَنَّ اللّٰهَ غَافِلًا» (ابراہیم: 42) سے بیان کی گئی ہیں۔","lang":"ur","meta":{"transliteration":"hādhā balāghun lilnnāsi waliyundharū bihi waliyaʿlamū annamā huwa ilāhun wāḥidun waliyadhakkara ulū al-albābi ","translations":["This","(is) a Message","for the mankind","that they may be warned","with it","and that they may know","that only","He","(is) One God","(is) One God","and that may take heed","men","(of) understanding","(52)"],"transliterationArr":["hādhā","balāghun","lilnnāsi","waliyundharū","bihi","waliyaʿlamū","annamā","huwa","ilāhun","wāḥidun","waliyadhakkara","ulū","al-albābi",null],"verseTiming":[[1,0,1357],[2,1357,2566],[3,2566,4248],[4,4248,6227],[5,6227,6876],[6,6876,11293],[7,11293,12021],[8,12021,13563],[9,13563,14239],[10,14239,16193],[11,16193,17954],[12,17954,19884],[13,19884,21311],[14,21311,25516]]}}],"chapter":["14 (Ibrahim)","Ibrahim","Surah Ibrahim","Chapter Ibrahim","Surah 14","Chapter 14","Abraham","إبراهيم"],"version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."}}