{"data":[{"name":"29:1","price":"الم.","arabic":"الٓمٓ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3341,"juzNumber":20,"footnotes":"","lang":"ur","meta":{"transliteration":"alif-lam-meem ","translations":["Alif Laam Meem","(1)"],"transliterationArr":["alif-lam-meem",null],"verseTiming":[[1,0,10365]]}},{"name":"29:2","price":"کیا لوگوں نے یہ گمان کر رکھا ہے کہ ان کے صرف اس دعوے پر کہ ہم ایمان ﻻئے ہیں ہم انہیں بغیر آزمائے ہوئے ہی چھوڑ دیں گے؟.(1)","arabic":"أَحَسِبَ ٱلنَّاسُ أَن يُتۡرَكُوٓاْ أَن يَقُولُوٓاْ ءَامَنَّا وَهُمۡ لَا يُفۡتَنُونَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3342,"juzNumber":20,"footnotes":"(1) یعنی یہ گمان کہ صرف زبان سے ایمان لانے کے بعد، بغیر امتحان لیے، انہیں چھوڑ دیا جائے گا، صحیح نہیں۔ بلکہ انہیں جان ومال کی تکالیف اور دیگر آزمائشوں کے ذریعے سے جانچا پر کھا جائے گا تاکہ کھرے کھوٹے کا، سچے جھوٹے کا اور مومن ومنافق کا پتہ چل جائے۔","lang":"ur","meta":{"transliteration":"aḥasiba al-nāsu an yut'rakū an yaqūlū āmannā wahum lā yuf'tanūna ","translations":["Do think","the people","that","they will be left","because","they say","We believe","and they","will not be tested","will not be tested","(2)"],"transliterationArr":["aḥasiba","al-nāsu","an","yut'rakū","an","yaqūlū","āmannā","wahum","lā","yuf'tanūna",null],"verseTiming":[[1,0,840],[2,840,2589],[3,2589,2829],[4,2829,6029],[5,6029,6359],[6,6359,9069],[7,9069,10969],[8,10969,11589],[9,11589,12069],[10,12069,15594]]}},{"name":"29:3","price":"ان سے اگلوں کو بھی ہم نے خوب جانچا(1) ۔ یقیناً اللہ تعالیٰ انہیں بھی جان لے گا جو سچ کہتے ہیں اور انہیں بھی معلوم کرلے گا جو جھوٹے ہیں.","arabic":"وَلَقَدۡ فَتَنَّا ٱلَّذِينَ مِن قَبۡلِهِمۡۖ فَلَيَعۡلَمَنَّ ٱللَّهُ ٱلَّذِينَ صَدَقُواْ وَلَيَعۡلَمَنَّ ٱلۡكَٰذِبِينَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3343,"juzNumber":20,"footnotes":"(1) یعنی یہ سنت الٰہی ہے جو پہلے سے چلی آرہی ہے۔ اس لیے وہ اس امت کے مومنوں کی بھی آزمائش کرے گا، جس طرح پہلی امتوں کی آزمائش کی گئی۔ ان آیات کی شان نزول کی روایات میں آتا ہے کہ صحابہ کرام (رضي الله عنهم) نے اس ظلم وستم کی شکایت کی جس کا نشانہ وہ کفار مکہ کی طرف سے بنے ہوئے تھے اور رسول اللہ (صلى الله عليه وسلم) سے دعا کی درخواست کی تاکہ اللہ تعالیٰ ان کی مدد فرمائے۔ آپ (صلى الله عليه وسلم) نے فرمایا کہ یہ تشدد وایذا تو اہل ایمان کی تاریخ کا حصہ ہے۔ تم سے پہلے بعض مومنوں کا یہ حال کیا گیا کہ انہیں ایک گڑھا کھود کر اس میں کھڑا کر دیا گیا اور پھر ان کے سروں پر آرا چلا دیا گیا، جس سے ان کے جسم دو حصوں میں تقسیم ہوگئے، اسی طرح لوہے کی کنگھیاں ان کے گوشت پر ہڈیوں تک پھیری گئیں۔ لیکن یہ ایذائیں انہیں دین حق سے پھیرنے میں کامیاب نہیں ہوئیں۔ (صحيح بخاري، كتاب أحاديث الأنبياء، باب علامات النبوة في الإسلام) حضرت عمار، ان کی والدہ حضرت سمیہ اور والد حضرت یاسر، حضرت صہیب، بلال ومقداد وغیرہم رضوان اللہ علیہم اجمعین پر اسلام کے ابتدائی دور میں جو ظلم وستم کے پہاڑ توڑے گئے، وہ صفحات تاریخ میں محفوظ ہیں۔ یہ واقعات ہی ان آیات کے نزول کا سبب بنے۔ تاہم عموم الفاظ کے اعتبار سے قیامت تک کے اہل ایمان اس میں داخل ہیں۔","lang":"ur","meta":{"transliteration":"walaqad fatannā alladhīna min qablihim falayaʿlamanna al-lahu alladhīna ṣadaqū walayaʿlamanna al-kādhibīna ","translations":["And indeed","We tested","those who","(were) before them","(were) before them","And Allah will surely make evident","And Allah will surely make evident","those who","(are) truthful","and He will surely make evident","the liars","(3)"],"transliterationArr":["walaqad","fatannā","alladhīna","min","qablihim","falayaʿlamanna","al-lahu","alladhīna","ṣadaqū","walayaʿlamanna","al-kādhibīna",null],"verseTiming":[[1,0,830],[2,830,2190],[3,2190,3260],[4,3260,4320],[5,4320,5330],[6,5330,7690],[7,7690,8600],[8,8600,9680],[9,9680,10630],[10,10630,12920],[11,12920,16365]]}},{"name":"29:4","price":"کیا جو لوگ برائیاں کر رہے ہیں انہوں نے یہ سمجھ رکھا ہے کہ وه ہمارے قابو سے باہر ہو جائیں گے(1) ، یہ لوگ کیسی بری تجویزیں کر رہے ہیں.(1)","arabic":"أَمۡ حَسِبَ ٱلَّذِينَ يَعۡمَلُونَ ٱلسَّيِّـَٔاتِ أَن يَسۡبِقُونَاۚ سَآءَ مَا يَحۡكُمُونَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3344,"juzNumber":20,"footnotes":"(1) یعنی ہم سے بھاگ جائیں گے اور ہماری گرفت میں نہ آسکیں گے۔\n(2) یعنی اللہ کے بارے میں کس ظن فاسد میں یہ مبتلا ہیں، جب کہ وہ ہر چیز پر قادر ہے اور ہر بات سے باخبر بھی . پھر اس کی نافرمانی کرکے اس کے مواخذہ وعذاب سے بچنا کیوں کر ممکن ہے؟","lang":"ur","meta":{"transliteration":"am ḥasiba alladhīna yaʿmalūna al-sayiāti an yasbiqūnā sāa mā yaḥkumūna ","translations":["Or","think","those who","do","evil deeds","that","they can outrun Us","Evil is","what","they judge","(4)"],"transliterationArr":["am","ḥasiba","alladhīna","yaʿmalūna","al-sayiāti","an","yasbiqūnā","sāa","mā","yaḥkumūna",null],"verseTiming":[[1,0,470],[2,470,1040],[3,1040,2170],[4,2170,3350],[5,3350,4920],[6,4920,5120],[7,5120,7840],[8,7840,10620],[9,10620,10950],[10,10950,13845]]}},{"name":"29:5","price":"جسے اللہ کی ملاقات کی امید ہو پس اللہ کا ٹھہرایا ہوا وقت یقیناً آنے واﻻ ہے(1) ، وه سب کچھ سننے واﻻ، سب کچھ جاننے واﻻ ہے.(2)","arabic":"مَن كَانَ يَرۡجُواْ لِقَآءَ ٱللَّهِ فَإِنَّ أَجَلَ ٱللَّهِ لَأٓتٖۚ وَهُوَ ٱلسَّمِيعُ ٱلۡعَلِيمُ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3345,"juzNumber":20,"footnotes":"(1) یعنی جسے آخرت پر یقین ہے اور وہ اجر وثواب کی امید پر اعمال صالحہ کرتا ہے۔ اللہ تعالیٰ اس کی امیدیں برلائے گا اور اسے اس کے عملوں کی مکمل جزا عطا فرمائے گا، کیونکہ قیامت یقیناً برپا ہوکر رہے گی اور اللہ کی عدالت ضرور قائم ہوگی۔\n(2) وہ بندوں کی باتوں اور دعاوں کا سننے والا اور ان کے چھپے اور ظاہر سب عملوں کو جاننے والا ہے۔ اس کے مطابق وہ جزا وسزا بھی یقیناً دے گا۔","lang":"ur","meta":{"transliteration":"man kāna yarjū liqāa al-lahi fa-inna ajala al-lahi laātin wahuwa al-samīʿu al-ʿalīmu ","translations":["Whoever","[is]","hopes","(for the) meeting","(with) Allah","then indeed","(the) Term","(of) Allah","(is) surely coming","And He","(is) the All-Hearer","the All-Knower","(5)"],"transliterationArr":["man","kāna","yarjū","liqāa","al-lahi","fa-inna","ajala","al-lahi","laātin","wahuwa","al-samīʿu","al-ʿalīmu",null],"verseTiming":[[1,0,1340],[2,1340,1930],[3,1930,2770],[4,2770,4970],[5,4970,5970],[6,5970,7220],[7,7220,7840],[8,7840,8690],[9,8690,11260],[10,11260,11800],[11,11800,12870],[12,12870,16035]]}},{"name":"29:6","price":"اور ہر ایک کوشش کرنے واﻻ اپنے ہی بھلے کی کوشش کرتا ہے۔ ویسے تو اللہ تعالیٰ تمام جہان والوں سے بےنیاز ہے.(1)","arabic":"وَمَن جَٰهَدَ فَإِنَّمَا يُجَٰهِدُ لِنَفۡسِهِۦٓۚ إِنَّ ٱللَّهَ لَغَنِيٌّ عَنِ ٱلۡعَٰلَمِينَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3346,"juzNumber":20,"footnotes":"(1) اس کا مطلب وہی ہے جو «مَنْ عَمِلَ صَالِحًا فَلِنَفْسِهِ» (الجاثية: 15) کا ہے یعنی جو نیک عمل کرے گا، اس کا فائدہ اسی کو ہوگا۔ ورنہ اللہ تعالیٰ تو بندوں کے افعال سے بےنیاز ہے۔ اگر سارے کے سارے متقی بن جائیں تو اس سے اس کی سلطنت میں قوت واضافہ نہیں ہوگا اور سب نافرمان ہو جائیں تو اس سے اس کی بادشاہی میں کمی نہیں ہوگی۔ الفاظ کی مناسبت سے اس میں جہاد مع الکفار بھی شامل ہے کہ وہ بھی من جملہ اعمال صالحہ ہی ہے۔","lang":"ur","meta":{"transliteration":"waman jāhada fa-innamā yujāhidu linafsihi inna al-laha laghaniyyun ʿani al-ʿālamīna ","translations":["And whoever","strives","then only","he strives","for himself","Indeed","Allah","(is) Free from need","of","the worlds","(6)"],"transliterationArr":["waman","jāhada","fa-innamā","yujāhidu","linafsihi","inna","al-laha","laghaniyyun","ʿani","al-ʿālamīna",null],"verseTiming":[[1,0,1640],[2,1640,2620],[3,2620,4350],[4,4350,5490],[5,5490,6910],[6,6910,8000],[7,8000,8910],[8,8910,10120],[9,10120,10580],[10,10580,13925]]}},{"name":"29:7","price":"اور جن لوگوں نے یقین کیا اور مطابق سنت کام کیے ہم ان کے تمام گناہوں کو ان سے دور کر دیں گے اور انہیں ان کے نیک اعمال کے بہترین بدلے دیں گے.(1)","arabic":"وَٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ لَنُكَفِّرَنَّ عَنۡهُمۡ سَيِّـَٔاتِهِمۡ وَلَنَجۡزِيَنَّهُمۡ أَحۡسَنَ ٱلَّذِي كَانُواْ يَعۡمَلُونَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3347,"juzNumber":20,"footnotes":"(1) یعنی باوجود اس بات کے کہ اللہ تعالیٰ تمام مخلوق سے بے نیاز ہے، وہ محض اپنے فضل وکرم سے اہل ایمان کو ان کے عملوں کی بہترین جزا عطا فرمائے گا۔ اور ایک ایک نیکی پر کئی کئی گنا اجر وثواب دے گا۔","lang":"ur","meta":{"transliteration":"wa-alladhīna āmanū waʿamilū al-ṣāliḥāti lanukaffiranna ʿanhum sayyiātihim walanajziyannahum aḥsana alladhī kānū yaʿmalūna ","translations":["And those who","believe","and do","righteous (deeds)","surely, We will remove","from them","their evil deeds","and We will surely reward them","(the) best","(of) what","they used","(to) do","(7)"],"transliterationArr":["wa-alladhīna","āmanū","waʿamilū","al-ṣāliḥāti","lanukaffiranna","ʿanhum","sayyiātihim","walanajziyannahum","aḥsana","alladhī","kānū","yaʿmalūna",null],"verseTiming":[[1,0,1270],[2,1270,2480],[3,2480,3270],[4,3270,4730],[5,4730,7180],[6,7180,7910],[7,7910,9660],[8,9660,12890],[9,12890,15640],[10,15640,16380],[11,16380,17310],[12,17310,18150],[13,18150,21135]]}},{"name":"29:8","price":"ہم نے ہر انسان کو اپنے ماں باپ کے ساتھ اچھا سلوک کرنے کی نصیحت کی ہے(1) ہاں اگر وه یہ کوشش کریں کہ آپ میرے ساتھ اسے شریک کرلیں جس کا آپ کو علم نہیں تو ان کا کہنا نہ مانیئے(2)، تم سب کا لوٹنا میری ہی طرف ہے پھر میں ہر اس چیز سے جو تم کرتے تھے تمہیں خبر دوں گا.","arabic":"وَوَصَّيۡنَا ٱلۡإِنسَٰنَ بِوَٰلِدَيۡهِ حُسۡنٗاۖ وَإِن جَٰهَدَاكَ لِتُشۡرِكَ بِي مَا لَيۡسَ لَكَ بِهِۦ عِلۡمٞ فَلَا تُطِعۡهُمَآۚ إِلَيَّ مَرۡجِعُكُمۡ فَأُنَبِّئُكُم بِمَا كُنتُمۡ تَعۡمَلُونَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3348,"juzNumber":20,"footnotes":"(1) قرآن کریم کے متعدد مقامات پر اللہ تعالیٰ نے اپنی توحید وعبادت کا حکم دینے کے ساتھ والدین کے ساتھ حسن سلوک کی تاکید کی ہے جس سے اس امر کی وضاحت ہوتی ہے کہ ربوبیت (الہٰ واحد) کے تقاضوں کو صحیح طریقے سے وہی سمجھ سکتا اور انہیں ادا کرسکتا ہے جو والدین کی اطاعت وخدمت کے تقاضوں کو سمجھتا اور ادا کرتا ہے۔ جو شخص یہ بات سمجھنے سے قاصر ہے کہ دنیا میں اس کا وجود والدین کی باہمی قربت کا نتیجہ اور اس کی تربیت وپرداخت، ان کی غایت مہربانی اور شفقت کا ثمرہ ہے۔ اس لیے مجھے ان کی خدمت میں کوئی کوتاہی اور ان کی اطاعت سے سرتابی نہیں کرنی چاہیے۔ وہ یقیناً خالق کائنات کو سمجھنے اور اس کی توحید وعبادت کے تقاضوں کی ادائیگی سے بھی قاصر رہے گا۔ اسی لیے احادیث میں بھی والدین کے ساتھ حسن سلوک کی بڑی تاکید آئی ہے۔ ایک حدیث میں والدین کی رضامندی کو اللہ کی رضا اور ان کی ناراضی کو رب کی ناراضی کا باعث قرار دیا گیا ہے۔\n(2) یعنی والدین اگر شرک کا حکم دیں (اور اسی میں دیگر معاصی کا حکم بھی شامل ہے) اور اس کے لیے خاص کوشش بھی کریں۔ (جیسا کہ مجاہدہ کے لفظ سے واضح ہے) تو ان کی اطاعت نہیں کرنی چاہیئے۔ کیونکہ «لا طَاعَةَ لأَحَدٍ فِي مَعْصِيَةِ اللهِ تَبَارَكَ وَتَعَالَى» (مسند أحمد5/66 والصحيحة للألباني، نمبر 179) ”اللہ کی نافرمانی میں کسی کی اطاعت نہیں“۔\nاس آیت کی شان نزول میں حضرت سعد بن ابی وقاص (رضي الله عنه) ، کا واقعہ آتا ہے کہ ان کے مسلمان ہونے پر ان کی والدہ نے کہا کہ میں نہ کھاؤں گی نہ پیوں گی، یہاں تک کہ مجھے موت آجائے یا پھر تو محمد (صلى الله عليه وسلم) کی نبوت کا انکار کر دے، بالآخر یہ اپنی والدہ کو زبردستی منہ کھول کر کھلاتے، جس پر یہ آیت نازل ہوئی۔ (صحيح مسلم، ترمذي، تفسير سورة العنكبوت)","lang":"ur","meta":{"transliteration":"wawaṣṣaynā al-insāna biwālidayhi ḥus'nan wa-in jāhadāka litush'rika bī mā laysa laka bihi ʿil'mun falā tuṭiʿ'humā ilayya marjiʿukum fa-unabbi-ukum bimā kuntum taʿmalūna ","translations":["And We have enjoined","(on) man","goodness to his parents","goodness to his parents","but if","they both strive against you","to make you associate","with Me","what","not","you have","of it","any knowledge","then (do) not","obey both of them","To Me","(is) your return","and I will inform you","about what","you used","(to) do","(8)"],"transliterationArr":["wawaṣṣaynā","al-insāna","biwālidayhi","ḥus'nan","wa-in","jāhadāka","litush'rika","bī","mā","laysa","laka","bihi","ʿil'mun","falā","tuṭiʿ'humā","ilayya","marjiʿukum","fa-unabbi-ukum","bimā","kuntum","taʿmalūna",null],"verseTiming":[[1,0,1160],[2,1160,3200],[3,3200,4670],[4,4670,5630],[5,5630,7480],[6,7480,8760],[7,8760,9800],[8,9800,10230],[9,10230,10630],[10,10630,11270],[11,11270,11610],[12,11610,12260],[13,12260,13620],[14,13620,14250],[15,14250,15650],[16,15650,17100],[17,17100,18280],[18,18280,20710],[19,20710,21330],[20,21330,22910],[21,22910,26205]]}},{"name":"29:9","price":"اور جن لوگوں نے ایمان قبول کیا اور نیک کام کیے انہیں میں اپنے نیک بندوں میں شمار کر لوں گا.(1)","arabic":"وَٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ لَنُدۡخِلَنَّهُمۡ فِي ٱلصَّٰلِحِينَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3349,"juzNumber":20,"footnotes":"(1) یعنی اگر کسی کے والدین مشرک ہوں گے تو مومن بیٹا نیکوں کے ساتھ ہوگا، والدین کے ساتھ نہیں۔ اس لیے کہ گو والدین دنیا میں اس کے بہت قریب رہے ہوں گے لیکن اس کی محبت دینی اہل ایمان ہی کے ساتھ تھی بنا بریں «الْمَرْءُ مَعَ مَنْ أَحَبَّ» کے تحت وہ زمرۂ صالحین میں ہوگا۔","lang":"ur","meta":{"transliteration":"wa-alladhīna āmanū waʿamilū al-ṣāliḥāti lanud'khilannahum fī al-ṣāliḥīna ","translations":["And those who","believe","and do","righteous deeds","We will surely admit them","among","the righteous","(9)"],"transliterationArr":["wa-alladhīna","āmanū","waʿamilū","al-ṣāliḥāti","lanud'khilannahum","fī","al-ṣāliḥīna",null],"verseTiming":[[1,0,1330],[2,1330,2510],[3,2510,3210],[4,3210,4680],[5,4680,7040],[6,7040,7240],[7,7240,10705]]}},{"name":"29:10","price":"اور بعض لوگ ایسے بھی ہیں جو زبانی کہتے ہیں کہ ہم ایمان ﻻئے ہیں لیکن جب اللہ کی راه میں کوئی مشکل آن پڑتی ہے تو لوگوں کی ایذا دہی کو اللہ تعالیٰ کے عذاب کی طرح بنا لیتے ہیں(1) ، ہاں اگر اللہ کی مدد آجائے(2) تو پکار اٹھتے ہیں کہ ہم تو تمہارے ساتھی ہی ہیں(3) کیا دنیا جہان کے سینوں میں جو کچھ ہے اس سے اللہ تعالیٰ دانا نہیں ہے؟(4)","arabic":"وَمِنَ ٱلنَّاسِ مَن يَقُولُ ءَامَنَّا بِٱللَّهِ فَإِذَآ أُوذِيَ فِي ٱللَّهِ جَعَلَ فِتۡنَةَ ٱلنَّاسِ كَعَذَابِ ٱللَّهِۖ وَلَئِن جَآءَ نَصۡرٞ مِّن رَّبِّكَ لَيَقُولُنَّ إِنَّا كُنَّا مَعَكُمۡۚ أَوَلَيۡسَ ٱللَّهُ بِأَعۡلَمَ بِمَا فِي صُدُورِ ٱلۡعَٰلَمِينَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3350,"juzNumber":20,"footnotes":"(1) اس میں اہل نفاق یا کمزور ایمان والوں کا حال بیان کیا گیا ہے کہ ایمان کی وجہ سے انہیں ایذا پہنچتی ہے تو عذاب الٰہی کی طرح وہ ان کے لیے ناقابل برداشت ہوتی ہے۔ نتیجتاً وہ ایمان سے پھر جاتے اور دین عوام کو اختیار کر لیتے ہیں۔\n(2) یعنی مسلمانوں کو فتح وغلبہ نصیب ہو جائے۔\n(3) یعنی تمہارے دینی بھائی ہیں۔ یہ وہی مضمون ہے جو دوسرے مقام پر اس طرح بیان فرمایا گیا ہے کہ وہ لوگ تمہیں دیکھتے رہتے ہیں، اگر تمہیں اللہ کی طرف سے فتح ملتی ہے، تو کہتے ہیں کیا ہم تمہارے ساتھ نہیں تھے؟ اور اگر حالات کافروں کے لیے کچھ سازگار ہوتے ہیں تو کافروں سے جاکر کہتے ہیں کہ کیا ہم نے تم کو گھیر نہیں لیا تھا اور مسلمانوں سے تم کو نہیں بچایا تھا۔ (النساء: 141)\n(4) یعنی کیا اللہ ان باتوں کو نہیں جانتا جو تمہارے دلوں میں ہے اور تمہارے ضمیروں میں پوشیدہ ہے۔ گو تم زبان سے مسلمانوں کا ساتھ ہونا ظاہر کرتے ہو۔","lang":"ur","meta":{"transliteration":"wamina al-nāsi man yaqūlu āmannā bil-lahi fa-idhā ūdhiya fī al-lahi jaʿala fit'nata al-nāsi kaʿadhābi al-lahi wala-in jāa naṣrun min rabbika layaqūlunna innā kunnā maʿakum awalaysa al-lahu bi-aʿlama bimā fī ṣudūri al-ʿālamīna ","translations":["And of","the people","(is he) who","says","We believe","in Allah","But when","he is harmed","in","(the Way of) Allah","he considers","(the) trial","(of) the people","as (the) punishment","(of) Allah","But if","comes","victory","from","your Lord","surely they say","Indeed, we","were","with you","Is not","Allah","most knowing","of what","(is) in","(the) breasts","(of) the worlds","(10)"],"transliterationArr":["wamina","al-nāsi","man","yaqūlu","āmannā","bil-lahi","fa-idhā","ūdhiya","fī","al-lahi","jaʿala","fit'nata","al-nāsi","kaʿadhābi","al-lahi","wala-in","jāa","naṣrun","min","rabbika","layaqūlunna","innā","kunnā","maʿakum","awalaysa","al-lahu","bi-aʿlama","bimā","fī","ṣudūri","al-ʿālamīna",null],"verseTiming":[[1,0,1465],[2,1465,2366],[3,2366,3211],[4,3211,4152],[5,4152,5867],[6,5867,6953],[7,6953,9295],[8,9295,10100],[9,10100,10612],[10,10612,11154],[11,11154,11825],[12,11825,12785],[13,12785,14073],[14,14073,15057],[15,15057,17831],[16,17831,19984],[17,19984,21275],[18,21275,21743],[19,21743,22360],[20,22360,22892],[21,22892,23917],[22,23917,25239],[23,25239,26253],[24,26253,27215],[25,27215,28525],[26,28525,30798],[27,30798,32007],[28,32007,32664],[29,32664,33369],[30,33369,35937],[31,35937,38580],[32,38580,39881],[33,39881,41165],[34,41165,42730],[35,42730,43619],[36,43619,44501],[37,44501,45562],[38,45562,46242],[39,46242,46703],[40,46703,47499],[41,47499,50028]]}},{"name":"29:11","price":"جو لوگ ایمان ﻻئے اللہ انہیں بھی ﻇاہر کرکے رہے گا اور منافقوں کو بھی ﻇاہر کرکے رہے گا.(1)","arabic":"وَلَيَعۡلَمَنَّ ٱللَّهُ ٱلَّذِينَ ءَامَنُواْ وَلَيَعۡلَمَنَّ ٱلۡمُنَٰفِقِينَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3351,"juzNumber":20,"footnotes":"(1) اس کا مطلب ہے کہ اللہ تعالیٰ خوشی اور تکلیف دے کر آزمائے گا تاکہ منافق اور مومن کی تمیز ہو جائے جو دونوں حالتوں میں اللہ کی اطاعت کرے گا، وہ مومن ہے اور جو صرف خوشی اور راحت میں اطاعت کرے گا تو اس کے معنی یہ ہیں کہ وہ صرف اپنے حظ نفس کا مطیع ہے ، اللہ کا نہیں۔ جس طرح دوسرے مقام پر فرمایا: «وَلَنَبْلُوَنَّكُمْ حَتَّى نَعْلَمَ الْمُجَاهِدِينَ مِنْكُمْ وَالصَّابِرِينَ وَنَبْلُوَ أَخْبَارَكُمْ» (سورة محمد: 31) ”ہم تمہیں ضرور آزمائیں گے، تاکہ ہم جان لیں تم میں مجاہد اور صابر کون ہیں اور تمہارے دیگر حالت بھی جانچیں گے“۔ جنگ احد کے بعد، جس میں مسلمان اختیار وامتحان کی بھٹی سے گزارے گئے تھے، فرمایا: «مَا كَانَ اللَّهُ لِيَذَرَ الْمُؤْمِنِينَ عَلَى مَا أَنْتُمْ عَلَيْهِ حَتَّى يَمِيزَ الْخَبِيثَ مِنَ الطَّيِّبِ» (سورة آل عمران: 179) ”نہیں ہے اللہ تعالیٰ کہ وہ چھوڑ دے مومنوں کو، اس حالت پر جس پر کہ تم ہو، یہاں تک کہ وہ جدا کر دے ناپاک کو پاک سے“۔","lang":"ur","meta":{"transliteration":"walayaʿlamanna al-lahu alladhīna āmanū walayaʿlamanna al-munāfiqīna ","translations":["And Allah will surely make evident","And Allah will surely make evident","those who","believe","And He will surely make evident","the hypocrites","(11)"],"transliterationArr":["walayaʿlamanna","al-lahu","alladhīna","āmanū","walayaʿlamanna","al-munāfiqīna",null],"verseTiming":[[1,0,52688],[2,52688,53542],[3,53542,54544],[4,54544,55615],[5,55615,58081],[6,58081,60846]]}},{"name":"29:12","price":"کافروں نے ایماں والوں سے کہا کہ تم ہماری راه کی تابعداری کرو تمہارے گناه ہم اٹھا لیں گے(1) ، حاﻻنکہ وه ان کے گناہوں میں سے کچھ بھی نہیں اٹھانے والے، یہ تو محض جھوٹے ہیں.(2)","arabic":"وَقَالَ ٱلَّذِينَ كَفَرُواْ لِلَّذِينَ ءَامَنُواْ ٱتَّبِعُواْ سَبِيلَنَا وَلۡنَحۡمِلۡ خَطَٰيَٰكُمۡ وَمَا هُم بِحَٰمِلِينَ مِنۡ خَطَٰيَٰهُم مِّن شَيۡءٍۖ إِنَّهُمۡ لَكَٰذِبُونَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3352,"juzNumber":20,"footnotes":"(1) یعنی تم اسی آبائی دین کی طرف لوٹ آو، جس پر ہم ابھی تک قائم ہیں، اس لیے کہ وہی دین صحیح ہے۔ اگر اس روایتی مذہب پر عمل کرنے سے تم گناہ گار ہوگے تو اس کے ذمے دار ہم ہیں، وہ بوجھ ہم اپنی گردنوں پر اٹھائیں گے۔\n(2) اللہ تعالیٰ نے فرمایا یہ جھوٹے ہیں۔ قیامت کا دن تو ایسا ہوگا کہ وہاں کوئی کسی کا بوجھ نہیں اٹھائے گا۔ «وَلا تَزِرُ وَازِرَةٌ وِزْرَ أُخْرَى» وہاں تو ایک دوست ، دوسرے دوست کو نہیں پوچھے گا چاہے ان کے درمیان نہایت گہری دوستی ہو۔ «وَلا يَسْأَلُ حَمِيمٌ حَمِيمًا» (المعارج: 10) حتیٰ کہ رشتے دار ایک دوسرے کا بوجھ نہیں اٹھائیں گے «وَإِنْ تَدْعُ مُثْقَلَةٌ إِلَى حِمْلِهَا لا يُحْمَلْ مِنْهُ شَيْءٌ وَلَوْ كَانَ ذَا قُرْبَى» (سورة فاطر: 18) اور یہاں بھی اس بوجھ کے اٹھانے کی نفی فرمائی۔","lang":"ur","meta":{"transliteration":"waqāla alladhīna kafarū lilladhīna āmanū ittabiʿū sabīlanā walnaḥmil khaṭāyākum wamā hum biḥāmilīna min khaṭāyāhum min shayin innahum lakādhibūna ","translations":["And said","those who","disbelieve","to those who","believe","Follow","our way","and we will carry","your sins","But not","they","(are) going to carry","of","their sins","any","thing","Indeed, they","(are) surely liars","(12)"],"transliterationArr":["waqāla","alladhīna","kafarū","lilladhīna","āmanū","ittabiʿū","sabīlanā","walnaḥmil","khaṭāyākum","wamā","hum","biḥāmilīna","min","khaṭāyāhum","min","shayin","innahum","lakādhibūna",null],"verseTiming":[[1,0,870],[2,870,1900],[3,1900,2800],[4,2800,3950],[5,3950,4790],[6,4790,5730],[7,5730,7040],[8,7040,8210],[9,8210,9740],[10,9740,10340],[11,10340,11280],[12,11280,12700],[13,12700,13110],[14,13110,14690],[15,14690,15660],[16,15660,18120],[17,18120,20590],[18,20590,23955]]}},{"name":"29:13","price":"البتہ یہ اپنے بوجھ ڈھولیں گے اور اپنے بوجھوں کے ساتھ ہی اور بوجھ بھی(1) ۔ اور جو کچھ افترا پردازیاں کر رہے ہیں ان سب کی بابت ان سے باز پرس کی جائے گی.","arabic":"وَلَيَحۡمِلُنَّ أَثۡقَالَهُمۡ وَأَثۡقَالٗا مَّعَ أَثۡقَالِهِمۡۖ وَلَيُسۡـَٔلُنَّ يَوۡمَ ٱلۡقِيَٰمَةِ عَمَّا كَانُواْ يَفۡتَرُونَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3353,"juzNumber":20,"footnotes":"(1) یعنی یہ ائمہ کفر اور داعیان ضلال اپنا ہی بوجھ نہیں اٹھائیں گے، بلکہ ان لوگوں کے گناہوں کا بوجھ بھی ان پر ہوگا جو ان کی سعی وکاوش سے گمراہ ہوئے تھے۔ یہ مضمون سورۃ النحل آیت 25 میں بھی گزر چکا ہے۔ حدیث میں ہے، جو ہدایت کی طرف بلاتا ہے ، اس کے لیے اپنی نیکیوں کے اجر کے ساتھ ان لوگوں کی نیکیوں کا اجر بھی ہوگا جو اس کی وجہ سے قیامت تک ہدایت کی پیروی کریں گے، بغیر اس کے کہ ان کے اجر میں کوئی کمی ہو۔ اور جو گمراہی کا داعی ہوگا، اس کے لیے اپنے گناہوں کے علاوہ ان لوگوں کے گناہوں کا بوجھ بھی ہوگا جو قیامت تک اس کی وجہ سے گمراہی کا راستہ اختیار کرنے والے ہوں گے، بغیر اس کے کہ ان کے گناہوں میں کمی ہو۔ (أبو داود، كتاب السنة، باب لزوم السنة ابن ماجه، المقدمة، باب من سن سنة حسنة أو سيئة) اسی اصول سے قیامت تک ظلم سے قتل کیے جانے والوں کے خون کا گناہ آدم (عليه السلام) کے پہلے بیٹے (قابیل) پر ہوگا۔ اس لیے کہ سب سے پہلے اسی نے ناحق قتل کیا تھا (مسند أحمد 1/383 وقد أخرجه الجماعة سوى أبي داود من طرق )","lang":"ur","meta":{"transliteration":"walayaḥmilunna athqālahum wa-athqālan maʿa athqālihim walayus'alunna yawma al-qiyāmati ʿammā kānū yaftarūna ","translations":["But surely they will carry","their burdens","and burdens","with","their burdens","and surely they will be questioned","(on the) Day","(of) the Resurrection","about what","they used","(to) invent","(13)"],"transliterationArr":["walayaḥmilunna","athqālahum","wa-athqālan","maʿa","athqālihim","walayus'alunna","yawma","al-qiyāmati","ʿammā","kānū","yaftarūna",null],"verseTiming":[[1,0,2140],[2,2140,3660],[3,3660,5100],[4,5100,6340],[5,6340,8200],[6,8200,10400],[7,10400,11020],[8,11020,12320],[9,12320,13850],[10,13850,14870],[11,14870,19415]]}},{"name":"29:14","price":"اور ہم نے نوح (علیہ السلام) کو ان کی قوم کی طرف بھیجا وه ان میں ساڑھے نو سو سال تک رہے(1) ، پھر تو انہیں طوفان نے دھر پکڑا اور وه تھے بھی ﻇالم.","arabic":"وَلَقَدۡ أَرۡسَلۡنَا نُوحًا إِلَىٰ قَوۡمِهِۦ فَلَبِثَ فِيهِمۡ أَلۡفَ سَنَةٍ إِلَّا خَمۡسِينَ عَامٗا فَأَخَذَهُمُ ٱلطُّوفَانُ وَهُمۡ ظَٰلِمُونَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3354,"juzNumber":20,"footnotes":"(1) قرآن کے الفاظ سے معلوم ہوتا ہے کہ یہ ان کی دعوت وتبلیغ کی عمر ہے۔ ان کی پوری عمر کتنی تھی؟ اس کی صراحت نہیں کی گئی۔ بعض کہتے ہیں چالیس سال نبوت سے قبل اور ساٹھ سال طوفان کے بعد، اس میں شامل کر لیے جائیں۔ اور بھی کئی اقوال ہیں، وَاللهُ أَعْلَمُ بِالصَّوَابِ۔","lang":"ur","meta":{"transliteration":"walaqad arsalnā nūḥan ilā qawmihi falabitha fīhim alfa sanatin illā khamsīna ʿāman fa-akhadhahumu al-ṭūfānu wahum ẓālimūna ","translations":["And verily","We sent","Nuh","to","his people","and he remained","among them","a thousand","year(s)","save","fifty","year(s)","then seized them","the flood","while they","(were) wrongdoers","(14)"],"transliterationArr":["walaqad","arsalnā","nūḥan","ilā","qawmihi","falabitha","fīhim","alfa","sanatin","illā","khamsīna","ʿāman","fa-akhadhahumu","al-ṭūfānu","wahum","ẓālimūna",null],"verseTiming":[[1,0,860],[2,860,2130],[3,2130,2930],[4,2930,3470],[5,3470,4540],[6,4540,5400],[7,5400,6190],[8,6190,6790],[9,6790,7660],[10,7660,8370],[11,8370,9410],[12,9410,10410],[13,10410,11950],[14,11950,12760],[15,12760,13300],[16,13300,14130],[17,14130,14870],[18,14870,15920],[19,15920,17280],[20,17280,18450],[21,18450,19740],[22,19740,20260],[23,20260,23245]]}},{"name":"29:15","price":"پھر ہم نے انہیں اور کشتی والوں کو نجات دی اور اس واقعہ کو ہم نے تمام جہان کے لیے عبرت کا نشان بنا دیا.","arabic":"فَأَنجَيۡنَٰهُ وَأَصۡحَٰبَ ٱلسَّفِينَةِ وَجَعَلۡنَٰهَآ ءَايَةٗ لِّلۡعَٰلَمِينَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3355,"juzNumber":20,"footnotes":"","lang":"ur","meta":{"transliteration":"fa-anjaynāhu wa-aṣḥāba al-safīnati wajaʿalnāhā āyatan lil'ʿālamīna ","translations":["But We saved him","and (the) people","(of) the ship","and We made it","a Sign","for the worlds","(15)"],"transliterationArr":["fa-anjaynāhu","wa-aṣḥāba","al-safīnati","wajaʿalnāhā","āyatan","lil'ʿālamīna",null],"verseTiming":[[1,0,2390],[2,2390,3370],[3,3370,4790],[4,4790,8150],[5,8150,8970],[6,8970,12165]]}},{"name":"29:16","price":"اور ابراہیم (علیہ السلام) نے بھی اپنی قوم سے فرمایا کہ اللہ تعالیٰ کی عبادت کرو اوراس سے ڈرتے رہو، اگر تم میں دانائی ہے تو یہی تمہارے لیے بہتر ہے.","arabic":"وَإِبۡرَٰهِيمَ إِذۡ قَالَ لِقَوۡمِهِ ٱعۡبُدُواْ ٱللَّهَ وَٱتَّقُوهُۖ ذَٰلِكُمۡ خَيۡرٞ لَّكُمۡ إِن كُنتُمۡ تَعۡلَمُونَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3356,"juzNumber":20,"footnotes":"","lang":"ur","meta":{"transliteration":"wa-ib'rāhīma idh qāla liqawmihi uʿ'budū al-laha wa-ittaqūhu dhālikum khayrun lakum in kuntum taʿlamūna ","translations":["And Ibrahim ","when","he said","to his people","Worship","Allah","and fear Him","That","(is) better","for you","if","you","know","(16)"],"transliterationArr":["wa-ib'rāhīma","idh","qāla","liqawmihi","uʿ'budū","al-laha","wa-ittaqūhu","dhālikum","khayrun","lakum","in","kuntum","taʿlamūna",null],"verseTiming":[[1,0,1710],[2,1710,2090],[3,2090,2780],[4,2780,3790],[5,3790,4390],[6,4390,5250],[7,5250,8110],[8,8110,9090],[9,9090,9940],[10,9940,10520],[11,10520,11450],[12,11450,13050],[13,13050,15795]]}},{"name":"29:17","price":"تم تو اللہ تعالیٰ کے سوا بتوں کی پوجا پاٹ کر رہے ہو اور جھوٹی باتیں دل سے گھڑ لیتے ہو(1) ۔ سنو! جن جنکی تم اللہ تعالیٰ کے سوا پوجا پاٹ کر رہے ہو وه تو تمہاری روزی کے مالک نہیں پس تمہیں چاہئے کہ تم اللہ تعالیٰ ہی سے روزیاں طلب کرو اور اسی کی عبادت کرو اور اسی کی شکر گزاری(2) کرو اور اسی کی طرف تم لوٹائے جاؤ گے.(3)","arabic":"إِنَّمَا تَعۡبُدُونَ مِن دُونِ ٱللَّهِ أَوۡثَٰنٗا وَتَخۡلُقُونَ إِفۡكًاۚ إِنَّ ٱلَّذِينَ تَعۡبُدُونَ مِن دُونِ ٱللَّهِ لَا يَمۡلِكُونَ لَكُمۡ رِزۡقٗا فَٱبۡتَغُواْ عِندَ ٱللَّهِ ٱلرِّزۡقَ وَٱعۡبُدُوهُ وَٱشۡكُرُواْ لَهُۥٓۖ إِلَيۡهِ تُرۡجَعُونَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3357,"juzNumber":20,"footnotes":"(1) أَوْثَانٌ وَثَنٌ کی جمع ہے۔ جس طرح أَصْنَامٌ، صَنَمٌ کی جمع ہے۔ دونوں کے معنی بت کے ہیں۔ بعض کہتے ہیں صنم ، سونے، چاندی، پیتل اور پتھر کی مورت کو اور وثن مورت کو بھی اور چونے کے پتھر وغیرہ کے بنے ہوئے آستانوں کو بھی کہتے ہیں۔ تَخْلُقُونَ إِفْكًا کے معنی ہیں تُكَذِّبُونَ كَذِبًا ، جیسا کہ متن کے ترجمہ سے واضح ہے۔ دوسرے معنی ہیں تَعْمَلُونَهَا وَتَنْحِتُونَهَا لِلإِفْكِ ، جھوٹے مقصد کے لیے انہیں بناتے اور گھڑتے ہو۔ مفہوم کے اعتبار سے دونوں ہی معنی صحیح ہیں۔ یعنی اللہ کو چھوڑ کر تم جن بتوں کی عبادت کرتے ہو، وہ تو پتھر کے بنے ہوئے ہیں جو سن سکتے ہیں نہ دیکھ سکتے ہیں، نقصان پہنچا سکتے ہیں نہ نفع۔ اپنے دل سے ہی تم نے انہیں گھڑ لیا ہے کوئی دلیل تو ان کی صداقت کی تمہارے پاس نہیں ہے۔ یا یہ بت تو وہ ہیں جنہیں تم خود اپنے ہاتھوں سے تراشتے اور گھڑتے ہو اور جب ان کی ایک خاص شکل وصورت بن جاتی ہے تو تم سمجھتے ہو کہ اب ان میں خدائی اختیارات آگئے ہیں اور ان سے تم امیدیں وابستہ کرکے انہیں حاجت روا اور مشکل کشا باور کر لیتے ہو۔\n(2) یعنی جب یہ بت تمہاری روزی کے اسباب ووسائل میں سے کسی بھی چیز کے مالک نہیں ہیں، نہ بارش برسا سکتے ہیں، نہ زمین میں درخت اگا سکتے ہیں اور نہ سورج کی حرارت پہنچا سکتے ہیں اور نہ تمہیں وہ صلاحیتیں دے سکتے ہیں، جنہیں بروئے کار لاکر تم قدرت کی ان چیزوں سے فیض یاب ہوتے ہو، تو پھر تم روزی اللہ ہی سے طلب کرو، اسی کی عبادت اور اسی کی شکر گزاری کرو۔\n(3) یعنی مرکر اور پھر دوبارہ زندہ ہوکر جب اسی کی طرف لوٹنا ہے، اسی کی بارگاہ میں پیش ہونا ہے تو پھر اس کا در چھوڑ کر دوسروں کے در پر اپنی جبین نیاز کیوں جھکاتے ہو؟ اس کے بجائے دوسروں کی عبادت کیوں کرتے؟ اور دوسروں کو حاجت روا اور مشکل کشا کیوں سمجھتے ہو؟","lang":"ur","meta":{"transliteration":"innamā taʿbudūna min dūni al-lahi awthānan watakhluqūna if'kan inna alladhīna taʿbudūna min dūni al-lahi lā yamlikūna lakum riz'qan fa-ib'taghū ʿinda al-lahi al-riz'qa wa-uʿ'budūhu wa-ush'kurū lahu ilayhi tur'jaʿūna ","translations":["Only","you worship","besides","besides","Allah","idols","and you create","falsehood","Indeed","those whom","you worship","besides","besides","Allah","(do) not","possess","for you","any provision","So seek","from","Allah","the provision","and worship Him","and be grateful","to Him","To Him","you will be returned","(17)"],"transliterationArr":["innamā","taʿbudūna","min","dūni","al-lahi","awthānan","watakhluqūna","if'kan","inna","alladhīna","taʿbudūna","min","dūni","al-lahi","lā","yamlikūna","lakum","riz'qan","fa-ib'taghū","ʿinda","al-lahi","al-riz'qa","wa-uʿ'budūhu","wa-ush'kurū","lahu","ilayhi","tur'jaʿūna",null],"verseTiming":[[1,0,1800],[2,1800,3050],[3,3050,4030],[4,4030,4700],[5,4700,5540],[6,5540,7210],[7,7210,8600],[8,8600,9630],[9,9630,11430],[10,11430,12430],[11,12430,13840],[12,13840,14760],[13,14760,15420],[14,15420,16320],[15,16320,16720],[16,16720,17950],[17,17950,18560],[18,18560,20190],[19,20190,21290],[20,21290,22560],[21,22560,23420],[22,23420,24240],[23,24240,25520],[24,25520,26430],[25,26430,27520],[26,27520,28370],[27,28370,30945]]}},{"name":"29:18","price":"اور اگر تم جھٹلاؤ تو تم سے پہلے کی امتوں نے بھی جھٹلایا ہے(1) ، رسول کے ذمہ تو صرف صاف طور پر پہنچا دینا ہی ہے.(2)","arabic":"وَإِن تُكَذِّبُواْ فَقَدۡ كَذَّبَ أُمَمٞ مِّن قَبۡلِكُمۡۖ وَمَا عَلَى ٱلرَّسُولِ إِلَّا ٱلۡبَلَٰغُ ٱلۡمُبِينُ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3358,"juzNumber":20,"footnotes":"(1) یہ حضرت ابراہیم (عليه السلام) کا قول بھی ہوسکتا ہے، جو انہوں نے اپنی قوم سے کہا۔ یا اللہ تعالیٰ کا قول ہے جس میں اہل مکہ سے خطاب ہے اور اس میں نبی (صلى الله عليه وسلم) کو تسلی دی جارہی ہے کہ کفار مکہ اگر آپ کو جھٹلا رہے ہیں، تو اس سے گھبرانے کی ضرورت نہیں ہے۔ پیغمبروں کے ساتھ یہی ہوتا آیا ہے۔ پہلی امتیں بھی رسولوں کو جھٹلاتی اور اس کا نتیجہ بھی وہ ہلاکت وتباہی کی صورت میں بھگتتی رہی ہیں۔\n(2) اس لیے آپ بھی تبلیغ کا کام کرتے رہیے۔ اس سے کوئی راہ یاب ہوتا ہے یا نہیں؟ اس کے ذمے دار آپ نہیں ہیں، نہ آپ سے اس کی بابت پوچھا ہی جائے گا، کیونکہ ہدایت دینا نہ دینا یہ صرف اللہ کے اختیار میں ہے، جو اپنی سنت کے مطابق، جس میں ہدایت کی طلب صادق دیکھتا ہے، اس کو ہدایت سے نواز دیتا ہے۔ دوسروں کو ضلالت کی تاریکیوں میں بھٹکتا ہوا چھوڑ دیتا ہے۔","lang":"ur","meta":{"transliteration":"wa-in tukadhibū faqad kadhaba umamun min qablikum wamā ʿalā al-rasūli illā al-balāghu al-mubīnu ","translations":["And if","you deny","then verily","denied","(the) nations","before you","before you","And not","(is) on","the Messenger","except","the conveyance","clear","(18)"],"transliterationArr":["wa-in","tukadhibū","faqad","kadhaba","umamun","min","qablikum","wamā","ʿalā","al-rasūli","illā","al-balāghu","al-mubīnu",null],"verseTiming":[[1,0,1320],[2,1320,2530],[3,2530,3210],[4,3210,4090],[5,4090,4880],[6,4880,5900],[7,5900,8080],[8,8080,8610],[9,8610,9070],[10,9070,10050],[11,10050,10620],[12,10620,11630],[13,11630,14675]]}},{"name":"29:19","price":"کیا انہوں نے نہیں دیکھا کہ مخلوق کی ابتدا کس طرح اللہ نے کی پھر اللہ اس کا اعاده کرے گا(1) ، یہ تو اللہ تعالیٰ پر بہت ہی آسان ہے.(2)","arabic":"أَوَلَمۡ يَرَوۡاْ كَيۡفَ يُبۡدِئُ ٱللَّهُ ٱلۡخَلۡقَ ثُمَّ يُعِيدُهُۥٓۚ إِنَّ ذَٰلِكَ عَلَى ٱللَّهِ يَسِيرٞ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3359,"juzNumber":20,"footnotes":"(1) توحید ورسالت کے اثبات کے بعد، یہاں سے معاد (آخرت) کا اثبات کیا جارہا ہے جس کا کفار انکار کرتے تھے۔ فرمایا پہلی مرتبہ پیدا کرنے والا بھی وہی ہے جب تمہارا سرے سے وجود ہی نہیں تھا، پھر تم دیکھنے سننے اور سمجھنے والے بن گئے اور پھر جب مرکر تم مٹی میں مل جاؤ گے، بظاہر تمہارا نام ونشان تک نہیں رہے گا، اللہ تعالیٰ تمہیں دوبارہ زندہ فرمائے گا۔\n(2) یعنی یہ بات چاہے تمہیں کتنی ہی مشکل لگے، اللہ کے لیے بالکل آسان ہے۔","lang":"ur","meta":{"transliteration":"awalam yaraw kayfa yub'di-u al-lahu al-khalqa thumma yuʿīduhu inna dhālika ʿalā al-lahi yasīrun ","translations":["Do not","they see","how","Allah originates","Allah originates","the creation","then","repeats it","Indeed","that","for","Allah","(is) easy","(19)"],"transliterationArr":["awalam","yaraw","kayfa","yub'di-u","al-lahu","al-khalqa","thumma","yuʿīduhu","inna","dhālika","ʿalā","al-lahi","yasīrun",null],"verseTiming":[[1,0,870],[2,870,1500],[3,1500,2160],[4,2160,2880],[5,2880,3680],[6,3680,4510],[7,4510,5890],[8,5890,7440],[9,7440,8700],[10,8700,9560],[11,9560,9920],[12,9920,10850],[13,10850,13375]]}},{"name":"29:20","price":"کہہ دیجئے! کہ زمین میں چل پھر کر دیکھو تو سہی(1) کہ کس طرح اللہ تعالیٰ نے ابتداءً پیدائش کی۔ پھر اللہ تعالیٰ ہی دوسری نئی پیدائش کرے گا، اللہ تعالیٰ ہر چیز پر قادر ہے.","arabic":"قُلۡ سِيرُواْ فِي ٱلۡأَرۡضِ فَٱنظُرُواْ كَيۡفَ بَدَأَ ٱلۡخَلۡقَۚ ثُمَّ ٱللَّهُ يُنشِئُ ٱلنَّشۡأَةَ ٱلۡأٓخِرَةَۚ إِنَّ ٱللَّهَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3360,"juzNumber":20,"footnotes":"(1) یعنی آفاق میں پھیلی ہوئی اللہ کی نشانیاں دیکھو زمین پر غور کرو، کس طرح اسے بچھایا، اس میں پہاڑ ، وادیاں، نہریں اور سمندر بنائے، اسی سے انواع واقسام کی روزیاں اور پھل پیدا کیے۔ کیا یہ سب چیزیں اس بات پر دلالت نہیں کرتیں کہ انہیں بنایا گیا ہے اور ان کا کوئی بنانے والا ہے؟","lang":"ur","meta":{"transliteration":"qul sīrū fī al-arḍi fa-unẓurū kayfa bada-a al-khalqa thumma al-lahu yunshi-u al-nashata al-ākhirata inna al-laha ʿalā kulli shayin qadīrun ","translations":["Say","Travel","in","the earth","and see","how","He originated","the creation","Then","Allah","will produce","the creation","the last","Indeed","Allah","on","every","thing","(is) All-Powerful","(20)"],"transliterationArr":["qul","sīrū","fī","al-arḍi","fa-unẓurū","kayfa","bada-a","al-khalqa","thumma","al-lahu","yunshi-u","al-nashata","al-ākhirata","inna","al-laha","ʿalā","kulli","shayin","qadīrun",null],"verseTiming":[[1,0,410],[2,410,1300],[3,1300,1530],[4,1530,2330],[5,2330,4090],[6,4090,4790],[7,4790,5300],[8,5300,6290],[9,6290,7510],[10,7510,8450],[11,8450,9800],[12,9800,11550],[13,11550,13300],[14,13300,14500],[15,14500,15520],[16,15520,16040],[17,16040,16670],[18,16670,17750],[19,17750,21165]]}},{"name":"29:21","price":"جسے چاہے عذاب کرے جس پر چاہے رحم کرے، سب اسی کی طرف لوٹائے جاؤ گے.(1)","arabic":"يُعَذِّبُ مَن يَشَآءُ وَيَرۡحَمُ مَن يَشَآءُۖ وَإِلَيۡهِ تُقۡلَبُونَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3361,"juzNumber":20,"footnotes":"(1) یعنی وہی اصل حاکم اور متصرف ہے، اس سے کوئی پوچھ نہیں سکتا۔ تاہم اس کا عذاب یا رحمت، یوں ہی الل ٹپ نہیں ہوگی، بلکہ ان اصولوں کے مطابق ہوگی جو اسنے اس کے لیے طے کر رکھے ہیں۔","lang":"ur","meta":{"transliteration":"yuʿadhibu man yashāu wayarḥamu man yashāu wa-ilayhi tuq'labūna ","translations":["He punishes","whom","He wills","and has mercy","(on) whom","He wills","and to Him","you will be returned","(21)"],"transliterationArr":["yuʿadhibu","man","yashāu","wayarḥamu","man","yashāu","wa-ilayhi","tuq'labūna",null],"verseTiming":[[1,0,1040],[2,1040,1340],[3,1340,4780],[4,4780,5770],[5,5770,5910],[6,5910,9690],[7,9690,11140],[8,11140,14385]]}},{"name":"29:22","price":"تم نہ تو زمین میں اللہ تعالیٰ کو عاجز کرسکتے ہو نہ آسمان میں، اللہ تعالیٰ کے سوا تمہارا کوئی والی ہے نہ مددگار.","arabic":"وَمَآ أَنتُم بِمُعۡجِزِينَ فِي ٱلۡأَرۡضِ وَلَا فِي ٱلسَّمَآءِۖ وَمَا لَكُم مِّن دُونِ ٱللَّهِ مِن وَلِيّٖ وَلَا نَصِيرٖ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3362,"juzNumber":20,"footnotes":"","lang":"ur","meta":{"transliteration":"wamā antum bimuʿ'jizīna fī al-arḍi walā fī al-samāi wamā lakum min dūni al-lahi min waliyyin walā naṣīrin ","translations":["And not","you","can escape","in","the earth","and not","in","the heaven","And not","for you","besides","besides","Allah","any","protector","and not","a helper","(22)"],"transliterationArr":["wamā","antum","bimuʿ'jizīna","fī","al-arḍi","walā","fī","al-samāi","wamā","lakum","min","dūni","al-lahi","min","waliyyin","walā","naṣīrin",null],"verseTiming":[[1,0,2240],[2,2240,4520],[3,4520,5850],[4,5850,6140],[5,6140,6970],[6,6970,7470],[7,7470,7780],[8,7780,10880],[9,10880,11480],[10,11480,12290],[11,12290,13880],[12,13880,14660],[13,14660,15540],[14,15540,16440],[15,16440,17420],[16,17420,18620],[17,18620,21475]]}},{"name":"29:23","price":"جو لوگ اللہ تعالیٰ کی آیتوں اور اس کی ملاقات کو بھلاتے ہیں وه میری رحمت سے ناامید ہو جائیں(1) اور ان کے لیے دردناک عذاب ہے.","arabic":"وَٱلَّذِينَ كَفَرُواْ بِـَٔايَٰتِ ٱللَّهِ وَلِقَآئِهِۦٓ أُوْلَٰٓئِكَ يَئِسُواْ مِن رَّحۡمَتِي وَأُوْلَٰٓئِكَ لَهُمۡ عَذَابٌ أَلِيمٞ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3363,"juzNumber":20,"footnotes":"(1) اللہ تعالیٰ کی رحمت، دنیا میں عام ہے جس سے کافر اور مومن، منافق اور مخلص اور نیک اور بد سب یکساں طور پر مستفیض ہو رہے ہیں۔ اللہ تعالیٰ سب کو دنیا کے وسائل، آسائشیں اور مال ودولت عطا کر رہا ہے یہ رحمت الٰہی کی وہ وسعت ہے جسے اللہ تعالیٰ نے دوسرے مقام پر فرمایا «وَرَحْمَتِي وَسِعَتْ كُلَّ شَيْءٍ» (الأعراف: 156) ”میری رحمت نے ہر چیز کو گھیر لیا ہے“۔ لیکن آخرت چونکہ دارالجزا ہے، انسان نے دنیا کی کھیتی میں جو کچھ بویا ہوگا، اسی کی فصل اسے وہاں کاٹنی ہوگی، جیسے عمل کیے ہوں گے، اسی کی جزا اسے وہاں ملے گی۔ اللہ کی بارگاہ میں بےلاگ فیصلے ہوں گے۔ دنیا کی طرح اگر آخرت میں بھی نیک وبد کے ساتھ یکساں سلوک ہو اور مومن وکافر دونوں ہی رحمت الٰہی کے مستحق قرار پائیں تو اس سے ایک تو اللہ تعالیٰ کی صفت عدل پر حرف آتا ہے، دوسرے قیامت کا مقصد ہی فوت ہو جاتا ہے۔ قیامت کا دن تو اللہ نے رکھا ہی اس لیے ہے کہ وہاں نیکوں کو ان کی نیکیوں کے صلے میں جنت اور بدوں کو ان کی بدیوں کی جزا میں جہنم دی جائے۔ اس لیے قیامت والے دن اللہ تعالیٰ کی رحمت صرف اہل ایمان کے لیے خاص ہوگی۔ جسے یہاں بھی بیان کیا گیا ہے کہ جو لوگ آخرت اور معاد کے ہی منکر ہوں گے وہ میری رحمت سے ناامید ہوں گے یعنی ان کے حصے میں رحمت الٰہی نہیں آئے گی۔ سورۂ اعراف میں ان کو ان الفاظ سے بیان کیا گیا ہے۔ «فَسَأَكْتُبُهَا لِلَّذِينَ يَتَّقُونَ وَيُؤْتُونَ الزَّكَاةَ وَالَّذِينَ هُمْ بِآيَاتِنَا يُؤْمِنُونَ» (الأعراف: 156) ”میں یہ رحمت (آخرت میں) ان لوگوں کے لیے لکھوں گا جو متقی، زکوٰۃ ادا کرنے والے اور ہماری آیتوں پر ایمان رکھنے والے ہوں گے“۔","lang":"ur","meta":{"transliteration":"wa-alladhīna kafarū biāyāti al-lahi waliqāihi ulāika ya-isū min raḥmatī wa-ulāika lahum ʿadhābun alīmun ","translations":["And those who","disbelieve","in (the) Signs","(of) Allah","and (the) meeting (with) Him","those","(have) despaired","of","My Mercy","And those","for them","(is) a punishment","painful","(23)"],"transliterationArr":["wa-alladhīna","kafarū","biāyāti","al-lahi","waliqāihi","ulāika","ya-isū","min","raḥmatī","wa-ulāika","lahum","ʿadhābun","alīmun",null],"verseTiming":[[1,0,1160],[2,1160,2050],[3,2050,3430],[4,3430,4250],[5,4250,8560],[6,8560,11040],[7,11040,11890],[8,11890,12060],[9,12060,13310],[10,13310,16470],[11,16470,19160],[12,19160,19690],[13,19690,20780],[14,20780,23265]]}},{"name":"29:24","price":"ان کی قوم کا جواب بجز اس کے کچھ نہ تھا کہ کہنے لگے کہ اسے مار ڈالو یا اسے جلا دو(1) ۔ آخر اللہ نے انہیں آگ سے بچا لیا(2)، اس میں ایمان والے لوگوں کے لیے تو بہت سی نشانیاں ہیں.","arabic":"فَمَا كَانَ جَوَابَ قَوۡمِهِۦٓ إِلَّآ أَن قَالُواْ ٱقۡتُلُوهُ أَوۡ حَرِّقُوهُ فَأَنجَىٰهُ ٱللَّهُ مِنَ ٱلنَّارِۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّقَوۡمٖ يُؤۡمِنُونَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3364,"juzNumber":20,"footnotes":"(1) ان آیات سے قبل حضرت ابراہیم (عليه السلام) کا قصہ بیان ہو رہا تھا، اب پھر اس کا بقیہ بیان کیا جارہا ہے۔ درمیان میں جملہ معترضہ کے طور پر اللہ کی توحید اور اس کی قدرت وطاقت کو بیان کیا گیا ہے۔ بعض کہتے ہیں کہ یہ سب حضرت ابراہیم (عليه السلام) ہی کے وعظ کا حصہ ہے، جس میں انہوں نے توحید ومعاد کے اثبات میں دلائل دیئے ہیں، جن کا کوئی جواب جب ان کی قوم سےنہیں بنا تو انہوں نے اس کا جواب ظلم وتشدد کی اس کارروائی سے دیا، جس کا ذکر اس آیت میں ہے کہ اسے قتل کر دو یا جلا ڈالو۔ چنانچہ انہوں نے آگ کا ایک بہت بڑا الاؤ تیار کرکے حضرت ابراہیم (عليه السلام) کو منجنیق کے ذریعے سے اس میں پھینک دیا۔\n(2) یعنی اللہ نے اس آگ کو گلزار کی صورت میں بدل کر اپنے بندے کو بچا لیا، جیسا کہ سورہ انبیاء میں گزرا۔","lang":"ur","meta":{"transliteration":"famā kāna jawāba qawmihi illā an qālū uq'tulūhu aw ḥarriqūhu fa-anjāhu al-lahu mina al-nāri inna fī dhālika laāyātin liqawmin yu'minūna ","translations":["And not","was","(the) answer","(of) his people","except","that","they said","Kill him","or","burn him","But Allah saved him","But Allah saved him","from","the fire","Indeed","in","that","surely (are) Signs","for a people","who believe","(24)"],"transliterationArr":["famā","kāna","jawāba","qawmihi","illā","an","qālū","uq'tulūhu","aw","ḥarriqūhu","fa-anjāhu","al-lahu","mina","al-nāri","inna","fī","dhālika","laāyātin","liqawmin","yu'minūna",null],"verseTiming":[[1,0,680],[2,680,1300],[3,1300,2230],[4,2230,4680],[5,4680,6550],[6,6550,7590],[7,7590,8130],[8,8130,9260],[9,9260,9630],[10,9630,10900],[11,10900,12870],[12,12870,13770],[13,13770,14100],[14,14100,17460],[15,17460,18750],[16,18750,19250],[17,19250,20120],[18,20120,21420],[19,21420,23400],[20,23400,26305]]}},{"name":"29:25","price":"(حضرت ابراہیم علیہ السلام نے) کہا کہ تم نے جن بتوں کی پرستش اللہ کے سوا کی ہے انہیں تم نے اپنی آپس کی دنیوی دوستی کی بنا ٹھہرا لی ہے(1) ، تم سب قیامت کے دن ایک دوسرے سے کفر کرنے لگو گے(2) اور ایک دوسرے پر لعنت کرنے لگو گے۔ اور تمہارا سب کا ٹھکانہ دوزخ ہوگا اور تمہارا کوئی مددگار نہ ہوگا.","arabic":"وَقَالَ إِنَّمَا ٱتَّخَذۡتُم مِّن دُونِ ٱللَّهِ أَوۡثَٰنٗا مَّوَدَّةَ بَيۡنِكُمۡ فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَاۖ ثُمَّ يَوۡمَ ٱلۡقِيَٰمَةِ يَكۡفُرُ بَعۡضُكُم بِبَعۡضٖ وَيَلۡعَنُ بَعۡضُكُم بَعۡضٗا وَمَأۡوَىٰكُمُ ٱلنَّارُ وَمَا لَكُم مِّن نَّٰصِرِينَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3365,"juzNumber":20,"footnotes":"(1) یعنی یہ تمہارے قومی بت ہیں جو تمہاری اجتماعیت اور آپس کی دوستی کی بنیاد ہیں۔ اگر تم ان کی عبادت چھوڑ دو تو تمہاری قومیت اور دوستی کا شیرازہ بکھر جائے گا۔\n(2) یعنی قیامت کے دن تم ایک دوسرے کا انکار اور دوستی کے بجائے ایک دوسرے پر لعنت کرو گے اور تابع ، متبوع کو ملامت اور متبوع، تابع سے بیزاری کا اظہار کریں گے۔","lang":"ur","meta":{"transliteration":"waqāla innamā ittakhadhtum min dūni al-lahi awthānan mawaddata baynikum fī al-ḥayati al-dun'yā thumma yawma al-qiyāmati yakfuru baʿḍukum bibaʿḍin wayalʿanu baʿḍukum baʿḍan wamawākumu al-nāru wamā lakum min nāṣirīna ","translations":["And he said","Only","you have taken","besides","besides","Allah","idols","(out of) love","among you","in","the life","(of) the world","Then","(on the) Day","(of) the Resurrection","you will deny","one another","one another","and curse","one another","one another","and your abode","(will be) the Fire","and not","for you","any","helpers","(25)"],"transliterationArr":["waqāla","innamā","ittakhadhtum","min","dūni","al-lahi","awthānan","mawaddata","baynikum","fī","al-ḥayati","al-dun'yā","thumma","yawma","al-qiyāmati","yakfuru","baʿḍukum","bibaʿḍin","wayalʿanu","baʿḍukum","baʿḍan","wamawākumu","al-nāru","wamā","lakum","min","nāṣirīna",null],"verseTiming":[[1,0,990],[2,990,2630],[3,2630,3920],[4,3920,4810],[5,4810,6210],[6,6210,7090],[7,7090,8260],[8,8260,9990],[9,9990,11080],[10,11080,11310],[11,11310,12420],[12,12420,13610],[13,13610,15430],[14,15430,16080],[15,16080,17430],[16,17430,18300],[17,18300,20080],[18,20080,22030],[19,22030,23070],[20,23070,24420],[21,24420,25530],[22,25530,27880],[23,27880,30990],[24,30990,33130],[25,33130,34930],[26,34930,35490],[27,35490,36030],[28,36030,37090],[29,37090,40945]]}},{"name":"29:26","price":"پس حضرت ابراہیم (علیہ السلام) پر حضرت لوط (علیہ السلام) ایمان ﻻئے(1) اور کہنے لگے کہ میں اپنے رب کی طرف ہجرت کرنے واﻻ ہوں(2)۔ وه بڑا ہی غالب اور حکیم ہے.","arabic":"۞ فَـَٔامَنَ لَهُۥ لُوطٞۘ وَقَالَ إِنِّي مُهَاجِرٌ إِلَىٰ رَبِّيٓۖ إِنَّهُۥ هُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3366,"juzNumber":20,"footnotes":"(1) حضرت لوط (عليه السلام) ، حضرت ابراہیم (عليه السلام) کے برادر زاد تھے، یہ حضرت ابراہیم (عليه السلام) پر ایمان لائے، بعد میں ان کو بھی (سدوم) کے علاقے میں نبی بنا کر بھیجا گیا۔\n(2) یہ حضرت ابراہیم (عليه السلام) نے کہا اور بعض کے نزدیک حضرت لوط (عليه السلام) نے۔ اور بعض کہتے ہیں دونوں نے ہی ہجرت کی۔ یعنی جب ابراہیم (عليه السلام) اور ان پر ایمان لانے والے لوط (عليه السلام) کے لیے اپنے علاقے، (كوثى) میں، جو حران کی طرف جاتے ہوئے کوفے کی ایک بستی تھی، اللہ کی عبادت کرنی مشکل ہوگئی تو وہاں سے ہجرت کرکےشام کے علاقےمیں چلے گئے۔ تیسری، ان کے ساتھ حضرت ابراہیم (عليه السلام) کی اہلیہ سارہ تھیں۔","lang":"ur","meta":{"transliteration":"faāmana lahu lūṭun waqāla innī muhājirun ilā rabbī innahu huwa al-ʿazīzu al-ḥakīmu ","translations":["And believed","[in] him","Lut","and he said","Indeed I (am)","emigrating","to","my Lord","Indeed, He","[He] (is)","the All-Mighty","the All-Wise","(26)"],"transliterationArr":["faāmana","lahu","lūṭun","waqāla","innī","muhājirun","ilā","rabbī","innahu","huwa","al-ʿazīzu","al-ḥakīmu",null],"verseTiming":[[1,0,1060],[2,1060,1640],[3,1640,3590],[4,3590,5020],[5,5020,6400],[6,6400,7650],[7,7650,8220],[8,8220,9620],[9,9620,11240],[10,11240,11600],[11,11600,12750],[12,12750,15695]]}},{"name":"29:27","price":"اور ہم نے انھیں (ابراہیم کو) اسحاق ویعقوب (علیہما السلام) عطا کیے اور ہم نے نبوت اور کتاب ان کی اوﻻد میں ہی کر دی(1) اور ہم نے دنیا میں بھی اسے ﺛواب دیا (2)اور آخرت میں تو وه صالح لوگوں میں سے ہیں.(3)","arabic":"وَوَهَبۡنَا لَهُۥٓ إِسۡحَٰقَ وَيَعۡقُوبَ وَجَعَلۡنَا فِي ذُرِّيَّتِهِ ٱلنُّبُوَّةَ وَٱلۡكِتَٰبَ وَءَاتَيۡنَٰهُ أَجۡرَهُۥ فِي ٱلدُّنۡيَاۖ وَإِنَّهُۥ فِي ٱلۡأٓخِرَةِ لَمِنَ ٱلصَّٰلِحِينَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3367,"juzNumber":20,"footnotes":"(1) یعنی حضرت اسحاق (عليه السلام) سے یعقوب (عليه السلام) ہوئے ، جن سے بنی اسرائیل کی نسل چلی اور انہی میں سارے انبیا ہوئے، اور کتابیں آئیں۔ آخر میں حضرت نبی کریم (صلى الله عليه وسلم) حضرت ابراہیم (عليه السلام) کے دوسرے بیٹے حضرت اسماعیل (عليه السلام) کی نسل سے نبی ہوئے اور آپ (صلى الله عليه وسلم) پر قرآن نازل ہوا۔\n(2) اس اجر سے مراد رزق دنیا بھی ہے اور ذکر خیر بھی۔ یعنی دنیا میں ہر مذہب کے لوگ (عیسائی، یہودی وغیرہ حتیٰ کہ مشرکیں بھی) حضرت ابراہیم (عليه السلام) کی عزت وتکریم کرتے ہیں اورمسلمان تو ہیں ہی ملت ابراہیمی کےپیرو، ان کے ہاں وہ محترم کیوں نہ ہوں گے؟\n(3) یعنی آخرت میں بھی وہ بلند درجات کے حامل اور زمرہ صالحین میں ہوں گے۔ اسی مضمون کو دوسرے مقام پراس طرح بیان فرمایا «وَآتَيْنَاهُ فِي الدُّنْيَا حَسَنَةً وَإِنَّهُ فِي الآخِرَةِ لَمِنَ الصَّالِحِينَ» (سورة النحل: 122)","lang":"ur","meta":{"transliteration":"wawahabnā lahu is'ḥāqa wayaʿqūba wajaʿalnā fī dhurriyyatihi al-nubuwata wal-kitāba waātaynāhu ajrahu fī al-dun'yā wa-innahu fī al-ākhirati lamina al-ṣāliḥīna ","translations":["And We granted","to him","Isaac","and Yaqub","and We placed","in","his offsprings","the Prophethood","and the Book","And We gave him","his reward","in","the world","And indeed, he","in","the Hereafter","(is) surely, among","the righteous","(27)"],"transliterationArr":["wawahabnā","lahu","is'ḥāqa","wayaʿqūba","wajaʿalnā","fī","dhurriyyatihi","al-nubuwata","wal-kitāba","waātaynāhu","ajrahu","fī","al-dun'yā","wa-innahu","fī","al-ākhirati","lamina","al-ṣāliḥīna",null],"verseTiming":[[1,0,1350],[2,1350,3050],[3,3050,4190],[4,4190,5380],[5,5380,6570],[6,6570,7030],[7,7030,8550],[8,8550,10340],[9,10340,11590],[10,11590,13210],[11,13210,14160],[12,14160,14430],[13,14430,15530],[14,15530,17870],[15,17870,18130],[16,18130,19380],[17,19380,19940],[18,19940,23155]]}},{"name":"29:28","price":"اور حضرت لوط (علیہ السلام) کا بھی ذکر کرو جب کہ انہوں نے اپنی قوم سے فرمایا کہ تم تو اس بدکاری پر اتر آئے(1) ہو جسے تم سے پہلے دنیا بھر میں سے کسی نے نہیں کیا.","arabic":"وَلُوطًا إِذۡ قَالَ لِقَوۡمِهِۦٓ إِنَّكُمۡ لَتَأۡتُونَ ٱلۡفَٰحِشَةَ مَا سَبَقَكُم بِهَا مِنۡ أَحَدٖ مِّنَ ٱلۡعَٰلَمِينَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3368,"juzNumber":20,"footnotes":"(1) اس بدکاری سے مراد وہی لواطت ہے جس کا ارتکاب قوم لوط (عليه السلام) نے ہی سب سے پہلے کیا، جیسا کہ قرآن نے صراحت کی ہے۔","lang":"ur","meta":{"transliteration":"walūṭan idh qāla liqawmihi innakum latatūna al-fāḥishata mā sabaqakum bihā min aḥadin mina al-ʿālamīna ","translations":["And Lut","when","he said","to his people","Indeed, you","commit","the immorality","not","has preceded you","with it","any","one","from","the worlds","(28)"],"transliterationArr":["walūṭan","idh","qāla","liqawmihi","innakum","latatūna","al-fāḥishata","mā","sabaqakum","bihā","min","aḥadin","mina","al-ʿālamīna",null],"verseTiming":[[1,0,1120],[2,1120,1470],[3,1470,2160],[4,2160,4790],[5,4790,6240],[6,6240,7460],[7,7460,8850],[8,8850,9160],[9,9160,10940],[10,10940,11520],[11,11520,11900],[12,11900,12740],[13,12740,13690],[14,13690,16925]]}},{"name":"29:29","price":"کیا تم مردوں کے پاس بدفعلی کے لیے آتے ہو(1) اور راستے بند کرتے ہو(2) اور اپنی عام مجلسوں میں بے حیائیوں کا کام کرتے ہو(3)؟ اس کے جواب میں اس کی قوم نے بجز اس کے اور کچھ نہیں کہا کہ بس(4) جا اگر سچا ہے تو ہمارے پاس اللہ تعالیٰ کا عذاب لے آ.","arabic":"أَئِنَّكُمۡ لَتَأۡتُونَ ٱلرِّجَالَ وَتَقۡطَعُونَ ٱلسَّبِيلَ وَتَأۡتُونَ فِي نَادِيكُمُ ٱلۡمُنكَرَۖ فَمَا كَانَ جَوَابَ قَوۡمِهِۦٓ إِلَّآ أَن قَالُواْ ٱئۡتِنَا بِعَذَابِ ٱللَّهِ إِن كُنتَ مِنَ ٱلصَّٰدِقِينَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3369,"juzNumber":20,"footnotes":"(1) یعنی تمہاری شہوت پرستی اس انتہا کو پہنچ گئی ہے کہ اس کے لیے طبعی طریقے تمہارے لیے ناکافی ہوگئے ہیں اور غیر طبعی طریقہ تم نے اختیار کر لیا ہے۔ جنسی شہوت کی تسکین کے لیے طبعی طریقہ اللہ تعالیٰ نے بیویوں سے مباشرت کی صورت میں رکھا ہے۔ اسے چھوڑ کر اس کام کے لیے مردوں کی دبر استعمال کرنا غیر فطری اور غیر طبعی طریقہ ہے۔\n(2) اس کے ایک معنی تو یہ کیے گئے ہیں کہ آنے جانے والے مسافروں، نوواردوں اور گزرنے والوں کو زبردستی پکڑ پکڑ کر تم ان سے بےحیائی کا کام کرتے ہو، جس سے لوگوں کے لیے راستوں سے گزرنا مشکل ہوگیا اور لوگ گھروں میں بیٹھے رہنے میں عافیت سمجھتے ہیں۔ دوسرے معنی ہیں کہ تم آنے جانے والوں کو لوٹ لیتے اور قتل کر دیتے ہو یا ازراہ شرارت انہیں کنکریاں مارتے ہو۔ تیسرے معنی کیے گئے ہیں کہ سرراہ ہی بےحیائی کا ارتکاب کرتے ہو جس سے وہاں سے گزرتے ہوئے لوگ شرم محسوس کرتے ہیں۔ ان تمام صورتوں سے راستے بند ہو جاتے ہیں۔ امام شوکانی فرماتے ہیں کہ کسی ایک خاص سبب کی تعیین تو مشکل ہے تاہم وہ ایسا کام ضرور کرتے تھے ، جس سے عملاً راستہ بند ہو جاتا تھا۔ قطع طریق کے ایک معنی قطع نسل کے بھی کیے گئے ہیں۔ یعنی عورتوں کی شرم گاہوں کو استعمال کرنے کے بجائے مردوں کی دبر استعمال کرکے تم اپنی نسل بھی منقطع کرنے میں لگے ہوئےہو۔ (فتح القدیر)\n(3) یہ بےحیائی کیا تھی؟ اس میں بھی مختلف اقوال ہیں، مثلاً لوگوں کو کنکریاں مارنا ، اجنبی مسافر کا استہزا واستخفاف ، مجلسوں میں پاد مارنا، ایک دوسرے کے سامنے اغلام بازی، شطرنج وغیرہ قسم کی قمار بازی، رنگے ہوئے کپڑے پہننا، وغیرہ۔ امام شوکانی فرماتے ہیں (کوئی بعید نہیں کہ وہ یہ تمام ہی منکرات کرتے رہے ہوں)۔\n(4) حضرت لوط (عليه السلام) نے جب انہیں ان منکرات سے منع کیا تو اس کے جواب میں کہا . . .۔","lang":"ur","meta":{"transliteration":"a-innakum latatūna al-rijāla wataqṭaʿūna al-sabīla watatūna fī nādīkumu al-munkara famā kāna jawāba qawmihi illā an qālū i'tinā biʿadhābi al-lahi in kunta mina al-ṣādiqīna ","translations":["Indeed, you","approach","the men","and you cut off","the road","and commit","in","your meetings","evil","And not","was","(the) answer","(of) his people","except","that","they said","Bring upon us","(the) punishment","(of) Allah","if","you are","of","the truthful","(29)"],"transliterationArr":["a-innakum","latatūna","al-rijāla","wataqṭaʿūna","al-sabīla","watatūna","fī","nādīkumu","al-munkara","famā","kāna","jawāba","qawmihi","illā","an","qālū","i'tinā","biʿadhābi","al-lahi","in","kunta","mina","al-ṣādiqīna",null],"verseTiming":[[1,0,1850],[2,1850,3090],[3,3090,4200],[4,4200,5580],[5,5580,6720],[6,6720,7920],[7,7920,8410],[8,8410,9610],[9,9610,12050],[10,12050,12590],[11,12590,13260],[12,13260,14160],[13,14160,16150],[14,16150,18200],[15,18200,19030],[16,19030,19680],[17,19680,20500],[18,20500,21560],[19,21560,22440],[20,22440,23420],[21,23420,24650],[22,24650,25030],[23,25030,28215]]}},{"name":"29:30","price":"حضرت لوط (علیہ السلام) نے دعا کی(1) کہ پروردگار! اس مفسد قوم پر میری مدد فرما.","arabic":"قَالَ رَبِّ ٱنصُرۡنِي عَلَى ٱلۡقَوۡمِ ٱلۡمُفۡسِدِينَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3370,"juzNumber":20,"footnotes":"(1) یعنی جب حضرت لوط (عليه السلام) قوم کی اصلاح سے ناامید ہوگئے تو اللہ سے مدد کی دعا فرمائی . . .۔","lang":"ur","meta":{"transliteration":"qāla rabbi unṣur'nī ʿalā al-qawmi al-muf'sidīna ","translations":["He said","My Lord","Help me","against","the people","the corrupters","(30)"],"transliterationArr":["qāla","rabbi","unṣur'nī","ʿalā","al-qawmi","al-muf'sidīna",null],"verseTiming":[[1,0,700],[2,700,1290],[3,1290,3050],[4,3050,3470],[5,3470,4360],[6,4360,7815]]}},{"name":"29:31","price":"اور جب ہمارے بھیجے ہوئے فرشتے ابراہیم (علیہ السلام) کے پاس بشارت لے کر پہنچے کہنے لگے کہ اس بستی والوں کو ہم ہلاک کرنے والے ہیں(1) ، یقیناً یہاں کے رہنے والے گنہگار ہیں.","arabic":"وَلَمَّا جَآءَتۡ رُسُلُنَآ إِبۡرَٰهِيمَ بِٱلۡبُشۡرَىٰ قَالُوٓاْ إِنَّا مُهۡلِكُوٓاْ أَهۡلِ هَٰذِهِ ٱلۡقَرۡيَةِۖ إِنَّ أَهۡلَهَا كَانُواْ ظَٰلِمِينَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3371,"juzNumber":20,"footnotes":"(1) یعنی حضرت لوط (عليه السلام) کی دعا قبول فرمالی گئی اور اللہ تعالیٰ نے فرشتوں کو ہلاک کرنے کے لیے بھیج دیا۔ وہ فرشتے پہلے حضرت ابراہیم (عليه السلام) کے پاس گئے اور انہیں اسحاق (عليه السلام) ویعقوب (عليه السلام) کی خوش خبری دی اور ساتھ ہی بتلایا کہ ہم لوط (عليه السلام) کی بستی ہلاک کرنے آئے ہیں۔","lang":"ur","meta":{"transliteration":"walammā jāat rusulunā ib'rāhīma bil-bush'rā qālū innā muh'likū ahli hādhihi al-qaryati inna ahlahā kānū ẓālimīna ","translations":["And when","came","Our messengers","(to) Ibrahim","with the glad tidings","they said","Indeed, we","(are) going to destroy","(the) people","(of) this","town","Indeed","its people","are","wrongdoers","(31)"],"transliterationArr":["walammā","jāat","rusulunā","ib'rāhīma","bil-bush'rā","qālū","innā","muh'likū","ahli","hādhihi","al-qaryati","inna","ahlahā","kānū","ẓālimīna",null],"verseTiming":[[1,0,1880],[2,1880,4290],[3,4290,6910],[4,6910,8200],[5,8200,9480],[6,9480,10470],[7,10470,13150],[8,13150,14510],[9,14510,16900],[10,16900,17530],[11,17530,18370],[12,18370,19850],[13,19850,21170],[14,21170,22130],[15,22130,23100],[16,23100,25935]]}},{"name":"29:32","price":"(حضرت ابراہیم علیہ السلام نے) کہا اس میں تو لوط (علیہ السلام) ہیں، فرشتوں نے کہا یہاں جو ہیں ہم انہیں بخوبی جانتے ہیں(1) ۔ لوط (علیہ السلام) کو اور اس کے خاندان کو سوائے اس کی بیوی کے ہم بچالیں گے، البتہ وه عورت پیچھے ره جانے والوں میں سے ہے.(2)","arabic":"قَالَ إِنَّ فِيهَا لُوطٗاۚ قَالُواْ نَحۡنُ أَعۡلَمُ بِمَن فِيهَاۖ لَنُنَجِّيَنَّهُۥ وَأَهۡلَهُۥٓ إِلَّا ٱمۡرَأَتَهُۥ كَانَتۡ مِنَ ٱلۡغَٰبِرِينَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3372,"juzNumber":20,"footnotes":"(1) یعنی ہمیں علم ہے کہ اخیار اور مومن کون ہیں اور اشرار کون؟۔\n(2) یعنی ان پیچھے رہ جانے والوں میں سے، جن کو عذاب کے ذریعے سے ہلاک کیا جانا ہے وہ چونکہ مومنہ نہیں تھی بلکہ اپنی قوم کی طرف دار تھی، اس لیے اسے بھی ہلاک کر دیا گیا۔","lang":"ur","meta":{"transliteration":"qāla inna fīhā lūṭan qālū naḥnu aʿlamu biman fīhā lanunajjiyannahu wa-ahlahu illā im'ra-atahu kānat mina al-ghābirīna ","translations":["He said","Indeed","in it","(is) Lut","They said","We","know better","who","(is) in it","We will surely save him","and his family","except","his wife","She","(is) of","those who remain behind","(32)"],"transliterationArr":["qāla","inna","fīhā","lūṭan","qālū","naḥnu","aʿlamu","biman","fīhā","lanunajjiyannahu","wa-ahlahu","illā","im'ra-atahu","kānat","mina","al-ghābirīna",null],"verseTiming":[[1,0,590],[2,590,1780],[3,1780,2720],[4,2720,4220],[5,4220,4980],[6,4980,5580],[7,5580,6490],[8,6490,7770],[9,7770,8700],[10,8700,11970],[11,11970,14480],[12,14480,15020],[13,15020,16260],[14,16260,17130],[15,17130,17460],[16,17460,20505]]}},{"name":"29:33","price":"پھر جب ہمارے قاصد لوط (علیہ السلام) کے پاس پہنچے تو وه ان کی وجہ سے غمگین ہوئے اور دل ہی دل میں رنج کرنے لگے(1) ۔ قاصدوں نے کہا آپ نہ خوف کھایئے نہ آزرده ہوں، ہم آپ کو مع آپ کے متعلقین کے بچالیں گے مگر آپ کی(2) بیوی کہ وه عذاب کے لیے باقی ره جانے والوں میں سے ہوگی.","arabic":"وَلَمَّآ أَن جَآءَتۡ رُسُلُنَا لُوطٗا سِيٓءَ بِهِمۡ وَضَاقَ بِهِمۡ ذَرۡعٗاۖ وَقَالُواْ لَا تَخَفۡ وَلَا تَحۡزَنۡ إِنَّا مُنَجُّوكَ وَأَهۡلَكَ إِلَّا ٱمۡرَأَتَكَ كَانَتۡ مِنَ ٱلۡغَٰبِرِينَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3373,"juzNumber":20,"footnotes":"(1) سِيءَ بِهِمْ کے معنی ہیں۔ ان کے پاس ایسی چیز آئی جو انہیں بری لگی اور اس سے ڈر گئے۔ اس لیے کہ لوط (عليه السلام) نے ان فرشتوں کو، جو انسانی شکل میں آئے تھے، انسان ہی سمجھا۔ ڈرے اپنی قوم کی عادت بد اور سرکشی کی وجہ سے کہ ان خوبصورت مہمانوں کی آمد کا علم اگر انہیں ہوگیا تو وہ ان سے زبردستی بےحیائی کا ارتکاب کریں گے، جس سے میری رسوائی ہوگی۔ ضَاقَ بِهِمْ ذَرْعًا یہ کنایہ ہے عاجزی سے۔ جیسے ضَاقَتْ يَدُهُ (ہاتھ کا تنگ ہونا) کنایہ ہے فقر سے۔ یعنی ان خوش شکل مہمانوں کو بدخصلت قوم سے بچانے کی کوئی تدبیر انہیں نہیں سوجھی، جس کی وجہ سے وہ غمگین اور دل ہی دل میں پریشان تھے۔\n(2) فرشتوں نے حضرت لوط (عليه السلام) کی اس پریشانی اور غم وحزن کی کیفیت کو دیکھا تو انہیں تسلی دی، اور کہا کہ آپ کوئی خوف اور حزن نہ کریں، ہم اللہ کی طرف سے بھیجے ہوئے فرشتے ہیں۔ ہمارا مقصد آپ کو اور آپ کے گھر والوں کو، سوائے آپ کی بیوی کے، نجات دلانا ہے۔","lang":"ur","meta":{"transliteration":"walammā an jāat rusulunā lūṭan sīa bihim waḍāqa bihim dharʿan waqālū lā takhaf walā taḥzan innā munajjūka wa-ahlaka illā im'ra-ataka kānat mina al-ghābirīna ","translations":["And when","[that]","came","Our messengers","(to) Lut","he was distressed","for them","and felt straitened","for them","(and) uneasy","And they said","(Do) not","fear","and (do) not","grieve","Indeed, we","(will) save you","and your family","except","your wife","She","(is) of","those who remain behind","(33)"],"transliterationArr":["walammā","an","jāat","rusulunā","lūṭan","sīa","bihim","waḍāqa","bihim","dharʿan","waqālū","lā","takhaf","walā","taḥzan","innā","munajjūka","wa-ahlaka","illā","im'ra-ataka","kānat","mina","al-ghābirīna",null],"verseTiming":[[1,0,1590],[2,1590,1650],[3,1650,4080],[4,4080,6090],[5,6090,7120],[6,7120,8740],[7,8740,10920],[8,10920,11520],[9,11520,12440],[10,12440,13050],[11,13050,13680],[12,13680,14530],[13,14530,15510],[14,15510,15890],[15,15890,16630],[16,16630,17210],[17,17210,18570],[18,18570,19910],[19,19910,21240],[20,21240,22230],[21,22230,22900],[22,22900,23910],[23,23910,24750],[24,24750,25100],[25,25100,28345]]}},{"name":"29:34","price":"ہم اس بستی والوں پر آسمانی عذاب نازل کرنے والے ہیں(1) اس وجہ سے کہ یہ بےحکم ہو رہے ہیں.","arabic":"إِنَّا مُنزِلُونَ عَلَىٰٓ أَهۡلِ هَٰذِهِ ٱلۡقَرۡيَةِ رِجۡزٗا مِّنَ ٱلسَّمَآءِ بِمَا كَانُواْ يَفۡسُقُونَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3374,"juzNumber":20,"footnotes":"(1) اس آسمانی عذاب سے وہی عذاب مراد ہے جس کے ذریعے سے قوم لوط کو ہلاک کیا گیا۔ کہا جاتا ہے کہ جبرائیل (عليه السلام) نے ان کی بستیوں کو زمین سے اکھیڑا آسمان کی بلندیوں تک لے گئے، پھر ان کو ان ہی پر الٹا دیا گیا، اس کے بعد کھنگر پتھروں کی بارش ان پر ہوئی اور اس جگہ کو سخت بدبودار بحیرہ (چھوٹے سمندر) میں تبدیل کر دیا گیا۔ (ابن کثیر)","lang":"ur","meta":{"transliteration":"innā munzilūna ʿalā ahli hādhihi al-qaryati rij'zan mina al-samāi bimā kānū yafsuqūna ","translations":["Indeed, we","(will) bring down","on","(the) people","(of) this","town","a punishment","from","(the) sky","because","they have been","defiantly disobedient","(34)"],"transliterationArr":["innā","munzilūna","ʿalā","ahli","hādhihi","al-qaryati","rij'zan","mina","al-samāi","bimā","kānū","yafsuqūna",null],"verseTiming":[[1,0,1760],[2,1760,3750],[3,3750,5700],[4,5700,6390],[5,6390,7210],[6,7210,8330],[7,8330,8990],[8,8990,10130],[9,10130,12760],[10,12760,13270],[11,13270,14250],[12,14250,16915]]}},{"name":"29:35","price":"البتہ ہم نے اس بستی کو صریح عبرت کی نشانی بنا دیا(1) ان لوگوں کے لیے جو عقل رکھتے ہیں.(2)","arabic":"وَلَقَد تَّرَكۡنَا مِنۡهَآ ءَايَةَۢ بَيِّنَةٗ لِّقَوۡمٖ يَعۡقِلُونَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3375,"juzNumber":20,"footnotes":"(1) یعنی پتھروں کے وہ آثار، جن کی بارش ان پر ہوئی سیاہ بدبودار پانی اور الٹی ہوئی بستیاں، یہ سب عبرت کی نشانیاں ہیں۔ مگر کن کے لیے؟ دانش مندوں کے لیے۔\n(2) اس لیے کہ وہی معاملات پر غور کرتے، اسباب وعوامل کا تجزیہ کرتے اور نتائج وآثار کو دیکھتے ہیں لیکن جو لوگ عقل وشعور سے بےبہرہ ہوتے ہیں، انہیں ان چیزوں سے کیا تعلق؟ وہ تو ان جانوروں کی طرح ہیں جنہیں ذبج کے لیے بوچڑ خانے لے جایا جاتا ہے لیکن انہیں اس کا احساس ہی نہیں ہوتا۔ اس میں مشرکین مکہ کے لیے بھی تعریض ہے کہ وہ بھی تکذیب کا مظاہرہ کر رہے ہیں جو عقل ودانش سے بےبہرہ لوگوں کا وطیرہ ہے۔","lang":"ur","meta":{"transliteration":"walaqad taraknā min'hā āyatan bayyinatan liqawmin yaʿqilūna ","translations":["And verily","We have left","about it","a sign","(as) evidence","for a people","who use reason","(35)"],"transliterationArr":["walaqad","taraknā","min'hā","āyatan","bayyinatan","liqawmin","yaʿqilūna",null],"verseTiming":[[1,0,780],[2,780,2060],[3,2060,4100],[4,4100,6000],[5,6000,7220],[6,7220,9280],[7,9280,13485]]}},{"name":"29:36","price":"اور مدین کی طرف(1) ہم نے ان کے بھائی شعیب (علیہ السلام) کو بھیجا انہوں نے کہا اے میری قوم کے لوگو! اللہ کی عبادت کرو قیامت کے دن کی توقع رکھو(2) اور زمین میں فساد نہ کرتے پھرو.(3)","arabic":"وَإِلَىٰ مَدۡيَنَ أَخَاهُمۡ شُعَيۡبٗا فَقَالَ يَٰقَوۡمِ ٱعۡبُدُواْ ٱللَّهَ وَٱرۡجُواْ ٱلۡيَوۡمَ ٱلۡأٓخِرَ وَلَا تَعۡثَوۡاْ فِي ٱلۡأَرۡضِ مُفۡسِدِينَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3376,"juzNumber":20,"footnotes":"(1) مدین حضرت ابراہیم (عليه السلام) کے بیٹے کا نام تھا، بعض کے نزدیک یہ ان کے پوتے کا نام ہے، بیٹے کا نام مدیان تھا۔ ان ہی کے نام پر اس قبیلے کا نام پڑ گیا، جو ان ہی کی نسل پر مشتمل تھا۔ اسی قبیلہ مدین کی طرف حضرت شعیب (عليه السلام) کو نبی بنا کر بھیجا گیا۔ بعض کہتے ہیں کہ مدین شہر کا نام تھا، یہ قبیلہ یا شہر لوط (عليه السلام) کی بستی کے قریب ہی تھا۔\n(2) اللہ کی عبادت کے بعد، انہیں آخرت کی یاد دہانی کرائی گئی یا تو اس لیے کہ وہ آخرت کے منکر تھے یا اس لیے کہ وہ اسے فراموش کیے ہوئے تھے اور معصیتوں میں مبتلا تھے اور جو قوم آخرت کو فراموش کر دے، وہ گناہوں میں دلیر ہوتی ہے۔ جیسے آج مسلمانوں کی اکثریت کا حال ہے۔\n(3) ناپ تول میں کمی اور لوگوں کو کم دینا، یہ بیماری ان میں عام تھی اور ارتکاب معاصی میں بھی انہیں باک نہیں تھا، جس سے زمین فساد سے بھر گئی تھی۔","lang":"ur","meta":{"transliteration":"wa-ilā madyana akhāhum shuʿayban faqāla yāqawmi uʿ'budū al-laha wa-ir'jū al-yawma al-ākhira walā taʿthaw fī al-arḍi muf'sidīna ","translations":["And to","Madyan","their brother","Shuaib","And he said","O my people","Worship","Allah","and expect","the Day","the Last","and (do) not","commit evil","in","the earth","(as) corrupters","(36)"],"transliterationArr":["wa-ilā","madyana","akhāhum","shuʿayban","faqāla","yāqawmi","uʿ'budū","al-laha","wa-ir'jū","al-yawma","al-ākhira","walā","taʿthaw","fī","al-arḍi","muf'sidīna",null],"verseTiming":[[1,0,890],[2,890,1640],[3,1640,2630],[4,2630,4260],[5,4260,5200],[6,5200,6160],[7,6160,6800],[8,6800,7660],[9,7660,8240],[10,8240,9010],[11,9010,10160],[12,10160,10740],[13,10740,11530],[14,11530,11770],[15,11770,12610],[16,12610,15515]]}},{"name":"29:37","price":"پھر بھی انہوں نے انہیں جھٹلایا آخر انہیں زلزلے نے پکڑ لیا اور وه اپنے گھروں میں بیٹھے کے بیٹھے مرده ہو کر ره گئے.(1)","arabic":"فَكَذَّبُوهُ فَأَخَذَتۡهُمُ ٱلرَّجۡفَةُ فَأَصۡبَحُواْ فِي دَارِهِمۡ جَٰثِمِينَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3377,"juzNumber":20,"footnotes":"(1) حضرت شعیب (عليه السلام) کے وعظ ونصیحت کا ان پر کوئی اثر نہیں ہوا بالآخر بادلوں کے سائے والے دن، جبرائیل (عليه السلام) کی ایک سخت چیخ سے زمین زلزلے سے لرز اٹھی، جس سے ان کے دل ان کی آنکھوں میں آگئے اور ان کی موت واقع ہوگئی اور وہ گھٹنوں کے بل بیٹھے کے بیٹھے رہ گئے۔","lang":"ur","meta":{"transliteration":"fakadhabūhu fa-akhadhathumu al-rajfatu fa-aṣbaḥū fī dārihim jāthimīna ","translations":["But they denied him","so seized them","the earthquake","and they became","in","their home","fallen prone","(37)"],"transliterationArr":["fakadhabūhu","fa-akhadhathumu","al-rajfatu","fa-aṣbaḥū","fī","dārihim","jāthimīna",null],"verseTiming":[[1,0,1480],[2,1480,2910],[3,2910,3940],[4,3940,5120],[5,5120,5570],[6,5570,6600],[7,6600,9135]]}},{"name":"29:38","price":"اور ہم نے عادیوں اور ﺛمودیوں کو بھی غارت کیا جن کے بعض مکانات تمہارے سامنے ﻇاہر ہیں(1) اور شیطان نے انہیں ان کی بداعمالیاں آراستہ کر دکھائی تھیں اور انہیں راه سے روک دیا تھا باوجودیکہ یہ آنکھوں والے اور ہوشیار تھے.(2)","arabic":"وَعَادٗا وَثَمُودَاْ وَقَد تَّبَيَّنَ لَكُم مِّن مَّسَٰكِنِهِمۡۖ وَزَيَّنَ لَهُمُ ٱلشَّيۡطَٰنُ أَعۡمَٰلَهُمۡ فَصَدَّهُمۡ عَنِ ٱلسَّبِيلِ وَكَانُواْ مُسۡتَبۡصِرِينَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3378,"juzNumber":20,"footnotes":"(1) قوم عاد کی بستی۔ احقاف، حضر موت (یمن) کے قریب اور ثمود کی بستی، حجر، جسے آج کل مدائن صالح کہتے ہیں، حجاز کے شمال میں ہے۔ ان علاقوں سے عربوں کے تجارتی قافلے آتے جاتے تھے، اس لیے یہ بستیاں ان کے لیے انجان نہیں، بلکہ ظاہر تھیں۔\n(2) یعنی تھے وہ عقل مند اور ہوشیار۔ لیکن دین کے معاملے میں انہوں نے اپنی عقل و بصیرت سے کچھ کام نہیں لیا، اس لیے یہ عقل اور سمجھ ان کے کام نہ آئی۔","lang":"ur","meta":{"transliteration":"waʿādan wathamūdā waqad tabayyana lakum min masākinihim wazayyana lahumu al-shayṭānu aʿmālahum faṣaddahum ʿani al-sabīli wakānū mus'tabṣirīna ","translations":["And Aad","and Thamud","and verily","(has) become clear","to you","from","their dwellings","And made fair-seeming","to them","the Shaitaan","their deeds","and averted them","from","the Way","though they were","endowed with insight","(38)"],"transliterationArr":["waʿādan","wathamūdā","waqad","tabayyana","lakum","min","masākinihim","wazayyana","lahumu","al-shayṭānu","aʿmālahum","faṣaddahum","ʿani","al-sabīli","wakānū","mus'tabṣirīna",null],"verseTiming":[[1,0,1690],[2,1690,2680],[3,2680,3090],[4,3090,4290],[5,4290,4960],[6,4960,5730],[7,5730,8530],[8,8530,9450],[9,9450,10100],[10,10100,11410],[11,11410,12830],[12,12830,14060],[13,14060,14480],[14,14480,15580],[15,15580,16590],[16,16590,19645]]}},{"name":"29:39","price":"اور قارون اور فرعون اور ہامان کو بھی، ان کے پاس حضرت موسیٰ (علیہ السلام) کھلے کھلے معجزے لے کر آئے تھے(1) پھر بھی انہوں نے زمین میں تکبر کیا لیکن ہم سے آگے بڑھنے والے نہ ہو سکے.(2)","arabic":"وَقَٰرُونَ وَفِرۡعَوۡنَ وَهَٰمَٰنَۖ وَلَقَدۡ جَآءَهُم مُّوسَىٰ بِٱلۡبَيِّنَٰتِ فَٱسۡتَكۡبَرُواْ فِي ٱلۡأَرۡضِ وَمَا كَانُواْ سَٰبِقِينَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3379,"juzNumber":20,"footnotes":"(1) یعنی دلائل ومعجزات کا کوئی اثر ان پر نہیں ہوا، اور بدستور متکبر بنے رہے یعنی ایمان وتقویٰ اختیار کرنے سے گریز کیا۔\n(2) یعنی ہماری گرفت سے بچ کر نہیں جاسکے اور ہمارے عذاب کے شکنجے میں آکر رہے۔ ایک دوسرا ترجمہ ہے کہ یہ کفر میں سبقت کرنے والے نہیں تھے بلکہ ان سے پہلے بھی بہت سی امتیں گزر چکی ہیں جنہوں نے اسی طرح کفر وعناد کا راستہ اختیار کیے رکھا تھا۔","lang":"ur","meta":{"transliteration":"waqārūna wafir'ʿawna wahāmāna walaqad jāahum mūsā bil-bayināti fa-is'takbarū fī al-arḍi wamā kānū sābiqīna ","translations":["And Qarun","and Firaun","and Haman","And certainly","came to them","Musa","with clear evidences","but they were arrogant","in","the earth","and not","they could","outstrip Us","(39)"],"transliterationArr":["waqārūna","wafir'ʿawna","wahāmāna","walaqad","jāahum","mūsā","bil-bayināti","fa-is'takbarū","fī","al-arḍi","wamā","kānū","sābiqīna",null],"verseTiming":[[1,0,1400],[2,1400,2710],[3,2710,5610],[4,5610,6380],[5,6380,8500],[6,8500,10280],[7,10280,11910],[8,11910,13270],[9,13270,15070],[10,15070,15320],[11,15320,16170],[12,16170,16680],[13,16680,17540],[14,17540,20525]]}},{"name":"29:40","price":"پھر تو ہر ایک کو ہم نے اس کے گناه کے وبال میں گرفتار کر لیا(1) ، ان میں سے بعض پر ہم نے پتھروں کا مینہ برسایا(2) اور ان میں سے بعض کو زور دار سخت آواز نے دبوچ لیا(3) اور ان میں سے بعض کو ہم نے زمین میں دھنسا دیا(4) اور ان میں سے بعض کو ہم نے ڈبو دیا(5)، اللہ تعالیٰ ایسا نہیں کہ ان پر ﻇلم کرے بلکہ یہی لوگ اپنی جانوں پر ﻇلم کرتے تھے.(6)","arabic":"فَكُلًّا أَخَذۡنَا بِذَنۢبِهِۦۖ فَمِنۡهُم مَّنۡ أَرۡسَلۡنَا عَلَيۡهِ حَاصِبٗا وَمِنۡهُم مَّنۡ أَخَذَتۡهُ ٱلصَّيۡحَةُ وَمِنۡهُم مَّنۡ خَسَفۡنَا بِهِ ٱلۡأَرۡضَ وَمِنۡهُم مَّنۡ أَغۡرَقۡنَاۚ وَمَا كَانَ ٱللَّهُ لِيَظۡلِمَهُمۡ وَلَٰكِن كَانُوٓاْ أَنفُسَهُمۡ يَظۡلِمُونَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3380,"juzNumber":20,"footnotes":"(1) یعنی ان مذکورین میں سے ہر ایک کی، ان کے گناہوں کی پاداش میں، ہم نے گرفت کی۔\n(2) یہ قوم عاد تھی، جس پر نہایت تندوتیز ہوا کا عذاب آیا۔ یہ ہوا زمین سے کنکریاں اڑا اڑا کر ان پر برساتی ، بالآخر اس کی شدت اتنی بڑھی کہ انہیں اچک کر آسمان تک لے جاتی اور انہیں سر کے بل زمین پر دے مارتی، جس سے ان کا سر الگ اور دھڑ الگ ہو جاتا گویا کہ وہ کھجور کے کھوکھلے تنے ہیں۔ (ابن کثیر) بعض مفسرین نے حاصبا کا مصداق قوم لوط (عليه السلام) کو ٹھہرایا ہے۔ لیکن امام ابن کثیر نے اسے غیر صحیح اور حضرت ابن عباس (رضي الله عنه) کی طرف منسوب قول کو منقطع قرار دیا ہے۔\n(3) یہ حضرت صالح (عليه السلام) کی قوم، ثمود ہے۔ جنہیں ان کے کہنے پر ایک چٹان سے اونٹنی نکال کر دکھائی گئی۔ لیکن ان ظالموں نے ایمان لانے کے بجائے اس اونٹنی کو ہی مار دالا۔ جس کے تین دن بعد ان پر سخت چنگھاڑ کا عذاب آیا، جس نے ان کی آوازوں اور حرکتوں کو خاموش کر دیا۔\n(4) یہ قارون ہے، جسے مال و دولت کے خزانے عطا کیے گئے تھے، لیکن یہ اس گھمنڈ میں مبتلا ہوگیا کہ یہ مال و دولت اس بات کی دلیل ہے کہ میں اللہ کے ہاں معزز و محترم ہوں۔ مجھے موسیٰ (عليه السلام) کی بات ماننے کی کیا ضرورت ہے؟ چنانچہ اسے اس کے خزانوں اور محلات سمیت زمین میں دھنسا دیا گیا۔\n(5) یہ فرعون ہے، جو ملک مصر کا حکمران تھا، لیکن حد سے تجاوز کرکے اس نے اپنے بارے میں الوہیت کا دعویٰ بھی کر دیا۔ حضرت موسیٰ (عليه السلام) پر ایمان لانے سے اور ان کی قوم بنی اسرائیل کو، جس کو اس نے غلام بنا رکھا تھا، آزاد کرنے سے انکار کر دیا۔ بالآخر ایک صبح اس کو اس کے پورے لشکر سمیت دریائے قلزم میں غرق کر دیا گیا۔\n(6) یعنی اللہ کی شان نہیں کہ وہ ظلم کرے۔ اس لیے پچھلی قومیں، جن پر عذاب آیا، محض اس لیے ہلاک ہوئیں کہ کفروشرک اور تکذیب ومعاصی کا ارتکاب کرکے انہوں نے خود ہی اپنی جانوں پر ظلم کیا تھا۔","lang":"ur","meta":{"transliteration":"fakullan akhadhnā bidhanbihi famin'hum man arsalnā ʿalayhi ḥāṣiban wamin'hum man akhadhathu al-ṣayḥatu wamin'hum man khasafnā bihi al-arḍa wamin'hum man aghraqnā wamā kāna al-lahu liyaẓlimahum walākin kānū anfusahum yaẓlimūna ","translations":["So each","We seized","for his sin","Then of them","(was he) who","We sent","on him","a violent storm","and of them","(was he) who","seized him","the awful cry","and of them","(was he) who","We caused to swallow","him","the earth","and of them","(was he) who","We drowned","And not","was","Allah","to wrong them","but","they were","themselves","doing wrong","(40)"],"transliterationArr":["fakullan","akhadhnā","bidhanbihi","famin'hum","man","arsalnā","ʿalayhi","ḥāṣiban","wamin'hum","man","akhadhathu","al-ṣayḥatu","wamin'hum","man","khasafnā","bihi","al-arḍa","wamin'hum","man","aghraqnā","wamā","kāna","al-lahu","liyaẓlimahum","walākin","kānū","anfusahum","yaẓlimūna",null],"verseTiming":[[1,0,990],[2,990,2000],[3,2000,4570],[4,4570,5700],[5,5700,6910],[6,6910,8150],[7,8150,8980],[8,8980,10750],[9,10750,11570],[10,11570,12680],[11,12680,13730],[12,13730,14770],[13,14770,15650],[14,15650,16510],[15,16510,17580],[16,17580,18040],[17,18040,18880],[18,18880,19710],[19,19710,20850],[20,20850,22210],[21,22210,23360],[22,23360,23940],[23,23940,24890],[24,24890,26300],[25,26300,27820],[26,27820,29470],[27,29470,31560],[28,31560,34555]]}},{"name":"29:41","price":"جن لوگوں نے اللہ تعالیٰ کے سوا اور کارساز مقرر کر رکھے ہیں ان کی مثال مکڑی کی سی ہے کہ وه بھی ایک گھر بنا لیتی ہے، حاﻻنکہ تمام گھروں سے زیاده بودا گھر مکڑی کا گھر ہی ہے(1) ، کاش! وه جان لیتے.","arabic":"مَثَلُ ٱلَّذِينَ ٱتَّخَذُواْ مِن دُونِ ٱللَّهِ أَوۡلِيَآءَ كَمَثَلِ ٱلۡعَنكَبُوتِ ٱتَّخَذَتۡ بَيۡتٗاۖ وَإِنَّ أَوۡهَنَ ٱلۡبُيُوتِ لَبَيۡتُ ٱلۡعَنكَبُوتِۚ لَوۡ كَانُواْ يَعۡلَمُونَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3381,"juzNumber":20,"footnotes":"(1) یعنی جس طرح مکڑی کا جالا (گھر) نہایت بودا، کمزور اور ناپائیدار ہوتا ہے، ہاتھ کے ادنیٰ سے اشارے سے وہ نابود ہو جاتا ہے۔ اللہ کے سوا دوسروں کو اپنا معبود، حاجت روا اور مشکل کشا سمجھنا بھی بالکل ایسا ہی، یعنی بالکل بے فائدہ ہے، کیونکہ وہ بھی کسی کے کام نہیں آسکتے۔ اس لیے غیر اللہ کے سہارے بھی مکڑی کے جالے کی طرح یکسر ناپائیدار ہیں۔ اگر یہ پائیدار یا نفع بخش ہوتے تو یہ معبود گزشتہ اقوام کو تباہی سے بچا لیتے۔ لیکن دنیا نے دیکھ لیا کہ وہ انہیں نہیں بچا سکے۔","lang":"ur","meta":{"transliteration":"mathalu alladhīna ittakhadhū min dūni al-lahi awliyāa kamathali al-ʿankabūti ittakhadhat baytan wa-inna awhana al-buyūti labaytu al-ʿankabūti law kānū yaʿlamūna ","translations":["(The) example","(of) those who","take","besides","besides","Allah","protectors","(is) like","the spider","who takes","a house","And indeed","the weakest","(of) houses","(is) surely (the) house","(of) the spider","if (only)","they","know","(41)"],"transliterationArr":["mathalu","alladhīna","ittakhadhū","min","dūni","al-lahi","awliyāa","kamathali","al-ʿankabūti","ittakhadhat","baytan","wa-inna","awhana","al-buyūti","labaytu","al-ʿankabūti","law","kānū","yaʿlamūna",null],"verseTiming":[[1,0,660],[2,660,1680],[3,1680,2790],[4,2790,3830],[5,3830,4510],[6,4510,5370],[7,5370,7920],[8,7920,8660],[9,8660,10770],[10,10770,11779],[11,11779,12779],[12,12779,14719],[13,14719,15439],[14,15439,16609],[15,16609,17379],[16,17379,21199],[17,21199,21549],[18,21549,22409],[19,22409,25314]]}},{"name":"29:42","price":"اللہ تعالیٰ ان تمام چیزوں کو جانتا ہے جنہیں وه اس کے سوا پکار رہے ہیں، وه زبردست اور ذی حکمت ہے","arabic":"إِنَّ ٱللَّهَ يَعۡلَمُ مَا يَدۡعُونَ مِن دُونِهِۦ مِن شَيۡءٖۚ وَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3382,"juzNumber":20,"footnotes":"","lang":"ur","meta":{"transliteration":"inna al-laha yaʿlamu mā yadʿūna min dūnihi min shayin wahuwa al-ʿazīzu al-ḥakīmu ","translations":["Indeed","Allah","knows","what","they invoke","besides Him","besides Him","any","thing","And He","(is) the All-Mighty","the All-Wise","(42)"],"transliterationArr":["inna","al-laha","yaʿlamu","mā","yadʿūna","min","dūnihi","min","shayin","wahuwa","al-ʿazīzu","al-ḥakīmu",null],"verseTiming":[[1,0,1140],[2,1140,1960],[3,1960,2900],[4,2900,3300],[5,3300,4340],[6,4340,5340],[7,5340,6430],[8,6430,6890],[9,6890,10240],[10,10240,10760],[11,10760,11890],[12,11890,14655]]}},{"name":"29:43","price":"ہم ان مثالوں کو لوگوں کے لیے بیان فرما رہے ہیں(1) انہیں صرف علم والے ہی سمجھتے ہیں.(2)","arabic":"وَتِلۡكَ ٱلۡأَمۡثَٰلُ نَضۡرِبُهَا لِلنَّاسِۖ وَمَا يَعۡقِلُهَآ إِلَّا ٱلۡعَٰلِمُونَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3383,"juzNumber":20,"footnotes":"(1) یعنی انہیں خواب غفلت سے بیدار کرنے، شرک کی حقیقت سے آگاہ کرنے اور ہدایت کا راستہ سجھانے کے لیے۔\n(2) اس علم سے مراد اللہ کا، اس کی شریعت کا اور ان آیات ودلائل کا علم ہے جن پر غور وفکر کرنے سے انسان کو اللہ کی معرفت حاصل ہوتی اور ہدایت کا راستہ ملتا ہے۔","lang":"ur","meta":{"transliteration":"watil'ka al-amthālu naḍribuhā lilnnāsi wamā yaʿqiluhā illā al-ʿālimūna ","translations":["And these","examples","We set forth","to mankind","but not","will understand them","except","those of knowledge","(43)"],"transliterationArr":["watil'ka","al-amthālu","naḍribuhā","lilnnāsi","wamā","yaʿqiluhā","illā","al-ʿālimūna",null],"verseTiming":[[1,0,880],[2,880,2110],[3,2110,3440],[4,3440,7210],[5,7210,7860],[6,7860,10300],[7,10300,10910],[8,10910,14525]]}},{"name":"29:44","price":"اللہ تعالیٰ نے آسمانوں اور زمین کو مصلحت اور حق کے ساتھ پیدا کیا ہے(1) ، ایمان والوں کے لیے تو اس میں بڑی بھاری دلیل ہے.(2)","arabic":"خَلَقَ ٱللَّهُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ بِٱلۡحَقِّۚ إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لِّلۡمُؤۡمِنِينَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3384,"juzNumber":20,"footnotes":"(1) یعنی عبث اور بےمقصد نہیں۔\n(2) یعنی اللہ کے وجود کی، اس کی قدرت اور علم وحکمت کی۔ اور پھر اسی دلیل سے وہ اس نتیجے پر پہنچتے ہیں کہ کائنات میں اسکے سوا کوئی معبود نہیں، کوئی حاجت روا اور مشکل کشا نہیں۔","lang":"ur","meta":{"transliteration":"khalaqa al-lahu al-samāwāti wal-arḍa bil-ḥaqi inna fī dhālika laāyatan lil'mu'minīna ","translations":["Allah created","Allah created","the heavens","and the earth","in truth","Indeed","in","that","(is) surely a Sign","for the believers","(44)"],"transliterationArr":["khalaqa","al-lahu","al-samāwāti","wal-arḍa","bil-ḥaqi","inna","fī","dhālika","laāyatan","lil'mu'minīna",null],"verseTiming":[[1,0,720],[2,720,1540],[3,1540,3030],[4,3030,4050],[5,4050,5450],[6,5450,6710],[7,6710,7150],[8,7150,8020],[9,8020,9080],[10,9080,12275]]}},{"name":"29:45","price":"جو کتاب آپ کی طرف وحی کی گئی ہے اسے پڑھئے(1) اور نماز قائم کریں(2)، یقیناً نماز بے حیائی اور برائی سے روکتی ہے(3)، بیشک اللہ کا ذکر بہت بڑی چیز ہے(4)، تم جو کچھ کر رہے ہو اس سے اللہ خبردار ہے.","arabic":"ٱتۡلُ مَآ أُوحِيَ إِلَيۡكَ مِنَ ٱلۡكِتَٰبِ وَأَقِمِ ٱلصَّلَوٰةَۖ إِنَّ ٱلصَّلَوٰةَ تَنۡهَىٰ عَنِ ٱلۡفَحۡشَآءِ وَٱلۡمُنكَرِۗ وَلَذِكۡرُ ٱللَّهِ أَكۡبَرُۗ وَٱللَّهُ يَعۡلَمُ مَا تَصۡنَعُونَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3385,"juzNumber":20,"footnotes":"(1) قرآن کریم کی تلاوت متعدد مقاصد کے لئے مطلوب ہے، محض اجر وثواب کے لئے، اس کے معانی ومطالب پر تدبرو تفکر کے لئے، تعلیم وتدریس کے لئے، اور وعظ ونصیحت کے لئے، اس حکم تلاوت میں ساری ہی صورتیں شامل ہیں۔\n(2) کیونکہ نماز سے (بشرطیکہ نماز ہو) انسان کا تعلق خصوصی اللہ تعالیٰ کے ساتھ قائم ہو جاتا ہے، جس سے انسان کو اللہ تعالیٰ کی مدد حاصل ہوتی ہے جو زندگی کے ہر موڑ پر اس کے عزم وثبات کا باعث، اور ہدایت کا ذریعہ ثابت ہوتی ہے۔ اسی لئے قرآن کریم میں کہا گیاہے اے ایمان والو! صبر اور نماز سےمدد حاصل کرو (البقرۃ: 153) نمازاور صبر کوئی مرئی چیز تو ہے نہیں کہ انسان ان کا سہارا پکڑ کر ان سے مدد حاصل کر لے۔ یہ تو غیر مرئی چیز ہے۔ مطلب یہ ہے کہ ان کے ذریعے سے انسان کا اپنے رب کے ساتھ جو خصوصی ربط وتعلق پیدا ہوتا ہے وہ قدم قدم پر اس کی دستگیری اور رہنمائی کرتا ہے اسی لئے نبی (صلى الله عليه وسلم) کو رات کی تنہائی میں تہجد کی نماز بھی پڑھنے کی تاکید کی گئی، کیونکہ آپ (صلى الله عليه وسلم) کے ذمے جو عظیم کام سونپا گیا تھا، اس میں آپ (صلى الله عليه وسلم) کو اللہ کی مدد کی بہت زیادہ ضرورت تھی اور یہی وجہ ہے کہ خود آنحضرت (صلى الله عليه وسلم) کو بھی جب کوئی اہم مرحلہ درپیش ہوتا تو آپ (صلى الله عليه وسلم) نماز کا اہتمام فرماتے ”إِذَا حَزَبَهُ أَمْرٌ فَزِعَ إِلى الصَّلاةِ“ (مسند أحمد وأبو دود)\n(3) یعنی، بے حیائی اور برائی کے روکنے کا سبب اور ذریعہ بنتی ہے جس طرح دواؤں کی مختلف تاثیرات ہیں اور کہا جاتا ہے کہ فلاں دوا فلاں بیماری کو روکتی ہے اور واقعتاً ایسا ہوتا ہے لیکن کب؟ جب دو باتوں کا التزام کیا جائے۔ ایک دوائی پابندی کے ساتھ اس طریقے اور شرائط کے ساتھ استعمال کیا جائےجو حکیم اور ڈاکٹر بتلائے۔ دوسرا پرہیز یعنی ایسی چیزوں سے اجتناب کیا جائے جو اس دوائی کے اثرات کو زائل کرنے والی ہوں۔ اسی طرح نماز کے اندر بھی یقیناً اللہ نے ایسی روحانی تاثیر رکھی ہے کہ یہ انسان کو بے حیائی اور برائی سے روکتی ہے لیکن اسی وقت، جب نماز کو سنت نبوی (صلى الله عليه وسلم) کے مطابق ان آداب اور شرائط کے ساتھ پڑھا جائے جو اس کی صحت وقبولیت کے لئے ضروری ہیں۔ مثلاً اس کے لئے پہلی چیز اخلاص ہے، ثانیاً طہارت قلب، یعنی نماز میں اللہ کے سوا کسی اور کی طرف التفات نہ ہو، ثالثاً باجماعت اوقات مقررہ پر اس کا اہتمام۔ رابعا ارکان صلوۃ (قراءت، رکوع، قومہ، سجدہ وغیرہ) میں اعتدال واطمینان، خامساً خشوع وخضوع اور رقت کی کیفیت۔ سادساً مواظبت یعنی پابندی کے ساتھ اس کا التزام، سابعاً رزق حلال کا اہتمام۔ ہماری نمازیں ان آداب وشرائط سے عاری ہیں، اس لئے ان کے وہ اثرات بھی ہماری زندگی میں ظاہر نہیں ہو رہے ہیں، جو قرآن کریم میں بتلائے گئے ہیں۔ بعض نے اس کے معنی امر کے کیے ہیں۔ یعنی نماز پڑھنے والے کو چاہئے کہ بے حیائی کے کاموں سے اور برائی سے رک جائے۔\n(4) یعنی بے حیائی اور برائی سے روکنے میں اللہ کا ذکر، اقامت صلوٰۃ سے بھی زیادہ موثر ہے۔ اس لئے کہ آدمی جب تک نماز میں ہوتا ہے، برائی سے رکا رہتا ہے۔ لیکن بعد میں اس کی تاثیر کمزور ہو جاتی ہے، اس کے برعکس ہر وقت اللہ کا ذکر اس کے لئے ہر وقت برائی میں مانع رہتا ہے۔","lang":"ur","meta":{"transliteration":"ut'lu mā ūḥiya ilayka mina al-kitābi wa-aqimi al-ṣalata inna al-ṣalata tanhā ʿani al-faḥshāi wal-munkari waladhik'ru al-lahi akbaru wal-lahu yaʿlamu mā taṣnaʿūna ","translations":["Recite","what","has been revealed","to you","of","the Book","and establish","the prayer","Indeed","the prayer","prevents","from","the immorality","and evil deeds","and surely (the) remembrance","(of) Allah","(is) greatest","And Allah","knows","what","you do","(45)"],"transliterationArr":["ut'lu","mā","ūḥiya","ilayka","mina","al-kitābi","wa-aqimi","al-ṣalata","inna","al-ṣalata","tanhā","ʿani","al-faḥshāi","wal-munkari","waladhik'ru","al-lahi","akbaru","wal-lahu","yaʿlamu","mā","taṣnaʿūna",null],"verseTiming":[[1,0,730],[2,730,2650],[3,2650,3440],[4,3440,4270],[5,4270,4600],[6,4600,5720],[7,5720,6550],[8,6550,8980],[9,8980,10580],[10,10580,11660],[11,11660,12500],[12,12500,12930],[13,12930,15630],[14,15630,18110],[15,18110,19150],[16,19150,20020],[17,20020,21220],[18,21220,22250],[19,22250,23310],[20,23310,23590],[21,23590,27325]]}},{"name":"29:46","price":"اور اہل کتاب کے ساتھ بحﺚ ومباحثہ نہ کرو مگر اس طریقہ پر جو عمده ہو(1) مگر ان کے ساتھ جو ان میں ﻇالم ہیں(2) اور صاف اعلان کر دو کہ ہمارا تو اس کتاب پر بھی ایمان ہے اور جو ہم پر اتاری گئی ہے اور اس پر بھی جو تم پر اتاری گئی(3)، ہمارا تمہارا معبود ایک ہی ہے۔ ہم سب اسی کے حکم برادر ہیں.","arabic":"۞ وَلَا تُجَٰدِلُوٓاْ أَهۡلَ ٱلۡكِتَٰبِ إِلَّا بِٱلَّتِي هِيَ أَحۡسَنُ إِلَّا ٱلَّذِينَ ظَلَمُواْ مِنۡهُمۡۖ وَقُولُوٓاْ ءَامَنَّا بِٱلَّذِيٓ أُنزِلَ إِلَيۡنَا وَأُنزِلَ إِلَيۡكُمۡ وَإِلَٰهُنَا وَإِلَٰهُكُمۡ وَٰحِدٞ وَنَحۡنُ لَهُۥ مُسۡلِمُونَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3386,"juzNumber":21,"footnotes":"(1) اس لئے کہ وہ اہل علم وفہم ہیں، بات کو سمجھنے کی صلاحیت واستعداد رکھتے ہیں۔ بنا بریں ان سے بحث وگفتگو میں تلخی اور تندی مناسب نہیں۔\n(2) یعنی جو بحث ومجادلہ میں افراط سےکام لیں تو تمہیں بھی سخت لب ولہجہ اختیار کرنے کی اجازت ہے۔ بعض نے پہلے گروہ سے مراد وہ اہل کتاب لئے ہیں جو مسلمان ہوگئے تھے اور دوسرے گروہ سے وہ اشخاص جو مسلمان نہیں ہوئے بلکہ یہودیت ونصرانیت پر قائم رہے اور بعض نے ظَلَمُوا مِنْهُمْ کا مصداق ان اہل کتاب کو لیا ہے جو مسلمانوں کےخلاف جارحانہ عزائم رکھتے تھے اور جدال وقتال کے بھی مرتکب ہوتے تھے۔ ان سے تم بھی قتال کرو تا آنکہ مسلمان ہو جائیں، یا جزیہ دیں۔\n(3) یعنی تورات وانجیل پر۔ یعنی یہ بھی اللہ کی طرف سےنازل کردہ ہیں اور یہ کہ یہ شریعت اسلامیہ کے قیام اور بعثت محمدیہ تک شریعت الہیہٰ ہیں۔","lang":"ur","meta":{"transliteration":"walā tujādilū ahla al-kitābi illā bi-allatī hiya aḥsanu illā alladhīna ẓalamū min'hum waqūlū āmannā bi-alladhī unzila ilaynā wa-unzila ilaykum wa-ilāhunā wa-ilāhukum wāḥidun wanaḥnu lahu mus'limūna ","translations":["And (do) not","argue","(with the) People of the Book","(with the) People of the Book","except","by which","[it]","(is) best","except","those who","(do) wrong","among them","and say","We believe","in that (which)","has been revealed","to us","and was revealed","to you","And our God","and your God","(is) One","and we","to Him","submit","(46)"],"transliterationArr":["walā","tujādilū","ahla","al-kitābi","illā","bi-allatī","hiya","aḥsanu","illā","alladhīna","ẓalamū","min'hum","waqūlū","āmannā","bi-alladhī","unzila","ilaynā","wa-unzila","ilaykum","wa-ilāhunā","wa-ilāhukum","wāḥidun","wanaḥnu","lahu","mus'limūna",null],"verseTiming":[[1,0,710],[2,710,3160],[3,3160,3740],[4,3740,4860],[5,4860,5570],[6,5570,6610],[7,6610,7010],[8,7010,7810],[9,7810,8350],[10,8350,9410],[11,9410,10270],[12,10270,11590],[13,11590,13610],[14,13610,15540],[15,15540,17870],[16,17870,19280],[17,19280,20280],[18,20280,21750],[19,21750,22780],[20,22780,24210],[21,24210,25620],[22,25620,26410],[23,26410,28120],[24,28120,28730],[25,28730,31435]]}},{"name":"29:47","price":"اور ہم نے اسی طرح آپ کی طرف اپنی کتاب نازل فرمائی ہے، پس جنہیں ہم نے کتاب دی ہے وه اس پر ایمان ﻻتے ہیں(1) اور ان (مشرکین) میں سے بعض اس پر ایمان رکھتے ہیں(2) اور ہماری آیتوں کا انکار صرف کافر ہی کرتے ہیں.","arabic":"وَكَذَٰلِكَ أَنزَلۡنَآ إِلَيۡكَ ٱلۡكِتَٰبَۚ فَٱلَّذِينَ ءَاتَيۡنَٰهُمُ ٱلۡكِتَٰبَ يُؤۡمِنُونَ بِهِۦۖ وَمِنۡ هَٰٓؤُلَآءِ مَن يُؤۡمِنُ بِهِۦۚ وَمَا يَجۡحَدُ بِـَٔايَٰتِنَآ إِلَّا ٱلۡكَٰفِرُونَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3387,"juzNumber":21,"footnotes":"(1) اس سے مراد عبداللہ بن سلام (رضي الله عنه) وغیرہ ہیں۔ ایتائے کتاب سے مراد اس پر عمل ہے۔ گویا اس پر جو عمل نہیں کرتے، انہیں یہ کتاب دی ہی نہیں گئی۔\n(2) ان سے مراد اہل مکہ ہیں جن میں سے کچھ لوگ ایمان لے آئے تھے۔","lang":"ur","meta":{"transliteration":"wakadhālika anzalnā ilayka al-kitāba fa-alladhīna ātaynāhumu al-kitāba yu'minūna bihi wamin hāulāi man yu'minu bihi wamā yajḥadu biāyātinā illā al-kāfirūna ","translations":["And thus","We (have) revealed","to you","the Book","So those","We gave [them]","the Book","believe","therein","And among","these","(are some) who","believe","therein","And none","reject","Our Verses","except","the disbelievers","(47)"],"transliterationArr":["wakadhālika","anzalnā","ilayka","al-kitāba","fa-alladhīna","ātaynāhumu","al-kitāba","yu'minūna","bihi","wamin","hāulāi","man","yu'minu","bihi","wamā","yajḥadu","biāyātinā","illā","al-kāfirūna",null],"verseTiming":[[1,0,1400],[2,1400,4490],[3,4490,5300],[4,5300,8250],[5,8250,9380],[6,9380,11090],[7,11090,12150],[8,12150,13420],[9,13420,14230],[10,14230,14890],[11,14890,18700],[12,18700,18810],[13,18810,20530],[14,20530,20860],[15,20860,21910],[16,21910,22780],[17,22780,25730],[18,25730,26310],[19,26310,29415]]}},{"name":"29:48","price":"اس سے پہلے تو آپ کوئی کتاب پڑھتے نہ تھے(1) اور نہ کسی کتاب کو اپنے ہاتھ سے لکھتے(2) تھے کہ یہ باطل پرست لوگ شک وشبہ میں پڑتے.(3)","arabic":"وَمَا كُنتَ تَتۡلُواْ مِن قَبۡلِهِۦ مِن كِتَٰبٖ وَلَا تَخُطُّهُۥ بِيَمِينِكَۖ إِذٗا لَّٱرۡتَابَ ٱلۡمُبۡطِلُونَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3388,"juzNumber":21,"footnotes":"(1) اس لئے کہ ان پڑھ تھے۔\n(2) اس لئے کہ لکھنے کے لئے بھی علم ضروری ہے، جو آپ نےکسی سے حاصل ہی نہیں کیا تھا۔\n(3) یعنی اگر آپ (صلى الله عليه وسلم) پڑھے لکھے ہوتے یا کسی استاد سےکچھ سیکھا ہوتا تو لوگ کہتے کہ یہ قرآن مجید فلاں کی مدد سے یا اس سے تعلیم حاصل کرنے کا نتیجہ ہے۔","lang":"ur","meta":{"transliteration":"wamā kunta tatlū min qablihi min kitābin walā takhuṭṭuhu biyamīnika idhan la-ir'tāba al-mub'ṭilūna ","translations":["And not","(did) you","recite","before it","before it","any","Book","and not","(did) you write it","with your right hand","in that case","surely (would) have doubted","the falsifiers","(48)"],"transliterationArr":["wamā","kunta","tatlū","min","qablihi","min","kitābin","walā","takhuṭṭuhu","biyamīnika","idhan","la-ir'tāba","al-mub'ṭilūna",null],"verseTiming":[[1,0,770],[2,770,2270],[3,2270,3050],[4,3050,4070],[5,4070,5050],[6,5050,5930],[7,5930,7670],[8,7670,8240],[9,8240,9520],[10,9520,11190],[11,11190,11680],[12,11680,12760],[13,12760,16475]]}},{"name":"29:49","price":"بلکہ یہ (قرآن) تو روشن آیتیں ہیں جو اہل علم کے سینوں میں محفوظ ہیں(1) ، ہماری آیتوں کا منکر بجز ﻇالموں کے اور کوئی نہیں.","arabic":"بَلۡ هُوَ ءَايَٰتُۢ بَيِّنَٰتٞ فِي صُدُورِ ٱلَّذِينَ أُوتُواْ ٱلۡعِلۡمَۚ وَمَا يَجۡحَدُ بِـَٔايَٰتِنَآ إِلَّا ٱلظَّٰلِمُونَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3389,"juzNumber":21,"footnotes":"(1) یعنی قرآن مجید کے حافظوں کے سینوں میں۔ یہ قرآن مجید کا اعجاز ہےکہ قرآن مجید لفظ بہ لفظ سینے میں محفوظ ہوتا ہے۔","lang":"ur","meta":{"transliteration":"bal huwa āyātun bayyinātun fī ṣudūri alladhīna ūtū al-ʿil'ma wamā yajḥadu biāyātinā illā al-ẓālimūna ","translations":["Nay","it","(is) Verses","clear","in","(the) breasts","(of) those who","are given","the knowledge","And not","reject","Our Verses","except","the wrongdoers","(49)"],"transliterationArr":["bal","huwa","āyātun","bayyinātun","fī","ṣudūri","alladhīna","ūtū","al-ʿil'ma","wamā","yajḥadu","biāyātinā","illā","al-ẓālimūna",null],"verseTiming":[[1,0,480],[2,480,810],[3,810,2870],[4,2870,5170],[5,5170,5510],[6,5510,6470],[7,6470,7520],[8,7520,8050],[9,8050,8680],[10,8680,10020],[11,10020,10900],[12,10900,13870],[13,13870,14440],[14,14440,17455]]}},{"name":"29:50","price":"انہوں نے کہا کہ اس پر کچھ نشانیاں (معجزات) اس کے رب کی طرف سے کیوں نہیں اتارے گئے۔ آپ کہہ دیجئے کہ نشانیاں تو سب اللہ تعالیٰ کے پاس ہیں(1) میں تو صرف کھلم کھلا آگاه کر دینے واﻻ ہوں.","arabic":"وَقَالُواْ لَوۡلَآ أُنزِلَ عَلَيۡهِ ءَايَٰتٞ مِّن رَّبِّهِۦۚ قُلۡ إِنَّمَا ٱلۡأٓيَٰتُ عِندَ ٱللَّهِ وَإِنَّمَآ أَنَا۠ نَذِيرٞ مُّبِينٌ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3390,"juzNumber":21,"footnotes":"(1) یعنی یہ نشانیاں اس کی حکمت ومشیت، جن بندوں پر اتارنے کی مقتضی ہوتی ہے، وہاں وہ اتارتا ہے، اس میں اللہ کے سوا کسی کا اختیار نہیں ہے۔","lang":"ur","meta":{"transliteration":"waqālū lawlā unzila ʿalayhi āyātun min rabbihi qul innamā al-āyātu ʿinda al-lahi wa-innamā anā nadhīrun mubīnun ","translations":["And they say","Why not","are sent down","to him","(the) Signs","from","his Lord","Say","Only","the Signs","(are) with","Allah","and only","I (am)","a warner","clear","(50)"],"transliterationArr":["waqālū","lawlā","unzila","ʿalayhi","āyātun","min","rabbihi","qul","innamā","al-āyātu","ʿinda","al-lahi","wa-innamā","anā","nadhīrun","mubīnun",null],"verseTiming":[[1,0,1090],[2,1090,3240],[3,3240,4740],[4,4740,5600],[5,5600,6770],[6,6770,7600],[7,7600,9230],[8,9230,9560],[9,9560,10910],[10,10910,12350],[11,12350,13480],[12,13480,14380],[13,14380,17270],[14,17270,17700],[15,17700,18540],[16,18540,22065]]}},{"name":"29:51","price":"کیا انہیں یہ کافی نہیں؟ کہ ہم نے آپ پر کتاب نازل فرما دی جو ان پر پڑھی جا رہی ہے(1) ، اس میں رحمت (بھی) ہے اور نصیحت (بھی) ہے ان لوگوں کے لئے جو ایمان والے ہیں.(2)","arabic":"أَوَلَمۡ يَكۡفِهِمۡ أَنَّآ أَنزَلۡنَا عَلَيۡكَ ٱلۡكِتَٰبَ يُتۡلَىٰ عَلَيۡهِمۡۚ إِنَّ فِي ذَٰلِكَ لَرَحۡمَةٗ وَذِكۡرَىٰ لِقَوۡمٖ يُؤۡمِنُونَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3391,"juzNumber":21,"footnotes":"(1) یعنی وہ نشانیاں طلب کرتے ہیں۔ کیا ان کے لئےبطور نشانی یہ قرآن کافی نہیں ہے جو ہم نے آپ پر نازل کی ہے اور جس کی بابت انہیں چیلنج دیا گیا ہے کہ اس جیسا قرآن لا کر دکھائیں یا کوئی ایک سورت ہی بنا کر پیش کر دیں۔ جب قرآن کی اس معجز ہ نمائی کےباوجود یہ قرآن پر ایمان نہیں لا رہے ہیں تو حضرت موسیٰ وعیسیٰ علیہما السلام کی طرح انہیں معجزے دکھا بھی دیئے جائیں تو ان پر یہ کون سا ایمان لے آئیں گے؟\n(2) یعنی ان لوگوں کے لئےجو اس بات کی تصدیق کرتے ہیں کہ یہ قرآن اللہ کی طرف سے آیا ہے، کیونکہ وہی اس سے متمتع اور فیض یاب ہوتے ہیں۔","lang":"ur","meta":{"transliteration":"awalam yakfihim annā anzalnā ʿalayka al-kitāba yut'lā ʿalayhim inna fī dhālika laraḥmatan wadhik'rā liqawmin yu'minūna ","translations":["And is (it) not","sufficient for them","that We","revealed","to you","the Book","(which) is recited","to them","Indeed","in","that","surely is a mercy","and a reminder","for a people","who believe","(51)"],"transliterationArr":["awalam","yakfihim","annā","anzalnā","ʿalayka","al-kitāba","yut'lā","ʿalayhim","inna","fī","dhālika","laraḥmatan","wadhik'rā","liqawmin","yu'minūna",null],"verseTiming":[[1,0,840],[2,840,1910],[3,1910,3360],[4,3360,5190],[5,5190,7200],[6,7200,8030],[7,8030,9150],[8,9150,9940],[9,9940,10970],[10,10970,12540],[11,12540,13060],[12,13060,13920],[13,13920,16070],[14,16070,17000],[15,17000,18830],[16,18830,21605]]}},{"name":"29:52","price":"کہہ دیجئے کہ مجھ میں اور تم میں اللہ تعالیٰ گواه ہونا کافی ہے(1) وه آسمان وزمین کی ہر چیز کا عالم ہے، جو لوگ باطل کے ماننے والے اور اللہ تعالیٰ سے کفر کرنے والے(2) ہیں وه زبردست نقصان اور گھاٹے میں ہیں.(3)","arabic":"قُلۡ كَفَىٰ بِٱللَّهِ بَيۡنِي وَبَيۡنَكُمۡ شَهِيدٗاۖ يَعۡلَمُ مَا فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۗ وَٱلَّذِينَ ءَامَنُواْ بِٱلۡبَٰطِلِ وَكَفَرُواْ بِٱللَّهِ أُوْلَٰٓئِكَ هُمُ ٱلۡخَٰسِرُونَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3392,"juzNumber":21,"footnotes":"(1) اس بات پر کہ میں اللہ کا نبی ہوں اور جو کتاب مجھ پر نازل ہوئی ہے، یقیناً منجانب اللہ ہے۔\n(2) یعنی غیر اللہ کو عبادت کا مستحق ٹھہراتے ہیں اور جو فی الواقع مستحق عبادت ہے، یعنی اللہ تعالیٰ ، اس کا انکار کرتے ہیں۔\n(3) کیونکہ یہی لوگ فساد عقلی اور سوء فہم میں مبتلا ہیں، اسی لئے انہوں نے جو سودا کیا ہےکہ ایمان کے بدلے کفر اور ہدایت کے بدلے گمراہی خریدی ہے، اس میں بھی یہ نقصان اٹھانے والے ہیں۔","lang":"ur","meta":{"transliteration":"qul kafā bil-lahi baynī wabaynakum shahīdan yaʿlamu mā fī al-samāwāti wal-arḍi wa-alladhīna āmanū bil-bāṭili wakafarū bil-lahi ulāika humu al-khāsirūna ","translations":["Say","Sufficient is","Allah","between me","and between you","(as) a Witness","He knows","what","(is) in","the heavens","and the earth","And those who","believe","in [the] falsehood","and disbelieve","in Allah","those","they","(are) the losers","(52)"],"transliterationArr":["qul","kafā","bil-lahi","baynī","wabaynakum","shahīdan","yaʿlamu","mā","fī","al-samāwāti","wal-arḍi","wa-alladhīna","āmanū","bil-bāṭili","wakafarū","bil-lahi","ulāika","humu","al-khāsirūna",null],"verseTiming":[[1,0,410],[2,410,1100],[3,1100,2200],[4,2200,3010],[5,3010,4280],[6,4280,5520],[7,5520,6760],[8,6760,7080],[9,7080,7370],[10,7370,8950],[11,8950,10370],[12,10370,11470],[13,11470,12610],[14,12610,13880],[15,13880,14890],[16,14890,16020],[17,16020,18520],[18,18520,18900],[19,18900,22015]]}},{"name":"29:53","price":"یہ لوگ آپ سے عذاب کی جلدی کر رہے ہیں(1) ۔ اگر میری طرف سے مقرر کیا ہوا وقت نہ ہوتا تو ابھی تک ان کے پاس عذاب آچکا ہوتا(2)، یہ یقینی بات ہے کہ اچانک ان کی بے خبری میں ان کے پاس عذاب آپہنچے گا.(3)","arabic":"وَيَسۡتَعۡجِلُونَكَ بِٱلۡعَذَابِ وَلَوۡلَآ أَجَلٞ مُّسَمّٗى لَّجَآءَهُمُ ٱلۡعَذَابُۚ وَلَيَأۡتِيَنَّهُم بَغۡتَةٗ وَهُمۡ لَا يَشۡعُرُونَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3393,"juzNumber":21,"footnotes":"(1) یعنی پیغمبر کی بات ماننے کے بجائے، کہتے ہیں کہ اگر تو سچا ہے تو ہم پر عذاب نازل کروا دے۔\n(2) یعنی ان کے اعمال واقوال تو یقیناً اس لائق ہیں کہ انہیں فوراً صفحۂ ہستی سے ہی مٹا دیا جائے۔ لیکن ہماری سنت ہے کہ ہر قوم کو ایک وقت خاص تک مہلت دیتے ہیں، جب وہ مہلت عمل ختم ہو جاتی ہے تو ہمارا عذاب آجاتا ہے۔\n(3) یعنی جب عذاب کا وقت مقرر آجائے گا تو اس طرح اچانک آئے گا کہ انہیں پتہ بھی نہیں چلےگا، یہ وقت مقرر وہ ہےجو اس نے اہل مکہ کے لئے لکھ رکھا تھا، یعنی جنگ بدر میں اسارت وقتل، یا پھر قیامت کا وقوع ہے جس کے بعد کافروں کے لئے عذاب ہی عذاب ہے۔","lang":"ur","meta":{"transliteration":"wayastaʿjilūnaka bil-ʿadhābi walawlā ajalun musamman lajāahumu al-ʿadhābu walayatiyannahum baghtatan wahum lā yashʿurūna ","translations":["And they ask you to hasten","[with] the punishment","And if not","(for) a term","appointed","surely (would) have come to them","the punishment","But it will surely come to them","suddenly","while they","(do) not","perceive","(53)"],"transliterationArr":["wayastaʿjilūnaka","bil-ʿadhābi","walawlā","ajalun","musamman","lajāahumu","al-ʿadhābu","walayatiyannahum","baghtatan","wahum","lā","yashʿurūna",null],"verseTiming":[[1,0,2210],[2,2210,4960],[3,4960,7520],[4,7520,8370],[5,8370,10730],[6,10730,13430],[7,13430,14480],[8,14480,17840],[9,17840,18830],[10,18830,19860],[11,19860,20400],[12,20400,22955]]}},{"name":"29:54","price":"یہ عذاب کی جلدی مچا رہے ہیں اور (تسلی رکھیں) جہنم کافروں کو گھیر لینے والی ہے.(1)","arabic":"يَسۡتَعۡجِلُونَكَ بِٱلۡعَذَابِ وَإِنَّ جَهَنَّمَ لَمُحِيطَةُۢ بِٱلۡكَٰفِرِينَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3394,"juzNumber":21,"footnotes":"(1) پہلا يَسْتَعْجِلُونَكَ بطور خبر کے تھا اور یہ دوسرا بطور تعجب کے ہے یعنی یہ امر تعجب انگیز ہے کہ عذاب کی جگہ (جہنم) ان کو اپنےگھیرے میں لئے ہوئے ہے۔ پھر بھی عذاب کے لئے جلدی مچا رہے ہیں؟ حالاں کہ ہرآنے والی چیز قریب ہی ہوتی ہے، اسے دور کیوں سمجھتے ہیں؟ یا پھر یہ تکرار بطور تاکید کے ہے۔","lang":"ur","meta":{"transliteration":"yastaʿjilūnaka bil-ʿadhābi wa-inna jahannama lamuḥīṭatun bil-kāfirīna ","translations":["They ask you to hasten","the punishment","And indeed","Hell","will surely, encompass","the disbelievers","(54)"],"transliterationArr":["yastaʿjilūnaka","bil-ʿadhābi","wa-inna","jahannama","lamuḥīṭatun","bil-kāfirīna",null],"verseTiming":[[1,0,1960],[2,1960,3160],[3,3160,4460],[4,4460,6090],[5,6090,8340],[6,8340,11655]]}},{"name":"29:55","price":"اس دن ان کے اوپر تلے سے عذاب ڈھانﭗ رہا ہوگا اور اللہ تعالیٰ(1) فرمائے گا کہ اب اپنے (بد) اعمال کا مزه چکھو.","arabic":"يَوۡمَ يَغۡشَىٰهُمُ ٱلۡعَذَابُ مِن فَوۡقِهِمۡ وَمِن تَحۡتِ أَرۡجُلِهِمۡ وَيَقُولُ ذُوقُواْ مَا كُنتُمۡ تَعۡمَلُونَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3395,"juzNumber":21,"footnotes":"(1) يَقُولُ، کا فاعل اللہ ہے یا فرشتے، یعنی جب چاروں طرف سے ان پر عذاب ہو رہا ہوگا تو کہا جائے گا۔","lang":"ur","meta":{"transliteration":"yawma yaghshāhumu al-ʿadhābu min fawqihim wamin taḥti arjulihim wayaqūlu dhūqū mā kuntum taʿmalūna ","translations":["On (the) Day","will cover them","the punishment","from","above them","and from","below","their feet","and He will say","Taste","what","you used","(to) do","(55)"],"transliterationArr":["yawma","yaghshāhumu","al-ʿadhābu","min","fawqihim","wamin","taḥti","arjulihim","wayaqūlu","dhūqū","mā","kuntum","taʿmalūna",null],"verseTiming":[[1,0,550],[2,550,1720],[3,1720,3050],[4,3050,3490],[5,3490,4950],[6,4950,6399],[7,6399,7119],[8,7119,8329],[9,8329,9429],[10,9429,10299],[11,10299,10659],[12,10659,12209],[13,12209,14874]]}},{"name":"29:56","price":"اے میرے ایمان والے بندو! میری زمین بہت کشاده ہے سو تم میری ہی عبادت کرو.(1)","arabic":"يَٰعِبَادِيَ ٱلَّذِينَ ءَامَنُوٓاْ إِنَّ أَرۡضِي وَٰسِعَةٞ فَإِيَّٰيَ فَٱعۡبُدُونِ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3396,"juzNumber":21,"footnotes":"(1) اس میں ایسی جگہ سے، جہاں اللہ کی عبادت کرنی مشکل ہو اور دین پر قائم رہنا دوبھر ہو رہا ہو، ہجرت کرنے کا حکم ہے، جس طرح مسلمانوں نے پہلے مکہ سے حبشہ کی طرف اور پھر بعد میں مدینہ کی طرف ہجرت کی۔","lang":"ur","meta":{"transliteration":"yāʿibādiya alladhīna āmanū inna arḍī wāsiʿatun fa-iyyāya fa-uʿ'budūni ","translations":["O My servants","who","believe","Indeed","My earth","(is) spacious","so only","worship Me","(56)"],"transliterationArr":["yāʿibādiya","alladhīna","āmanū","inna","arḍī","wāsiʿatun","fa-iyyāya","fa-uʿ'budūni",null],"verseTiming":[[1,0,1650],[2,1650,2650],[3,2650,4560],[4,4560,6180],[5,6180,6990],[6,6990,8810],[7,8810,10150],[8,10150,13275]]}},{"name":"29:57","price":"ہر جاندار موت کا مزه چکھنے واﻻ ہےاور تم سب ہماری ہی طرف لوٹائے جاؤ گے.(1)","arabic":"كُلُّ نَفۡسٖ ذَآئِقَةُ ٱلۡمَوۡتِۖ ثُمَّ إِلَيۡنَا تُرۡجَعُونَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3397,"juzNumber":21,"footnotes":"(1) یعنی موت کا جرعۂ تلخ تو لامحالہ ہر ایک کو پینا ہے، ہجرت کرو گے تب بھی اور نہ کرو گے تب بھی، اس لئےتمہارے لئےوطن کا، رشتے داروں کا، اور دوست احباب کا چھوڑنا مشکل نہیں ہونا چاہئے۔ موت تو تم جہاں بھی ہوں گے آجائے گی۔ البتہ اللہ کی عبادت کرتے ہوئے مرو گے تو تم اخروی نعمتوں سے شاد کام ہو گے، اس لئے کہ مر کر تو اللہ ہی کے پاس جانا ہے۔","lang":"ur","meta":{"transliteration":"kullu nafsin dhāiqatu al-mawti thumma ilaynā tur'jaʿūna ","translations":["Every","soul","(will) taste","the death","Then","to Us","you will be returned","(57)"],"transliterationArr":["kullu","nafsin","dhāiqatu","al-mawti","thumma","ilaynā","tur'jaʿūna",null],"verseTiming":[[1,0,600],[2,600,1510],[3,1510,5130],[4,5130,7480],[5,7480,9030],[6,9030,10190],[7,10190,13335]]}},{"name":"29:58","price":"اور جولوگ ایمان ﻻئے اور نیک کام کیے انہیں ہم یقیناً جنت کے ان باﻻ خانوں میں جگہ دینگے جن کے نیچے چشمے بہہ رہے ہیں(1) جہاں وه ہمیشہ رہیں گے(2)، کام کرنے والوں کا کیا ہی اچھا اجر ہے.","arabic":"وَٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ لَنُبَوِّئَنَّهُم مِّنَ ٱلۡجَنَّةِ غُرَفٗا تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَاۚ نِعۡمَ أَجۡرُ ٱلۡعَٰمِلِينَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3398,"juzNumber":21,"footnotes":"(1) یعنی اہل جنت کے مکانات بلند ہوں گے، جن کے نیچے نہریں بہہ رہی ہوں گی۔ یہ نہریں پانی، شراب، شہد اور دودھ کی ہوں گی، علاوہ ازیں انہیں جس طرف پھیرنا چاہیں گے، ان کا رخ اسی طرف ہو جائے گا۔\n(2) ان کے زوال کا خطرہ ہوگا، نہ انہیں موت کا اندیشہ نہ کسی اور جگہ پھر جانے کا خوف۔","lang":"ur","meta":{"transliteration":"wa-alladhīna āmanū waʿamilū al-ṣāliḥāti lanubawwi-annahum mina al-janati ghurafan tajrī min taḥtihā al-anhāru khālidīna fīhā niʿ'ma ajru al-ʿāmilīna ","translations":["And those who","believe","and do","[the] righteous deeds","surely We will give them a place","in","Paradise","lofty dwellings","flow","from","underneath it","the rivers","will abide forever","in it","Excellent is","(the) reward","(of) the workers","(58)"],"transliterationArr":["wa-alladhīna","āmanū","waʿamilū","al-ṣāliḥāti","lanubawwi-annahum","mina","al-janati","ghurafan","tajrī","min","taḥtihā","al-anhāru","khālidīna","fīhā","niʿ'ma","ajru","al-ʿāmilīna",null],"verseTiming":[[1,0,1200],[2,1200,2400],[3,2400,3130],[4,3130,4630],[5,4630,7210],[6,7210,7960],[7,7960,9680],[8,9680,10700],[9,10700,13950],[10,13950,14660],[11,14660,16350],[12,16350,17850],[13,17850,18780],[14,18780,19180],[15,19180,20570],[16,20570,21850],[17,21850,23060],[18,23060,24050],[19,24050,25190],[20,25190,25730],[21,25730,28605]]}},{"name":"29:59","price":"وه جنہوں نے صبر کیا(1) ، اور اپنے رب تعالیٰ پر بھروسہ رکھتے ہیں.(2)","arabic":"ٱلَّذِينَ صَبَرُواْ وَعَلَىٰ رَبِّهِمۡ يَتَوَكَّلُونَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3399,"juzNumber":21,"footnotes":"(1) یعنی دین پر مضبوطی سے قائم رہے، ہجرت کی تکلیفیں برداشت کیں، اہل وعیال اور عزیز واقربا سےدوری کو محض اللہ کی رضا کے لئے گوارا کیا۔\n(2) دین اور دنیا کے ہر معاملے اور حالات میں۔","lang":"ur","meta":{"transliteration":"alladhīna ṣabarū waʿalā rabbihim yatawakkalūna ","translations":["Those who","(are) patient","and upon","their Lord","put their trust","(59)"],"transliterationArr":["alladhīna","ṣabarū","waʿalā","rabbihim","yatawakkalūna",null],"verseTiming":[[1,0,1220],[2,1220,2160],[3,2160,2910],[4,2910,3930],[5,3930,7325]]}},{"name":"29:60","price":"اور بہت سے(1) جانور ہیں جو اپنی روزی اٹھائے نہیں پھرتے(2)، ان سب کو اور تمہیں بھی اللہ تعالیٰ ہی روزی دیتا ہے(3)، وه بڑا ہی سننے جاننے واﻻ ہے.(4)","arabic":"وَكَأَيِّن مِّن دَآبَّةٖ لَّا تَحۡمِلُ رِزۡقَهَا ٱللَّهُ يَرۡزُقُهَا وَإِيَّاكُمۡۚ وَهُوَ ٱلسَّمِيعُ ٱلۡعَلِيمُ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3400,"juzNumber":21,"footnotes":"(1) كَأَيِّنْ میں کاف تشبیہ کا ہے اور معنی ہیں کتنے ہی یا بہت سے۔\n(2) کیونکہ اٹھا کر لے جانے کی ان میں ہمت ہی نہیں ہوتی، اسی طرح وہ ذخیرہ بھی نہیں کر سکتے۔ مطلب یہ ہے کہ رزق کسی خاص جگہ کے ساتھ مختص نہیں ہے بلکہ اللہ کا رزق اپنی مخلوق کے لئے عام ہے وہ جو بھی ہو اور جہاں بھی ہو بلکہ اللہ تعالیٰ نےہجرت کو جانے والے صحابہ (رضي الله عنهم) کو پہلے سے کہیں زیادہ وسیع اور پاکیزہ رزق عطا فرمایا، نیز تھوڑے ہی عرصے کے بعد انہیں عرب کے متعدد علاقوں کا حکمران بنا دیا۔ رَضِيَ اللهُ عَنْهُمْ أَجْمَعِينَ.\n(3) یعنی کمزور ہے یا طاقت ور، اسباب ووسائل سے بہرہ ور ہے یا بے بہرہ، اپنے وطن میں ہے یا مہاجر اور بے وطن، سب کا روزی رساں وہی اللہ ہے جو چیونٹی کو زمین کے کونوں کھدروں میں، پرندوں کو ہواؤں میں اور مچھلیوں اور دیگر آبی جانوروں کو سمندر کی گہرائیوں میں روزی پہنچاتا ہے۔ اس موقع پر مطلب یہ ہے کہ فقر وفاقہ کا ڈر ہجرت میں رکاوٹ نہ بنے، اس لئے کہ اللہ تعالیٰ تمہاری اور تمام مخلوقات کی روزی کا ذمے دار ہے۔\n(4) وہ جاننے والا ہے تمہارے اعمال وافعال کو اور تمہارے ظاہر وباطن کو، اس لئے صرف اسی سے ڈرو، اس کے سوا کسی سے مت ڈرو! اسی کی اطاعت میں سعادت وکمال ہے اور اس کی معصیت میں شقاوت ونقصان۔","lang":"ur","meta":{"transliteration":"waka-ayyin min dābbatin lā taḥmilu riz'qahā al-lahu yarzuquhā wa-iyyākum wahuwa al-samīʿu al-ʿalīmu ","translations":["And how many","of","a creature","(does) not","carry","its provision","Allah","provides (for) it","and (for) you","And He","(is) the All-Hearer","the All-Knower","(60)"],"transliterationArr":["waka-ayyin","min","dābbatin","lā","taḥmilu","riz'qahā","al-lahu","yarzuquhā","wa-iyyākum","wahuwa","al-samīʿu","al-ʿalīmu",null],"verseTiming":[[1,0,1110],[2,1110,3200],[3,3200,7010],[4,7010,7500],[5,7500,8410],[6,8410,9160],[7,9160,10040],[8,10040,11390],[9,11390,13300],[10,13300,13850],[11,13850,15030],[12,15030,17415]]}},{"name":"29:61","price":"اور اگر آپ ان سے دریافت کریں کہ زمین وآسمان کا خالق اور سورج چاند کو کام میں لگانے واﻻ کون ہے؟ تو ان کا جواب یہی ہوگا کہ اللہ تعالیٰ(1) ، پھر کدھر الٹے جا رہے ہیں.(2)","arabic":"وَلَئِن سَأَلۡتَهُم مَّنۡ خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ وَسَخَّرَ ٱلشَّمۡسَ وَٱلۡقَمَرَ لَيَقُولُنَّ ٱللَّهُۖ فَأَنَّىٰ يُؤۡفَكُونَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3401,"juzNumber":21,"footnotes":"(1) یعنی یہ مشرکین، جو مسلمانوں کو محض توحید کی وجہ سے ایذائیں پہنچا رہے ہیں، ان سے اگر پوچھا جائے کہ آسمان وزمین کو عدم سےوجود میں لانے والا اور سورج اور چاند کو اپنے اپنے مدار پر چلانے والا کون ہے؟ تو وہاں یہ اعتراف کیے بغیر انہیں چارہ نہیں ہوتا کہ یہ سب کچھ کرنے والا اللہ ہے۔\n(2) یعنی دلائل واعتراف کے باوجود حق سے یہ اعراض اور گریز باعث تعجب ہے۔","lang":"ur","meta":{"transliteration":"wala-in sa-altahum man khalaqa al-samāwāti wal-arḍa wasakhara al-shamsa wal-qamara layaqūlunna al-lahu fa-annā yu'fakūna ","translations":["And if","you ask them","Who","created","the heavens","and the earth","and subjected","the sun","and the moon","Surely they would say","Allah","Then how","are they deluded","(61)"],"transliterationArr":["wala-in","sa-altahum","man","khalaqa","al-samāwāti","wal-arḍa","wasakhara","al-shamsa","wal-qamara","layaqūlunna","al-lahu","fa-annā","yu'fakūna",null],"verseTiming":[[1,0,1430],[2,1430,2810],[3,2810,3680],[4,3680,4260],[5,4260,5840],[6,5840,6930],[7,6930,7850],[8,7850,8760],[9,8760,9740],[10,9740,11720],[11,11720,14500],[12,14500,16080],[13,16080,19145]]}},{"name":"29:62","price":"اللہ تعالیٰ اپنے بندوں میں سے جسے چاہے فراخ روزی دیتا ہے اور جسے چاہے تنگ(1) ۔ یقیناً اللہ تعالیٰ ہر چیز کا جاننے واﻻ ہے.(2)","arabic":"ٱللَّهُ يَبۡسُطُ ٱلرِّزۡقَ لِمَن يَشَآءُ مِنۡ عِبَادِهِۦ وَيَقۡدِرُ لَهُۥٓۚ إِنَّ ٱللَّهَ بِكُلِّ شَيۡءٍ عَلِيمٞ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3402,"juzNumber":21,"footnotes":"(1) یہ مشرکین کے اعتراض کا جواب ہے جو وہ مسلمانوں پر کرتے تھے کہ اگر تم حق پر ہوتو پھر غریب اور کمزور کیوں ہو؟ اللہ نے فرمایا کہ رزق کی کشادگی اور کمی اللہ کے اختیار میں ہے وہ اپنی حکمت ومشیت کے مطابق جس کو چاہتا ہے کم یا زیادہ دیتا ہے، اس کا تعلق اس کی رضا مندی یا غضب سے نہیں ہے۔\n(2) اس کو بھی وہی جانتا ہے کہ زیادہ رزق کس کے لئے بہتر ہے اور کس کے لئے نہیں؟","lang":"ur","meta":{"transliteration":"al-lahu yabsuṭu al-riz'qa liman yashāu min ʿibādihi wayaqdiru lahu inna al-laha bikulli shayin ʿalīmun ","translations":["Allah","extends","the provision","for whom","He wills","of","His slaves","and restricts","for him","Indeed","Allah","of every","thing","(is) All-Knower","(62)"],"transliterationArr":["al-lahu","yabsuṭu","al-riz'qa","liman","yashāu","min","ʿibādihi","wayaqdiru","lahu","inna","al-laha","bikulli","shayin","ʿalīmun",null],"verseTiming":[[1,0,1050],[2,1050,1920],[3,1920,2770],[4,2770,3170],[5,3170,6240],[6,6240,6590],[7,6590,8030],[8,8030,9040],[9,9040,9990],[10,9990,11050],[11,11050,12000],[12,12000,12790],[13,12790,13660],[14,13660,16565]]}},{"name":"29:63","price":"اور اگر آپ ان سے سوال کریں کہ آسمان سے پانی اتار کر زمین کو اس کی موت کے بعد زنده کس نے کیا؟ تو یقیناً ان کا جواب یہی ہوگا اللہ تعالیٰ نے۔ آپ کہہ دیں کہ ہر تعریف اللہ ہی کے لئے سزاوار ہے، بلکہ ان میں سے اکثر بے عقل ہیں.(1)","arabic":"وَلَئِن سَأَلۡتَهُم مَّن نَّزَّلَ مِنَ ٱلسَّمَآءِ مَآءٗ فَأَحۡيَا بِهِ ٱلۡأَرۡضَ مِنۢ بَعۡدِ مَوۡتِهَا لَيَقُولُنَّ ٱللَّهُۚ قُلِ ٱلۡحَمۡدُ لِلَّهِۚ بَلۡ أَكۡثَرُهُمۡ لَا يَعۡقِلُونَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3403,"juzNumber":21,"footnotes":"(1) کیونکہ عقل ہوتی تو اپنے رب کےساتھ پتھروں کو اور مردوں کو رب نہ بناتے۔ نہ ان کے اندر یہ تناقض ہوتا کہ اللہ تعالیٰ کی خالقیت وربوبیت کے اعتراف کے باوجود، بتوں کو حاجت روا اور لائق عبادت سمجھ رہے ہیں۔","lang":"ur","meta":{"transliteration":"wala-in sa-altahum man nazzala mina al-samāi māan fa-aḥyā bihi al-arḍa min baʿdi mawtihā layaqūlunna al-lahu quli al-ḥamdu lillahi bal aktharuhum lā yaʿqilūna ","translations":["And if","you ask them","Who","sends down","from","the sky","water","and gives life","thereby","(to) the earth","after","after","its death","Surely, they would say","Allah","Say","All Praises","(are) for Allah","But","most of them","(do) not","use reason","(63)"],"transliterationArr":["wala-in","sa-altahum","man","nazzala","mina","al-samāi","māan","fa-aḥyā","bihi","al-arḍa","min","baʿdi","mawtihā","layaqūlunna","al-lahu","quli","al-ḥamdu","lillahi","bal","aktharuhum","lā","yaʿqilūna",null],"verseTiming":[[1,0,1370],[2,1370,2860],[3,2860,3660],[4,3660,5540],[5,5540,5870],[6,5870,9140],[7,9140,11940],[8,11940,13050],[9,13050,13520],[10,13520,14310],[11,14310,15030],[12,15030,15930],[13,15930,17060],[14,17060,19280],[15,19280,22790],[16,22790,23120],[17,23120,23940],[18,23940,25990],[19,25990,26390],[20,26390,27460],[21,27460,28030],[22,28030,30685]]}},{"name":"29:64","price":"اور دنیا کی یہ زندگانی تو محض کھیل تماشا ہے(1) البتہ آخرت کے گھر کی زندگی ہی حقیقی زندگی ہے(2)، کاش! یہ جانتے ہوتے.(3)","arabic":"وَمَا هَٰذِهِ ٱلۡحَيَوٰةُ ٱلدُّنۡيَآ إِلَّا لَهۡوٞ وَلَعِبٞۚ وَإِنَّ ٱلدَّارَ ٱلۡأٓخِرَةَ لَهِيَ ٱلۡحَيَوَانُۚ لَوۡ كَانُواْ يَعۡلَمُونَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3404,"juzNumber":21,"footnotes":"(1) یعنی جس دنیا نے انہیں آخرت سے اندھا اور اس کے لئے توشہ جمع کرنے سے غافل رکھا ہے، وہ ایک کھیل کود سے زیادہ حیثیت نہیں رکھتی، کافر دنیا کے کاروبار میں مشغول رہتا ہے، اس کے لئے شب روز محنت کرتا ہے لیکن جب مرتا ہے تو خالی ہاتھ ہوتا ہے۔ جس طرح بچے سارا دن مٹی کے گھروندوں سے کھیلتے ہیں، پھر خالی ہاتھ گھروں کو لوٹ جاتے ہیں، سوائے تھکاوٹ کے انہیں کچھ حاصل نہیں ہوتا۔\n(2) اس لئے ایسےعمل صالح کرنے چاہئے جن سے آخرت کا یہ گھر سنور جائے۔\n(3) کیونکہ اگر وہ یہ بات جان لیتے تو آخرت سے بے پرواہ ہو کر دنیا میں مگن نہ ہوتے۔ اس لئے انکا علاج علم ہے، علم شریعت۔","lang":"ur","meta":{"transliteration":"wamā hādhihi al-ḥayatu al-dun'yā illā lahwun walaʿibun wa-inna al-dāra al-ākhirata lahiya al-ḥayawānu law kānū yaʿlamūna ","translations":["And not","(is) this","life","(of) the world","but","amusement","and play","And indeed","the Home","(of) the Hereafter ","surely, it","(is) the life","if only","they","know","(64)"],"transliterationArr":["wamā","hādhihi","al-ḥayatu","al-dun'yā","illā","lahwun","walaʿibun","wa-inna","al-dāra","al-ākhirata","lahiya","al-ḥayawānu","law","kānū","yaʿlamūna",null],"verseTiming":[[1,0,700],[2,700,1600],[3,1600,2610],[4,2610,5179],[5,5179,6049],[6,6049,7859],[7,7859,9109],[8,9109,10259],[9,10259,11159],[10,11159,12469],[11,12469,13049],[12,13049,15799],[13,15799,16209],[14,16209,17079],[15,17079,20094]]}},{"name":"29:65","price":"پس یہ لوگ جب کشتیوں میں سوار ہوتے ہیں تو اللہ تعالیٰ ہی کو پکارتے ہیں اس کے لئے عبادت کو خالص کر کے پھر جب وه انہیں خشکی کی طرف بچا ﻻتا ہے تو اسی وقت شرک کرنے لگتے ہیں.(1)","arabic":"فَإِذَا رَكِبُواْ فِي ٱلۡفُلۡكِ دَعَوُاْ ٱللَّهَ مُخۡلِصِينَ لَهُ ٱلدِّينَ فَلَمَّا نَجَّىٰهُمۡ إِلَى ٱلۡبَرِّ إِذَا هُمۡ يُشۡرِكُونَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3405,"juzNumber":21,"footnotes":"(1) مشرکین کے اس تناقض کو بھی قرآن کریم میں متعدد جگہ بیان فرمایا گیا ہے۔ اس تناقض کو حضرت عکرمہ (رضي الله عنه) سمجھ گئے تھے جس کی وجہ سے انہیں قبول اسلام کی توفیق حاصل ہوگئی۔ ان کے متعلق آیا ہے کہ فتح مکہ کے بعد یہ مکہ سے فرار ہوگئے تاکہ نبی (صلى الله عليه وسلم) کی گرفت سے بچ جائیں۔ یہ حبشہ جانے کے لئے ایک کشتی میں بیٹھے، کشتی گرداب میں پھنس گئی، تو کشتی میں سوار لوگوں نے ایک دوسرے سے کہا کہ پورے خلوص سے رب سے دعائیں کرو، اس لئےکہ یہاں اس کےعلاوہ کوئی نجات دینے والا نہیں ہے۔ حضرت عکرمہ (رضي الله عنه) نے یہ سن کر کہا کہ اگر یہاں سمندر میں اس کے سوا کوئی نجات نہیں دے سکتا تو خشکی میں بھی اس کے سوا کوئی نجات نہیں دے سکتا۔ اور اسی وقت اللہ سے عہد کر لیا کہ اگر میں یہاں سے بخیرت ساحل پر پہنچ گیا تو میں محمد (صلى الله عليه وسلم) کے ہاتھ پر بیعت کر لوں گا یعنی مسلمان ہو جاؤں گا، چنانچہ یہاں سے نجات پاکر انہوں نے اسلام قبول کرلیا (رضي الله عنه)۔ (ابن کثیر بحوالہ سیرت محمد بن اسحاق)","lang":"ur","meta":{"transliteration":"fa-idhā rakibū fī al-ful'ki daʿawū al-laha mukh'liṣīna lahu al-dīna falammā najjāhum ilā al-bari idhā hum yush'rikūna ","translations":["And when","they embark","[in]","the ship","they call","Allah","(being) sincere","to Him","(in) the religion","But when","He delivers them","to","the land","behold","they","associate partners (with Him)","(65)"],"transliterationArr":["fa-idhā","rakibū","fī","al-ful'ki","daʿawū","al-laha","mukh'liṣīna","lahu","al-dīna","falammā","najjāhum","ilā","al-bari","idhā","hum","yush'rikūna",null],"verseTiming":[[1,0,830],[2,830,1650],[3,1650,1900],[4,1900,2740],[5,2740,3320],[6,3320,4210],[7,4210,5470],[8,5470,5800],[9,5800,6650],[10,6650,8200],[11,8200,9400],[12,9400,9780],[13,9780,10610],[14,10610,11250],[15,11250,11720],[16,11720,14485]]}},{"name":"29:66","price":"تاکہ ہماری دی ہوئی نعمتوں سے مکرتے رہیں اور برتتے رہیں(1) ۔ ابھی ابھی پتہ چل جائے گا.","arabic":"لِيَكۡفُرُواْ بِمَآ ءَاتَيۡنَٰهُمۡ وَلِيَتَمَتَّعُواْۚ فَسَوۡفَ يَعۡلَمُونَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3406,"juzNumber":21,"footnotes":"یہ لام کئی ہے جو علت کے لئے ہے۔ یعنی نجات کے بعد ان کا شرک کرنا، اس لئے ہے کہ وہ کفران نعمت کریں اور دنیا کی لذتوں سے متمتع ہوتے رہیں۔ کیونکہ اگر وہ یہ ناشکری نہ کرتے تو اخلاص پر قائم رہتے اور صرف الہٰ واحد کو ہی ہمیشہ پکارتے۔ بعض کے نزدیک یہ لام عاقبت کے لئے ہے، یعنی گو ان کا مقصد کفر کرنا نہیں ہے لیکن دوبارہ شرک کے ارتکاب کا نتیجہ بہرحال کفر ہی ہے۔","lang":"ur","meta":{"transliteration":"liyakfurū bimā ātaynāhum waliyatamattaʿū fasawfa yaʿlamūna ","translations":["So that they may deny","[in] what","We have given them","and they may enjoy (themselves)","But soon","they will know","(66)"],"transliterationArr":["liyakfurū","bimā","ātaynāhum","waliyatamattaʿū","fasawfa","yaʿlamūna",null],"verseTiming":[[1,0,1250],[2,1250,3210],[3,3210,4930],[4,4930,6670],[5,6670,7590],[6,7590,10555]]}},{"name":"29:67","price":"کیا یہ نہیں دیکھتے کہ ہم نے حرم کو با امن بنا دیا ہے حاﻻنکہ ان کے اردگرد سے لوگ اچک لیے جاتے ہیں(1) ، کیا یہ باطل پر تو یقین رکھتے ہیں اور اللہ تعالیٰ کی نعمتوں پر ناشکری کرتے ہیں.(2)","arabic":"أَوَلَمۡ يَرَوۡاْ أَنَّا جَعَلۡنَا حَرَمًا ءَامِنٗا وَيُتَخَطَّفُ ٱلنَّاسُ مِنۡ حَوۡلِهِمۡۚ أَفَبِٱلۡبَٰطِلِ يُؤۡمِنُونَ وَبِنِعۡمَةِ ٱللَّهِ يَكۡفُرُونَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3407,"juzNumber":21,"footnotes":"(1) اللہ تعالیٰ اس احسان کا تذکرہ فرما رہاہے جو اہل مکہ پر اس نے کیا کہ ہم نے ان کے حرم کو امن والا بنایا جس میں اس کے باشندے قتل وغارت، اسیری، لوٹ مار وغیرہ سے محفوظ ہیں، جب کہ عرب کے دوسرےعلاقے اس امن وسکون سے محروم ہیں قتل وغارت گری ان کے ہاں معمول اور آئے دن کا مشغلہ ہے۔\n(2) یعنی کیا اس نعمت کا شکر یہی ہے کہ وہ اللہ کے ساتھ شریک ٹھہرائیں، اور جھوٹے معبودوں اور بتوں کی پرستش کرتے رہیں۔ اس احسان کا اقتضا تو یہ تھا کہ وہ صرف ایک اللہ کی عبادت کرتے اور اس کے پیغمبر (صلى الله عليه وسلم) کی تصدیق کرتے۔","lang":"ur","meta":{"transliteration":"awalam yaraw annā jaʿalnā ḥaraman āminan wayutakhaṭṭafu al-nāsu min ḥawlihim afabil-bāṭili yu'minūna wabiniʿ'mati al-lahi yakfurūna ","translations":["Do not","they see","that We","have made","a Sanctuary","secure","while are being taken away","the people","around them","around them","Then do in (the) falsehood","they believe","and in (the) Favor","(of) Allah","they disbelieve","(67)"],"transliterationArr":["awalam","yaraw","annā","jaʿalnā","ḥaraman","āminan","wayutakhaṭṭafu","al-nāsu","min","ḥawlihim","afabil-bāṭili","yu'minūna","wabiniʿ'mati","al-lahi","yakfurūna",null],"verseTiming":[[1,0,810],[2,810,1460],[3,1460,2870],[4,2870,3940],[5,3940,4790],[6,4790,6690],[7,6690,8000],[8,8000,9710],[9,9710,10090],[10,10090,11620],[11,11620,13260],[12,13260,14410],[13,14410,15750],[14,15750,16590],[15,16590,19415]]}},{"name":"29:68","price":"اور اس سے بڑا ﻇالم کون ہوگا؟ جو اللہ تعالیٰ پر جھوٹ باندھے(1) یا جب حق اس کے پاس آجائے وه اسے(2) جھٹلائے، کیا ایسے کافروں کا ٹھکانا جہنم میں نہ ہوگا؟","arabic":"وَمَنۡ أَظۡلَمُ مِمَّنِ ٱفۡتَرَىٰ عَلَى ٱللَّهِ كَذِبًا أَوۡ كَذَّبَ بِٱلۡحَقِّ لَمَّا جَآءَهُۥٓۚ أَلَيۡسَ فِي جَهَنَّمَ مَثۡوٗى لِّلۡكَٰفِرِينَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3408,"juzNumber":21,"footnotes":"(1) یعنی دعویٰ کرے کہ مجھ پر اللہ کی طرف سے وحی آتی ہے دراں حالیکہ ایسا نہ ہو یا کوئی یہ کہے کہ میں بھی وہ چیز اتار سکتا ہوں جو اللہ نے اتاری ہے۔ یہ افتراہے اور مدعی مفتری۔\n(2) یہ تکذیب ہے اور اس کا مرتکب مکذب۔ افترا اور تکذیب دونوں کفر ہیں جس کی سزا جہنم ہے۔","lang":"ur","meta":{"transliteration":"waman aẓlamu mimmani if'tarā ʿalā al-lahi kadhiban aw kadhaba bil-ḥaqi lammā jāahu alaysa fī jahannama mathwan lil'kāfirīna ","translations":["And who","(is) more unjust","than (he) who","invents","against","Allah","a lie","or","denies","the truth","when","it has come to him","Is there not","in","Hell","an abode","for the disbelievers","(68)"],"transliterationArr":["waman","aẓlamu","mimmani","if'tarā","ʿalā","al-lahi","kadhiban","aw","kadhaba","bil-ḥaqi","lammā","jāahu","alaysa","fī","jahannama","mathwan","lil'kāfirīna",null],"verseTiming":[[1,0,640],[2,640,1480],[3,1480,2910],[4,2910,3750],[5,3750,4210],[6,4210,5000],[7,5000,5850],[8,5850,6220],[9,6220,7040],[10,7040,8070],[11,8070,9430],[12,9430,12660],[13,12660,13430],[14,13430,13810],[15,13810,15770],[16,15770,16320],[17,16320,20195]]}},{"name":"29:69","price":"اور جو لوگ ہماری راه میں مشقتیں برداشت کرتے ہیں(1) ہم انہیں اپنی راہیں ضرور دکھا دیں گے(2)۔ یقیناً اللہ تعالیٰ نیکو کاروں کا ساتھی ہے.(3)","arabic":"وَٱلَّذِينَ جَٰهَدُواْ فِينَا لَنَهۡدِيَنَّهُمۡ سُبُلَنَاۚ وَإِنَّ ٱللَّهَ لَمَعَ ٱلۡمُحۡسِنِينَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut"],"ayahNumber":3409,"juzNumber":21,"footnotes":"(1) یعنی دین پر عمل کرنے میں جو دشواریاں، آزمائشیں اور مشکلات پیش آتی ہیں۔\n(2) اس سے مراد دنیا وآخرت کے وہ راستے ہیں جن پر چل کر انسان کو اللہ کی رضا حاصل ہوتی ہے۔\n(3) احسان کا مطلب ہے اللہ کوحاضر ناظر جان کر ہرنیکی کےکام کو اخلاص کے ساتھ کرنا، سنت نبوی (صلى الله عليه وسلم) کے مطابق کرنا، برائی کے بدلے میں برائی کے بجائے حسن سلوک کرنا، اپنا حق چھوڑ دینا اور دوسروں کو ان کے حق سے زیادہ دینا۔ یہ سب احسان کےمفہوم میں شامل ہیں۔","lang":"ur","meta":{"transliteration":"wa-alladhīna jāhadū fīnā lanahdiyannahum subulanā wa-inna al-laha lamaʿa al-muḥ'sinīna ","translations":["And those who","strive","for Us","We will surely, guide them","(to) Our ways","And indeed","Allah","surely (is) with","the good-doers","(69)"],"transliterationArr":["wa-alladhīna","jāhadū","fīnā","lanahdiyannahum","subulanā","wa-inna","al-laha","lamaʿa","al-muḥ'sinīna",null],"verseTiming":[[1,0,1220],[2,1220,2230],[3,2230,3130],[4,3130,5570],[5,5570,6780],[6,6780,8640],[7,8640,9640],[8,9640,10260],[9,10260,16105]]}}],"chapter":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut","Chapter Al-Ankabut","Ankabut","Surah Ankabut","Chapter Ankabut","Al Ankabut","Surah Al Ankabut","Chapter Al Ankabut","Surah 29","Chapter 29","The Spider","العَنكَبُوت"],"version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."}}