{"data":[{"name":"33:1","price":"اے نبی! اللہ تعالیٰ سے ڈرتے رہنا(1) اور کافروں اور منافقوں کی باتوں میں نہ آجانا، اللہ تعالیٰ بڑے علم واﻻ اور بڑی حکمت واﻻ ہے.(2)","arabic":"يَٰٓأَيُّهَا ٱلنَّبِيُّ ٱتَّقِ ٱللَّهَ وَلَا تُطِعِ ٱلۡكَٰفِرِينَ وَٱلۡمُنَٰفِقِينَۚ إِنَّ ٱللَّهَ كَانَ عَلِيمًا حَكِيمٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3534,"juzNumber":21,"footnotes":"(1) آیت میں تقویٰ پر مداومت اور تبلیغ ودعوت سے استقامت کا حکم ہے۔ طلق بن حبیب کہتے ہیں، تقویٰ کا مطلب ہے کہ تو اللہ کی اطاعت اللہ کی دی ہوئی روشنی کے مطابق کرے اور اللہ سے ثواب کی امید رکھے اور اللہ کی معصیت اللہ کی دی ہوئی روشنی کے مطابق ترک کر دے، اللہ کےعذاب سے ڈرتے ہوئے۔ (ابن کثیر)\n(2) پس وہی اس بات کا حق دار ہے کہ اس کی اطاعت کی جائے اس لئے کہ عواقب کو وہی جانتا ہے اور اپنے اقوال وافعال میں وہ حکیم ہے۔","lang":"ur","meta":{"transliteration":"yāayyuhā al-nabiyu ittaqi al-laha walā tuṭiʿi al-kāfirīna wal-munāfiqīna inna al-laha kāna ʿalīman ḥakīman ","translations":["O Prophet","O Prophet","Fear","Allah","and (do) not","obey","the disbelievers","and the hypocrites","Indeed","Allah","is","All-Knower","All-Wise","(1)"],"transliterationArr":["yāayyuhā","al-nabiyu","ittaqi","al-laha","walā","tuṭiʿi","al-kāfirīna","wal-munāfiqīna","inna","al-laha","kāna","ʿalīman","ḥakīman",null],"verseTiming":[[1,0,2510],[2,2510,4050],[3,4050,4680],[4,4680,5440],[5,5440,5930],[6,5930,6530],[7,6530,7970],[8,7970,11330],[9,11330,12390],[10,12390,13200],[11,13200,13800],[12,13800,14760],[13,14760,15915]]}},{"name":"33:2","price":"جو کچھ آپ کی جانب آپ کے رب کی طرف سے وحی کی جاتی ہے(1) اس کی تابعداری کریں (یقین مانو) کہ اللہ تمہارے ہر ایک عمل سے باخبر ہے.(2)","arabic":"وَٱتَّبِعۡ مَا يُوحَىٰٓ إِلَيۡكَ مِن رَّبِّكَۚ إِنَّ ٱللَّهَ كَانَ بِمَا تَعۡمَلُونَ خَبِيرٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3535,"juzNumber":21,"footnotes":"(1) یعنی قرآن کی اور احادیث کی بھی، اس لئے کہ احادیث کے الفاظ گو نبی (صلى الله عليه وسلم) کی زبان مبارک سے نکلے ہوئے ہیں لیکن ان کے معانی ومفاہیم من جانب اللہ ہی ہیں۔ اسی لئے ان کو وحی خفی یا وحی غیر متلو کہا جاتا ہے۔\n(2) پس اس سے تمہاری کوئی بات مخفی نہیں رہ سکتی۔","lang":"ur","meta":{"transliteration":"wa-ittabiʿ mā yūḥā ilayka min rabbika inna al-laha kāna bimā taʿmalūna khabīran ","translations":["And follow","what","is inspired","to you","from","your Lord","Indeed","Allah","is","of what","you do","All-Aware","(2)"],"transliterationArr":["wa-ittabiʿ","mā","yūḥā","ilayka","min","rabbika","inna","al-laha","kāna","bimā","taʿmalūna","khabīran",null],"verseTiming":[[1,0,900],[2,900,1380],[3,1380,3530],[4,3530,4310],[5,4310,4440],[6,4440,5820],[7,5820,6830],[8,6830,7600],[9,7600,8210],[10,8210,8810],[11,8810,10000],[12,10000,11445]]}},{"name":"33:3","price":"آپ اللہ ہی پر توکل رکھیں(1) ، وه کار سازی کے لئے کافی ہے.(2)","arabic":"وَتَوَكَّلۡ عَلَى ٱللَّهِۚ وَكَفَىٰ بِٱللَّهِ وَكِيلٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3536,"juzNumber":21,"footnotes":"- اپنے تمام معاملات اور احوال میں۔\n(2) ان لوگوں کے لئے جو اس پر بھروسہ رکھتے، اور اس کی طرف رجوع کرتے ہیں۔","lang":"ur","meta":{"transliteration":"watawakkal ʿalā al-lahi wakafā bil-lahi wakīlan ","translations":["And put your trust","in","Allah","And Allah is sufficient","And Allah is sufficient","(as) Disposer of affairs","(3)"],"transliterationArr":["watawakkal","ʿalā","al-lahi","wakafā","bil-lahi","wakīlan",null],"verseTiming":[[1,0,1170],[2,1170,1560],[3,1560,4070],[4,4070,4800],[5,4800,5830],[6,5830,7365]]}},{"name":"33:4","price":"کسی آدمی کے سینے میں اللہ تعالیٰ نے دو دل نہیں رکھے(1) ، اور اپنی جن بیویوں کو تم ماں کہہ بیٹھتے ہو انہیں اللہ نے تمہاری (سچ مچ کی) مائیں نہیں(2) بنایا، اور نہ تمہارے لے پالک لڑکوں کو (واقعی) تمہارے بیٹے بنایا ہے(3)، یہ تو تمہارے اپنے منھ کی باتیں ہیں(4)، اللہ تعالیٰ حق بات فرماتا ہے(5) اور وه (سیدھی) راه سجھاتا ہے.","arabic":"مَّا جَعَلَ ٱللَّهُ لِرَجُلٖ مِّن قَلۡبَيۡنِ فِي جَوۡفِهِۦۚ وَمَا جَعَلَ أَزۡوَٰجَكُمُ ٱلَّٰٓـِٔي تُظَٰهِرُونَ مِنۡهُنَّ أُمَّهَٰتِكُمۡۚ وَمَا جَعَلَ أَدۡعِيَآءَكُمۡ أَبۡنَآءَكُمۡۚ ذَٰلِكُمۡ قَوۡلُكُم بِأَفۡوَٰهِكُمۡۖ وَٱللَّهُ يَقُولُ ٱلۡحَقَّ وَهُوَ يَهۡدِي ٱلسَّبِيلَ","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3537,"juzNumber":21,"footnotes":"(1) بعض روایات سے معلوم ہوتا ہے کہ ایک منافق یہ دعویٰ کرتا تھا کہ اس کے دو دل ہیں۔ ایک دل مسلمانوں کے ساتھ ہے اور دوسرا دل کفر اور کافروں کے ساتھ ہے۔ (مسند احمد ا / 267) یہ آیت اس کی تردید میں نازل ہوئی۔ مطلب یہ ہے کہ ممکن ہی نہیں ہے کہ ایک دل میں اللہ کی محبت اور اس کے دشمنوں کی اطاعت جمع ہو جائے۔ بعض کہتے ہیں کہ مشرکین مکہ میں سے ایک شخص جمیل بن معمر فہری تھا، جو بڑا ہشیار، مکار اور نہایت تیز طرار تھا، اس کا دعویٰ تھا کہ میرے تو دو دل ہیں جن سے میں سوچتا سمجھتا ہوں۔ جب کہ محمد (صلى الله عليه وسلم) کا ایک ہی دل ہے۔ یہ آیت اس کے رد میں نازل ہوئی۔ (ایسر التفاسیر) بعض مفسرین کہتے ہیں کہ آگے جو دو مسئلے بیان کیے جا رہے ہیں، یہ ان کی تمہید ہے یعنی جس طرح ایک شخص کے دو دل نہیں ہو سکتے، اسی طرح اگر کوئی شخص اپنی بیوی سے ظہار کر لے یعنی یہ کہہ دے کہ تیری پشت میرے لئے ایسے ہی ہے جیسے میری ماں کی پشت۔ تو اس طرح کہنے سے اس کی بیوی، اس کی ماں نہیں بن جائے گی۔ یوں اس کی دو مائیں نہیں ہو سکتیں۔ اسی طرح کوئی شخص کسی کو اپنا بیٹا (لے پالک) بنالے تو وہ اس کا حقیقی بیٹا نہیں بن جائے گا، بلکہ وہ بیٹا تو اپنے باپ ہی کا رہے گا، اس کے دو باپ نہیں ہو سکتے۔ (ابن کثیر)۔\n(2) یہ مسئلۂ ظہار کہلاتا ہے، اس کی تفصیل سورۂ مجادلہ میں آئے گی۔\n(3) اس کی تفصیل اسی سورت میں آگے چل کر آئے گی۔ أَدْعِياءُ، دَعِيٌّ کی جمع ہے۔ منہ بولا بیٹا۔\n(4) یعنی کسی کو ماں کہہ دینے سے وہ ماں نہیں بن جائے گی، نہ بیٹا کہنے سے وہ بیٹا بن جائے گا، یعنی ان پر امومت اور بنوت کے شرعی احکام جاری نہیں ہوں گے۔\n(5) اس لئے اس کا اتباع کرو اور ظہار والی عورت کو ماں اور لے پالک کو بیٹا مت کہو، خیال رہے کہہ کسی کو پیار اور محبت میں بیٹا کہنا اور بات ہے اور لے پالک کو حقیقی بیٹا تصور کرکے بیٹا کہنا اور بات ہے۔ پہلی بات جائز ہے، یہاں مقصود دوسری بات کی ممانعت ہے۔","lang":"ur","meta":{"transliteration":"mā jaʿala al-lahu lirajulin min qalbayni fī jawfihi wamā jaʿala azwājakumu allāī tuẓāhirūna min'hunna ummahātikum wamā jaʿala adʿiyāakum abnāakum dhālikum qawlukum bi-afwāhikum wal-lahu yaqūlu al-ḥaqa wahuwa yahdī al-sabīla ","translations":["Not","Allah (has) made","Allah (has) made","for any man","[of]","two hearts","in","his interior","And not","He (has) made","your wives","whom","you declare unlawful","[of them]","(as) your mothers","And not","He has made","your adopted sons","your sons","That","(is) your saying","by your mouths","but Allah","says","the truth","and He","guides","(to) the Way","(4)"],"transliterationArr":["mā","jaʿala","al-lahu","lirajulin","min","qalbayni","fī","jawfihi","wamā","jaʿala","azwājakumu","allāī","tuẓāhirūna","min'hunna","ummahātikum","wamā","jaʿala","adʿiyāakum","abnāakum","dhālikum","qawlukum","bi-afwāhikum","wal-lahu","yaqūlu","al-ḥaqa","wahuwa","yahdī","al-sabīla",null],"verseTiming":[[1,0,400],[2,400,930],[3,930,1850],[4,1850,2690],[5,2690,4670],[6,4670,5590],[7,5590,6020],[8,6020,7180],[9,7180,7720],[10,7720,8410],[11,8410,9720],[12,9720,12090],[13,12090,13490],[14,13490,15100],[15,15100,17670],[16,17670,18250],[17,18250,18930],[18,18930,22070],[19,22070,25030],[20,25030,26000],[21,26000,27580],[22,27580,29410],[23,29410,30370],[24,30370,31190],[25,31190,32000],[26,32000,32470],[27,32470,33120],[28,33120,36025]]}},{"name":"33:5","price":"لے پالکوں کو ان کے (حقیقی) باپوں کی طرف نسبت کر کے بلاؤ اللہ کے نزدیک پورا انصاف یہی(1) ہے۔ پھر اگر تمہیں ان کے (حقیقی) باپوں کا علم ہی نہ ہو تو وه تمہارے دینی بھائی اور دوست ہیں(2)، تم سے بھول چوک میں جو کچھ ہو جائے اس میں تم پر کوئی گناه نہیں(3)، البتہ گناه وه ہے جس کا تم اراده دل سے کرو(4)۔ اللہ تعالیٰ بڑا ہی بخشنے واﻻ مہربان ہے.","arabic":"ٱدۡعُوهُمۡ لِأٓبَآئِهِمۡ هُوَ أَقۡسَطُ عِندَ ٱللَّهِۚ فَإِن لَّمۡ تَعۡلَمُوٓاْ ءَابَآءَهُمۡ فَإِخۡوَٰنُكُمۡ فِي ٱلدِّينِ وَمَوَٰلِيكُمۡۚ وَلَيۡسَ عَلَيۡكُمۡ جُنَاحٞ فِيمَآ أَخۡطَأۡتُم بِهِۦ وَلَٰكِن مَّا تَعَمَّدَتۡ قُلُوبُكُمۡۚ وَكَانَ ٱللَّهُ غَفُورٗا رَّحِيمًا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3538,"juzNumber":21,"footnotes":"(1) اس حکم سے اس رواج کی ممانعت کر دی گئی جو زمانۂ جاہلیت سے چلا آرہا تھا اور ابتدائے اسلام میں بھی رائج تھا کہ لے پالک بیٹوں کو حقیقی بیٹا سمجھا جاتا تھا۔ صحابہ کرام (رضي الله عنهم) بیان فرماتے ہیں کہ ہم زید بن حارثہ ! کو (جنہیں رسول اللہ (صلى الله عليه وسلم) ) نے آزاد کرکے بیٹا بنا لیا تھا) زید بن محمد ( (صلى الله عليه وسلم) ) کہہ کر پکارﺗے تھے، حتیٰ کہ قرآن کریم کی آیت ادْعُوهُمْ لآبَائِهِمْ نازل ہوگئی۔ (صحیح بخاری، تفسیر سورۃ الاحزاب) اس آیت کے نزول کے بعد حضرت ابو حذیفہ ! کے گھر میں بھی ایک مسئلہ پیدا ہو گیا، جنہوں نے سالم کو بیٹا بنایا ہوا تھا جب منہ بولے بیٹوں کو حقیقی بیٹا سمجھنے سے روک دیا گیا تو اس سے پردہ کرنا ضروری ہوگیا نبی (صلى الله عليه وسلم) نے حضرت ابو حذیفہ ! کی بیوی کو کہا کہ اسےدودھ پلا کر اپنا رضاعی بیٹا بنالو کیونکہ اس طرح تم اس پر حرام ہو جاؤ گی۔ چنانچہ انہوں نے ایسا ہی کیا۔ (صحيح مسلم، كتاب الرضاع، باب رضاعة الكبير ، أبو داود، كتاب النكاح، باب فيمن حرم به)۔\n(2) یعنی جن کے حقیقی باپوں کا علم ہے، اب دوسری نسبت ختم کرکے انہیں کی طرف انہیں منسوب کرو، البتہ جن کے باپوں کا علم نہ ہو سکے تو تم انہیں اپنا بھائی اور دوست سمجھو، بیٹا مت سمجھو۔\n(3) اس لئے کہ خطا ونسیان معاف ہے، جیسا کہ حدیث میں بھی صراحت ہے۔\n(4) یعنی جو جان بوجھ کر غلط انتساب کرے گا، وہ سخت گناہ گار ہوگا۔ حدیث میں آتاہے۔ جس نے جانتے بوجھتے اپنے کو غیر باپ کی طرف منسوب کیا۔ اس نے کفر کا ارتکاب کیا۔ (صحيح بخاري، كتاب المناقب ، باب ، نسبة اليمن إلى إسماعيل عليه السلام)","lang":"ur","meta":{"transliteration":"id'ʿūhum liābāihim huwa aqsaṭu ʿinda al-lahi fa-in lam taʿlamū ābāahum fa-ikh'wānukum fī al-dīni wamawālīkum walaysa ʿalaykum junāḥun fīmā akhṭatum bihi walākin mā taʿammadat qulūbukum wakāna al-lahu ghafūran raḥīman ","translations":["Call them","by their fathers","it","(is) more just","near","Allah","But if","not","you know","their fathers ","then (they are) your brothers","in","[the] religion","and your friends","But not is","upon you","any blame","in what","you made a mistake","in it","but","what","intended","your hearts","And Allah","And Allah","(is) Oft-Forgiving","Most Merciful","(5)"],"transliterationArr":["id'ʿūhum","liābāihim","huwa","aqsaṭu","ʿinda","al-lahi","fa-in","lam","taʿlamū","ābāahum","fa-ikh'wānukum","fī","al-dīni","wamawālīkum","walaysa","ʿalaykum","junāḥun","fīmā","akhṭatum","bihi","walākin","mā","taʿammadat","qulūbukum","wakāna","al-lahu","ghafūran","raḥīman",null],"verseTiming":[[1,0,1170],[2,1170,4290],[3,4290,4610],[4,4610,5480],[5,5480,6990],[6,6990,9090],[7,9090,9500],[8,9500,10050],[9,10050,12190],[10,12190,14950],[11,14950,16430],[12,16430,16710],[13,16710,17440],[14,17440,19460],[15,19460,20150],[16,20150,21060],[17,21060,22590],[18,22590,24510],[19,24510,25960],[20,25960,26780],[21,26780,27700],[22,27700,28530],[23,28530,30360],[24,30360,31490],[25,31490,32640],[26,32640,33570],[27,33570,34290],[28,34290,35945]]}},{"name":"33:6","price":"پیغمبر مومنوں پر خود ان سے بھی زیاده حق رکھنے والے(1) ہیں اور پیغمبر کی بیویاں مومنوں کی مائیں ہیں(2)، اور رشتے دار کتاب اللہ کی رو سے بہ نسبت دوسرے مومنوں اور مہاجروں کے آپس میں زیاده حق دار ہیں(3) (ہاں) مگر یہ کہ تم اپنے دوستوں کے ساتھ حسن سلوک کرنا چاہو(4)۔ یہ حکم کتاب (الٰہی) میں لکھا ہوا ہے.(5)","arabic":"ٱلنَّبِيُّ أَوۡلَىٰ بِٱلۡمُؤۡمِنِينَ مِنۡ أَنفُسِهِمۡۖ وَأَزۡوَٰجُهُۥٓ أُمَّهَٰتُهُمۡۗ وَأُوْلُواْ ٱلۡأَرۡحَامِ بَعۡضُهُمۡ أَوۡلَىٰ بِبَعۡضٖ فِي كِتَٰبِ ٱللَّهِ مِنَ ٱلۡمُؤۡمِنِينَ وَٱلۡمُهَٰجِرِينَ إِلَّآ أَن تَفۡعَلُوٓاْ إِلَىٰٓ أَوۡلِيَآئِكُم مَّعۡرُوفٗاۚ كَانَ ذَٰلِكَ فِي ٱلۡكِتَٰبِ مَسۡطُورٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3539,"juzNumber":21,"footnotes":"(1) نبی (صلى الله عليه وسلم) اپنی امت کے لئے جتنے شفیق اور خیر خواہ تھے، محتاج وضاحت نہیں۔ اللہ تعالیٰ نے آپ (صلى الله عليه وسلم) کی اس شفقت اور خیر خواہی کو دیکھتے ہوئے اس آیت میں آپ (صلى الله عليه وسلم) کو مومنوں کے اپنے نفسوں سے بھی زیادہ حق دار، آپ (صلى الله عليه وسلم) کی محبت کو دیگر تمام محبتوں سے فائق تر اور آپ (صلى الله عليه وسلم) کے حکم کو اپنی تمام خواہشات سے اہم تر قرار دیا ہے۔ اس لئے مومنوں کے لئے ضروری ہے کہ آپ (صلى الله عليه وسلم) ان کے جن مالوں کا مطالبہ۔ اللہ کے لئے کریں، وہ آپ (صلى الله عليه وسلم) پر نچھاور کر دیں چاہے انہیں خود کتنی ہی ضرورت ہو، آپ (صلى الله عليه وسلم) سے اپنے نفسوں سے بھی زیادہ محبت کریں۔ (جیسے حضرت عمر ! کا واقعہ ہے) آپ (صلى الله عليه وسلم) کے حکم کو سب پر مقدم اور آپ (صلى الله عليه وسلم) کی اطاعت کو سب سے اہم سمجھیں۔ جب تک یہ خود سپردگی نہیں ہوگی «فَلا وَرَبِّكَ لا يُؤْمِنُونَ» (النساء: 65) کے مطابق آدمی مومن نہیں ہوگا۔ اسی طرح جب تک آپ کی محبت تمام محبتوں پر غالب نہیں ہوگی «لا يُؤْمِنُ أَحَدُكُمْ حَتَّى أَكُونَ أَحَبَّ إِلَيْهِ مِنْ وَالِدِهِ وَوَلَدِه».. کی رو سے مومن نہیں، ٹھیک اسی طرح اطاعت رسول (صلى الله عليه وسلم) میں کوتاہی بھی «لا يُؤْمِنُ أَحَدُكُمْ حَتَّى يَكُونَ هَوَاهُ تَبَعًا لِمَا جِئْتُ بِهِ ..» کا مصداق بنا دے گی۔\n(2) یعنی احترام وتکریم میں اور ان سے نکاح نہ کرنے میں۔ مومن مردوں اور مومن عورتوں کی مائیں بھی ہیں۔\n(3) یعنی اب مہاجرت، اخوت اور موالات کی وجہ سے وراثت نہیں ہوگی۔ اب وراثت صرف قریبی رشتہ کی بنیاد پر ہوگی۔\n(4) ہاں تم غیر رشتے داروں کے لئے احسان اور بر وصلہ کا معاملہ کر سکتے ہو، نیز ان کے لئے ایک تہائی مال میں سے وصیت بھی کر سکتے ہو۔\n(5) یعنی لوح محفوظ میں اصل حکم یہی ہے، گو عارضی طور پر مصلحتاً دوسروں کو بھی وارث قرار دے دیا گیا تھا، لیکن اللہ کے علم میں تھا کہ یہ منسوخ کر دیا جائے گا۔ چنانچہ اسے منسوخ کرکے پہلا حکم بحال کر دیا گیا ہے۔","lang":"ur","meta":{"transliteration":"al-nabiyu awlā bil-mu'minīna min anfusihim wa-azwājuhu ummahātuhum wa-ulū al-arḥāmi baʿḍuhum awlā bibaʿḍin fī kitābi al-lahi mina al-mu'minīna wal-muhājirīna illā an tafʿalū ilā awliyāikum maʿrūfan kāna dhālika fī al-kitābi masṭūran ","translations":["The Prophet","(is) closer","to the believers","than","their own selves","and his wives","(are) their mothers","And possessors","(of) relationships","some of them","(are) closer","to another","in","(the) Decree","(of) Allah","than","the believers","and the emigrants","except","that","you do","to","your friends","a kindness","That is","That is","in","the Book","written","(6)"],"transliterationArr":["al-nabiyu","awlā","bil-mu'minīna","min","anfusihim","wa-azwājuhu","ummahātuhum","wa-ulū","al-arḥāmi","baʿḍuhum","awlā","bibaʿḍin","fī","kitābi","al-lahi","mina","al-mu'minīna","wal-muhājirīna","illā","an","tafʿalū","ilā","awliyāikum","maʿrūfan","kāna","dhālika","fī","al-kitābi","masṭūran",null],"verseTiming":[[1,0,1880],[2,1880,2660],[3,2660,4220],[4,4220,4540],[5,4540,7180],[6,7180,10130],[7,10130,12740],[8,12740,13320],[9,13320,14510],[10,14510,15420],[11,15420,16160],[12,16160,17230],[13,17230,18300],[14,18300,19170],[15,19170,19910],[16,19910,20240],[17,20240,21660],[18,21660,23290],[19,23290,24260],[20,24260,26870],[21,26870,27870],[22,27870,30660],[23,30660,32610],[24,32610,35810],[25,35810,37960],[26,37960,38510],[27,38510,39310],[28,39310,39530],[29,39530,40500],[30,40500,42235]]}},{"name":"33:7","price":"جب کہ ہم نے تمام نبیوں سے عہد لیا اور (بالخصوص) آپ سے اور نوح سے اور ابراہیم سے اور موسیٰ سے اور مریم کے بیٹے عیسیٰ سے، اور ہم نے ان سے (پکا اور) پختہ عہد لیا.(1)","arabic":"وَإِذۡ أَخَذۡنَا مِنَ ٱلنَّبِيِّـۧنَ مِيثَٰقَهُمۡ وَمِنكَ وَمِن نُّوحٖ وَإِبۡرَٰهِيمَ وَمُوسَىٰ وَعِيسَى ٱبۡنِ مَرۡيَمَۖ وَأَخَذۡنَا مِنۡهُم مِّيثَٰقًا غَلِيظٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3540,"juzNumber":21,"footnotes":"(1) اس عہد سے کیا مراد ہے؟ بعض کے نزدیک یہ وہ عہد ہے جو ایک دوسرے کی مدد اور تصدیق کا انبیا علیہم السلام سے لیا گیا تھا جیسا کہ سورۂ آل عمران کی آیت 81 میں ہے۔ بعض کے نزدیک یہ وہ عہد ہے، جس کا ذکر شوریٰ کی ایت 13 میں ہے کہ دین قائم کرنا اور اس میں تفرقہ مت ڈالنا۔ یہ عہد اگرچہ تمام انبیا علیہم السلام سے لیا گیا تھا لیکن یہاں بطور خاص پانچ انبیا علیہم السلام کا نام لیا گیا ہے جن سے ان کی اہمیت وعظمت واضح ہے اور ان میں بھی نبی (صلى الله عليه وسلم) کا ذکر سب سے پہلے ہے دراں حالیکہ نبوت کے لحاظ سے آپ (صلى الله عليه وسلم) سب سے متاخر ہیں، اس سے آپ (صلى الله عليه وسلم) کی عظمت اور شرف کا جس طرح اظہار ہو رہا ہے، محتاج وضاحت نہیں۔","lang":"ur","meta":{"transliteration":"wa-idh akhadhnā mina al-nabiyīna mīthāqahum waminka wamin nūḥin wa-ib'rāhīma wamūsā waʿīsā ib'ni maryama wa-akhadhnā min'hum mīthāqan ghalīẓan ","translations":["And when","We took","from","the Prophets","their Covenant","and from you","and from","Nuh","and Ibrahim","and Musa","and Isa","son","(of) Maryam","And We took","from them","a covenant","strong","(7)"],"transliterationArr":["wa-idh","akhadhnā","mina","al-nabiyīna","mīthāqahum","waminka","wamin","nūḥin","wa-ib'rāhīma","wamūsā","waʿīsā","ib'ni","maryama","wa-akhadhnā","min'hum","mīthāqan","ghalīẓan",null],"verseTiming":[[1,0,550],[2,550,1530],[3,1530,1830],[4,1830,3950],[5,3950,5290],[6,5290,6640],[7,6640,7050],[8,7050,8930],[9,8930,10390],[10,10390,11360],[11,11360,12120],[12,12120,12570],[13,12570,13260],[14,13260,14930],[15,14930,16580],[16,16580,17740],[17,17740,18825]]}},{"name":"33:8","price":"تاکہ اللہ تعالیٰ سچوں سے ان کی سچائی کے بارے میں دریافت فرمائے(1) ، اور کافروں کے لئے ہم نے المناک عذاب تیار کر رکھے ہیں.","arabic":"لِّيَسۡـَٔلَ ٱلصَّٰدِقِينَ عَن صِدۡقِهِمۡۚ وَأَعَدَّ لِلۡكَٰفِرِينَ عَذَابًا أَلِيمٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3541,"juzNumber":21,"footnotes":"- یہ لام كَيْ ہے۔ یعنی یہ عہد اس لئے لیا تاکہ اللہ سچے نبیوں سے پوچھے کہ انہوں نے اللہ کا پیغام اپنی قوموں تک ٹھیک طریقے سے پہنچا دیا تھا؟ یا دوسرا مطلب یہ ہے کہ وہ انبیا سے پوچھے کہ تمہاری قوموں نے تمہاری دعوت کا جواب کس طرح دیا؟ مثبت انداز میں یا منفی طریقے سے؟ جس طرح کہ دوسرے مقام پر ہے کہ ہم ان سے بھی پوچھیں گے جن کی طرف رسول بھیجے گئے اور رسولوں سے بھی پوچھیں گے۔ (الاعراف۔ 6) اس میں داعیان حق کے لئے بھی تنبیہ ہے کہ وہ دعوت حق کا فریضہ پوری تن دہی اور اخلاص سے ادا کریں تاکہ بارگاہ الٰہی میں سرخرو ہو سکیں، اور ان لوگوں کے لئے بھی وعید ہے جن کو حق کی دعوت پہنچائی جائے کہ اگر وہ اسے قبول نہیں کریں گے تو عنداللہ مجرم اور مستوجب سزا ہوں گے۔","lang":"ur","meta":{"transliteration":"liyasala al-ṣādiqīna ʿan ṣid'qihim wa-aʿadda lil'kāfirīna ʿadhāban alīman ","translations":["That He may ask","the truthful","about","their truth","And He has prepared","for the disbelievers","a punishment","painful","(8)"],"transliterationArr":["liyasala","al-ṣādiqīna","ʿan","ṣid'qihim","wa-aʿadda","lil'kāfirīna","ʿadhāban","alīman",null],"verseTiming":[[1,0,950],[2,950,2330],[3,2330,2730],[4,2730,4830],[5,4830,5780],[6,5780,7480],[7,7480,8890],[8,8890,10325]]}},{"name":"33:9","price":"اے ایمان والو! اللہ تعالیٰ نے جو احسان تم پر کیا اسے یاد کرو جبکہ تمہارے مقابلے کو فوجوں پر فوجیں آئیں پھر ہم نے ان پر تیز وتند آندھی اور ایسے لشکر بھیجے جنہیں تم نے دیکھا ہی نہیں(1) ، اور جو کچھ تم کرتے ہو اللہ تعالیٰ سب کچھ دیکھتا ہے.","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱذۡكُرُواْ نِعۡمَةَ ٱللَّهِ عَلَيۡكُمۡ إِذۡ جَآءَتۡكُمۡ جُنُودٞ فَأَرۡسَلۡنَا عَلَيۡهِمۡ رِيحٗا وَجُنُودٗا لَّمۡ تَرَوۡهَاۚ وَكَانَ ٱللَّهُ بِمَا تَعۡمَلُونَ بَصِيرًا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3542,"juzNumber":21,"footnotes":"(1) ان آیات میں غزوۂ احزاب کی کچھ تفصیل ہے جو 5 ہجری میں پیش آیا اسے احزاب اس لئے کہتے ہیں کہ اس موقعے پر تمام اسلام دشمن گروہ جمع ہو کر مسلمانوں کے مرکز مدینہ پر حملہ آور ہوئے تھے۔ احزاب حزب (گروہ) کی جمع ہے۔ اسے جنگ خندق بھی کہتے ہیں، اس لئے کہ مسلمانوں نے اپنے بچاؤ کے لئے مدینے کے اطراف میں خندق کھودی تھی تاکہ دشمن مدینے کے اندر نہ آسکیں۔ اس کی مختصر تفصیل اس طرح ہے کہ یہودیوں کے قبیلے بنو نضیر، جس کو رسول اللہ (صلى الله عليه وسلم) نے اس کی مسلسل بدعہدی کی وجہ سے مدینہ سے جلا وطن کردیا تھا، یہ قبیلہ خیبر میں جا آباد ہوا، اس نے کفار مکہ کو مسلمانوں پر حملہ آور ہونے کے لئے تیار کیا،اسی طرح غطفان وغیرہ قبائل نجد کو بھی امداد کا یقین دلا کر آمادۂ قتال کیا اور یوں یہ یہودی اسلام اور مسلمانوں کے تمام دشمنوں کو اکھٹا کرکے مدینے پر حملہ آور ہونے میں کامیاب ہوگئے۔ مشرکین مکہ کی قیادت ابوسفیان کے پاس تھی، انہوں نے احد کے آس پاس پڑاؤ ڈال کر تقریباً مدینے کا محاصرہ کر لیا، ان کی مجموعی تعداد 10 ہزار تھی، جب کہ مسلمان تین ہزار تھے۔ علاوہ ازیں جنوبی رخ پر یہودیوں کا تیسرا قبیلہ بنو قریظہ آباد تھا، جس سے ابھی تک مسلمانوں کا معاہدہ قائم اور وہ مسلمانوں کی مدد کرنے کا پابند تھا۔ لیکن اسے بھی بنو نضیر کے یہودی سردار حیی بن اخطب نےورغلا کر مسلمانوں پر کاری ضرب لگانے کے حوالے سے، اپنے ساتھ ملا لیا، یوں مسلمان چاروں طرف سے دشمن کے نرغے میں گھر گئے۔ اس موقع پر حضرت سلمان فارسی ! کے مشورے سے خندق کھودی گئی، جس کی وجہ سے دشمن کا لشکر مدینے سے اندر نہیں آسکا اور مدینے کے باہر قیام پذیر رہا۔ تاہم مسلمان اس محاصرے اور دشمن کی متحدہ یلغارسے سخت خوفزدہ تھے۔ کم وبیش ایک مہینے تک یہ محاصرہ قائم رہا اور مسلمان سخت خوف اور اضطراب کے عالم میں مبتلا۔ بالآخر اللہ تعالیٰ نے پردۂ غیب سے مسلمانوں کی مدد فرمائی ان آیات میں ان ہی سراسیمہ حالات اور امداد غیبی کا تذکرہ فرمایا گیا ہے۔ پہلے جُنُودٌ سے مراد کفار کی فوجیں ہیں، جو جمع ہو کر آئی تھیں۔ تیز وتند ہوا سے مراد وہ ہوا ہے جو سخت طوفان اور آندھی کی شکل میں آئی، جس نے ان کے خیموں کو اکھاڑ پھینکا، جانور رسیاں تڑا کر بھاگ کھڑے ہوئے، ہانڈیاں الٹ گئیں اور سب بھاگنے پر مجبور ہوگئے۔ یہ وہی ہوا تھی جس کی بابت حدیث میں آتا ہے، نُصِرْتُ بِالصَّبَا وَأُهْلِكَتْ عَادٌ بِالدَّبُورِ (صحيح بخاري ، كتاب الاستسقاء، باب نصرت بالصبا مسلم، باب في ريح الصبا والدبور) میری مدد صبا (مشرقی ہوا) سےکی گئی اور عاد دبور (پچھمی) ہوا سے ہلاک کیے گئے۔ وَجُنُودًا لَمْ تَرَوْهَا سے مراد فرشتے ہیں، جو مسلمانوں کی مدد کے لئے آئے۔ انہوں نے دشمن کےدلوں پر ایسا خوف اور دہشت طاری کر دی کہ انہوں نے وہاں سے جلد بھاگ جانے میں ہی اپنی عافیت سمجھی۔","lang":"ur","meta":{"transliteration":"yāayyuhā alladhīna āmanū udh'kurū niʿ'mata al-lahi ʿalaykum idh jāatkum junūdun fa-arsalnā ʿalayhim rīḥan wajunūdan lam tarawhā wakāna al-lahu bimā taʿmalūna baṣīran ","translations":["O you","who","believe","Remember","(the) Favor","(of) Allah","upon you","when","came to you","(the) hosts","and We sent","upon them","a wind","and hosts","not","you (could) see them","And Allah is","And Allah is","of what","you do","All-Seer","(9)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","udh'kurū","niʿ'mata","al-lahi","ʿalaykum","idh","jāatkum","junūdun","fa-arsalnā","ʿalayhim","rīḥan","wajunūdan","lam","tarawhā","wakāna","al-lahu","bimā","taʿmalūna","baṣīran",null],"verseTiming":[[1,0,2500],[2,2500,3460],[3,3460,4270],[4,4270,4990],[5,4990,5740],[6,5740,6570],[7,6570,7550],[8,7550,7890],[9,7890,10640],[10,10640,12020],[11,12020,13380],[12,13380,14350],[13,14350,14900],[14,14900,16570],[15,16570,17080],[16,17080,18080],[17,18080,19280],[18,19280,20140],[19,20140,20670],[20,20670,21820],[21,21820,23305]]}},{"name":"33:10","price":"جب کہ (دشمن) تمہارے پاس اوپر سے اور نیچے سے چڑھ آئے(1) اور جب کہ آنکھیں پتھرا گئیں اور کلیجے منھ کو آگئے اور تم اللہ تعالیٰ کی نسبت طرح طرح کے گمان کرنے لگے.(2)","arabic":"إِذۡ جَآءُوكُم مِّن فَوۡقِكُمۡ وَمِنۡ أَسۡفَلَ مِنكُمۡ وَإِذۡ زَاغَتِ ٱلۡأَبۡصَٰرُ وَبَلَغَتِ ٱلۡقُلُوبُ ٱلۡحَنَاجِرَ وَتَظُنُّونَ بِٱللَّهِ ٱلظُّنُونَا۠","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3543,"juzNumber":21,"footnotes":"(1) اس سے مراد یہ ہے کہ ہر طرف سے دشمن آگئے یا اوپر سے مراد غطفان، ہوا زن اور دیگر نجد کے مشرکین ہیں اور نیچے کی سمت سے قریش اور ان کے اعوان وانصار۔\n(2) یہ مسلمانوں کی اس کیفیت کا اظہار ہے جس سے اس وقت دوچار تھے۔","lang":"ur","meta":{"transliteration":"idh jāūkum min fawqikum wamin asfala minkum wa-idh zāghati al-abṣāru wabalaghati al-qulūbu al-ḥanājira wataẓunnūna bil-lahi al-ẓunūnā ","translations":["When","they came upon you","from","above you","and from","below","you","and when","grew wild","the eyes","and reached","the hearts","the throats","and you assumed","about Allah","the assumptions","(10)"],"transliterationArr":["idh","jāūkum","min","fawqikum","wamin","asfala","minkum","wa-idh","zāghati","al-abṣāru","wabalaghati","al-qulūbu","al-ḥanājira","wataẓunnūna","bil-lahi","al-ẓunūnā",null],"verseTiming":[[1,0,410],[2,410,2660],[3,2660,3530],[4,3530,5190],[5,5190,5770],[6,5770,6560],[7,6560,8090],[8,8090,8580],[9,8580,9440],[10,9440,10580],[11,10580,11580],[12,11580,12440],[13,12440,13620],[14,13620,14590],[15,14590,15470],[16,15470,16730],[17,16730,17670],[18,17670,18610],[19,18610,19880],[20,19880,21930],[21,21930,22980],[22,22980,24685]]}},{"name":"33:11","price":"یہیں مومن آزمائے گئے اور پوری طرح وه جھنجھوڑ دیئے گئے.(1)","arabic":"هُنَالِكَ ٱبۡتُلِيَ ٱلۡمُؤۡمِنُونَ وَزُلۡزِلُواْ زِلۡزَالٗا شَدِيدٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3544,"juzNumber":21,"footnotes":"(1) یعنی مسلمانوں کو خوف، قتال، بھوک اور محاصرے میں مبتلا کرکے ان کو جانچا پرکھا گیا تاکہ منافق الگ ہو جائیں۔","lang":"ur","meta":{"transliteration":"hunālika ub'tuliya al-mu'minūna wazul'zilū zil'zālan shadīdan ","translations":["There ","were tried","the believers","and shaken","(with a) shake","severe","(11)"],"transliterationArr":["hunālika","ub'tuliya","al-mu'minūna","wazul'zilū","zil'zālan","shadīdan",null],"verseTiming":[[1,0,1010],[2,1010,1740],[3,1740,3170],[4,3170,4280],[5,4280,6150],[6,6150,7645]]}},{"name":"33:12","price":"اور اس وقت منافق اور وه لوگ جن کے دلوں میں (شک کا) روگ تھا کہنے لگے اللہ تعالیٰ اور اس کے رسول نے ہم سے محض دھوکا فریب کا ہی وعده کیا تھا.(1)","arabic":"وَإِذۡ يَقُولُ ٱلۡمُنَٰفِقُونَ وَٱلَّذِينَ فِي قُلُوبِهِم مَّرَضٞ مَّا وَعَدَنَا ٱللَّهُ وَرَسُولُهُۥٓ إِلَّا غُرُورٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3545,"juzNumber":21,"footnotes":"(1) یعنی اللہ تعالیٰ کی طرف سے مدد کا وعدہ ایک فریب تھا۔ یہ تقریباً ستر منافقین تھے جن کی زبانوں پر وہ بات آگئی جو دلوں میں تھی۔","lang":"ur","meta":{"transliteration":"wa-idh yaqūlu al-munāfiqūna wa-alladhīna fī qulūbihim maraḍun mā waʿadanā al-lahu warasūluhu illā ghurūran ","translations":["And when","said","the hypocrites","and those","in","their hearts","(was) a disease","Not","Allah promised us","Allah promised us","and His messenger","except","delusion","(12)"],"transliterationArr":["wa-idh","yaqūlu","al-munāfiqūna","wa-alladhīna","fī","qulūbihim","maraḍun","mā","waʿadanā","al-lahu","warasūluhu","illā","ghurūran",null],"verseTiming":[[1,0,620],[2,620,1370],[3,1370,2990],[4,2990,4090],[5,4090,4510],[6,4510,5690],[7,5690,6930],[8,6930,8090],[9,8090,8850],[10,8850,9730],[11,9730,12270],[12,12270,13020],[13,13020,14605]]}},{"name":"33:13","price":"ان ہی کی ایک جماعت نے ہانک لگائی کہ اے مدینہ والو(1) ! تمہارے لئے ٹھکانہ نہیں چلو لوٹ چلو(2)، اور ان کی ایک اور جماعت یہ کہہ کر نبی ﴿صلی اللہ علیہ وسلم﴾ سے اجازت مانگنے لگی کہ ہمارے گھر غیر محفوظ ہیں(3)، حاﻻنکہ وه (کھلے ہوئے اور) غیر محفوظ نہ تھے (لیکن) ان کا پختہ اراده بھاگ کھڑے ہونے کا تھا.(4)","arabic":"وَإِذۡ قَالَت طَّآئِفَةٞ مِّنۡهُمۡ يَٰٓأَهۡلَ يَثۡرِبَ لَا مُقَامَ لَكُمۡ فَٱرۡجِعُواْۚ وَيَسۡتَـٔۡذِنُ فَرِيقٞ مِّنۡهُمُ ٱلنَّبِيَّ يَقُولُونَ إِنَّ بُيُوتَنَا عَوۡرَةٞ وَمَا هِيَ بِعَوۡرَةٍۖ إِن يُرِيدُونَ إِلَّا فِرَارٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3546,"juzNumber":21,"footnotes":"(1) یثرب اس پورے علاقے کا نام تھا، مدینہ اسی کا ایک حصہ تھا، جسے یہاں یثرب سے تعبیر کیا گیا ہے۔ کہا جاتا ہے کہ اس کا نام یثرب اس لئے پڑا کہ کسی زمانے میں عمالقہ میں سے کسی نے یہاں پڑاو کیا تھا جس کا نام یثرب بن عمیل تھا۔ (فتح القدیر)۔\n(2) یعنی مسلمانوں کے لشکر میں رہنا تو سخت خطرناک ہے، اپنے اپنے گھروں کو واپس لوٹ جاؤ۔\n(3) یعنی بنو قریظہ کی طرف سے حملے کا خطرہ ہے یوں اہل خانہ کی جان ومال اور آبرو خطرے میں ہے۔\n(4) یعنی جو خطرہ وہ ظاہر کر رہے ہیں، نہیں ہے وہ اس بہانے سے راہ فرار چاہتے ہیں۔ عَوْرَةٌ کے لغوی اور معروف معنی کے لئے دیکھئے، سورۂ نور، آیت 58 کا حاشیہ۔","lang":"ur","meta":{"transliteration":"wa-idh qālat ṭāifatun min'hum yāahla yathriba lā muqāma lakum fa-ir'jiʿū wayastadhinu farīqun min'humu al-nabiya yaqūlūna inna buyūtanā ʿawratun wamā hiya biʿawratin in yurīdūna illā firāran ","translations":["And when","said","a party","of them","O People","(of) Yathrib","No","stand","for you","so return","And asked permission","a group","of them","(from) the Prophet","saying","Indeed","our houses","(are) exposed","and not","they","(were) exposed","Not","they wished","but","to flee","(13)"],"transliterationArr":["wa-idh","qālat","ṭāifatun","min'hum","yāahla","yathriba","lā","muqāma","lakum","fa-ir'jiʿū","wayastadhinu","farīqun","min'humu","al-nabiya","yaqūlūna","inna","buyūtanā","ʿawratun","wamā","hiya","biʿawratin","in","yurīdūna","illā","firāran",null],"verseTiming":[[1,0,570],[2,570,1190],[3,1190,4260],[4,4260,5910],[5,5910,8390],[6,8390,9190],[7,9190,9570],[8,9570,10390],[9,10390,10950],[10,10950,12000],[11,12000,13720],[12,13720,14580],[13,14580,16180],[14,16180,17580],[15,17580,18630],[16,18630,19800],[17,19800,20930],[18,20930,22510],[19,22510,23020],[20,23020,23390],[21,23390,24790],[22,24790,25010],[23,25010,25750],[24,25750,26200],[25,26200,26670],[26,26670,27460],[27,27460,28945]]}},{"name":"33:14","price":"اور اگر مدینے کے اطراف سے ان پر (لشکر) داخل کیے جاتے پھر ان سے فتنہ طلب کیا جاتا تو یہ ضرور اسے برپا کر دیتے اور نہ لڑتے مگر تھوڑی مدت.(1)","arabic":"وَلَوۡ دُخِلَتۡ عَلَيۡهِم مِّنۡ أَقۡطَارِهَا ثُمَّ سُئِلُواْ ٱلۡفِتۡنَةَ لَأٓتَوۡهَا وَمَا تَلَبَّثُواْ بِهَآ إِلَّا يَسِيرٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3547,"juzNumber":21,"footnotes":"(1) یعنی مدینے یا ان کے گھروں میں چاروں طرف سے دشمن داخل ہو جائیں اور ان سے مطالبہ کریں کہ تم کفر وشرک کی طرف دوبارہ واپس آجاؤ، تو یہ ذرا توقف نہ کریں گے اور اس وقت گھروں کے غیر محفوظ ہونے کا عذر بھی نہیں کریں گے بلکہ فوراً مطالبۂ شرک کے سامنے جھک جائیں۔ مطلب یہ ہے کہ کفر وشرک ان کو مرغوب ہے اور اس کی طرف یہ لپکتے ہیں۔","lang":"ur","meta":{"transliteration":"walaw dukhilat ʿalayhim min aqṭārihā thumma su-ilū al-fit'nata laātawhā wamā talabbathū bihā illā yasīran ","translations":["And if","had been entered","upon them","from","all its sides","then","they had been asked","the treachery","they (would) have certainly done it","and not","they (would) have hesitated","over it","except","a little","(14)"],"transliterationArr":["walaw","dukhilat","ʿalayhim","min","aqṭārihā","thumma","su-ilū","al-fit'nata","laātawhā","wamā","talabbathū","bihā","illā","yasīran",null],"verseTiming":[[1,0,560],[2,560,1310],[3,1310,2220],[4,2220,3050],[5,3050,4340],[6,4340,5170],[7,5170,5710],[8,5710,6670],[9,6670,7930],[10,7930,8480],[11,8480,9590],[12,9590,11640],[13,11640,12380],[14,12380,13825]]}},{"name":"33:15","price":"اس سے پہلے تو انہوں نے اللہ سے عہد کیا تھا کہ پیٹھ نہ پھیریں گے(1) ، اور اللہ تعالیٰ سے کیے ہوئے وعده کی باز پرس ضرور(2) ہوگی.","arabic":"وَلَقَدۡ كَانُواْ عَٰهَدُواْ ٱللَّهَ مِن قَبۡلُ لَا يُوَلُّونَ ٱلۡأَدۡبَٰرَۚ وَكَانَ عَهۡدُ ٱللَّهِ مَسۡـُٔولٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3548,"juzNumber":21,"footnotes":"(1) بیان کیا جاتا ہے کہ منافقین جنگ بدر تک مسلمان نہیں ہوئے۔ لیکن جب مسلمان فاتح ہوکر اور مال غنیمت لے کر واپس آئے تو انہوں نے نہ صرف یہ کہ اسلام کا اظہار کیا بلکہ یہ عہد بھی کیا کہ آئندہ جب بھی کفار سے معرکہ پیش آیا تو وہ مسلمانوں کے ساتھ مل کر ضرور لڑیں گے، یہاں ان کو وہی عہد یاد کرایا گیا ہے۔\n(2) یعنی اسےپورا کرنے کا ان سے مطالبہ کیا جائے گا اور عدم وفا پر سزا کے وہ مستحق ہوں گے۔","lang":"ur","meta":{"transliteration":"walaqad kānū ʿāhadū al-laha min qablu lā yuwallūna al-adbāra wakāna ʿahdu al-lahi masūlan ","translations":["And certainly","they had","promised","Allah","before","before","not","they would turn","their backs","And is","(the) promise","(to) Allah","to be questioned","(15)"],"transliterationArr":["walaqad","kānū","ʿāhadū","al-laha","min","qablu","lā","yuwallūna","al-adbāra","wakāna","ʿahdu","al-lahi","masūlan",null],"verseTiming":[[1,0,800],[2,800,1590],[3,1590,2290],[4,2290,3000],[5,3000,4190],[6,4190,4690],[7,4690,5090],[8,5090,6170],[9,6170,8840],[10,8840,9520],[11,9520,10090],[12,10090,10860],[13,10860,12335]]}},{"name":"33:16","price":"کہہ دیجئے کہ گو تم موت سے یا خوف قتل سے بھاگو تو یہ بھاگنا تمہیں کچھ بھی کام نہ آئے گا اور اس وقت تم بہت ہی کم فائده اٹھاؤ گے.(1)","arabic":"قُل لَّن يَنفَعَكُمُ ٱلۡفِرَارُ إِن فَرَرۡتُم مِّنَ ٱلۡمَوۡتِ أَوِ ٱلۡقَتۡلِ وَإِذٗا لَّا تُمَتَّعُونَ إِلَّا قَلِيلٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3549,"juzNumber":21,"footnotes":"(1) یعنی موت سے تو کوئی صورت مفر نہیں ہے۔ اگر میدان جنگ سے بھاگ کر آبھی جاؤ گے، تو کیا فائدہ؟ کچھ عرصے بعد موت کا پیالہ تو پھر بھی پینا ہی پڑے گا۔","lang":"ur","meta":{"transliteration":"qul lan yanfaʿakumu al-firāru in farartum mina al-mawti awi al-qatli wa-idhan lā tumattaʿūna illā qalīlan ","translations":["Say","Never","will benefit you","the fleeing","if","you flee","from","death","or","killing","and then","not","you will be allowed to enjoy","except","a little","(16)"],"transliterationArr":["qul","lan","yanfaʿakumu","al-firāru","in","farartum","mina","al-mawti","awi","al-qatli","wa-idhan","lā","tumattaʿūna","illā","qalīlan",null],"verseTiming":[[1,0,450],[2,450,660],[3,660,3100],[4,3100,4050],[5,4050,5000],[6,5000,5850],[7,5850,6760],[8,6760,7610],[9,7610,7950],[10,7950,8680],[11,8680,9390],[12,9390,9730],[13,9730,11050],[14,11050,11820],[15,11820,13295]]}},{"name":"33:17","price":"پوچھیئے! تو کہ اگر اللہ تعالیٰ تمہیں کوئی برائی پہنچانا چاہے یا تم پر کوئی فضل کرنا چاہے تو کون ہے جو تمہیں بچا سکے (یا تم سے روک سکے؟)(1) ، اپنے لیے بجز اللہ تعالیٰ کے نہ کوئی حمایتی پائیں گے نہ مددگار.","arabic":"قُلۡ مَن ذَا ٱلَّذِي يَعۡصِمُكُم مِّنَ ٱللَّهِ إِنۡ أَرَادَ بِكُمۡ سُوٓءًا أَوۡ أَرَادَ بِكُمۡ رَحۡمَةٗۚ وَلَا يَجِدُونَ لَهُم مِّن دُونِ ٱللَّهِ وَلِيّٗا وَلَا نَصِيرٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3550,"juzNumber":21,"footnotes":"(1) یعنی تمہیں ہلاک کرنا، بیمار کرنا، یا مال وجائیداد میں نقصان پہنچانا یا قحط سالی میں مبتلا کرنا چاہے، تو کون ہے جو تمہیں اس سے بچا سکے؟ یا اپنا فضل وکرم کرنا چاہے تو وہ روک سکے؟","lang":"ur","meta":{"transliteration":"qul man dhā alladhī yaʿṣimukum mina al-lahi in arāda bikum sūan aw arāda bikum raḥmatan walā yajidūna lahum min dūni al-lahi waliyyan walā naṣīran ","translations":["Say","Who","(is) it that","(is) it that","(can) protect you","from","Allah","If","He intends","for you","any harm","or","He intends","for you","a mercy","And not","they will find","for them","besides","besides","Allah","any protector","and not","any helper","(17)"],"transliterationArr":["qul","man","dhā","alladhī","yaʿṣimukum","mina","al-lahi","in","arāda","bikum","sūan","aw","arāda","bikum","raḥmatan","walā","yajidūna","lahum","min","dūni","al-lahi","waliyyan","walā","naṣīran",null],"verseTiming":[[1,0,380],[2,380,1689],[3,1689,1849],[4,1849,2689],[5,2689,3779],[6,3779,3899],[7,3899,5409],[8,5409,5939],[9,5939,6699],[10,6699,7209],[11,7209,7719],[12,7719,9299],[13,9299,9969],[14,9969,10729],[15,10729,11269],[16,11269,12519],[17,12519,13029],[18,13029,13959],[19,13959,15089],[20,15089,16289],[21,16289,16849],[22,16849,17639],[23,17639,18399],[24,18399,19559],[25,19559,21084]]}},{"name":"33:18","price":"اللہ تعالیٰ تم میں سے انہیں (بخوبی) جانتا ہے جو دوسروں کو روکتے ہیں اور اپنے بھائی بندوں سے کہتے ہیں کہ ہمارے پاس(1) چلے آؤ۔ اور کبھی کبھی ہی لڑائی میں آجاتے ہیں.(2)","arabic":"۞ قَدۡ يَعۡلَمُ ٱللَّهُ ٱلۡمُعَوِّقِينَ مِنكُمۡ وَٱلۡقَآئِلِينَ لِإِخۡوَٰنِهِمۡ هَلُمَّ إِلَيۡنَاۖ وَلَا يَأۡتُونَ ٱلۡبَأۡسَ إِلَّا قَلِيلًا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3551,"juzNumber":21,"footnotes":"(1) یہ کہنے والے منافقین تھے، جو اپنے دوسرے ساتھیوں کو بھی مسلمانوں کے ساتھ جنگ میں شریک ہونے سے روکتے تھے۔\n(2) کیوں کہ وہ موت کے خوف سے پیچھے ہی رہتے تھے۔","lang":"ur","meta":{"transliteration":"qad yaʿlamu al-lahu al-muʿawiqīna minkum wal-qāilīna li-ikh'wānihim halumma ilaynā walā yatūna al-basa illā qalīlan ","translations":["Verily","Allah knows","Allah knows","those who hinder","among you","and those who say","to their brothers","Come","to us","and not","they come","(to) the battle","except","a few","(18)"],"transliterationArr":["qad","yaʿlamu","al-lahu","al-muʿawiqīna","minkum","wal-qāilīna","li-ikh'wānihim","halumma","ilaynā","walā","yatūna","al-basa","illā","qalīlan",null],"verseTiming":[[1,0,370],[2,370,1170],[3,1170,1940],[4,1940,3510],[5,3510,4900],[6,4900,7430],[7,7430,8980],[8,8980,10250],[9,10250,11380],[10,11380,12320],[11,12320,13240],[12,13240,14070],[13,14070,14790],[14,14790,16225]]}},{"name":"33:19","price":"تمہاری مدد میں (پورے) بخیل ہیں(1) ، پھر جب خوف ودہشت کا موقعہ آجائے تو آپ انہیں دیکھیں گے کہ آپ کی طرف نظریں جما دیتے ہیں اور ان کی انکھیں اس طرح گھومتی ہیں جیسے اس شخص کی جس پر موت کی غشی طاری ہو(2)۔ پھر جب خوف جاتا رہتا ہے تو تم پر اپنی تیز زبانوں سے بڑی باتیں بناتے ہیں(3) مال کے بڑے ہی حریص ہیں(4)، یہ ایمان ﻻئے ہی نہیں ہیں(5) اللہ تعالیٰ نے ان کے تمام اعمال نابود کر دیئے ہیں(6)، اور اللہ تعالیٰ پر یہ بہت ہی آسان ہے.(7)","arabic":"أَشِحَّةً عَلَيۡكُمۡۖ فَإِذَا جَآءَ ٱلۡخَوۡفُ رَأَيۡتَهُمۡ يَنظُرُونَ إِلَيۡكَ تَدُورُ أَعۡيُنُهُمۡ كَٱلَّذِي يُغۡشَىٰ عَلَيۡهِ مِنَ ٱلۡمَوۡتِۖ فَإِذَا ذَهَبَ ٱلۡخَوۡفُ سَلَقُوكُم بِأَلۡسِنَةٍ حِدَادٍ أَشِحَّةً عَلَى ٱلۡخَيۡرِۚ أُوْلَٰٓئِكَ لَمۡ يُؤۡمِنُواْ فَأَحۡبَطَ ٱللَّهُ أَعۡمَٰلَهُمۡۚ وَكَانَ ذَٰلِكَ عَلَى ٱللَّهِ يَسِيرٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3552,"juzNumber":21,"footnotes":"(1) یعنی تمہارے ساتھ خندق کھود کر تم سے تعاون کرنے میں یا اللہ کی راہ میں خرچ کرنے میں یا تمہارے ساتھ مل کرلڑنے میں بخیل ہیں۔\n(2) یہ ان کی بزدلی اور پست ہمتی کی کیفیت کا بیان ہے۔\n(3) یعنی اپنی شجاعت ومردانگی کی بابت ڈینگیں مارتے ہیں، جو سراسر جھوٹ پر مبنی ہوتی ہیں، یا غنیمت کی تقسیم کے وقت اپنی زبان کی تیزی وطراری سے لوگوں کو متاثر کرکے زیادہ سے زیادہ مال حاصل کرنے کی کوشش کرتے ہیں۔ حضرت قتادہ (رضي الله عنه) فرماتے ہیں، غنیمت کی تقسیم کے وقت یہ سب سے زیادہ بخیل اور سب سے زیادہ برا حصہ لینے والے اور لڑائی کے وقت سب سے زیادہ بزدل اور ساتھیوں کو بےیارو مددگار چھوڑ کر بھاگ جانے والے ہیں۔\n(4) یادوسرا مفہوم ہے کہ خیر کا جذبہ بھی ان کےاندر نہیں ہے۔ یعنی مذکورہ خرابیوں اور کوتاہیوں کے ساتھ خیر اور بھلائی سے بھی وہ محروم ہیں۔\n(5) یعنی دل سے، بلکہ یہ منافق ہیں، کیوں کہ ان کے دل کفر وعناد سے بھرے ہوئے ہیں۔\n(6) اس لئے کہ وہ مشرک اور کافر ہیں اور کافر ومشرک کے اعمال باطل ہیں، جن پر کوئی اجر وثواب نہیں۔ یا أَحْبَطَ أَظْهَرَ کے معنی میں ہے، یعنی ان کے عملوں کے بطلان کو ظاہر کر دیا، اس لیے کہ ان کے اعمال ایسے ہیں ہی نہیں کہ وہ ثواب کے مقتضی ہوں اور اللہ ان کو باطل کر دے۔ (فتح القدیر)۔\n(7) ان کے اعمال کا برباد کر دینا، یا ان کا نفاق۔","lang":"ur","meta":{"transliteration":"ashiḥḥatan ʿalaykum fa-idhā jāa al-khawfu ra-aytahum yanẓurūna ilayka tadūru aʿyunuhum ka-alladhī yugh'shā ʿalayhi mina al-mawti fa-idhā dhahaba al-khawfu salaqūkum bi-alsinatin ḥidādin ashiḥḥatan ʿalā al-khayri ulāika lam yu'minū fa-aḥbaṭa al-lahu aʿmālahum wakāna dhālika ʿalā al-lahi yasīran ","translations":["Miserly","towards you","But when","comes","the fear","you see them","looking","at you","revolving","their eyes","like one who","faints","faints","from","[the] death","But when","departs","the fear","they smite you","with tongues","sharp","miserly","towards","the good","Those ","not","they have believed","so Allah made worthless","so Allah made worthless","their deeds","And is","that","for","Allah","easy","(19)"],"transliterationArr":["ashiḥḥatan","ʿalaykum","fa-idhā","jāa","al-khawfu","ra-aytahum","yanẓurūna","ilayka","tadūru","aʿyunuhum","ka-alladhī","yugh'shā","ʿalayhi","mina","al-mawti","fa-idhā","dhahaba","al-khawfu","salaqūkum","bi-alsinatin","ḥidādin","ashiḥḥatan","ʿalā","al-khayri","ulāika","lam","yu'minū","fa-aḥbaṭa","al-lahu","aʿmālahum","wakāna","dhālika","ʿalā","al-lahi","yasīran",null],"verseTiming":[[1,0,1180],[2,1180,2500],[3,2500,3220],[4,3220,4840],[5,4840,5650],[6,5650,6890],[7,6890,8520],[8,8520,9300],[9,9300,10070],[10,10070,11510],[11,11510,12250],[12,12250,13380],[13,13380,14370],[14,14370,15090],[15,15090,15910],[16,15910,16220],[17,16220,18250],[18,18250,19430],[19,19430,19940],[20,19940,20720],[21,20720,22760],[22,22760,24010],[23,24010,24980],[24,24980,26010],[25,26010,26410],[26,26410,28610],[27,28610,30810],[28,30810,31110],[29,31110,32040],[30,32040,32960],[31,32960,33780],[32,33780,35440],[33,35440,36130],[34,36130,36880],[35,36880,37260],[36,37260,38100],[37,38100,39405]]}},{"name":"33:20","price":"سمجھتے ہیں کہ اب تک لشکر چلے نہیں گئے(1) ، اور اگر فوجیں آجائیں تو تمنائیں کرتے ہیں کہ کاش! وه صحرا میں بادیہ نشینوں کے ساتھ ہوتے کہ تمہاری خبریں دریافت کیا کرتے(2)، اگر وه تم میں موجود ہوتے (تو بھی کیا؟) نہ لڑتے مگر برائے نام.(3)","arabic":"يَحۡسَبُونَ ٱلۡأَحۡزَابَ لَمۡ يَذۡهَبُواْۖ وَإِن يَأۡتِ ٱلۡأَحۡزَابُ يَوَدُّواْ لَوۡ أَنَّهُم بَادُونَ فِي ٱلۡأَعۡرَابِ يَسۡـَٔلُونَ عَنۡ أَنۢبَآئِكُمۡۖ وَلَوۡ كَانُواْ فِيكُم مَّا قَٰتَلُوٓاْ إِلَّا قَلِيلٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3553,"juzNumber":21,"footnotes":"(1) یعنی ان منافقین کی بزدلی، دوں ہمتی اور خوف ودہشت کا یہ حال ہے کہ کافروں کے گروہ اگرچہ ناکام ونامراد واپس جا چکے ہیں۔ لیکن یہ اب تک یہ سمجھ رہے ہیں کہ وہ ابھی تک اپنے مورچوں اور خیموں میں موجود ہیں۔\n(2) یعنی بالفرض اگر کفار کی ٹولیاں دوبارہ لڑائی کی نیت سے واپس آجائیں تو منافقین کی خواہش یہ ہوگی کہ وہ مدینہ شہر کے اندر رہنے کے بجائے، باہر صحرا میں بادیہ نشینوں کے ساتھ ہوں اور وہاں لوگوں سے تمہاری بابت پوچھتے رہیں کہ محمد (صلى الله عليه وسلم) اور اس کے ساتھی ہلاک ہوئے یا نہیں؟ یا لشکر کفار کامیاب رہا یا ناکام؟\n(3) محض عار کے ڈر سے یاہم وطنی کی حمیت کی وجہ سے۔ اس میں ان لوگوں کے لئے سخت وعید ہے جو جہاد سے گریز کرتے یا اس سے پیچھے رہتے ہیں۔","lang":"ur","meta":{"transliteration":"yaḥsabūna al-aḥzāba lam yadhhabū wa-in yati al-aḥzābu yawaddū law annahum bādūna fī al-aʿrābi yasalūna ʿan anbāikum walaw kānū fīkum mā qātalū illā qalīlan ","translations":["They think","the confederates","(have) not","withdrawn","And if","(should) come","the confederates","they would wish","if","that they (were)","living in (the) desert","among","the Bedouins","asking","about","your news","And if","they were","among you","not","they would fight","except","a little","(20)"],"transliterationArr":["yaḥsabūna","al-aḥzāba","lam","yadhhabū","wa-in","yati","al-aḥzābu","yawaddū","law","annahum","bādūna","fī","al-aʿrābi","yasalūna","ʿan","anbāikum","walaw","kānū","fīkum","mā","qātalū","illā","qalīlan",null],"verseTiming":[[1,0,1060],[2,1060,2240],[3,2240,2560],[4,2560,3620],[5,3620,5050],[6,5050,5600],[7,5600,6710],[8,6710,7660],[9,7660,8040],[10,8040,10650],[11,10650,11590],[12,11590,11810],[13,11810,13010],[14,13010,14080],[15,14080,14480],[16,14480,18560],[17,18560,19040],[18,19040,19790],[19,19790,20710],[20,20710,21580],[21,21580,23790],[22,23790,24430],[23,24430,26045]]}},{"name":"33:21","price":"یقیناً تمہارے لئے رسول اللہ میں عمده نمونہ (موجود) ہے(1) ، ہر اس شخص کے لئے جو اللہ تعالیٰ کی اور قیامت کے دن کی توقع رکھتا ہے اور بکثرت اللہ تعالیٰ کی یاد کرتا ہے.(2)","arabic":"لَّقَدۡ كَانَ لَكُمۡ فِي رَسُولِ ٱللَّهِ أُسۡوَةٌ حَسَنَةٞ لِّمَن كَانَ يَرۡجُواْ ٱللَّهَ وَٱلۡيَوۡمَ ٱلۡأٓخِرَ وَذَكَرَ ٱللَّهَ كَثِيرٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3554,"juzNumber":21,"footnotes":"(1) یعنی اے مسلمانو ! اور منافقو ! تم سب کے لئے رسول اللہ (صلى الله عليه وسلم) کی ذات کے اندر بہترین نمونہ ہے، پس تم جہاد میں اور صبر وثبات میں اسی کی پیروی کرو۔ ہمارا یہ پیغمبر جہاد میں بھوکا رہا حتیٰ کہ اسے پیٹ پر پتھر باندھنے پڑے، اس کا چہرہ زخمی ہو گیا، اس کا رباعی دانت ٹوٹ گیا، خندق اپنے ہاتھوں سے کھودی اور تقریباً ایک مہینہ دشمن کے سامنے سینہ سپر رہا۔ یہ آیت اگرچہ جنگ احزاب کے ضمن میں نازل ہوئی ہے جس میں جنگ کے موقعے پر بطور خاص رسول اللہ (صلى الله عليه وسلم) کے اسوۂ حسنہ کو سامنے رکھنے اور اس کی اقتدا کرنے کا حکم دیا گیا ہے۔ لیکن یہ حکم عام ہے یعنی آپ (صلى الله عليه وسلم) کے تمام اقوال، افعال اور احوال میں مسلمانوں کے لئے آپ (صلى الله عليه وسلم) کی اقتدا ضروری ہے چاہے ان کا تعلق عبادات سے ہو یا معاشرت سے، معیشت سے، یا سیاست سے، زندگی کے ہر شعبے میں آپ کی ہدایات واجب الاتباع ہیں۔ وَمَا آتَاكُمُ الرَّسُولُ فَخُذُوهُ الآية (الحشر) اور إِنْ كُنْتُمْ تُحِبُّونَ اللَّهَ الآية (آل عمران: 31) کا مفاد بھی یہی ہے۔\n(2) اس سے یہ واضح ہوگیا کہ اسوۂ رسول (صلى الله عليه وسلم) کو وہی اپنائے گا جو آخرت میں اللہ کی ملاقات پر یقین رکھتا اور کثرت سے اللہ کا ذکر کرتا ہے۔ آج مسلمان بھی بالعموم ان دونوں وصفوں سے محروم ہیں، اس لئے اسوۂ رسول (صلى الله عليه وسلم) کی بھی کوئی اہمیت ان کے دلوں میں نہیں ہے۔ ان میں جو اہل دین ہیں ان کے پیشوا، پیر اور مشائخ ہیں اور جو اہل دنیا واہل سیاست ہیں ان کے مرشد ورہنما آقایان مغرب ہیں۔ رسول اللہ (صلى الله عليه وسلم) سےعقیدت کے زبانی دعوے بڑے ہیں، لیکن آپ (صلى الله عليه وسلم) کو مرشد اور پیشوا ماننے کے لئے ان میں سے کوئی بھی آمادہ نہیں ہے۔ فَإِلَى اللهِ الْمُشْتَكَى۔","lang":"ur","meta":{"transliteration":"laqad kāna lakum fī rasūli al-lahi us'watun ḥasanatun liman kāna yarjū al-laha wal-yawma al-ākhira wadhakara al-laha kathīran ","translations":["Certainly","is","for you","in","(the) Messenger","(of) Allah","an excellent example","an excellent example","for (one) who","has","hope","(in) Allah","and the Day","the Last","and remembers","Allah","much","(21)"],"transliterationArr":["laqad","kāna","lakum","fī","rasūli","al-lahi","us'watun","ḥasanatun","liman","kāna","yarjū","al-laha","wal-yawma","al-ākhira","wadhakara","al-laha","kathīran",null],"verseTiming":[[1,0,600],[2,600,1140],[3,1140,1700],[4,1700,2090],[5,2090,2870],[6,2870,3590],[7,3590,4470],[8,4470,5260],[9,5260,6660],[10,6660,7240],[11,7240,8020],[12,8020,9890],[13,9890,11480],[14,11480,12050],[15,12050,12690],[16,12690,13500],[17,13500,14390],[18,14390,15440],[19,15440,16150],[20,16150,16870],[21,16870,18605]]}},{"name":"33:22","price":"اور ایمان والوں نے جب (کفار کے) لشکروں کو دیکھا (بے ساختہ) کہہ اٹھے! کہ انہیں کا وعده ہمیں اللہ تعالیٰ نے اور اس کے رسول نے دیا تھا اور اللہ تعالیٰ اور اس کے رسول نے سچ فرمایا(1) ، اور اس (چیز) نے ان کے ایمان میں اور شیوہٴ فرماں برداری میں اور اضافہ کر دیا.(2)","arabic":"وَلَمَّا رَءَا ٱلۡمُؤۡمِنُونَ ٱلۡأَحۡزَابَ قَالُواْ هَٰذَا مَا وَعَدَنَا ٱللَّهُ وَرَسُولُهُۥ وَصَدَقَ ٱللَّهُ وَرَسُولُهُۥۚ وَمَا زَادَهُمۡ إِلَّآ إِيمَٰنٗا وَتَسۡلِيمٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3555,"juzNumber":21,"footnotes":"(1) یعنی منافقین نے تو دشمن کی کثرت تعداد اور حالات کی سنگینی دیکھ کر کہا تھا کہ اللہ اور رسول ( (صلى الله عليه وسلم) ) کے وعدے فریب تھے، ان کے برعکس اہل ایمان نے کہا کہ اللہ اور رسول نے جو وعدہ کیا ہے کہ ابتلا وامتحان سے گزرنے کے بعد تمہیں فتح ونصرت سے ہمکنار کیا جائے گا، وہ سچا ہے۔\n(2) یعنی حالات کی شدت اور ہولناکی نےان کے ایمان کو متزلزل نہیں کیا، بلکہ ان کے ایمان میں جذبۂ اطاعت وانقیاد اور تسلیم ورضا میں مزید اضافہ کر دیا۔ اس میں اس بات کی دلیل ہے کہ لوگوں اور ان کے مختلف احوال کے اعتبار سے ایمان اور اس کی قوت میں کمی بیشی ہوتی ہے جیسا کہ محدثین کا مسلک ہے۔","lang":"ur","meta":{"transliteration":"walammā raā al-mu'minūna al-aḥzāba qālū hādhā mā waʿadanā al-lahu warasūluhu waṣadaqa al-lahu warasūluhu wamā zādahum illā īmānan wataslīman ","translations":["And when","saw","the believers","the confederates","they said","This","(is) what","Allah promised us","Allah promised us","and His Messenger","and Allah spoke the truth","and Allah spoke the truth","and His Messenger","And not","it increased them","except","(in) faith","and submission","(22)"],"transliterationArr":["walammā","raā","al-mu'minūna","al-aḥzāba","qālū","hādhā","mā","waʿadanā","al-lahu","warasūluhu","waṣadaqa","al-lahu","warasūluhu","wamā","zādahum","illā","īmānan","wataslīman",null],"verseTiming":[[1,0,1390],[2,1390,1840],[3,1840,3130],[4,3130,4330],[5,4330,5040],[6,5040,5860],[7,5860,6200],[8,6200,6980],[9,6980,7880],[10,7880,9240],[11,9240,9950],[12,9950,10750],[13,10750,11800],[14,11800,12850],[15,12850,13900],[16,13900,15940],[17,15940,17690],[18,17690,19755]]}},{"name":"33:23","price":"مومنوں میں (ایسے) لوگ بھی ہیں جنہوں نے جو عہد اللہ تعالیٰ سے کیا تھا انہیں سچا کر دکھایا(1) ، بعض نے تو اپنا عہد پورا کر(2) دیا اور بعض (موقعہ کے) منتظر ہیں اور انہوں نے کوئی تبدیلی نہیں کی.(3)","arabic":"مِّنَ ٱلۡمُؤۡمِنِينَ رِجَالٞ صَدَقُواْ مَا عَٰهَدُواْ ٱللَّهَ عَلَيۡهِۖ فَمِنۡهُم مَّن قَضَىٰ نَحۡبَهُۥ وَمِنۡهُم مَّن يَنتَظِرُۖ وَمَا بَدَّلُواْ تَبۡدِيلٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3556,"juzNumber":21,"footnotes":"- یہ آیت ان بعض صحابہ (رضي الله عنهم) کے بارے میں نازل ہوئی ہے، جنہوں نے اس موقع پر جاں نثاری کےعجیب وغریب جوہر دکھائے تھے اور انہیں میں وہ صحابہ (رضي الله عنهم) بھی شامل ہیں جو جنگ بدر میں شریک نہ ہو سکے تھے لیکن انہوں نے یہ عہد کر رکھا تھا کہ اب آئندہ کوئی معرکہ پیش آیا، تو جہاد میں بھرپور حصہ لیں گے، جیسے نضربن انس وغیرہ (رضي الله عنهم) ، جو بالآخر لڑتے ہوئے جنگ احد میں شہید ہوئے۔ ان کے جسم پر تلوار، نیزے اور تیروں کے 80 سے اوپر زخم تھے، شہادت کے بعد ان کی ہمشیرہ نے انہیں ان کی انگلی کے پورے سے پہچانا، (مسند احمد،ج۔4، ص - 193)۔\n(2) نَحْبٌ کی معنی عہد، نذر اور موت کے کیے گئے ہیں، مطلب ہے کہ ان صادقین میں سے کچھ نے تو اپنا عہد یا نذر پوری کرتے ہوئے جام شہادت نوش کر لیا ہے۔\n(3) اور دوسرے وہ ہیں جو ابھی تک عروس شہادت سے ہمکنار نہیں ہوئے ہیں تاہم اس کے شوق میں شریک جہاد ہوتے ہیں اور شہادت کی سعادت کے آرزو مند ہیں، اپنی اس نذر یا عہد میں انہوں نے تبدیلی نہیں کی۔","lang":"ur","meta":{"transliteration":"mina al-mu'minīna rijālun ṣadaqū mā ʿāhadū al-laha ʿalayhi famin'hum man qaḍā naḥbahu wamin'hum man yantaẓiru wamā baddalū tabdīlan ","translations":["Among","the believers","(are) men","(who) have been true","(to) what","they promised Allah","they promised Allah","[on it]","And among them","(is he) who","has fulfilled","his vow","and among them","(is he) who","awaits","And not","they alter","(by) any alteration ","(23)"],"transliterationArr":["mina","al-mu'minīna","rijālun","ṣadaqū","mā","ʿāhadū","al-laha","ʿalayhi","famin'hum","man","qaḍā","naḥbahu","wamin'hum","man","yantaẓiru","wamā","baddalū","tabdīlan",null],"verseTiming":[[1,0,410],[2,410,1730],[3,1730,3290],[4,3290,4100],[5,4100,4480],[6,4480,5260],[7,5260,6020],[8,6020,8120],[9,8120,8930],[10,8930,10610],[11,10610,11170],[12,11170,12170],[13,12170,12910],[14,12910,13770],[15,13770,16150],[16,16150,17220],[17,17220,18100],[18,18100,19775]]}},{"name":"33:24","price":"تاکہ اللہ تعالیٰ سچوں کو ان کی سچائی کا بدلہ دے اور اگر چاہے تو منافقوں کو سزا دے یا ان کی توبہ قبول فرمائے(1) ، اللہ تعالیٰ بڑا ہی بخشنے واﻻ بہت ہی مہربان ہے.","arabic":"لِّيَجۡزِيَ ٱللَّهُ ٱلصَّٰدِقِينَ بِصِدۡقِهِمۡ وَيُعَذِّبَ ٱلۡمُنَٰفِقِينَ إِن شَآءَ أَوۡ يَتُوبَ عَلَيۡهِمۡۚ إِنَّ ٱللَّهَ كَانَ غَفُورٗا رَّحِيمٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3557,"juzNumber":21,"footnotes":"(1) یعنی انہیں قبول اسلام کی توفیق دے دے۔","lang":"ur","meta":{"transliteration":"liyajziya al-lahu al-ṣādiqīna biṣid'qihim wayuʿadhiba al-munāfiqīna in shāa aw yatūba ʿalayhim inna al-laha kāna ghafūran raḥīman ","translations":["That Allah may reward","That Allah may reward","the truthful","for their truth","and punish","the hypocrites","if","He wills","or","turn in mercy","to them","Indeed","Allah","is","Oft-Forgiving","Most Merciful","(24)"],"transliterationArr":["liyajziya","al-lahu","al-ṣādiqīna","biṣid'qihim","wayuʿadhiba","al-munāfiqīna","in","shāa","aw","yatūba","ʿalayhim","inna","al-laha","kāna","ghafūran","raḥīman",null],"verseTiming":[[1,0,1010],[2,1010,1710],[3,1710,3030],[4,3030,4190],[5,4190,5230],[6,5230,6740],[7,6740,7830],[8,7830,10220],[9,10220,10540],[10,10540,11320],[11,11320,12670],[12,12670,14020],[13,14020,14820],[14,14820,15400],[15,15400,16140],[16,16140,17815]]}},{"name":"33:25","price":"اور اللہ تعالیٰ نےکافروں کو غصے بھرے ہوئے ہی (نامراد) لوٹا دیا انہوں نے کوئی فائده نہیں پایا(1) ، اور اس جنگ میں اللہ تعالیٰ خود ہی مومنوں کو کافی ہوگیا(2) اللہ تعالیٰ بڑی قوتوں واﻻ اور غالب ہے.","arabic":"وَرَدَّ ٱللَّهُ ٱلَّذِينَ كَفَرُواْ بِغَيۡظِهِمۡ لَمۡ يَنَالُواْ خَيۡرٗاۚ وَكَفَى ٱللَّهُ ٱلۡمُؤۡمِنِينَ ٱلۡقِتَالَۚ وَكَانَ ٱللَّهُ قَوِيًّا عَزِيزٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3558,"juzNumber":21,"footnotes":"(1) یعنی مشرک جو مختلف جہات سے جمع ہو کرآئے تھے تاکہ مسلمانوں کا نشان مٹا دیں۔ اللہ نے انہیں اپنے غیظ وغضب سمیت واپس لوٹا دیا۔ نہ دنیا کا مال ومتاع ان کے ہاتھ لگا اور نہ آخرت میں وہ اجر وثواب کے مستحق ہوں گے، کسی بھی قسم کی خیر انہیں حاصل نہیں ہوئی۔\n(2) یعنی مسلمانوں کو ان سے لڑنے کی ضرورت ہی پیش نہیں آئی، بلکہ اللہ تعالیٰ نے ہوا اور فرشتوں کے ذریعے سے اپنے مومن بندوں کی مدد کا سامان بہم پہنچا دیا۔ اسی لئے نبی (صلى الله عليه وسلم) نے فرمایا «لا إِلهَ إِلا اللهُ وَحْدَهُ ، صَدَقَ وَعْدَهُ ، وَنَصَرَ عَبْدَهُ، وَهَزَمَ الأَحْزَابَ وَحْدَهُ ، فَلا شَيْءَ بَعْدَهُ» (صحيح بخاري ، كتاب العمرة ، باب ما يقول إذا رجع من الحج أو العمرة أو الغزو - مسلم باب ما يقول إذا قفل من سفر الحج وغيره) ”ایک اللہ کے سوا کوئی معبود نہیں، اس نے اپنا وعدہ سچ کردکھایا، اپنے بندے کی مدد کی، اپنے لشکر کو سرخرو کیا، اور تمام گروہوں کو اکیلے اس نے ہی شکست دے دی، اس کے بعد کوئی شے نہیں“ یہ دعا حج، عمرہ، جہاد اور سفر سے واپسی پر بھی پڑھنی چاہئے۔","lang":"ur","meta":{"transliteration":"waradda al-lahu alladhīna kafarū bighayẓihim lam yanālū khayran wakafā al-lahu al-mu'minīna al-qitāla wakāna al-lahu qawiyyan ʿazīzan ","translations":["And Allah turned back","And Allah turned back","those who","disbelieved","in their rage","not","they obtained","any good","And sufficient is","Allah","(for) the believers","(in) the battle","and Allah is","and Allah is","All-Strong","All-Mighty","(25)"],"transliterationArr":["waradda","al-lahu","alladhīna","kafarū","bighayẓihim","lam","yanālū","khayran","wakafā","al-lahu","al-mu'minīna","al-qitāla","wakāna","al-lahu","qawiyyan","ʿazīzan",null],"verseTiming":[[1,0,830],[2,830,1530],[3,1530,2530],[4,2530,3300],[5,3300,4400],[6,4400,4790],[7,4790,5740],[8,5740,7090],[9,7090,7660],[10,7660,8370],[11,8370,9670],[12,9670,11220],[13,11220,12330],[14,12330,13150],[15,13150,14050],[16,14050,15255]]}},{"name":"33:26","price":"اور جن اہل کتاب نے ان سے سازباز کر لی تھی انہیں (بھی) اللہ تعالیٰ نے ان کے قلعوں سے نکال دیا اور ان کے دلوں میں (بھی) رعب بھر دیا کہ تم ان کے ایک گروه کو قتل کر رہے ہو اور ایک گروه کو قیدی بنا رہے ہو.","arabic":"وَأَنزَلَ ٱلَّذِينَ ظَٰهَرُوهُم مِّنۡ أَهۡلِ ٱلۡكِتَٰبِ مِن صَيَاصِيهِمۡ وَقَذَفَ فِي قُلُوبِهِمُ ٱلرُّعۡبَ فَرِيقٗا تَقۡتُلُونَ وَتَأۡسِرُونَ فَرِيقٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3559,"juzNumber":21,"footnotes":"","lang":"ur","meta":{"transliteration":"wa-anzala alladhīna ẓāharūhum min ahli al-kitābi min ṣayāṣīhim waqadhafa fī qulūbihimu al-ruʿ'ba farīqan taqtulūna watasirūna farīqan ","translations":["And He brought down","those who","backed them","among","(the) People","(of) the Scripture","from","their fortresses","and cast","into","their hearts","[the] terror","a group","you killed","and you took captive","a group","(26)"],"transliterationArr":["wa-anzala","alladhīna","ẓāharūhum","min","ahli","al-kitābi","min","ṣayāṣīhim","waqadhafa","fī","qulūbihimu","al-ruʿ'ba","farīqan","taqtulūna","watasirūna","farīqan",null],"verseTiming":[[1,0,1760],[2,1760,2730],[3,2730,4250],[4,4250,5080],[5,5080,5600],[6,5600,6570],[7,6570,7020],[8,7020,9090],[9,9090,9870],[10,9870,10150],[11,10150,11270],[12,11270,12540],[13,12540,13340],[14,13340,13620],[15,13620,14840],[16,14840,15680],[17,15680,17270],[18,17270,18690],[19,18690,19990],[20,19990,21555]]}},{"name":"33:27","price":"اور اس نے تمہیں ان کی زمینوں کا اور ان کے گھر بار کا اور ان کے مال کا وارث کر دیا(1) اور اس زمین کا بھی جس کو تمہارے قدموں نے روندا نہیں(2)، اللہ تعالیٰ ہر چیز پر قادر ہے.","arabic":"وَأَوۡرَثَكُمۡ أَرۡضَهُمۡ وَدِيَٰرَهُمۡ وَأَمۡوَٰلَهُمۡ وَأَرۡضٗا لَّمۡ تَطَـُٔوهَاۚ وَكَانَ ٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3560,"juzNumber":21,"footnotes":"(1) اس میں غزوۂ بنی قریظہ کا ذکر ہے جیسا کہ پہلے گزرا کہ اس قبیلے نے نقض عہد کرکے جنگ احزاب میں مشرکوں اور دوسرے یہودیوں کا ساتھ دیا تھا۔ چنانچہ جنگ احزاب سے واپس آکر رسول اللہ (صلى الله عليه وسلم) ابھی غسل ہی فرما سکے تھے کہ حضرت جبرائیل (عليه السلام) آگئے اور کہا کہ آپ (صلى الله عليه وسلم) نے ہتھیار رکھ دیے؟ ہم فرشتوں نے تو نہیں رکھے ہیں۔ چلئے، اب بنو قریظہ کے ساتھ نمٹنا ہے، مجھے اللہ نے اسی لئے آپ (صلى الله عليه وسلم) کی طرف بھیجا ہے۔ چنانچہ آپ نے مسلمانوں میں اعلان فرما دیا بلکہ ان کو تاکید کر دی کہ عصر کی نماز وہاں جا کر پڑھنی ہے۔ ان کی آبادی مدینے سے چند میل کے فاصلے پر تھی۔ یہ اپنے قلعوں میں بند ہو گئے، باہر سے مسلمانوں نے ان کا محاصرہ کر لیا جو کم وبیش پچیس روز جاری رہا۔ بالآخر انہوں نے سعد بن معاذ (رضي الله عنه) کو اپنا حکم (ثالث) تسلیم کر لیا کہ وہ جو فیصلہ بابت دیں گے، ہمیں منظور ہوگا۔ چنانچہ انہوں نے یہ فیصلہ دیا کہ ان سے لڑنے والے لوگوں کو قتل اور بچوں، عورتوں کو قیدی بنا لیا جائے اور ان کا مال مسلمانوں میں تقسیم کر دیا جائے۔ نبی (صلى الله عليه وسلم) نے یہ فیصلہ سن کر فرمایا کہ یہی فیصلہ آسمانوں کے اوپر االلہ تعالیٰ کا بھی ہے۔ اس کے مطابق ان کے جنگ جو افراد کی گردنیں اڑا دی گئیں۔ اور مدینے کو ان کے ناپاک وجود سے پاک کر دیا گیا۔ (دیکھئے صحیح بخاری، باب غزوۂ خندق) أَنْزَلَ قلعوں سے نیچے اتار دیا، ظَاهَرُوهُمْ کافروں کی انہوں نے مدد کی۔\n(2) بعض نے اس سے خیبر کی زمین مراد لی ہے کیونکہ اس کے بعد ہی 6 ہجری میں صلح حدیبیہ کے بعد مسلمانوں نے خیبر فتح کیا ہے۔ بعض نے کہا کہ مکہ ہے اور بعض نے ارض فارس وروم کو اس کا مصداق قرار دیا ہے اور بعض کے نزدیک تمام وہ زمینیں ہیں جو قیامت تک مسلمان فتح کریں گے۔ (فتح القدیر)۔","lang":"ur","meta":{"transliteration":"wa-awrathakum arḍahum wadiyārahum wa-amwālahum wa-arḍan lam taṭaūhā wakāna al-lahu ʿalā kulli shayin qadīran ","translations":["And He caused you to inherit","their land","and their houses","and their properties","and a land","not","you (had) trodden","And Allah is","And Allah is","on","every","thing","All-Powerful","(27)"],"transliterationArr":["wa-awrathakum","arḍahum","wadiyārahum","wa-amwālahum","wa-arḍan","lam","taṭaūhā","wakāna","al-lahu","ʿalā","kulli","shayin","qadīran",null],"verseTiming":[[1,0,1380],[2,1380,2360],[3,2360,3810],[4,3810,5280],[5,5280,6250],[6,6250,6600],[7,6600,7860],[8,7860,8940],[9,8940,9840],[10,9840,10440],[11,10440,11080],[12,11080,12610],[13,12610,14595]]}},{"name":"33:28","price":"اے نبی! اپنی بیویوں سے کہہ دو کہ اگر تم زندگانی دنیا اور زینت دنیا چاہتی ہو تو آؤ میں تمہیں کچھ دے دﻻ دوں اور تمہیں اچھائی کے ساتھ رخصت کر دوں.","arabic":"يَٰٓأَيُّهَا ٱلنَّبِيُّ قُل لِّأَزۡوَٰجِكَ إِن كُنتُنَّ تُرِدۡنَ ٱلۡحَيَوٰةَ ٱلدُّنۡيَا وَزِينَتَهَا فَتَعَالَيۡنَ أُمَتِّعۡكُنَّ وَأُسَرِّحۡكُنَّ سَرَاحٗا جَمِيلٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3561,"juzNumber":21,"footnotes":"","lang":"ur","meta":{"transliteration":"yāayyuhā al-nabiyu qul li-azwājika in kuntunna turid'na al-ḥayata al-dun'yā wazīnatahā fataʿālayna umattiʿ'kunna wa-usarriḥ'kunna sarāḥan jamīlan ","translations":["O Prophet","O Prophet","Say","to your wives","If","you","desire","the life","(of) the world","and its adornment","then come","I will provide for you","and release you","(with) a release","good","(28)"],"transliterationArr":["yāayyuhā","al-nabiyu","qul","li-azwājika","in","kuntunna","turid'na","al-ḥayata","al-dun'yā","wazīnatahā","fataʿālayna","umattiʿ'kunna","wa-usarriḥ'kunna","sarāḥan","jamīlan",null],"verseTiming":[[1,0,2440],[2,2440,4080],[3,4080,4390],[4,4390,5800],[5,5800,6820],[6,6820,9420],[7,9420,10180],[8,10180,11090],[9,11090,12110],[10,12110,13400],[11,13400,14760],[12,14760,16180],[13,16180,17480],[14,17480,19940],[15,19940,22340],[16,22340,23860],[17,23860,25455]]}},{"name":"33:29","price":"اور اگر تمہاری مراد اللہ اور اس کا رسول اور آخرت کا گھر ہے تو (یقین مانو کہ) تم میں سے نیک کام کرنے والیوں کے لئے اللہ تعالیٰ نے بہت زبردست اجر رکھ چھوڑے ہیں.(1)","arabic":"وَإِن كُنتُنَّ تُرِدۡنَ ٱللَّهَ وَرَسُولَهُۥ وَٱلدَّارَ ٱلۡأٓخِرَةَ فَإِنَّ ٱللَّهَ أَعَدَّ لِلۡمُحۡسِنَٰتِ مِنكُنَّ أَجۡرًا عَظِيمٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3562,"juzNumber":21,"footnotes":"(1) فتوحات کے نتیجے میں جب مسلمانوں کی حالت پہلے کی نسبت کچھ بہتر ہوگئی تو انصار ومہاجرین کی عورتوں کو دیکھ کر ازواج مطہرات نے بھی نان نفقہ میں اضافہ کا مطالبہ کر دیا۔ نبی (صلى الله عليه وسلم) چونکہ نہایت سادگی پسند تھے، اس لئے ازواج مطہرات کے اس مطالبے پر سخت کبیدہ خاطر ہوئے اور بیویوں سے علیحدگی اختیار کر لی جو ایک مہینے تک جاری رہی بالآخر اللہ تعالیٰ نے یہ آیت نازل فرما دی۔ اس کے بعد سب سے پہلے آپ نے حضرت عائشہ (رضی الله عنها) کو یہ آیت سنا کر انہیں اختیار دیا تاہم انہیں کہا کہ اپنے طور پر فیصلہ کرنے کے بجائے اپنے والدین سے مشورے کے بعد کوئی اقدام کرنا۔ حضرت عائشہ (رضی الله عنها) نے فرمایا۔ یہ کیسے ہو سکتا ہے کہ میں آپ کے بارے میں مشورہ کروں؟ بلکہ میں اللہ اور رسول (صلى الله عليه وسلم) کو پسند کرتی ہوں . یہی بات دیگر ازواج مطہرات (رضي الله عنه) ن نے بھی کہی اور کسی نے بھی رسول اللہ (صلى الله عليه وسلم) کو چھوڑ کر دنیا کی عیش وآرام کو ترجیح نہیں دی (صحیح بخاری، تفسیر سورۃ الاحزاب) اس وقت آپ (صلى الله عليه وسلم) کے حبالۂ عقد میں 9 بیویاں تھیں، پانچ قریش میں سے تھیں۔ حضرت عائشہ، حفصہ، ام حبیبہ، سودہ اور ام سلمہ۔ (رضي الله عنه) ن اور چار ان کے علاوہ، یعنی حضرت صفیہ، میمونہ، زینب اور جویریہ تھیں۔ (رضي الله عنهن)۔ بعض لوگ مرد کی طرف سے اختیار علیحدگی کو طلاق قرار دیتے ہیں، لیکن یہ بات صحیح نہیں۔ صحیح بات یہ ہے کہ اختیار علیحدگی کے بعد اگر عورت علیحدگی کو پسند کر لے، پھر تو یقیناً طلاق ہوجائے گی (اور یہ طلاق بھی رجعی ہوگی نہ کہ بائنہ، جیسا کہ بعض علما کا مسلک ہے) تاہم اگر عورت علیحدگی کو اختیار نہیں کرتی تو پھر طلاق نہیں ہوگی، جیسے ازواج مطہرات (رضي الله عنه) ن نے علیحدگی کے بجائے حرم رسول (صلى الله عليه وسلم) میں ہی رہنا پسند کیا تو اس اختیار کو طلاق شمار نہیں کیا گیا۔ (صحيح بخاري ، كتاب الطلاق ، باب من خير نساءه ، مسلم باب بيان أن تخيير امرأته لا يكون طلاقا إلا بالنية)۔","lang":"ur","meta":{"transliteration":"wa-in kuntunna turid'na al-laha warasūlahu wal-dāra al-ākhirata fa-inna al-laha aʿadda lil'muḥ'sināti minkunna ajran ʿaẓīman ","translations":["But if","you","desire","Allah","and His Messenger","and the Home","(of) the Hereafter","then indeed","Allah","has prepared","for the good-doers","among you","a reward","great","(29)"],"transliterationArr":["wa-in","kuntunna","turid'na","al-laha","warasūlahu","wal-dāra","al-ākhirata","fa-inna","al-laha","aʿadda","lil'muḥ'sināti","minkunna","ajran","ʿaẓīman",null],"verseTiming":[[1,0,1340],[2,1340,3370],[3,3370,4030],[4,4030,4880],[5,4880,6290],[6,6290,7160],[7,7160,8370],[8,8370,9530],[9,9530,10360],[10,10360,11070],[11,11070,12630],[12,12630,14530],[13,14530,15210],[14,15210,16795]]}},{"name":"33:30","price":"اے نبی کی بیویو! تم میں سے جو بھی کھلی بے حیائی (کا ارتکاب) کرے گی اسے دوہرا دوہرا عذاب دیا جائے گا(1) ، اور اللہ تعالیٰ کے نزدیک یہ بہت ہی سہل (سی بات) ہے.","arabic":"يَٰنِسَآءَ ٱلنَّبِيِّ مَن يَأۡتِ مِنكُنَّ بِفَٰحِشَةٖ مُّبَيِّنَةٖ يُضَٰعَفۡ لَهَا ٱلۡعَذَابُ ضِعۡفَيۡنِۚ وَكَانَ ذَٰلِكَ عَلَى ٱللَّهِ يَسِيرٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3563,"juzNumber":21,"footnotes":"(1) قرآن میں الْفَاحِشَةُ (مُعَرَّفٌ بِاللامِ) کو زنا کے معنی میں استعمال کیا گیا ہے لیکن فَاحِشَةٌ (نکرہ) کو برائی کے لئے، جیسے یہاں ہے۔ یہاں اس کے معنی بداخلاقی اور نامناسب رویے کے ہیں۔ کیونکہ نبی (صلى الله عليه وسلم) کے ساتھ بداخلاقی اور نامناسب رویہ، آپ (صلى الله عليه وسلم) کو ایذا پہنچانا ہے جس کا ارتکاب کفر ہے۔ علاوہ ازیں ازواج مطہرات (رضي الله عنه) ن خود بھی مقام بلند کی حامل تھیں اور بلند مرتبت لوگوں کی معمولی غلطیاں بھی بڑی شمار ہوتی ہیں، اس لئے انہیں دوگنے عذاب کی وعید سنائی گئی ہے۔","lang":"ur","meta":{"transliteration":"yānisāa al-nabiyi man yati minkunna bifāḥishatin mubayyinatin yuḍāʿaf lahā al-ʿadhābu ḍiʿ'fayni wakāna dhālika ʿalā al-lahi yasīran ","translations":["O wives","(of) the Prophet","Whoever","commits","from you","immorality","clear","will be doubled","for her","the punishment","two fold","And that is","And that is","for","Allah","easy","(30)"],"transliterationArr":["yānisāa","al-nabiyi","man","yati","minkunna","bifāḥishatin","mubayyinatin","yuḍāʿaf","lahā","al-ʿadhābu","ḍiʿ'fayni","wakāna","dhālika","ʿalā","al-lahi","yasīran",null],"verseTiming":[[1,0,2560],[2,2560,4150],[3,4150,4450],[4,4450,5720],[5,5720,7840],[6,7840,9010],[7,9010,11130],[8,11130,12450],[9,12450,12850],[10,12850,13840],[11,13840,14840],[12,14840,17040],[13,17040,17840],[14,17840,18100],[15,18100,18960],[16,18960,20295]]}},{"name":"33:31","price":"اور تم میں سے جو کوئی اللہ کی اور اس کے رسول کی فرمانبرداری کرے گی اور نیک کام کرے گی ہم اسے اجر (بھی) دوہرا دیں گے(1) اور اس کے لئے ہم نے بہترین روزی تیار کر رکھی ہے.","arabic":"۞ وَمَن يَقۡنُتۡ مِنكُنَّ لِلَّهِ وَرَسُولِهِۦ وَتَعۡمَلۡ صَٰلِحٗا نُّؤۡتِهَآ أَجۡرَهَا مَرَّتَيۡنِ وَأَعۡتَدۡنَا لَهَا رِزۡقٗا كَرِيمٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3564,"juzNumber":22,"footnotes":"- یعنی جس طرح گناہ کا وبال دگنا ہوگا، نیکیوں کا اجر بھی دوہرا ہوگا۔ جس طرح نبی کریم (صلى الله عليه وسلم) کو اللہ تعالیٰ نے فرمایا إِذًا لأَذَقْنَاكَ ضِعْفَ الْحَيَاةِ وَضِعْفَ الْمَمَاتِ (بني إسرائيل۔75) (پھر تو ہم بھی آپ کو دوہرا عذاب دنیا کا کرتے اور دوہرا ہی موت کاﹿ۔","lang":"ur","meta":{"transliteration":"waman yaqnut minkunna lillahi warasūlihi wataʿmal ṣāliḥan nu'tihā ajrahā marratayni wa-aʿtadnā lahā riz'qan karīman ","translations":["And whoever","is obedient","among you","to Allah","and His Messenger","and does","righteousness","We will give her","her reward","twice","and We have prepared","for her","a provision","noble","(31)"],"transliterationArr":["waman","yaqnut","minkunna","lillahi","warasūlihi","wataʿmal","ṣāliḥan","nu'tihā","ajrahā","marratayni","wa-aʿtadnā","lahā","riz'qan","karīman",null],"verseTiming":[[1,0,490],[2,490,1900],[3,1900,4990],[4,4990,6030],[5,6030,7380],[6,7380,8350],[7,8350,9310],[8,9310,12030],[9,12030,13070],[10,13070,14230],[11,14230,18050],[12,18050,19020],[13,19020,20220],[14,20220,21490],[15,21490,22200],[16,22200,23780],[17,23780,25175]]}},{"name":"33:32","price":"اے نبی کی بیویو! تم عام عورتوں کی طرح نہیں ہو(1) ، اگر تم پرہیزگاری اختیار کرو تو نرم لہجے سے بات نہ کرو کہ جس کے دل میں روگ ہو وه کوئی برا خیال کرے(2) اور ہاں قاعدے کے مطابق کلام کرو.(3)","arabic":"يَٰنِسَآءَ ٱلنَّبِيِّ لَسۡتُنَّ كَأَحَدٖ مِّنَ ٱلنِّسَآءِ إِنِ ٱتَّقَيۡتُنَّۚ فَلَا تَخۡضَعۡنَ بِٱلۡقَوۡلِ فَيَطۡمَعَ ٱلَّذِي فِي قَلۡبِهِۦ مَرَضٞ وَقُلۡنَ قَوۡلٗا مَّعۡرُوفٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3565,"juzNumber":22,"footnotes":"(1) یعنی تمہاری حیثیت اور مرتبہ عام عورتوں کا سا نہیں ہے۔ بلکہ اللہ نے تمہیں رسول اللہ (صلى الله عليه وسلم) کی زوجیت کا جو شرف عطا فرمایا ہے، اس کی وجہ سے تمہیں ایک امتیازی مقام حاصل ہے اور رسول (صلى الله عليه وسلم) کی طرح تمہیں بھی امت کے لئے ایک نمونہ بننا ہے چنانچہ انہیں ان کے مقام و مرتبے سے آگاہ کرکے انہیں کچھ ہدایات دی جا رہی ہیں۔ اس کی مخاطب اگرچہ ازواج مطہرات ہیں جنہیں امہات المومنین قرار دیا گیا ہے، لیکن انداز بیان سے صاف ظاہر ہے کہ مقصد پوری امت مسلمہ کی عورتوں کو سمجھانا اور متنبہ کرنا ہے۔ اس لئے یہ ہدایات تمام مسلمان عورتوں کے لئے ہیں۔\n(2) اللہ تعالیٰ نے جس طرح عورت کے وجود کے اندر مرد کے لئے جنسی کشش رکھی ہے (جس کی حفاظت کے لئے بھی خصوصی ہدایات دی گئی ہیں تاکہ عورت مرد کے لئے فتنے کا باعث نہ بنے) اسی طرح اللہ تعالیٰ نے عورتوں کی آواز میں بھی فطری طور پر دلکشی، نرمی اور نزاکت رکھی ہے جو مرد کو اپنی طرف کھیچنتی ہے۔ بنابریں اس آواز کے لئے بھی یہ ہدایت دی گئی کہ مردوں سے گفتگو کرتے وقت قصداً ایسا لب و لہجہ اختیار کرو کہ نرمی اور لطافت کی جگہ قدرے سختی اور روکھا پن ہو۔ تاکہ کوئی بدباطن تمہاری طرف مائل نہ ہو اور اس کے دل میں برا خیال پیدا نہ ہو۔\n(3) یعنی یہ روکھاپن، صرف لہجے کی حد تک ہی ہو، زبان سے ایسا لفظ نہ نکالنا جو معروف قاعدے اور اخلاق کے منافی ہو۔ إِنِ اتَّقَيْتُنَّ کہہ کر اشارہ کردیا کہ یہ بات اور دیگر ہدایات، جو آگے آ رہی ہیں، متقی عورتوں کے لئے ہیں، کیونکہ انہیں ہی یہ فکر ہوتی ہے کہ ان کی آخرت برباد نہ ہوجائے۔ جن کے دل خوف الٰہی سے عاری ہیں، انہیں ان ہدایات سے کیا تعلق؟ اور وہ کب ان ہدایات کی پروا کرتی ہیں؟","lang":"ur","meta":{"transliteration":"yānisāa al-nabiyi lastunna ka-aḥadin mina al-nisāi ini ittaqaytunna falā takhḍaʿna bil-qawli fayaṭmaʿa alladhī fī qalbihi maraḍun waqul'na qawlan maʿrūfan ","translations":["O wives","(of) the Prophet","You are not","like anyone","among","the women","If","you fear (Allah)","then (do) not","be soft","in speech","lest should be moved with desire","he who","in","his heart","(is) a disease","but say","a word","appropriate","(32)"],"transliterationArr":["yānisāa","al-nabiyi","lastunna","ka-aḥadin","mina","al-nisāi","ini","ittaqaytunna","falā","takhḍaʿna","bil-qawli","fayaṭmaʿa","alladhī","fī","qalbihi","maraḍun","waqul'na","qawlan","maʿrūfan",null],"verseTiming":[[1,0,2800],[2,2800,4550],[3,4550,5970],[4,5970,6650],[5,6650,7620],[6,7620,11200],[7,11200,11600],[8,11600,13380],[9,13380,13940],[10,13940,14970],[11,14970,15910],[12,15910,16860],[13,16860,17630],[14,17630,18020],[15,18020,19000],[16,19000,20410],[17,20410,21120],[18,21120,21750],[19,21750,24245]]}},{"name":"33:33","price":"اور اپنے گھروں میں قرار سے رہو(1) اور قدیم جاہلیت کے زمانے کی طرح اپنے بناؤ کا اﻇہار نہ کرو(2) اور نماز ادا کرتی رہو اور زکوٰة دیتی رہو اور اللہ اور اس کے رسول کی اطاعت گزاری کرو(3)۔ اللہ تعالیٰ یہی چاہتا ہے کہ اے نبی کی گھر والیو(4)! تم سے وه (ہر قسم کی) گندگی کو دور کردے اور تمہیں خوب پاک کردے.","arabic":"وَقَرۡنَ فِي بُيُوتِكُنَّ وَلَا تَبَرَّجۡنَ تَبَرُّجَ ٱلۡجَٰهِلِيَّةِ ٱلۡأُولَىٰۖ وَأَقِمۡنَ ٱلصَّلَوٰةَ وَءَاتِينَ ٱلزَّكَوٰةَ وَأَطِعۡنَ ٱللَّهَ وَرَسُولَهُۥٓۚ إِنَّمَا يُرِيدُ ٱللَّهُ لِيُذۡهِبَ عَنكُمُ ٱلرِّجۡسَ أَهۡلَ ٱلۡبَيۡتِ وَيُطَهِّرَكُمۡ تَطۡهِيرٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3566,"juzNumber":22,"footnotes":"(1) یعنی ٹک کر رہو اور بغیر ضروری حاجت کے گھر سے باہر نہ نکلو۔ اس میں وضاحت کردی گئی ہے کہ عورت کا دائرہ عمل امور سیاست وجہاں بانی نہیں، معاشی جھمیلے بھی نہیں، بلکہ گھر کی چاردیواری کے اندر رہ کر امور خانہ داری سرانجام دینا ہے۔\n(2) اس میں گھر سے باہر نکلنے کے آداب بتلا دیئے کہ اگر باہر جانے کی ضرورت پیش آئے تو بناؤ سنگھار کرکے یا ایسے انداز سے، جس سے تمہارا بناؤ سنگھار ظاہر ہو، مت نکلو۔ جیسے بےپردہ ہو کر، جس سے تمہارا سر، چہرہ، بازو اور چھاتی وغیرہ لوگوں کو دعوت نظارہ دے۔ بلکہ بغیر خوشبو لگائے، سادہ لباس میں ملبوس اور باپردہ باہر نکلو تَبَرُّجٌ بےپردگی اور زیب وزینت کے اظہار کو کہتے ہیں۔ قرآن نے واضح کردیا ہے کہ یہ تبرج، جاہلیت ہے، جو اسلام سے پہلے تھی اور آئندہ بھی، جب کبھی اسے اختیار کیا جائے گا، یہ جاہلیت ہی ہوگی، اسلام سے اس کا کوئی تعلق نہیں ہے، چاہے اس کا نام کتنا ہی خوش نما، دل فریب رکھ لیا جائے۔\n(3) پچھلی ہدایات، برائی سے اجتناب سے متعلق تھیں، یہ ہدایات نیکی اختیار کرنے سے متعلق ہیں۔\n(4) اہل بیت سے کون مراد ہیں؟ اس کی تعیین میں کچھ اختلاف ہے۔ بعض نے ازواج مطہرات کو مراد لیا ہے، جیسا کہ یہاں قرآن کریم کے سیاق سے واضح ہے۔ قرآن نے یہاں ازواج مطہرات ہی کو اہل البیت کہا ہے۔ قرآن کے دوسرے مقامات پر بھی بیوی کو اہل بیت کہا گیا ہے۔ مثلاً سورۂ ھود، آیت 73 میں۔ اس لئے ازواج مطہرات کا اہل بیت ہونا نص قرآنی سے واضح ہے۔ بعض حضرات، بعض روایات کی رو سے اہل بیت کا مصداق صرف حضرت علی، حضرت فاطمہ اور حضرت حسن وحسین (رضي الله عنهم) کو مانتے ہیں اور ازواج مطہرات کو اس سے خارج سمجھتے ہیں، جب کہ اول الذکر، ان اصحاب اربعہ کو اس سے خارج سمجھتے ہیں۔ تاہم اعتدال کی راہ اور نقطہ متوسط یہ ہے کہ دونوں ہی اہل بیت ہیں۔ ازواج مطہرات تو اس نص قرانی کی وجہ سے اور داماد واولاد ان روایات کی رو سے جو صحیح سند سے ثابت ہیں جن میں نبی کریم (صلى الله عليه وسلم) نے ان کو اپنی چادر میں لے کر فرمایا کہ اے اللہ یہ میرے اہل بیت ہیں، جس کا مطلب یہ ہوگا کہ یہ بھی میرے اہل بیت سے ہیں یا یہ دعا ہے کہ یا اللہ ان کوبھی ازواج مطہرات کی طرح، میرے اہل بیت میں شامل فرما دے۔ اس طرح یہ تمام دلائل میں بھی تطبیق ہوجاتی ہے۔ (مزید تفصیل کے لئے دیکھئے فتح القدیر، للشوکانی)۔","lang":"ur","meta":{"transliteration":"waqarna fī buyūtikunna walā tabarrajna tabarruja al-jāhiliyati al-ūlā wa-aqim'na al-ṣalata waātīna al-zakata wa-aṭiʿ'na al-laha warasūlahu innamā yurīdu al-lahu liyudh'hiba ʿankumu al-rij'sa ahla al-bayti wayuṭahhirakum taṭhīran ","translations":["And stay","in","your houses","and (do) not","display yourselves","(as was the) display","(of the times of) ignorance","the former","And establish","the prayer","and give","zakah","and obey","Allah","and His Messenger","Only","Allah wishes","Allah wishes","to remove","from you","the impurity","(O) People","(of) the House","And to purify you","(with thorough) purification","(33)"],"transliterationArr":["waqarna","fī","buyūtikunna","walā","tabarrajna","tabarruja","al-jāhiliyati","al-ūlā","wa-aqim'na","al-ṣalata","waātīna","al-zakata","wa-aṭiʿ'na","al-laha","warasūlahu","innamā","yurīdu","al-lahu","liyudh'hiba","ʿankumu","al-rij'sa","ahla","al-bayti","wayuṭahhirakum","taṭhīran",null],"verseTiming":[[1,0,740],[2,740,1220],[3,1220,3390],[4,3390,3900],[5,3900,5040],[6,5040,6020],[7,6020,7680],[8,7680,8500],[9,8500,9500],[10,9500,11900],[11,11900,13180],[12,13180,14200],[13,14200,15250],[14,15250,16360],[15,16360,17210],[16,17210,18110],[17,18110,19660],[18,19660,21290],[19,21290,22110],[20,22110,22910],[21,22910,23890],[22,23890,25100],[23,25100,25940],[24,25940,26350],[25,26350,27280],[26,27280,28790],[27,28790,30485]]}},{"name":"33:34","price":"اور تمہارے گھروں میں اللہ کی جو آیتیں اور رسول کی احادیﺚ پڑھی جاتی ہیں ان کا ذکر کرتی رہو(1) ، یقیناً اللہ تعالیٰ لطف کرنے واﻻ خبردار ہے.","arabic":"وَٱذۡكُرۡنَ مَا يُتۡلَىٰ فِي بُيُوتِكُنَّ مِنۡ ءَايَٰتِ ٱللَّهِ وَٱلۡحِكۡمَةِۚ إِنَّ ٱللَّهَ كَانَ لَطِيفًا خَبِيرًا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3567,"juzNumber":22,"footnotes":"(1) یعنی ان پر عمل کرو۔ حکمت سے مراد، احادیث ہیں۔ اس آیت سے استدلال کرتے ہوئے بعض علما نے کہا ہے کہ حدیث بھی قرآن کی طرح ثواب کی نیت سے پڑھی جاسکتی ہے۔علاوہ ازیں یہ آیت بھی ازواج مطہرات کے اہل بیت ہونے پر دلالت کرتی ہے، اس لئے وحی کا نزول، جس کا ذکر اس آیت میں ہے، ازواج مطہرات کے گھروں میں ہی ہوتا تھا، بالخصوص حضرت عائشہ (رضی الله عنها) کے گھر میں۔ جیسا کہ احادیث میں ہے۔","lang":"ur","meta":{"transliteration":"wa-udh'kur'na mā yut'lā fī buyūtikunna min āyāti al-lahi wal-ḥik'mati inna al-laha kāna laṭīfan khabīran ","translations":["And remember","what","is recited","in","your houses","of","(the) Verses","(of) Allah","and the wisdom","Indeed","Allah","is","All-Subtle","All-Aware","(34)"],"transliterationArr":["wa-udh'kur'na","mā","yut'lā","fī","buyūtikunna","min","āyāti","al-lahi","wal-ḥik'mati","inna","al-laha","kāna","laṭīfan","khabīran",null],"verseTiming":[[1,0,990],[2,990,1360],[3,1360,2070],[4,2070,2490],[5,2490,4650],[6,4650,5010],[7,5010,5950],[8,5950,6690],[9,6690,8050],[10,8050,9290],[11,9290,10160],[12,10160,10840],[13,10840,11850],[14,11850,13695]]}},{"name":"33:35","price":"بےشک مسلمان مرد اور مسلمان عورتیں(1) مومن مرد اور مومن عورتیں فرماں برداری کرنے والے مرد اور فرمانبردار عورتیں راست باز مرد اور راست باز عورتیں صبر کرنے والے مرد اور صبر کرنے والی عورتیں، عاجزی کرنے والے مرد اور عاجزی کرنے والی عورتیں، خیرات کرنے والے مرد اور خیرات کرنے والی عورتیں، روزے رکھنے والے مرد اور روزے رکھنے والی عورتیں اپنی شرمگاه کی حفاﻇت کرنے والے مرد اور حفاﻇت کرنے والیاں بکثرت اللہ کا ذکر کرنے والے اور ذکر کرنے والیاں ان (سب کے) لئے اللہ تعالیٰ نے (وسیع) مغفرت اور بڑا ﺛواب تیار کر رکھا ہے.","arabic":"إِنَّ ٱلۡمُسۡلِمِينَ وَٱلۡمُسۡلِمَٰتِ وَٱلۡمُؤۡمِنِينَ وَٱلۡمُؤۡمِنَٰتِ وَٱلۡقَٰنِتِينَ وَٱلۡقَٰنِتَٰتِ وَٱلصَّٰدِقِينَ وَٱلصَّٰدِقَٰتِ وَٱلصَّٰبِرِينَ وَٱلصَّٰبِرَٰتِ وَٱلۡخَٰشِعِينَ وَٱلۡخَٰشِعَٰتِ وَٱلۡمُتَصَدِّقِينَ وَٱلۡمُتَصَدِّقَٰتِ وَٱلصَّٰٓئِمِينَ وَٱلصَّٰٓئِمَٰتِ وَٱلۡحَٰفِظِينَ فُرُوجَهُمۡ وَٱلۡحَٰفِظَٰتِ وَٱلذَّٰكِرِينَ ٱللَّهَ كَثِيرٗا وَٱلذَّٰكِرَٰتِ أَعَدَّ ٱللَّهُ لَهُم مَّغۡفِرَةٗ وَأَجۡرًا عَظِيمٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3568,"juzNumber":22,"footnotes":"(1) حضرت ام سلمہ (رضی الله عنها) اور بعض دیگر صحابیات نے کہا کہ کیا بات ہے، اللہ تعالیٰ ہر جگہ مردوں سے ہی خطاب فرماتا ہے، عورتوں سے نہیں، جس پر یہ آیت نازل ہوئی۔ (مسند احمد 6 / 301، ترمذی، نمبر3211) اس میں عورتوں کی دل داری کا اہتمام کردیا گیا ہے ورنہ تمام احکام میں مردوں کے ساتھ عورتیں بھی شامل ہیں سوائے ان مخصوص احکام کے جو صرف عورتوں کے لئے ہیں۔ اس آیت اور دیگر آیات سے واضح ہے کہ عبادت واطاعت الٰہی اور اخروی درجات و فضائل میں مرد اور عورت کے درمیان کوئی تفریق نہیں ہے۔ دونوں کے لئے یکساں طور پر یہ میدان کھلا ہے اور دونوں زیادہ سے زیادہ نیکیاں اور اجر وثواب کما سکتے ہیں۔ جنس کی بنیاد پر اس میں کوئی کمی بیشی نہیں کی جائے گی۔ علاوہ ازیں مسلمان اور مومن کا الگ الگ ذکر کرنے سے واضح ہے کہ ان دونوں میں فرق ہے۔ ایمان کا درجہ اسلام سے بڑھ کر ہے جیسا کہ قرآن وحدیث کے دیگر دلائل بھی اس پر دلالت کرتے ہیں۔","lang":"ur","meta":{"transliteration":"inna al-mus'limīna wal-mus'limāti wal-mu'minīna wal-mu'mināti wal-qānitīna wal-qānitāti wal-ṣādiqīna wal-ṣādiqāti wal-ṣābirīna wal-ṣābirāti wal-khāshiʿīna wal-khāshiʿāti wal-mutaṣadiqīna wal-mutaṣadiqāti wal-ṣāimīna wal-ṣāimāti wal-ḥāfiẓīna furūjahum wal-ḥāfiẓāti wal-dhākirīna al-laha kathīran wal-dhākirāti aʿadda al-lahu lahum maghfiratan wa-ajran ʿaẓīman ","translations":["Indeed","the Muslim men","and the Muslim women","and the believing men","and the believing women","and the obedient men","and the obedient women","and the truthful men","and the truthful women","and the patient men","and the patient women","and the humble men","and the humble women","and the men who give charity","and the women who give charity","and the men who fast","and the women who fast","and the men who guard","their chastity","and the women who guard (it)","and the men who remember","Allah","much","and the women who remember","Allah has prepared","Allah has prepared","for them","forgiveness","and a reward","great","(35)"],"transliterationArr":["inna","al-mus'limīna","wal-mus'limāti","wal-mu'minīna","wal-mu'mināti","wal-qānitīna","wal-qānitāti","wal-ṣādiqīna","wal-ṣādiqāti","wal-ṣābirīna","wal-ṣābirāti","wal-khāshiʿīna","wal-khāshiʿāti","wal-mutaṣadiqīna","wal-mutaṣadiqāti","wal-ṣāimīna","wal-ṣāimāti","wal-ḥāfiẓīna","furūjahum","wal-ḥāfiẓāti","wal-dhākirīna","al-laha","kathīran","wal-dhākirāti","aʿadda","al-lahu","lahum","maghfiratan","wa-ajran","ʿaẓīman",null],"verseTiming":[[1,0,1300],[2,1300,2670],[3,2670,4220],[4,4220,5610],[5,5610,7150],[6,7150,8590],[7,8590,10080],[8,10080,11620],[9,11620,13110],[10,13110,15790],[11,15790,17390],[12,17390,18850],[13,18850,20350],[14,20350,21840],[15,21840,23720],[16,23720,25530],[17,25530,28530],[18,28530,31560],[19,31560,34380],[20,34380,35950],[21,35950,37200],[22,37200,38680],[23,38680,40110],[24,40110,40920],[25,40920,42490],[26,42490,43940],[27,43940,44670],[28,44670,45390],[29,45390,45900],[30,45900,47500],[31,47500,49030],[32,49030,50715]]}},{"name":"33:36","price":"اور (دیکھو) کسی مومن مرد و عورت کو اللہ اور اس کے رسول کا فیصلہ کے بعد اپنے کسی امر کا کوئی اختیار باقی نہیں رہتا(1) ، (یاد رکھو) اللہ تعالیٰ اور اس کے رسول کی جو بھی نافرمانی کرے گا وه صریح گمراہی میں پڑے گا.","arabic":"وَمَا كَانَ لِمُؤۡمِنٖ وَلَا مُؤۡمِنَةٍ إِذَا قَضَى ٱللَّهُ وَرَسُولُهُۥٓ أَمۡرًا أَن يَكُونَ لَهُمُ ٱلۡخِيَرَةُ مِنۡ أَمۡرِهِمۡۗ وَمَن يَعۡصِ ٱللَّهَ وَرَسُولَهُۥ فَقَدۡ ضَلَّ ضَلَٰلٗا مُّبِينٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3569,"juzNumber":22,"footnotes":"(1) یہ آیت حضرت زینب (رضی الله عنها) کے نکاح کے سلسلے میں نازل ہوئی تھی۔ حضرت زید بن حارثہ (رضي الله عنه) ، جو اگرچہ اصلاً عرب تھے، لیکن کسی نے انہیں بچپن میں زبردستی پکڑ کر بطور غلام بیچ دیا تھا۔ نبی کریم (صلى الله عليه وسلم) سے حضرت خدیجہ (رضی الله عنها) کے نکاح کے بعد حضرت خدیجہ (رضی الله عنها) نے انہیں رسول اللہ (صلى الله عليه وسلم) کو ہبہ کردیا تھا۔ آپ (صلى الله عليه وسلم) نے انہیں آزاد کرکے اپنا بیٹا بنا لیا تھا۔ نبی کریم (صلى الله عليه وسلم) نے ان کے نکاح کے لئے اپنی پھوپھی زاد بہن حضرت زینب (رضی الله عنها) کو نکاح کا پیغام بھیجا، جس پر انہیں اور ان کے بھائی کو خاندانی وجاہت کی بناء پر تامل ہوا، کہ زید (رضي الله عنه) ایک آزاد کردہ غلام ہیں اور ہمارا تعلق ایک اونچے خاندان سے ہے۔ جس پر یہ آیت نازل ہوئی۔ جس کا مطلب یہ ہے کہ اللہ اور رسول کے فیصلے کے بعد کسی مومن مرد اور عورت کو یہ حق حاصل نہیں کہ وہ اپنا اختیار بروئےکار لائے۔ بلکہ اس کے لئے ضروری ہے کہ وہ سر تسلیم خم کردے۔ چنانچہ یہ آیت سننے کے بعد حضرت زینب (رضی الله عنها) وغیرہ نے اپنی رائے پر اصرار نہیں کیا اور ان کا باہم نکاح ہوگیا۔","lang":"ur","meta":{"transliteration":"wamā kāna limu'minin walā mu'minatin idhā qaḍā al-lahu warasūluhu amran an yakūna lahumu al-khiyaratu min amrihim waman yaʿṣi al-laha warasūlahu faqad ḍalla ḍalālan mubīnan ","translations":["And not","(it) is","for a believing man","and not","(for) a believing woman","when","Allah has decided","Allah has decided","and His Messenger","a matter","that","(there) should be","for them","(any) choice","about","their affair","And whoever","disobeys","Allah","and His Messenger","certainly","he (has) strayed","(into) error","clear","(36)"],"transliterationArr":["wamā","kāna","limu'minin","walā","mu'minatin","idhā","qaḍā","al-lahu","warasūluhu","amran","an","yakūna","lahumu","al-khiyaratu","min","amrihim","waman","yaʿṣi","al-laha","warasūlahu","faqad","ḍalla","ḍalālan","mubīnan",null],"verseTiming":[[1,0,690],[2,690,1290],[3,1290,3040],[4,3040,3540],[5,3540,4670],[6,4670,5230],[7,5230,5690],[8,5690,6500],[9,6500,9010],[10,9010,9710],[11,9710,10020],[12,10020,11440],[13,11440,11990],[14,11990,12930],[15,12930,13250],[16,13250,14630],[17,14630,15020],[18,15020,15990],[19,15990,17020],[20,17020,18270],[21,18270,18840],[22,18840,19480],[23,19480,20260],[24,20260,22565]]}},{"name":"33:37","price":"(یاد کرو) جب کہ تو اس شخص سے کہہ رہا تھا جس پر اللہ نے بھی انعام کیا اور تو نے بھی کہ تو اپنی بیوی کو اپنے پاس رکھ اور اللہ سے ڈر اور تو اپنے دل میں وه بات چھپائے ہوئے تھا جسے اللہ ﻇاہر کرنے واﻻ تھا اور تو لوگوں سے خوف کھاتا تھا، حاﻻنکہ اللہ تعالیٰ اس کا زیاده حق دار تھا کہ تو اس سے ڈرے(1) ، پس جب کہ زید نے اس عورت سے اپنی غرض پوری کرلی(2) ہم نے اسے تیرے نکاح میں دے دیا(3) تاکہ مسلمانوں پر اپنے لے پالکوں کی بیویوں کے بارے میں کسی طرح کی تنگی نہ رہے جب کہ وه اپنی غرض ان سے پوری کرلیں(4)، اللہ کا (یہ) حکم تو ہو کر ہی رہنے واﻻ تھا.(5)","arabic":"وَإِذۡ تَقُولُ لِلَّذِيٓ أَنۡعَمَ ٱللَّهُ عَلَيۡهِ وَأَنۡعَمۡتَ عَلَيۡهِ أَمۡسِكۡ عَلَيۡكَ زَوۡجَكَ وَٱتَّقِ ٱللَّهَ وَتُخۡفِي فِي نَفۡسِكَ مَا ٱللَّهُ مُبۡدِيهِ وَتَخۡشَى ٱلنَّاسَ وَٱللَّهُ أَحَقُّ أَن تَخۡشَىٰهُۖ فَلَمَّا قَضَىٰ زَيۡدٞ مِّنۡهَا وَطَرٗا زَوَّجۡنَٰكَهَا لِكَيۡ لَا يَكُونَ عَلَى ٱلۡمُؤۡمِنِينَ حَرَجٞ فِيٓ أَزۡوَٰجِ أَدۡعِيَآئِهِمۡ إِذَا قَضَوۡاْ مِنۡهُنَّ وَطَرٗاۚ وَكَانَ أَمۡرُ ٱللَّهِ مَفۡعُولٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3570,"juzNumber":22,"footnotes":"(1) لیکن چونکہ ان کے مزاج میں فرق تھا، بیوی کے مزاج میں خاندانی نسب وشرف رچا ہوا تھا، جب کہ زید (رضي الله عنه) کے دامن پر غلامی کا داغ تھا، ان کی آپس میں ان بن رہتی تھی جس کا تذکرہ حضرت زید (رضي الله عنه) نبی کریم (صلى الله عليه وسلم) سے کرتے رہتے تھے اور طلاق کا عندیہ بھی ظاہر کرتے۔ لیکن نبی کریم (صلى الله عليه وسلم) ان کو طلاق دینے سے روکتے اور نباہ کرنے کی تلقین فرماتے۔ علاوہ ازیں اللہ تعالیٰ نے آپ (صلى الله عليه وسلم) کو اس پیش گوئی سے بھی آگاہ فرما دیا تھا کہ زید (رضي الله عنه) کی طرف سےطلاق واقع ہو کر رہے گی اور اس کے بعد زینب (رضی الله عنها) کا نکاح آپ سے کردیا جائے گا تاکہ جاہلیت کی اس رسم تبنیت پر ا یک کاری ضرب لگا کر واضح کردیا جائے کہ منہ بولا بیٹا، احکام شرعیہ میں حقیقی بیٹے کی طرح نہیں ہے اور اس کی مطلقہ سے نکاح جائز ہے۔ اس آیت میں ان ہی باتوں کی طرف اشارہ کیا گیا ہے۔ حضرت زید (رضي الله عنه) پر اللہ کا انعام یہ تھا کہ انہیں قبول اسلام کی توفیق دی اور غلامی سے نجات دلائی، نبی کریم (صلى الله عليه وسلم) کا احسان ان پر یہ تھا کہ ان کی دینی تربیت کی۔ ان کو آزاد کرکے اپنا بیٹا قرار دیا اور اپنی پھوپھی امیمہ بنت عبدالمطلب کی لڑکی سے ان کا نکاح کرادیا۔ دل میں چھپانے والی بات یہی تھی جو آپ کو حضرت زینب (رضی الله عنها) سے نکاح کی بابت بذریعہ وحی بتلائی گئی تھی، آپ (صلى الله عليه وسلم) ڈرتے اس بات سے تھے کہ لوگ کہیں گے اپنی بہو سے نکاح کرلیا۔ حالانکہ جب اللہ کو آپ کے ذریعے سے اس رسم کا خاتمہ کرنا تھا تو پھر لوگوں سے ڈرنے کی ضرورت نہیں تھی۔ آپ (صلى الله عليه وسلم) کا یہ خوف اگرچہ فطری تھا، اس کے باوجود آپ (صلى الله عليه وسلم) کو تنبیہ فرمائی گئی۔ ظاہر کرنے سے مراد یہی ہے کہ یہ نکاح ہوگیا، جس سے یہ بات سب کے ہی علم میں آجائے گی۔\n(2) یعنی نکاح کے بعد طلاق دی اور حضرت زینب (رضی الله عنها) عدت سے فارغ ہوگئیں۔\n(3) یعنی یہ نکاح معروف طریقے کے برعکس صرف اللہ کے حکم سے نکاح قرار پاگیا، نکاح خوانی، ولایت، حق مہر اور گواہوں کے بغیر ہی۔\n(4) یہ حضرت زینب (رضی الله عنها) سے، نبی کریم (صلى الله عليه وسلم) کے نکاح کی علت ہے کہ آئندہ کوئی مسلمان اس بارے میں تنگی محسوس نہ کرے اور حسب ضرورت اقتضا لےپالک بیٹے کی مطلقہ بیوی سے نکاح کیا جاسکے۔\n(5) یعنی پہلے سے ہی تقدیر الٰہی میں تھا جو بہرصورت ہو کر رہنا تھا۔","lang":"ur","meta":{"transliteration":"wa-idh taqūlu lilladhī anʿama al-lahu ʿalayhi wa-anʿamta ʿalayhi amsik ʿalayka zawjaka wa-ittaqi al-laha watukh'fī fī nafsika mā al-lahu mub'dīhi watakhshā al-nāsa wal-lahu aḥaqqu an takhshāhu falammā qaḍā zaydun min'hā waṭaran zawwajnākahā likay lā yakūna ʿalā al-mu'minīna ḥarajun fī azwāji adʿiyāihim idhā qaḍaw min'hunna waṭaran wakāna amru al-lahi mafʿūlan ","translations":["And when","you said","to the one","Allah bestowed favor","Allah bestowed favor","on him","and you bestowed favor","on him","Keep","to yourself","your wife","and fear","Allah","But you concealed","within","yourself","what","Allah","(was to) disclose","And you fear","the people","while Allah","has more right","that","you (should) fear Him","So when","ended","Zaid","from her","necessary (formalities)","We married her to you","so that","not","there be","on","the believers","any discomfort","concerning","the wives","(of) their adopted sons","when","they have ended","from them","necessary (formalities)","And is","(the) Command","(of) Allah","accomplished","(37)"],"transliterationArr":["wa-idh","taqūlu","lilladhī","anʿama","al-lahu","ʿalayhi","wa-anʿamta","ʿalayhi","amsik","ʿalayka","zawjaka","wa-ittaqi","al-laha","watukh'fī","fī","nafsika","mā","al-lahu","mub'dīhi","watakhshā","al-nāsa","wal-lahu","aḥaqqu","an","takhshāhu","falammā","qaḍā","zaydun","min'hā","waṭaran","zawwajnākahā","likay","lā","yakūna","ʿalā","al-mu'minīna","ḥarajun","fī","azwāji","adʿiyāihim","idhā","qaḍaw","min'hunna","waṭaran","wakāna","amru","al-lahi","mafʿūlan",null],"verseTiming":[[1,0,600],[2,600,1360],[3,1360,3450],[4,3450,4100],[5,4100,4900],[6,4900,5720],[7,5720,6790],[8,6790,7590],[9,7590,8210],[10,8210,9110],[11,9110,9910],[12,9910,10620],[13,10620,12410],[14,12410,13780],[15,13780,14570],[16,14570,15420],[17,15420,16150],[18,16150,16930],[19,16930,17870],[20,17870,18310],[21,18310,19070],[22,19070,19200],[23,19200,19980],[24,19980,20870],[25,20870,21590],[26,21590,24660],[27,24660,25400],[28,25400,27020],[29,27020,27960],[30,27960,28650],[31,28650,29480],[32,29480,32310],[33,32310,34330],[34,34330,34920],[35,34920,35540],[36,35540,37190],[37,37190,38340],[38,38340,40170],[39,40170,40500],[40,40500,41050],[41,41050,41770],[42,41770,42230],[43,42230,43490],[44,43490,44180],[45,44180,45080],[46,45080,45630],[47,45630,46410],[48,46410,46790],[49,46790,48170],[50,48170,49540],[51,49540,51290],[52,51290,52240],[53,52240,55030],[54,55030,55550],[55,55550,56180],[56,56180,57740],[57,57740,59010],[58,59010,59680],[59,59680,60280],[60,60280,61020],[61,61020,62625]]}},{"name":"33:38","price":"جو چیزیں اللہ تعالیٰ نے اپنے نبی کے لئے مقرر کی ہیں ان میں نبی پر کوئی حرج نہیں(1) ، (یہی) اللہ کا دستور ان میں بھی رہا جو پہلے ہوئے(2) اور اللہ تعالیٰ کے کام اندازے پر مقرر کئے ہوئے ہیں.(3)","arabic":"مَّا كَانَ عَلَى ٱلنَّبِيِّ مِنۡ حَرَجٖ فِيمَا فَرَضَ ٱللَّهُ لَهُۥۖ سُنَّةَ ٱللَّهِ فِي ٱلَّذِينَ خَلَوۡاْ مِن قَبۡلُۚ وَكَانَ أَمۡرُ ٱللَّهِ قَدَرٗا مَّقۡدُورًا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3571,"juzNumber":22,"footnotes":"(1) یہ اسی واقعہ نکاح زینب (رضی الله عنها) کی طرف اشارہ ہے، چونکہ یہ نکاح آپ (صلى الله عليه وسلم) کے لئے حلال تھا، اس لئے اس میں کوئی گناہ اور تنگی والی بات نہیں ہے۔\n(2) یعنی گزشتہ انبیا علیہم السلام بھی ایسے کاموں کے کرنے میں کوئی حرج محسوس نہیں کرتے تھے جو اللہ کی طرف سے ان پر فرض قرار دیئے جاتے تھے چاہے قومی اور عوامی رسم ورواج ان کے خلاف ہی ہوتے۔\n(3) یعنی خاص حکمت ومصلحت پر مبنی ہوتے ہیں، دنیوی حکمرانوں کی طرح وقتی اور فوری ضرورت پر مشتمل نہیں ہوتے، اسی طرح ان کا وقت بھی مقرر ہوتا ہے جس کے مطابق وقوع پذیر ہوتے ہیں۔","lang":"ur","meta":{"transliteration":"mā kāna ʿalā al-nabiyi min ḥarajin fīmā faraḍa al-lahu lahu sunnata al-lahi fī alladhīna khalaw min qablu wakāna amru al-lahi qadaran maqdūran ","translations":["Not","(there can) be","upon","the Prophet","any","discomfort","in what","Allah has imposed","Allah has imposed","on him","(That is the) Way","(of) Allah","concerning","those who","passed away","before","before","And is","(the) Command","(of) Allah","a decree","destined","(38)"],"transliterationArr":["mā","kāna","ʿalā","al-nabiyi","min","ḥarajin","fīmā","faraḍa","al-lahu","lahu","sunnata","al-lahi","fī","alladhīna","khalaw","min","qablu","wakāna","amru","al-lahi","qadaran","maqdūran",null],"verseTiming":[[1,0,430],[2,430,1010],[3,1010,1390],[4,1390,3140],[5,3140,3450],[6,3450,4340],[7,4340,5660],[8,5660,6280],[9,6280,7020],[10,7020,7820],[11,7820,9180],[12,9180,9960],[13,9960,10190],[14,10190,11100],[15,11100,11660],[16,11660,12760],[17,12760,13440],[18,13440,14070],[19,14070,14600],[20,14600,15450],[21,15450,15990],[22,15990,18575]]}},{"name":"33:39","price":"یہ سب ایسے تھے کہ اللہ تعالیٰ کے احکام پہنچایا کرتے تھے اور اللہ ہی سے ڈرتے تھے اور اللہ کے سوا کسی سے نہیں ڈرتے تھے(1) ، اور اللہ تعالیٰ حساب لینے کے لئے کافی ہے.(2)","arabic":"ٱلَّذِينَ يُبَلِّغُونَ رِسَٰلَٰتِ ٱللَّهِ وَيَخۡشَوۡنَهُۥ وَلَا يَخۡشَوۡنَ أَحَدًا إِلَّا ٱللَّهَۗ وَكَفَىٰ بِٱللَّهِ حَسِيبٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3572,"juzNumber":22,"footnotes":"(1) اس لئے کسی کا ڈر یا سطوت انہیں اللہ کا پیغام پہچانے میں مانع بنتا تھا نہ طعن وملامت کی انہیں پروا ہوتی تھی۔ (2) یعنی ہر جگہ وہ اپنے علم اور قدرت کے لحاظ سے موجود ہے، اس لئے وہ اپنے بندوں کی مدد کے لئے کافی ہے اور اللہ کے دین کی تبلیغ ودعوت میں انہیں جو مشکلات آتی ہیں، ان میں وہ ان کی چارہ سازی فرماتا اور دشمنوں کے مذموم ارادوں اور سازشوں سے انہیں بچاتا ہے۔","lang":"ur","meta":{"transliteration":"alladhīna yuballighūna risālāti al-lahi wayakhshawnahu walā yakhshawna aḥadan illā al-laha wakafā bil-lahi ḥasīban ","translations":["Those who","convey","(the) Messages","(of) Allah","and fear Him","and (do) not","fear","anyone","except","Allah","And sufficient is Allah","And sufficient is Allah","(as) a Reckoner","(39)"],"transliterationArr":["alladhīna","yuballighūna","risālāti","al-lahi","wayakhshawnahu","walā","yakhshawna","aḥadan","illā","al-laha","wakafā","bil-lahi","ḥasīban",null],"verseTiming":[[1,0,1070],[2,1070,2410],[3,2410,3670],[4,3670,4370],[5,4370,5980],[6,5980,6460],[7,6460,7400],[8,7400,8210],[9,8210,8700],[10,8700,11200],[11,11200,11910],[12,11910,12860],[13,12860,14295]]}},{"name":"33:40","price":"(لوگو) تمہارے مردوں میں سے کسی کے باپ محمد ﴿صلی اللہ علیہ وسلم﴾ نہیں(1) لیکن آپ اللہ تعالیٰ کے رسول ہیں اور تمام نبیوں کے ختم کرنے والے(2)، اور اللہ تعالی ہر چیز کا (بخوبی) جاننے واﻻ ہے.","arabic":"مَّا كَانَ مُحَمَّدٌ أَبَآ أَحَدٖ مِّن رِّجَالِكُمۡ وَلَٰكِن رَّسُولَ ٱللَّهِ وَخَاتَمَ ٱلنَّبِيِّـۧنَۗ وَكَانَ ٱللَّهُ بِكُلِّ شَيۡءٍ عَلِيمٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3573,"juzNumber":22,"footnotes":"(1) اس لئے وہ زید بن حارثہ (رضي الله عنه) کے بھی باپ نہیں ہیں، جس پر انہیں مورد طعن بنایا جاسکے کہ انہوں نے اپنی بہو سے نکاح کیوں کرلیا؟ ایک زید (رضي الله عنه) ہی کیا، وہ تو کسی بھی مرد کے باپ نہیں ہیں۔ کیونکہ زید (رضي الله عنه) تو حارثہ کے بیٹے تھے، آپ (صلى الله عليه وسلم) نے تو انہیں منہ بولا بیٹا بنایا ہوا تھا اور جاہلی دستور کے مطابق انہیں زید بن محمد کہا جاتا تھا، حقیقتاً وہ آپ (صلى الله عليه وسلم) کے صلبی بیٹے نہیں تھے۔ اس لئے ادْعُوهُمْ لآبَائِهِمْ کے نزول کے بعد انہیں زید بن حارثہ (رضي الله عنه) ہی کہا جاتا تھا، علاوہ ازیں حضرت خدیجہ (رضی الله عنها) سے آپ (صلى الله عليه وسلم) کے تین بیٹے، قاسم، طاہر، طیب ہوئے اور ایک ابراہیم بچہ ماریہ قبطیہ (رضی الله عنها) کے بطن سے ہوا۔ لیکن یہ سب کے سب بچپن میں ہی فوت ہوگئے، ان میں سے کوئی بھی عمر رجولیت کو نہیں پہنچا۔ بنابریں آپ (صلى الله عليه وسلم) کی صلبی اولاد میں سے بھی کوئی مرد نہیں بنا کہ جس کے آپ باپ ہوں (ابن کثیر)۔\n(2) خَاتَمٌ مہر کو کہتے ہیں اور مہر آخری عمل ہی کو کہا جاتا ہے۔ یعنی آپ (صلى الله عليه وسلم) پر نبوت ورسالت کا خاتمہ کردیا گیا، آپ (صلى الله عليه وسلم) کے بعد جو بھی نبوت کا دعویٰ کرے گا، وہ نبی نہیں کذاب و دجال ہوگا۔ احادیث میں اس مضمون کو تفصیل سے بیان کیا گیا ہے اور اس پر پوری امت کا اجماع واتفاق ہے۔ قیامت کے قریب حضرت عیسیٰ (عليه السلام) کا نزول ہوگا، جو صحیح اور متواتر روایات سے ثابت ہے، تو وہ نبی کی حیثیت سے نہیں آئیں گے بلکہ نبی کریم (صلى الله عليه وسلم) کے امتی بن کر آئیں گے، اس لئے ان کا نزول عقیدہ آخرت نبوت کے منافی نہیں ہے۔","lang":"ur","meta":{"transliteration":"mā kāna muḥammadun abā aḥadin min rijālikum walākin rasūla al-lahi wakhātama al-nabiyīna wakāna al-lahu bikulli shayin ʿalīman ","translations":["Not","is","Muhammad","(the) father","(of) anyone","of","your men","but","(he is the) Messenger","(of) Allah","and Seal","(of) the Prophets","And Allah is","And Allah is","of every","thing","All-Knower","(40)"],"transliterationArr":["mā","kāna","muḥammadun","abā","aḥadin","min","rijālikum","walākin","rasūla","al-lahi","wakhātama","al-nabiyīna","wakāna","al-lahu","bikulli","shayin","ʿalīman",null],"verseTiming":[[1,0,390],[2,390,940],[3,940,2720],[4,2720,4460],[5,4460,5050],[6,5050,5950],[7,5950,7290],[8,7290,8200],[9,8200,9000],[10,9000,11400],[11,11400,12140],[12,12140,12950],[13,12950,13790],[14,13790,14900],[15,14900,18150],[16,18150,18800],[17,18800,19630],[18,19630,20350],[19,20350,21090],[20,21090,22675]]}},{"name":"33:41","price":"مسلمانو! اللہ تعالیٰ کا ذکر بہت زیاده کرو.","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱذۡكُرُواْ ٱللَّهَ ذِكۡرٗا كَثِيرٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3574,"juzNumber":22,"footnotes":"","lang":"ur","meta":{"transliteration":"yāayyuhā alladhīna āmanū udh'kurū al-laha dhik'ran kathīran ","translations":["O you who believe","O you who believe","O you who believe","Remember","Allah","(with) remembrance","much","(41)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","udh'kurū","al-laha","dhik'ran","kathīran",null],"verseTiming":[[1,0,2560],[2,2560,3440],[3,3440,4230],[4,4230,4970],[5,4970,5570],[6,5570,7010],[7,7010,8545]]}},{"name":"33:42","price":"اور صبح وشام اس کی پاکیزگی بیان کرو.","arabic":"وَسَبِّحُوهُ بُكۡرَةٗ وَأَصِيلًا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3575,"juzNumber":22,"footnotes":"","lang":"ur","meta":{"transliteration":"wasabbiḥūhu buk'ratan wa-aṣīlan ","translations":["And glorify Him","morning","and evening","(42)"],"transliterationArr":["wasabbiḥūhu","buk'ratan","wa-aṣīlan",null],"verseTiming":[[1,0,1360],[2,1360,2440],[3,2440,4265]]}},{"name":"33:43","price":"وہی ہے جو تم پر اپنی رحمتیں بھیجتا ہے اور اس کے فرشتے (تمہارے لئے دعائے رحمت کرتے ہیں) تاکہ وه تمہیں اندھیروں سے اجالے کی طرف لے جائے اور اللہ تعالیٰ مومنوں پر بہت ہی مہربان ہے.","arabic":"هُوَ ٱلَّذِي يُصَلِّي عَلَيۡكُمۡ وَمَلَٰٓئِكَتُهُۥ لِيُخۡرِجَكُم مِّنَ ٱلظُّلُمَٰتِ إِلَى ٱلنُّورِۚ وَكَانَ بِٱلۡمُؤۡمِنِينَ رَحِيمٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3576,"juzNumber":22,"footnotes":"","lang":"ur","meta":{"transliteration":"huwa alladhī yuṣallī ʿalaykum wamalāikatuhu liyukh'rijakum mina al-ẓulumāti ilā al-nūri wakāna bil-mu'minīna raḥīman ","translations":["He","(is) the One Who","sends His blessings","upon you","and His Angels","so that He may bring you out","from","the darkness[es]","to","the light","And He is","to the believers","Merciful","(43)"],"transliterationArr":["huwa","alladhī","yuṣallī","ʿalaykum","wamalāikatuhu","liyukh'rijakum","mina","al-ẓulumāti","ilā","al-nūri","wakāna","bil-mu'minīna","raḥīman",null],"verseTiming":[[1,0,380],[2,380,1230],[3,1230,2040],[4,2040,3120],[5,3120,6240],[6,6240,7520],[7,7520,8590],[8,8590,9790],[9,9790,10080],[10,10080,13130],[11,13130,13880],[12,13880,15270],[13,15270,16725]]}},{"name":"33:44","price":"جس دن یہ (اللہ سے) ملاقات کریں گے ان کا تحفہ سلام ہوگا(1) ، ان کے لئے اللہ تعالیٰ نے باعزت اجر تیار کر رکھا ہے.","arabic":"تَحِيَّتُهُمۡ يَوۡمَ يَلۡقَوۡنَهُۥ سَلَٰمٞۚ وَأَعَدَّ لَهُمۡ أَجۡرٗا كَرِيمٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3577,"juzNumber":22,"footnotes":"(1) یعنی جنت میں فرشتے اہل ایمان کو یا مومن آپس میں ایک دوسرے کو سلام کریں گے۔","lang":"ur","meta":{"transliteration":"taḥiyyatuhum yawma yalqawnahu salāmun wa-aʿadda lahum ajran karīman ","translations":["Their greetings","(on the) Day","they will meet Him","(will be), \"Peace","and He has prepared","for them","a reward","noble","(44)"],"transliterationArr":["taḥiyyatuhum","yawma","yalqawnahu","salāmun","wa-aʿadda","lahum","ajran","karīman",null],"verseTiming":[[1,0,1290],[2,1290,1840],[3,1840,3060],[4,3060,5320],[5,5320,6550],[6,6550,7080],[7,7080,8420],[8,8420,9495]]}},{"name":"33:45","price":"اے نبی! یقیناً ہم نے ہی آپ کو (رسول بنا کر) گواہیاں دینے واﻻ(1) ، خوشخبریاں سنانے واﻻ، آگاه کرنے واﻻ بھیجا ہے.","arabic":"يَٰٓأَيُّهَا ٱلنَّبِيُّ إِنَّآ أَرۡسَلۡنَٰكَ شَٰهِدٗا وَمُبَشِّرٗا وَنَذِيرٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3578,"juzNumber":22,"footnotes":"(1) بعض لوگ شاہد کے معنی حاضر وناظر کے کرتے ہیں جو قرآن کی تحریف معنوی ہے۔ نبی کریم (صلى الله عليه وسلم) اپنی امت کی گواہی دیں گے، ان کی بھی جو آپ (صلى الله عليه وسلم) پر ایمان لائے اور ان کی بھی جنہوں نے تکذیب کی۔ آپ (صلى الله عليه وسلم) قیامت والے دن اہل ایمان کو ان کے اعضائے وضو سے پہنچان لیں گے جو چمکتے ہوں گے، اسی طرح آپ (صلى الله عليه وسلم) دیگر انبیا علیہم السلام کی گواہی دیں گے کہ ا نہوں نے اپنی اپنی قوموں کو اللہ کا پیغام پہنچا دیا تھا اور یہ گواہی اللہ کے دیئے ہوئے یقینی علم کی بنیاد پر ہوگی۔ اس لئے نہیں کہ آپ (صلى الله عليه وسلم) تمام انبیا علیہم السلام کو اپنی آنکھوں سے دیکھتے رہے ہیں، یہ عقیدہ تو نصوص قرآنی کے خلاف ہے۔","lang":"ur","meta":{"transliteration":"yāayyuhā al-nabiyu innā arsalnāka shāhidan wamubashiran wanadhīran ","translations":["O Prophet","O Prophet","Indeed, We","have sent you","(as) a witness","and a bearer of glad tidings","and (as) a warner","(45)"],"transliterationArr":["yāayyuhā","al-nabiyu","innā","arsalnāka","shāhidan","wamubashiran","wanadhīran",null],"verseTiming":[[1,0,2390],[2,2390,4000],[3,4000,5480],[4,5480,8230],[5,8230,9460],[6,9460,11670],[7,11670,13505]]}},{"name":"33:46","price":"اور اللہ کے حکم سے اس کی طرف بلانے واﻻ اور روشن چراغ.(1)","arabic":"وَدَاعِيًا إِلَى ٱللَّهِ بِإِذۡنِهِۦ وَسِرَاجٗا مُّنِيرٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3579,"juzNumber":22,"footnotes":"(1) جس طرح چراغ سے اندھیرے دور ہوجاتے ہیں، اسی طرح آپ (صلى الله عليه وسلم) کے ذریعے سے کفروشرک کی تاریکیاں دور ہوئیں۔ علاوہ ازیں اس چراغ سے کسب ضیا کرکے جو کمال وسعادت حاصل کرنا چاہے، کرسکتا ہے۔ اس لئے کہ یہ چراغ قیامت تک روشن ہے۔","lang":"ur","meta":{"transliteration":"wadāʿiyan ilā al-lahi bi-idh'nihi wasirājan munīran ","translations":["And as one who invites","to","Allah","by His permission","and (as) a lamp","illuminating","(46)"],"transliterationArr":["wadāʿiyan","ilā","al-lahi","bi-idh'nihi","wasirājan","munīran",null],"verseTiming":[[1,0,1130],[2,1130,1490],[3,1490,2270],[4,2270,3360],[5,3360,4380],[6,4380,6455]]}},{"name":"33:47","price":"آپ مومنوں کو خوشخبری سنا دیجئے! کہ ان کے لئے اللہ کی طرف سے بہت بڑا فضل ہے.","arabic":"وَبَشِّرِ ٱلۡمُؤۡمِنِينَ بِأَنَّ لَهُم مِّنَ ٱللَّهِ فَضۡلٗا كَبِيرٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3580,"juzNumber":22,"footnotes":"","lang":"ur","meta":{"transliteration":"wabashiri al-mu'minīna bi-anna lahum mina al-lahi faḍlan kabīran ","translations":["And give glad tidings","(to) the believers","that","for them","(is) from","Allah","a Bounty","great","(47)"],"transliterationArr":["wabashiri","al-mu'minīna","bi-anna","lahum","mina","al-lahi","faḍlan","kabīran",null],"verseTiming":[[1,0,970],[2,970,4100],[3,4100,4890],[4,4890,6270],[5,6270,7510],[6,7510,8000],[7,8000,8780],[8,8780,9580],[9,9580,11070],[10,11070,12545]]}},{"name":"33:48","price":"اور کافروں اور منافقوں کا کہنا نہ مانیئے! اور جو ایذا (ان کی طرف سے پہنچے) اس کا خیال بھی نہ کیجیئے اللہ پر بھروسہ کئے رہیں، اور کافی ہے اللہ تعالیٰ کام بنانے واﻻ.","arabic":"وَلَا تُطِعِ ٱلۡكَٰفِرِينَ وَٱلۡمُنَٰفِقِينَ وَدَعۡ أَذَىٰهُمۡ وَتَوَكَّلۡ عَلَى ٱللَّهِۚ وَكَفَىٰ بِٱللَّهِ وَكِيلٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3581,"juzNumber":22,"footnotes":"","lang":"ur","meta":{"transliteration":"walā tuṭiʿi al-kāfirīna wal-munāfiqīna wadaʿ adhāhum watawakkal ʿalā al-lahi wakafā bil-lahi wakīlan ","translations":["And (do) not","obey","the disbelievers","and the hypocrites","and disregard","their harm","and put your trust","in","Allah","And sufficient is Allah","And sufficient is Allah","(as) a Trustee","(48)"],"transliterationArr":["walā","tuṭiʿi","al-kāfirīna","wal-munāfiqīna","wadaʿ","adhāhum","watawakkal","ʿalā","al-lahi","wakafā","bil-lahi","wakīlan",null],"verseTiming":[[1,0,530],[2,530,1180],[3,1180,2490],[4,2490,4310],[5,4310,4770],[6,4770,5790],[7,5790,6850],[8,6850,7220],[9,7220,9590],[10,9590,10480],[11,10480,11790],[12,11790,13635]]}},{"name":"33:49","price":"اے مومنو! جب تم مومن عورتوں سے نکاح کرو پھر ہاتھ لگانے سے پہلے (ہی) طلاق دے دو تو ان پر تمہارا کوئی حق عدت کا نہیں جسے تم شمار کرو(1) ، پس تم کچھ نہ کچھ انہیں دے دو(2) اور بھلے طریق پر انہیں رخصت کر دو.(3)","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا نَكَحۡتُمُ ٱلۡمُؤۡمِنَٰتِ ثُمَّ طَلَّقۡتُمُوهُنَّ مِن قَبۡلِ أَن تَمَسُّوهُنَّ فَمَا لَكُمۡ عَلَيۡهِنَّ مِنۡ عِدَّةٖ تَعۡتَدُّونَهَاۖ فَمَتِّعُوهُنَّ وَسَرِّحُوهُنَّ سَرَاحٗا جَمِيلٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3582,"juzNumber":22,"footnotes":"(1) نکاح کے بعد جن عورتوں سے ہم بستری کی جاچکی ہو اور وہ ابھی جوان ہوں، ایسی عورتوں کو طلاق مل جائے تو ان کی عدت تین حیض ہے۔ (البقرۃ: 228) یہاں ان عورتوں کو حکم بیان کیا جا رہا ہے کہ جن سے نکاح ہوا ہے لیکن میاں بیوی کے درمیان ہم بستری نہیں ہوئی۔ ان کو اگر طلاق ہوجائے تو کوئی عدت نہیں ہے یعنی ایسی غیر مدخولہ مطلقہ بغیر عدت گزارے فوری طور پر کہیں نکاح کرنا چاہے، تو کر سکتی ہے، البتہ اگر ہم بستری سے قبل خاوند فوت ہوجائے تو پھر اسے 4 مہینے 10 دن ہی عدت گزارنی پڑے گی۔ (فتح القدیر، ابن کثیر) چھونا یا ہاتھ لگانا، یہ کنایہ ہے جماع (ہم بستری) سے۔ نکاح کا لفظ خاص جماع اور عقد زواج دونوں کے لئے استعمال ہوتا ہے۔ یہاں عقد کے معنی میں ہے۔ اسی آیت سے استدلال کرتے ہوئے یہ بھی کہا گیا ہے کہ نکاح سے پہلے طلاق نہیں ہے۔ اس لئے کہ یہاں نکاح کے بعد طلاق کا ذکر ہے۔ اس لئے جو فقہا اس بات کے قائل ہیں کہ اگر کوئی شخص یہ کہے کہ اگر فلاں عورت سے میں نے نکاح کیا تو اسے طلاق، تو ان کے نزدیک اس عورت سے نکاح ہوتے ہی طلاق واقع ہوجائے گی۔ اسی طرح بعض جو یہ کہتے ہیں کہ اگر وہ یہ کہے کہ میں نے کسی بھی عورت سے نکاح کیا تو اسے طلاق، تو جس عورت سے بھی نکاح کرے گا، طلاق واقع ہوجائے گی۔ یہ بات صحیح نہیں ہے۔ حدیث میں بھی وضاحت ہے۔ ”لا طَلاقَ قَبْلَ نِكَاحٍ“ (ابن ماجه) ”لا طَلاقَ لابْنِ آدَمَ فِيمَا لا يَمْلِكُ“ (أبو داود ، باب في الطلاق قبل النكاح، ترمذي، ابن ماجه ومسند أحمد 2 /189) اس سے واضح ہے کہ نکاح سے قبل طلاق، ایک فعل عبث ہے جس کی کوئی شرعی حیثیت نہیں ہے۔\n(2) یہ متعہ، اگر مہر مقرر کیا گیا ہو تو نصف مہر ہے ورنہ حسب توفیق کچھ دے دیا جائے۔\n(3) یعنی انہیں عزت و احترام سے ، بغیر کوئی ایذاء پہنچائے علیحدہ کردیا جائے۔","lang":"ur","meta":{"transliteration":"yāayyuhā alladhīna āmanū idhā nakaḥtumu al-mu'mināti thumma ṭallaqtumūhunna min qabli an tamassūhunna famā lakum ʿalayhinna min ʿiddatin taʿtaddūnahā famattiʿūhunna wasarriḥūhunna sarāḥan jamīlan ","translations":["O you who believe","O you who believe","O you who believe","When","you marry","believing women","and then","divorce them","before","before","[that]","you have touched them","then not","for you","on them","any","waiting period","(to) count concerning them","So provide for them","and release them","(with) a release","good","(49)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","idhā","nakaḥtumu","al-mu'mināti","thumma","ṭallaqtumūhunna","min","qabli","an","tamassūhunna","famā","lakum","ʿalayhinna","min","ʿiddatin","taʿtaddūnahā","famattiʿūhunna","wasarriḥūhunna","sarāḥan","jamīlan",null],"verseTiming":[[1,0,2620],[2,2620,3400],[3,3400,5140],[4,5140,5670],[5,5670,6490],[6,6490,7720],[7,7720,8810],[8,8810,11410],[9,11410,12330],[10,12330,12820],[11,12820,13680],[12,13680,15880],[13,15880,17810],[14,17810,20210],[15,20210,21230],[16,21230,21750],[17,21750,22520],[18,22520,24690],[19,24690,25280],[20,25280,25800],[21,25800,27410],[22,27410,27730],[23,27730,29360],[24,29360,31400],[25,31400,34330],[26,34330,36340],[27,36340,37820],[28,37820,39245]]}},{"name":"33:50","price":"اے نبی! ہم نے تیرے لئے تیری وه بیویاں حلال کر دی ہیں جنہوں تو ان کا مہر دے چکا ہے(1) اور وه لونڈیاں بھی جو اللہ تعالیٰ نے غنیمت میں تجھے دی ہیں(2) اور تیرے چچا کی لڑکیاں اور پھوپھیوں کی بیٹیاں اور تیرے ماموں کی بیٹیاں اور تیری خاﻻؤں کی بیٹیاں بھی جنہوں نے تیرے ساتھ ہجرت کی ہے(3)، اور وه باایمان عورت جو اپنا نفس نبی کو ہبہ کردے یہ اس صورت میں کہ خود نبی بھی اس سے نکاح کرنا چاہے(4)، یہ خاص طور پر صرف تیرے لئے ہی ہے اور مومنوں کے لئے نہیں(5)، ہم اسے بخوبی جانتے ہیں جو ہم نے ان پر ان کی بیویوں اور لونڈیوں کے بارے میں (احکام) مقرر کر رکھے ہیں(6)، یہ اس لئے کہ تجھ پر حرج واقع نہ ہو(7)، اللہ تعالیٰ بہت بخشنے اور بڑے رحم واﻻ ہے.","arabic":"يَٰٓأَيُّهَا ٱلنَّبِيُّ إِنَّآ أَحۡلَلۡنَا لَكَ أَزۡوَٰجَكَ ٱلَّٰتِيٓ ءَاتَيۡتَ أُجُورَهُنَّ وَمَا مَلَكَتۡ يَمِينُكَ مِمَّآ أَفَآءَ ٱللَّهُ عَلَيۡكَ وَبَنَاتِ عَمِّكَ وَبَنَاتِ عَمَّٰتِكَ وَبَنَاتِ خَالِكَ وَبَنَاتِ خَٰلَٰتِكَ ٱلَّٰتِي هَاجَرۡنَ مَعَكَ وَٱمۡرَأَةٗ مُّؤۡمِنَةً إِن وَهَبَتۡ نَفۡسَهَا لِلنَّبِيِّ إِنۡ أَرَادَ ٱلنَّبِيُّ أَن يَسۡتَنكِحَهَا خَالِصَةٗ لَّكَ مِن دُونِ ٱلۡمُؤۡمِنِينَۗ قَدۡ عَلِمۡنَا مَا فَرَضۡنَا عَلَيۡهِمۡ فِيٓ أَزۡوَٰجِهِمۡ وَمَا مَلَكَتۡ أَيۡمَٰنُهُمۡ لِكَيۡلَا يَكُونَ عَلَيۡكَ حَرَجٞۗ وَكَانَ ٱللَّهُ غَفُورٗا رَّحِيمٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3583,"juzNumber":22,"footnotes":"(1) بعض احکام شرعیہ میں نبی کریم (صلى الله عليه وسلم) کو امیتاز حاصل تھا، جنہیں آپ (صلى الله عليه وسلم) کی خصوصیات کہا جاتا ہے۔ مثلاً اہل علم کی ایک جماعت کے بقول قیام اللیل (تہجد) آپ (صلى الله عليه وسلم) پر فرض تھا، صدقہ آپ (صلى الله عليه وسلم) پر حرام تھا، اسی طرح کی بعض خصوصیات کا ذکر قرآن کریم کے اس مقام پر کیا گیا ہے جن کا تعلق نکاح سے ہے۔ 1 . جن عورتوں کو آپ (صلى الله عليه وسلم) نے مہر دیا ہے، وہ حلال ہیں چاہے تعداد میں وہ کتنی ہی ہوں اور آپ (صلى الله عليه وسلم) نے حضرت صفیہ (رضی الله عنها) اور جویریہ (رضی الله عنها) کا مہر ان کی آزادی کو قرار دیا تھا، ان کے علاوہ بصورت نقد سب کو مہر ادا کیا تھا۔ صرف ام حبیبہ (رضی الله عنها) کا مہر نجاشی نے اپنی طرف سے دیا تھا۔\n(2) چنانچہ حضرت صفیہ (رضی الله عنها) اور جویریہ (رضی الله عنها) ملکیت میں آئیں جنہیں آپ (صلى الله عليه وسلم) نے آزاد کرکے نکاح کرلیا، اور ریحانہ (رضی الله عنها) اور ماریہ قبطیہ (رضی الله عنها) یہ بطور لونڈی آپ کےپاس رہیں۔\n(3) اس کا مطلب ہے کہ جس طرح آپ (صلى الله عليه وسلم) نے ہجرت کی، اسی طرح انہوں نے بھی مکے سے مدینہ ہجرت کی۔ کیونکہ آپ (صلى الله عليه وسلم) کے ساتھ تو کسی عورت نے بھی ہجرت نہیں کی تھی۔\n(4) یعنی اپنے آپ (صلى الله عليه وسلم) کو ہبہ کرنے والی عورت، اگر آپ (صلى الله عليه وسلم) اس سے نکاح کرنا پسند فرمائیں تو بغیر مہر کے آپ (صلى الله عليه وسلم) کے لئے اسے اپنے نکاح میں رکھنا جائزہے۔\n(5) یہ اجازت صرف آپ (صلى الله عليه وسلم) کے لئے ہے۔ دیگر مومنوں کے لئے تو ضروری ہے کہ وہ حق مہر، ادا کریں، تب نکاح جائز ہوگا۔\n(6) یعنی عقد کے جو شرائط اور حقوق ہیں جو ہم نے فرض کئے ہیں کہ مثلاً چار سے زیادہ عورتیں بیک وقت کوئی شخص اپنے نکاح میں نہیں رکھ سکتا، نکاح کے لئے ولی، گواہ اور حق مہر ضروری ہے۔ البتہ لونڈیاں جتنی کوئی چاہے، رکھ سکتا ہے، تاہم آج کل لونڈیوں کا مسئلہ تو ختم ہے۔","lang":"ur","meta":{"transliteration":"yāayyuhā al-nabiyu innā aḥlalnā laka azwājaka allātī ātayta ujūrahunna wamā malakat yamīnuka mimmā afāa al-lahu ʿalayka wabanāti ʿammika wabanāti ʿammātika wabanāti khālika wabanāti khālātika allātī hājarna maʿaka wa-im'ra-atan mu'minatan in wahabat nafsahā lilnnabiyyi in arāda al-nabiyu an yastankiḥahā khāliṣatan laka min dūni al-mu'minīna qad ʿalim'nā mā faraḍnā ʿalayhim fī azwājihim wamā malakat aymānuhum likaylā yakūna ʿalayka ḥarajun wakāna al-lahu ghafūran raḥīman ","translations":["O Prophet","O Prophet","Indeed, We","[We] have made lawful","to you","your wives","(to) whom","you have given","their bridal money","and whom","you rightfully possess","you rightfully possess","from those (whom)","Allah has given","Allah has given","to you","and (the) daughters","(of) your paternal uncles","and (the) daughters","(of) your paternal aunts","and (the) daughters","(of) your maternal uncles","and (the) daughters","(of) your maternal aunts","who","emigrated","with you","and a woman","believing","if","she gives","herself","to the Prophet","if","wishes","the Prophet","to","marry her ","only","for you","excluding","excluding","the believers","Certainly","We know","what","We have made obligatory","upon them","concerning","their wives","and whom","they rightfully possess","they rightfully possess","that not","should be","on you","any discomfort","And Allah is","And Allah is","Oft-Forgiving","Most Merciful","(50)"],"transliterationArr":["yāayyuhā","al-nabiyu","innā","aḥlalnā","laka","azwājaka","allātī","ātayta","ujūrahunna","wamā","malakat","yamīnuka","mimmā","afāa","al-lahu","ʿalayka","wabanāti","ʿammika","wabanāti","ʿammātika","wabanāti","khālika","wabanāti","khālātika","allātī","hājarna","maʿaka","wa-im'ra-atan","mu'minatan","in","wahabat","nafsahā","lilnnabiyyi","in","arāda","al-nabiyu","an","yastankiḥahā","khāliṣatan","laka","min","dūni","al-mu'minīna","qad","ʿalim'nā","mā","faraḍnā","ʿalayhim","fī","azwājihim","wamā","malakat","aymānuhum","likaylā","yakūna","ʿalayka","ḥarajun","wakāna","al-lahu","ghafūran","raḥīman",null],"verseTiming":[[1,0,2790],[2,2790,4290],[3,4290,6640],[4,6640,7760],[5,7760,8140],[6,8140,9210],[7,9210,11550],[8,11550,12450],[9,12450,14210],[10,14210,14760],[11,14760,15470],[12,15470,16220],[13,16220,17430],[14,17430,18190],[15,18190,19120],[16,19120,21890],[17,21890,23900],[18,23900,24760],[19,24760,25510],[20,25510,26360],[21,26360,27550],[22,27550,28460],[23,28460,30070],[24,30070,30910],[25,30910,31700],[26,31700,33000],[27,33000,33790],[28,33790,34620],[29,34620,35690],[30,35690,36630],[31,36630,37550],[32,37550,38160],[33,38160,39090],[34,39090,40700],[35,40700,41140],[36,41140,42200],[37,42200,43090],[38,43090,44440],[39,44440,45120],[40,45120,46210],[41,46210,47940],[42,47940,48900],[43,48900,49630],[44,49630,50620],[45,50620,52120],[46,52120,52420],[47,52420,53090],[48,53090,54540],[49,54540,54790],[50,54790,57580],[51,57580,58670],[52,58670,59070],[53,59070,59450],[54,59450,60430],[55,60430,63500],[56,63500,63870],[57,63870,64920],[58,64920,65210],[59,65210,66150],[60,66150,67110],[61,67110,68690],[62,68690,69960],[63,69960,70490],[64,70490,71240],[65,71240,72470],[66,72470,73430],[67,73430,74190],[68,74190,74960],[69,74960,75520],[70,75520,76530],[71,76530,77360],[72,77360,78020],[73,78020,79685]]}},{"name":"33:51","price":"ان میں سے جسے تو چاہے دور رکھ دے اور جسے چاہے اپنے پاس رکھ لے(1) ، اور اگر تو نے ان میں سے بھی کسی کو اپنے پاس بلالے جنہیں تو نے الگ کر رکھا تھا تو تجھ پر کوئی گناه نہیں(2)، اس میں اس بات کی زیاده توقع ہے کہ ان عورتوں کی آنکھیں ٹھنڈی رہیں اور وه رنجیده نہ ہوں اور جو کچھ بھی تو انہیں دے دے اس پر سب کی سب راضی رہیں(3)۔ تمہارے دلوں میں جو کچھ ہے اسے اللہ (خوب) جانتا ہے(4)۔ اللہ تعالیٰ بڑا ہی علم اور حلم واﻻ ہے.","arabic":"۞ تُرۡجِي مَن تَشَآءُ مِنۡهُنَّ وَتُـٔۡوِيٓ إِلَيۡكَ مَن تَشَآءُۖ وَمَنِ ٱبۡتَغَيۡتَ مِمَّنۡ عَزَلۡتَ فَلَا جُنَاحَ عَلَيۡكَۚ ذَٰلِكَ أَدۡنَىٰٓ أَن تَقَرَّ أَعۡيُنُهُنَّ وَلَا يَحۡزَنَّ وَيَرۡضَيۡنَ بِمَآ ءَاتَيۡتَهُنَّ كُلُّهُنَّۚ وَٱللَّهُ يَعۡلَمُ مَا فِي قُلُوبِكُمۡۚ وَكَانَ ٱللَّهُ عَلِيمًا حَلِيمٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3584,"juzNumber":22,"footnotes":"(1) اس کا تعلق إِنَّا أَحْلَلْنَا سے ہے یعنی مذکورہ تمام عورتوں کی آپ (صلى الله عليه وسلم) کے لئے حلت اس لئے ہے تاکہ آپ (صلى الله عليه وسلم) کو تنگی محسوس نہ ہو اور آپ (صلى الله عليه وسلم) ان میں سے کسی کے ساتھ نکاح میں گناہ نہ سمجھیں۔\n(2) یعنی جن بیویوں کی باریاں موقوف کر رکھی تھیں اگر آپ (صلى الله عليه وسلم) چاہیں کہ ان سے بھی مباشرت کا تعلق قائم کیا جائے، تو یہ اجازت بھی آپ (صلى الله عليه وسلم) کو حاصل ہے۔\n(3) یعنی باری موقوف ہونے اور ایک کو دوسری پر ترجیح دینے کے باوجود وہ خوش ہوں گی، غمگین نہیں ہوں گی اور جتنا کچھ آپ (صلى الله عليه وسلم) کی طرف سے انہیں مل جائے گا، اس پر مطمئن رہیں گی۔ کیوں؟ اس لئے کہ انہیں معلوم ہے کہ پیغمبر (صلى الله عليه وسلم) یہ سب کچھ اللہ کے حکم اور اجازت سے کر رہے ہیں اور یہ ازواج مطہرات اللہ کے فیصلہ پر راضی اور مطمئن ہیں۔ بعض کہتے ہیں کہ نبی کریم (صلى الله عليه وسلم) کو یہ اختیار ملنے کے باوجود آپ (صلى الله عليه وسلم) نے اسے استعمال نہیں کیا اور سوائے حضرت سودہ (رضی الله عنها) کے (کہ انہوں نے اپنی باری خود ہی حضرت عائشہ (رضی الله عنها) کے لئے ہبہ کردی تھی) آپ (صلى الله عليه وسلم) نے تمام ازواج مطہرات کی باریاں برابر برابر مقرر کر رکھی تھیں، اس لئے آپ (صلى الله عليه وسلم) نے مرض الموت میں ازواج مطہرات سے اجازت لے کر بیماری کے ایام حضرت عائشہ (رضی الله عنها) کے پاس گزارے ”أَنْ تَقَرَّ أَعْيُنُهُنَّ“ کا تعلق آپ (صلى الله عليه وسلم) کے اسی طرز عمل سے ہے کہ آپ (صلى الله عليه وسلم) پر تقسیم اگرچہ (دوسرے لوگوں کی طرح) واجب نہیں تھی، اس کے باوجود آپ (صلى الله عليه وسلم) نے تقسیم کو اختیار فرمایا، تاکہ آپ (صلى الله عليه وسلم) کی بیویوں کی آنکھیں ٹھنڈی ہوجائیں اور آپ (صلى الله عليه وسلم) کے اس حسن سلوک اور عدل وانصاف سے خوش ہوجائیں کہ آپ (صلى الله عليه وسلم) نے خصوصی اختیار استعمال کرنے کے بجائے ان کی دلجوئی اور دلداری کا اہتمام فرمایا۔\n(4) یعنی تمہارے دلوں میں جو کچھ ہے، ان میں یہ بات بھی یقیناً ہے کہ سب بیویوں کی محبت دل میں یکساں نہیں ہے۔ کیوں کہ دل پر انسان کا اختیار ہی نہیں ہے۔ اس لئے بیویوں کے درمیان مساوات باری میں، نان و نفقہ اور دیگر ضروریات زندگی اور آسائشوں میں ضروری ہے، جس کا اہتمام انسان کرسکتا ہے۔ دلوں کے میلان میں مساوات چونکہ اختیار ہی میں نہیں ہے۔ اس لئے اللہ تعالیٰ اس پر گرفت بھی نہیں فرمائے گا بشرطیکہ دلی محبت کسی ایک بیوی سے امتیازی سلوک کا باعث نہ ہو۔ اسی لئے نبی کریم (صلى الله عليه وسلم) فرمایا کرتے تھے یااللہ یہ میری تقسیم ہے جو میرے اختیار میں ہے، لیکن جس چیز پر تیرا اختیار ہے، میں اس پر اختیار نہیں رکھتا، اس میں مجھے ملامت نہ کرنا۔ (أبو داود، باب القسم في النساء، ترمذي، نسائي، ابن ماجه، مسند أحمد 6 / 144)۔","lang":"ur","meta":{"transliteration":"tur'jī man tashāu min'hunna watu'wī ilayka man tashāu wamani ib'taghayta mimman ʿazalta falā junāḥa ʿalayka dhālika adnā an taqarra aʿyunuhunna walā yaḥzanna wayarḍayna bimā ātaytahunna kulluhunna wal-lahu yaʿlamu mā fī qulūbikum wakāna al-lahu ʿalīman ḥalīman ","translations":["You may defer","whom","you will","of them","or you may take","to yourself","whom","you will","And whoever","you desire","of those whom","you (had) set aside ","then (there is) no","blame","upon you","That","(is) more suitable","that","may be cooled","their eyes","and not","they grieve","and they may be pleased","with what","you have given them ","all of them","And Allah","knows","what","(is) in","your hearts","And Allah is","And Allah is","All-Knower","Most Forbearing","(51)"],"transliterationArr":["tur'jī","man","tashāu","min'hunna","watu'wī","ilayka","man","tashāu","wamani","ib'taghayta","mimman","ʿazalta","falā","junāḥa","ʿalayka","dhālika","adnā","an","taqarra","aʿyunuhunna","walā","yaḥzanna","wayarḍayna","bimā","ātaytahunna","kulluhunna","wal-lahu","yaʿlamu","mā","fī","qulūbikum","wakāna","al-lahu","ʿalīman","ḥalīman",null],"verseTiming":[[1,0,820],[2,820,1610],[3,1610,3690],[4,3690,5080],[5,5080,7400],[6,7400,8120],[7,8120,9070],[8,9070,9920],[9,9920,11890],[10,11890,12390],[11,12390,13340],[12,13340,14430],[13,14430,15250],[14,15250,15770],[15,15770,16530],[16,16530,18240],[17,18240,19430],[18,19430,21030],[19,21030,21840],[20,21840,22650],[21,22650,24370],[22,24370,24850],[23,24850,26230],[24,26230,27220],[25,27220,28880],[26,28880,30900],[27,30900,32620],[28,32620,33940],[29,33940,34700],[30,34700,35030],[31,35030,35390],[32,35390,36870],[33,36870,37550],[34,37550,38290],[35,38290,39130],[36,39130,40735]]}},{"name":"33:52","price":"اس کے بعد اور عورتیں آپ کے لئے حلال نہیں اور نہ یہ (درست ہے) کہ ان کے بدلے اور عورتوں سے (نکاح کرے) اگر چہ ان کی صورت اچھی بھی لگتی ہو مگر(1) جو تیری مملوکہ ہوں(2)۔ اور اللہ تعالیٰ ہر چیز کا (پورا) نگہبان ہے.","arabic":"لَّا يَحِلُّ لَكَ ٱلنِّسَآءُ مِنۢ بَعۡدُ وَلَآ أَن تَبَدَّلَ بِهِنَّ مِنۡ أَزۡوَٰجٖ وَلَوۡ أَعۡجَبَكَ حُسۡنُهُنَّ إِلَّا مَا مَلَكَتۡ يَمِينُكَۗ وَكَانَ ٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ رَّقِيبٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3585,"juzNumber":22,"footnotes":"(1) آیت تخییر کے نزول کے بعد ازواج مطہرات نے دنیا کے اسباب عیش و راحت کے مقابلے میں عسرت کے ساتھ، نبی کریم (صلى الله عليه وسلم) کے ساتھ رہنا پسند کیا تھا، اس کا صلہ اللہ نے یہ دیا کہ آپ (صلى الله عليه وسلم) کو ان ازواج کے علاوہ (جن کی تعداد اس وقت 9 تھی) دیگر عورتوں سے نکاح کرنے یا اس میں سے کسی کو طلاق دے کر اس کی جگہ اور سے نکاح کرنے سے منع فرمایا دیا۔ بعض کہتے ہیں کہ بعد میں آپ (صلى الله عليه وسلم) کو یہ اختیار دے دیا گیا تھا، لیکن آپ (صلى الله عليه وسلم) نے کوئی نکاح نہیں کیا۔ (ابن کثیر)۔\n(2) یعنی لونڈیاں رکھنے پر کوئی پابندی نہیں ہے۔ بعض نے اس کے عموم سے استدلال کرتے ہوئے کہا ہے کہ کافر لونڈی بھی رکھنے کی آپ (صلى الله عليه وسلم) کو اجازت تھی اور بعض نے وَلا تُمْسِكُوا بِعِصَمِ الْكَوَافِرِ (الممتحنة: 10) کے پیش نظر اسے آپ (صلى الله عليه وسلم) کے حلال نہیں سمجھا۔ (فتح القدیر)۔","lang":"ur","meta":{"transliteration":"lā yaḥillu laka al-nisāu min baʿdu walā an tabaddala bihinna min azwājin walaw aʿjabaka ḥus'nuhunna illā mā malakat yamīnuka wakāna al-lahu ʿalā kulli shayin raqīban ","translations":["(It is) not","lawful","for you","(to marry) women","after (this)","after (this)","and not","to","exchange","them","for","(other) wives","even if","pleases you","their beauty","except","whom","you rightfully possess","you rightfully possess","And Allah is","And Allah is","over","all","things","an Observer","(52)"],"transliterationArr":["lā","yaḥillu","laka","al-nisāu","min","baʿdu","walā","an","tabaddala","bihinna","min","azwājin","walaw","aʿjabaka","ḥus'nuhunna","illā","mā","malakat","yamīnuka","wakāna","al-lahu","ʿalā","kulli","shayin","raqīban",null],"verseTiming":[[1,0,470],[2,470,1210],[3,1210,1590],[4,1590,4250],[5,4250,4990],[6,4990,5650],[7,5650,7320],[8,7320,8130],[9,8130,9130],[10,9130,10370],[11,10370,10710],[12,10710,12390],[13,12390,12880],[14,12880,13780],[15,13780,15400],[16,15400,16210],[17,16210,16570],[18,16570,17290],[19,17290,18210],[20,18210,19250],[21,19250,20080],[22,20080,20690],[23,20690,21300],[24,21300,21990],[25,21990,24315]]}},{"name":"33:53","price":"اے ایمان والو! جب تک تمہیں اجازت نہ دی جائے تم نبی کے گھروں میں نہ جایا کرو کھانے کے لئے ایسے وقت میں کہ اس کے پکنے کا انتظار کرتے رہو بلکہ جب بلایا جائے جاؤ اور جب کھا چکو نکل کھڑے ہو، وہیں باتوں میں مشغول نہ ہوجایا کرو۔ نبی کو تمہاری اس بات سے تکلیف ہوتی ہے۔ تو وه لحاظ کر جاتے ہیں اور اللہ تعالیٰ (بیان) حق میں کسی کا لحاظ نہیں کرتا(1) ، جب تم نبی کی بیویوں سے کوئی چیز طلب کرو تو پردے کے پیچھے سے طلب کرو(2)۔ تمہارے اور ان کے دلوں کے لئے کامل پاکیزگی یہی ہے(3)، نہ تمہیں یہ جائز ہے کہ تم رسول اللہ کو تکلیف دو(4) اور نہ تمہیں یہ حلال ہے کہ آپ کے بعد کسی وقت بھی آپ کی بیویوں سے نکاح کرو۔ (یاد رکھو) اللہ کے نزدیک یہ بہت بڑا (گناه) ہے.(5)","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَدۡخُلُواْ بُيُوتَ ٱلنَّبِيِّ إِلَّآ أَن يُؤۡذَنَ لَكُمۡ إِلَىٰ طَعَامٍ غَيۡرَ نَٰظِرِينَ إِنَىٰهُ وَلَٰكِنۡ إِذَا دُعِيتُمۡ فَٱدۡخُلُواْ فَإِذَا طَعِمۡتُمۡ فَٱنتَشِرُواْ وَلَا مُسۡتَـٔۡنِسِينَ لِحَدِيثٍۚ إِنَّ ذَٰلِكُمۡ كَانَ يُؤۡذِي ٱلنَّبِيَّ فَيَسۡتَحۡيِۦ مِنكُمۡۖ وَٱللَّهُ لَا يَسۡتَحۡيِۦ مِنَ ٱلۡحَقِّۚ وَإِذَا سَأَلۡتُمُوهُنَّ مَتَٰعٗا فَسۡـَٔلُوهُنَّ مِن وَرَآءِ حِجَابٖۚ ذَٰلِكُمۡ أَطۡهَرُ لِقُلُوبِكُمۡ وَقُلُوبِهِنَّۚ وَمَا كَانَ لَكُمۡ أَن تُؤۡذُواْ رَسُولَ ٱللَّهِ وَلَآ أَن تَنكِحُوٓاْ أَزۡوَٰجَهُۥ مِنۢ بَعۡدِهِۦٓ أَبَدًاۚ إِنَّ ذَٰلِكُمۡ كَانَ عِندَ ٱللَّهِ عَظِيمًا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3586,"juzNumber":22,"footnotes":"(1) اس آیت کا سبب نزول یہ ہے کہ نبی کریم (صلى الله عليه وسلم) کی دعوت پر حضرت زینب (رضی الله عنها) کے ولیمے میں صحابہ کرام (رضي الله عنهم) تشریف لائے جن میں سے بعض کھانے کے بعد بیٹھے ہوئے باتیں کرتے رہے جس سے آپ (صلى الله عليه وسلم) کو خاص تکلیف ہوئی، تاہم حیا واخلاق کی وجہ سے آپ (صلى الله عليه وسلم) نے انہیں جانے کے لئے کہا نہیں۔ (صحيح بخاري، تفسير سورة الأحزاب) چنانچہ اس آیت میں دعوت کے آداب بتلا دیئے گئے کہ ایک تو اس وقت جاؤ، جب کھانا تیار ہوچکا ہو، پہلے سے ہی جا کر دھرنا مار کر نہ بیٹھ جاؤ۔ دوسرا، کھاتے ہی اپنے اپنے گھروں کو چلے جاؤ، وہاں بیٹھے ہوئے باتیں مت کرتے رہو، کھانے کا ذکر تو سبب نزول کی وجہ سے ہے، ورنہ مطلب یہ ہے کہ جب بھی تمہیں بلایا جائے چاہے کھانے کے لئے یا کسی اور کام کے لئے، اجازت کے بغیر گھر کے اندر داخل مت ہو۔\n(2) یہ حکم حضرت عمر (رضي الله عنه) کی خواہش پر نازل ہوا۔ حضرت عمر (رضي الله عنه) نے نبی کریم (صلى الله عليه وسلم) سے عرض کیا، یا رسول اللہ (صلى الله عليه وسلم)! آپ کے پاس اچھے برے ہر طرح کے لوگ آتے ہیں، کاش آپ امہات المومنین کو پردے کا حکم دیں تو کیا اچھا ہو۔ جس پر اللہ نے یہ حکم نازل فرما دیا۔ (صحيح بخاري ، كتاب الصلاة ، وتفسير سورة البقرة، مسلم باب فضائل عمر بن الخطاب)۔\n(3) یہ پردے کی حکمت اور علت ہے کہ اس سے مرد اور عورت دونوں کے دل ریب وشک سے اور ایک دوسرے کے ساتھ فتنے میں مبتلا ہونے سے محفوظ رہیں گے۔\n(4) چاہے وہ کسی بھی لحاظ سے ہو۔ آپ (صلى الله عليه وسلم) کے گھر میں بغیر اجازت داخل ہونا، آپ (صلى الله عليه وسلم) کی خواہش کے بغیر گھر میں بیٹھے رہنا اور بغیر حجاب کے ازواج مطہرات سے گفتگو کرنا، یہ امور بھی ایذا کے باعث ہیں، ان سے بھی اجتناب کرو۔\n(5) یہ حکم ان ازواج مطہرات کے بارے میں ہے جو وفات کے وقت نبی کریم (صلى الله عليه وسلم) کے حبالۂ عقد میں تھیں۔ تاہم جن کو آپ (صلى الله عليه وسلم) نے ہم بستری کے بعد زندگی میں طلاق دے کر اپنے سےعلیحدہ کردیا ہو، وہ اس کے عموم میں داخل ہیں یا نہیں؟ اس میں دو رائے ہیں۔ بعض ان کو بھی شامل سمجھتے ہیں اور بعض نہیں۔ لیکن آپ (صلى الله عليه وسلم) کی ایسی کوئی بیوی تھی ہی نہیں۔ اس لئے یہ محض ایک فرضی شکل ہے۔ علاوہ ازیں ایک تیسری قسم ان عورتوں کی ہے جن سے آپ (صلى الله عليه وسلم) نکاح ہوا لیکن ہم بستری سے قبل ہی ان کو آپ (صلى الله عليه وسلم) نے طلاق دے دی۔ ان سے دوسرے لوگوں کا نکاح درست ہونے میں کوئی نزاع معلوم نہیں۔ (تفسیر ابن کثیر)","lang":"ur","meta":{"transliteration":"yāayyuhā alladhīna āmanū lā tadkhulū buyūta al-nabiyi illā an yu'dhana lakum ilā ṭaʿāmin ghayra nāẓirīna ināhu walākin idhā duʿītum fa-ud'khulū fa-idhā ṭaʿim'tum fa-intashirū walā mus'tanisīna liḥadīthin inna dhālikum kāna yu'dhī al-nabiya fayastaḥyī minkum wal-lahu lā yastaḥyī mina al-ḥaqi wa-idhā sa-altumūhunna matāʿan fasalūhunna min warāi ḥijābin dhālikum aṭharu liqulūbikum waqulūbihinna wamā kāna lakum an tu'dhū rasūla al-lahi walā an tankiḥū azwājahu min baʿdihi abadan inna dhālikum kāna ʿinda al-lahi ʿaẓīman ","translations":["O you who believe","O you who believe","O you who believe","(Do) not","enter","(the) houses","(of) the Prophet","except","when","permission is given","to you","for","a meal","without","awaiting","its preparation","But","when","you are invited","then enter","and when","you have eaten","then disperse","and not","seeking to remain","for a conversation","Indeed","that","was","troubling","the Prophet","and he is shy","of (dismissing) you","But Allah","is not shy","is not shy","of","the truth","And when","you ask them","(for) anything","then ask them","from","behind","a screen","That","(is) purer","for your hearts","and their hearts","And not","is","for you","that","you trouble","(the) Messenger","(of) Allah","and not","that","you should marry","his wives","after him","after him","ever","Indeed","that","is","near","Allah","an enormity","(53)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","lā","tadkhulū","buyūta","al-nabiyi","illā","an","yu'dhana","lakum","ilā","ṭaʿāmin","ghayra","nāẓirīna","ināhu","walākin","idhā","duʿītum","fa-ud'khulū","fa-idhā","ṭaʿim'tum","fa-intashirū","walā","mus'tanisīna","liḥadīthin","inna","dhālikum","kāna","yu'dhī","al-nabiya","fayastaḥyī","minkum","wal-lahu","lā","yastaḥyī","mina","al-ḥaqi","wa-idhā","sa-altumūhunna","matāʿan","fasalūhunna","min","warāi","ḥijābin","dhālikum","aṭharu","liqulūbikum","waqulūbihinna","wamā","kāna","lakum","an","tu'dhū","rasūla","al-lahi","walā","an","tankiḥū","azwājahu","min","baʿdihi","abadan","inna","dhālikum","kāna","ʿinda","al-lahi","ʿaẓīman",null],"verseTiming":[[1,0,2870],[2,2870,3770],[3,3770,4690],[4,4690,5070],[5,5070,5950],[6,5950,6670],[7,6670,8270],[8,8270,10160],[9,10160,10480],[10,10480,11890],[11,11890,12850],[12,12850,14840],[13,14840,15400],[14,15400,16340],[15,16340,16920],[16,16920,17380],[17,17380,18350],[18,18350,18870],[19,18870,19940],[20,19940,20780],[21,20780,21630],[22,21630,22110],[23,22110,23020],[24,23020,23880],[25,23880,24570],[26,24570,25510],[27,25510,27150],[28,27150,27630],[29,27630,28980],[30,28980,29620],[31,29620,30750],[32,30750,32360],[33,32360,33340],[34,33340,33820],[35,33820,34470],[36,34470,35810],[37,35810,37180],[38,37180,39180],[39,39180,40040],[40,40040,40410],[41,40410,41560],[42,41560,41830],[43,41830,42970],[44,42970,43650],[45,43650,45760],[46,45760,47140],[47,47140,49180],[48,49180,49540],[49,49540,52189],[50,52189,54199],[51,54199,55499],[52,55499,56249],[53,56249,57529],[54,57529,59509],[55,59509,60379],[56,60379,61039],[57,61039,61529],[58,61529,62459],[59,62459,63249],[60,63249,63999],[61,63999,64739],[62,64739,66598],[63,66598,67448],[64,67448,70138],[65,70138,71418],[66,71418,72248],[67,72248,74637],[68,74637,75887],[69,75887,76907],[70,76907,77857],[71,77857,78307],[72,78307,79547],[73,79547,80347],[74,80347,81432]]}},{"name":"33:54","price":"تم کسی چیز کو ﻇاہر کرو یا مخفی رکھو اللہ تو ہر چیز کا بخوبی علم رکھنے واﻻ ہے.","arabic":"إِن تُبۡدُواْ شَيۡـًٔا أَوۡ تُخۡفُوهُ فَإِنَّ ٱللَّهَ كَانَ بِكُلِّ شَيۡءٍ عَلِيمٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3587,"juzNumber":22,"footnotes":"","lang":"ur","meta":{"transliteration":"in tub'dū shayan aw tukh'fūhu fa-inna al-laha kāna bikulli shayin ʿalīman ","translations":["Whether","you reveal","a thing","or","conceal it","indeed","Allah","is","of all","things","All-Knower","(54)"],"transliterationArr":["in","tub'dū","shayan","aw","tukh'fūhu","fa-inna","al-laha","kāna","bikulli","shayin","ʿalīman",null],"verseTiming":[[1,0,990],[2,990,1820],[3,1820,2610],[4,2610,2900],[5,2900,3900],[6,3900,5080],[7,5080,5730],[8,5730,6420],[9,6420,7210],[10,7210,7910],[11,7910,9005]]}},{"name":"33:55","price":"ان عورتوں پر کوئی گناه نہیں کہ وه اپنے باپوں اور اپنے بیٹوں اور بھائیوں اور بھتیجوں اور بھانجوں اور اپنی (میل جول کی) عورتوں اور ملکیت کے ماتحتوں (لونڈی، غلام) کے سامنے ہوں(1) ۔ (عورتو!) اللہ سے ڈرتی رہو۔ اللہ تعالیٰ یقیناً ہر چیز پر شاہد ہے.(2)","arabic":"لَّا جُنَاحَ عَلَيۡهِنَّ فِيٓ ءَابَآئِهِنَّ وَلَآ أَبۡنَآئِهِنَّ وَلَآ إِخۡوَٰنِهِنَّ وَلَآ أَبۡنَآءِ إِخۡوَٰنِهِنَّ وَلَآ أَبۡنَآءِ أَخَوَٰتِهِنَّ وَلَا نِسَآئِهِنَّ وَلَا مَا مَلَكَتۡ أَيۡمَٰنُهُنَّۗ وَٱتَّقِينَ ٱللَّهَۚ إِنَّ ٱللَّهَ كَانَ عَلَىٰ كُلِّ شَيۡءٖ شَهِيدًا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3588,"juzNumber":22,"footnotes":"(1) جب عورتوں کے لئے پردے کا حکم نازل ہوا تو پھر گھر میں موجود اقارب یا ہر وقت آنے والے جانےوالے رشتے داروں کی بابت سوال ہوا کہ ان سے پردہ کیا جائے یا نہیں؟ چنانچہ اس آیت میں ان اقارب کا ذکر کردیا گیا جن سے پردے کی ضرورت نہیں؟ اس کی تفصیل سورۂ نور کی آیت 31 ”وَلا يُبْدِينَ زِينَتَهُنَّ“ میں بھی گزرچکی ہے، اسے ملاحظہ فرما لیا جائے۔\n(2) اس مقام پر عورتوں کو تقویٰ کا حکم دے کر واضح کردیا کہ اگر تمہارے دلوں میں تقویٰ ہوگا تو پردے کا جو اصل مقصد، قلب ونظر کی طہارت اور عصمت کی حفاظت ہے، وہ یقیناً تمہیں حاصل ہوگا، ورنہ حجاب کی ظاہری پابندیاں تمہیں گناہ میں ملوث ہونے سے نہیں بچا سکیں گی۔","lang":"ur","meta":{"transliteration":"lā junāḥa ʿalayhinna fī ābāihinna walā abnāihinna walā ikh'wānihinna walā abnāi ikh'wānihinna walā abnāi akhawātihinna walā nisāihinna walā mā malakat aymānuhunna wa-ittaqīna al-laha inna al-laha kāna ʿalā kulli shayin shahīdan ","translations":["(There is) no","blame","upon them","concerning","their fathers","and not","their sons","and not","their brothers","and not","sons","(of) their brothers","and not","sons","(of) their sisters","and not","their women","and not","what","they rightfully possess","they rightfully possess","And fear","Allah","Indeed","Allah","is","over","all","things","a Witness","(55)"],"transliterationArr":["lā","junāḥa","ʿalayhinna","fī","ābāihinna","walā","abnāihinna","walā","ikh'wānihinna","walā","abnāi","ikh'wānihinna","walā","abnāi","akhawātihinna","walā","nisāihinna","walā","mā","malakat","aymānuhunna","wa-ittaqīna","al-laha","inna","al-laha","kāna","ʿalā","kulli","shayin","shahīdan",null],"verseTiming":[[1,0,390],[2,390,1090],[3,1090,2560],[4,2560,4130],[5,4130,7160],[6,7160,8810],[7,8810,11860],[8,11860,13490],[9,13490,15710],[10,15710,16750],[11,16750,17950],[12,17950,19830],[13,19830,20120],[14,20120,21660],[15,21660,23790],[16,23790,25730],[17,25730,27210],[18,27210,29330],[19,29330,31360],[20,31360,31850],[21,31850,34840],[22,34840,35340],[23,35340,35700],[24,35700,36520],[25,36520,38560],[26,38560,40240],[27,40240,42470],[28,42470,43700],[29,43700,44490],[30,44490,45180],[31,45180,45840],[32,45840,46580],[33,46580,48140],[34,48140,50305]]}},{"name":"33:56","price":"اللہ تعالیٰ اور اس کے فرشتے اس نبی پر رحمت بھیجتے ہیں۔ اے ایمان والو! تم (بھی) ان پر درود بھیجو اور خوب سلام (بھی) بھیجتے رہا کرو.(1)","arabic":"إِنَّ ٱللَّهَ وَمَلَٰٓئِكَتَهُۥ يُصَلُّونَ عَلَى ٱلنَّبِيِّۚ يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ صَلُّواْ عَلَيۡهِ وَسَلِّمُواْ تَسۡلِيمًا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3589,"juzNumber":22,"footnotes":"(1) اس آیت میں نبی کریم (صلى الله عليه وسلم) کے اس مرتبہ و منزلت کا بیان ہے جو ملأ اعلیٰ (آسمانوں) میں آپ (صلى الله عليه وسلم) کو حاصل ہے اور وہ یہ کہ اللہ تبارک تعالیٰ فرشتوں میں آپ (صلى الله عليه وسلم) کی ثناو تعریف کرتا اور آپ (صلى الله عليه وسلم) پر رحمتیں بھیجتا ہے اور فرشتے بھی آپ (صلى الله عليه وسلم) کی بلندی درجات کی دعا کرتے ہیں۔ اس کے ساتھ ہی اللہ تعالیٰ نے عالم سفلی (اہل زمین) کو حکم دیا کہ وہ بھی آپ (صلى الله عليه وسلم) پر صلوٰۃ وسلام بھیجیں تاکہ آپ (صلى الله عليه وسلم) کی تعریف میں علوی اورسفلی دونوں عالم متحد ہوجائیں۔ حدیث میں آتا ہے، صحابہ کرام (رضي الله عنهم) نے عرض کیا، یا رسول اللہ ! سلام کا طریقہ تو ہم جانتے ہیں (یعنی التحیات میں السَّلامُ عَلَيْكَ أَيُّهَا النَّبِيُّ ! پڑھتے ہیں) ہم درود کس طرح پڑھیں؟ اس پر آپ (صلى الله عليه وسلم) نے وہ درود ابراہیمی بیان فرمایا جو نمازمیں پڑھا جاتا ہے۔ (صحيح بخاري، تفسير سورة الأحزاب) علاوہ ازیں احادیث میں درود کے اور بھی صیغے آتے ہیں، جو پڑھے جاسکتے ہیں۔ نیز مختصراً صلی اللہ علیٰ رسول اللہ وسلم بھی پڑھا جاسکتا ہے تاہم الصَّلاةُ وَالسَّلامُ عَلَيْكَ يَا رَسُولَ اللهِ ! پڑھنا اس لئے صحیح نہیں کہ اس میں نبی کریم (صلى الله عليه وسلم) سے خطاب ہے اور یہ صیغہ نبی کریم سے عام درود کے وقت منقول نہیں ہے اور تحیات میں السَّلامُ عَلَيْكَ أَيُّهَا النَّبِيُّ ! چونکہ آپ (صلى الله عليه وسلم) سے منقول ہے اس وجہ سے اس وقت میں پڑھنے میں کوئی قباحت نہیں مزید برآں اس کا پڑھنے والا اس فاسد عقیدے سے پڑھتا ہے کہ آپ (صلى الله عليه وسلم) اسے براہ راست سنتے ہیں۔ یہ عقیدہ فاسدہ قرآن و حدیث کے خلاف ہے اور اس عقیدے سے مذکورہ خانہ ساز درود پڑھنا بھی غیر صحیح ہے۔ اسی طرح اذان سے قبل اسے پڑھنا بھی بدعت ہے، جو ثواب نہیں، گناہ ہے۔ احادیث میں درود کی بڑی فضیلت وارد ہے۔ نماز میں اس کا پڑھنا واجب ہے یا سنت؟ جمہور علما اسے سنت سمجھتے ہیں اور امام شافعی اور بہت سے علما واجب۔ اور احادیث سے اس کے وجوب ہی کی تائید ہوتی ہے۔ اسی طرح احادیث سے یہ بھی معلوم ہوتا ہے کہ جس طرح آخری تشہد میں درود پڑھنا واجب ہے، پہلے تشہد میں بھی درود پڑھنے کی وہی حیثیت ہے۔ اس لئے نماز کے دونوں تشہد میں درود پڑھنا ضروری ہے۔\nاس کے دلائل مختصراً حسب ذیل ہیں۔\nایک دلیل یہ ہے کہ مسند احمد میں صحیح سند سے مروی ہے کہ ایک شخص نے نبی کریم (صلى الله عليه وسلم) سے سوال کیا، یا رسول اللہ (صلى الله عليه وسلم) آپ (صلى الله عليه وسلم) پر سلام کس طرح پڑھنا ہے، یہ تو ہم نے جان لیا (کہ ہم تشہد میں السَّلامُ عَلَيْكَ پڑھتے ہیں) لیکن جب ہم نماز میں ہوں تو آپ (صلى الله عليه وسلم) پر درود کس طرح پڑھیں؟ تو آپ (صلى الله عليه وسلم) نے درود ابراہیمی کی تلقین فرمائی (الفتح الربانی، ج 4، ص 20۔21) مسند احمد کے علاوہ یہ روایت صحیح ابن حبان، سنن کبری بیہقی، مستدرک حاکم اور ابن خزیمہ میں بھی ہے۔ اس میں صراحت ہے کہ جس طرح سلام نماز میں پڑھا جاتا ہے یعنی تشہد میں، اسی طرح یہ سوال بھی نماز کے اندر درود پڑھنے سے متعلق تھا، نبی (صلى الله عليه وسلم) نے درود ابراہیمی پڑھنے کا حکم فرمایا۔ جس سے معلوم ہوا کہ نماز میں سلام کے ساتھ درود بھی پڑھنا چاہیئے، اور اس کا مقام تشہد ہے۔ اور حدیث میں یہ عام ہے، اسے پہلے یا دوسرے تشہد کے ساتھ خاص نہیں کیا گیا ہے جس سے یہ استدلال کرنا صحیح ہے کہ (پہلے اور دوسرے) دونوں تشہد میں سلام اور درود پڑھا جائے۔ اور جن روایات میں تشہد اول کا بغیر درود کے ذکر ہے، انہیں سورۂ احزاب کی آیت صَلُّوا عَلَيْهِ وَسَلِّمُوا کے نزول سے پہلے پر محمول کیا جائے گا۔ لیکن اس آیت کے نزول یعنی 5 ہجری کے بعد جب نبی (صلى الله عليه وسلم) نے صحابہ (رضي الله عنهم) کے استفسار پر درود کے الفاظ بھی بیان فرما دیئے تو اب نماز میں سلام کے ساتھ صلوٰۃ (درود شریف) کا پڑھنا بھی ضروری ہوگیا، چاہے وہ پہلا تشہد ہو یا دوسرا۔ اس کی ایک اور دلیل یہ ہے کہ حضرت عائشہ (رضی الله عنها) نے بیان فرمایا کہ نبی (صلى الله عليه وسلم) (بعض دفعہ) رات کو 9 رکعات ادا فرماتے، آٹھویں رکعت میں تشہد بیٹھتے تو اس میں اپنے رب سے دعا کرتے اور اس کے پیغمبر (صلى الله عليه وسلم) پر درود پڑھتے، پھر سلام پھیرے بغیر کھڑے ہوجاتے اور نویں رکعت پوری کرکے تشہد میں بیٹھتےتو اپنے رب سے دعا کرتے اور اس کے پیغمبر پر درود پڑھتے اور پھر دعا کرتے، پھر سلام پھیر دیتے (السنن الكبرى للبيهقي، ج2 ص704 طبع جديد سنن النسائي، مع التعليقات السلفية، كتاب قيام الليل، ج1 ص202۔ مزید ملاحظہ ہو، صفة صلاة النبي صلى الله عليه وسلم للألباني صفحة 145) اس میں بالکل صراحت ہے کہ نبی (صلى الله عليه وسلم) نے اپنی رات کی نماز میں پہلے اور آخری دونوں تشہد میں درود پڑھا ہے۔ یہ اگرچہ نفلی نماز کا واقعہ ہے لیکن مذکورہ عمومی دلائل کی آپ (صلى الله عليه وسلم) کے اس عمل سے تائید ہوجاتی ہے، اس لئے اسے صرف نفلی نماز تک محدود کردینا صحیح نہیں ہوگا۔","lang":"ur","meta":{"transliteration":"inna al-laha wamalāikatahu yuṣallūna ʿalā al-nabiyi yāayyuhā alladhīna āmanū ṣallū ʿalayhi wasallimū taslīman ","translations":["Indeed","Allah","and His Angels","send blessings","upon","the Prophet","O you who believe","O you who believe","O you who believe","Send blessings","on him","and greet him","(with) greetings","(56)"],"transliterationArr":["inna","al-laha","wamalāikatahu","yuṣallūna","ʿalā","al-nabiyi","yāayyuhā","alladhīna","āmanū","ṣallū","ʿalayhi","wasallimū","taslīman",null],"verseTiming":[[1,0,1080],[2,1080,2000],[3,2000,5120],[4,5120,6350],[5,6350,6720],[6,6720,8440],[7,8440,11770],[8,11770,12740],[9,12740,13750],[10,13750,14590],[11,14590,15360],[12,15360,16510],[13,16510,18415]]}},{"name":"33:57","price":"جو لوگ اللہ اور اس کے رسول کو ایذا دیتے ہیں ان پر دنیا اور آخرت میں اللہ کی پھٹکار ہے اور ان کے لئے نہایت رسوا کن عذاب ہے.(1)","arabic":"إِنَّ ٱلَّذِينَ يُؤۡذُونَ ٱللَّهَ وَرَسُولَهُۥ لَعَنَهُمُ ٱللَّهُ فِي ٱلدُّنۡيَا وَٱلۡأٓخِرَةِ وَأَعَدَّ لَهُمۡ عَذَابٗا مُّهِينٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3590,"juzNumber":22,"footnotes":"(1) اللہ کا ایذا دینے کا مطلب ان افعال کا ارتکاب ہے جسے وہ ناپسند فرماتا ہے۔ ورنہ اللہ کو ایذا پہنچانے پر کون قادر ہے؟ جیسے مشرکین، یہود اور نصاریٰ وغیرہ اللہ کے لئے اولاد ثابت کرتے ہیں۔ یا جس طرح حدیث قدسی میں ہے، اللہ تعالیٰ فرماتا ہے ابن آدم مجھے ایذا دیتا ہے، زمانے کو گالی دیتا ہے، حالانکہ میں ہی زمانہ ہوں اس کے رات اور دن کی گردش میرے ہی حکم سے ہوتی ہے۔ (صحيح بخاري، تفسير سورة الجاثية ومسلم، كتاب الألفاظ من الأدب، باب النهي عن سب الدهر) یعنی یہ کہنا کہ زمانے نے یا فلک کج رفتار نے ایسا کردیا، یہ صحیح نہیں، اس لئے کہ افعال اللہ کے ہیں، زمانے یا فلک کے نہیں۔ اللہ کے رسول (صلى الله عليه وسلم) کو ایذا پہنچانا، آپ (صلى الله عليه وسلم) کی تکذیب، آپ (صلى الله عليه وسلم) کو شاعر، کذاب، ساحر وغیرہ کہنا ہے۔ علاوہ ازیں بعض احادیث میں صحابہ کرام (رضي الله عنهم) کو ایذا پہنچانے اور ان کی تنقیص واہانت کو بھی آپ (صلى الله عليه وسلم) نے ایذا قرار دیا ہے۔ لعنت کا مطلب، اللہ کی رحمت سے دوری اور محرومی ہے۔","lang":"ur","meta":{"transliteration":"inna alladhīna yu'dhūna al-laha warasūlahu laʿanahumu al-lahu fī al-dun'yā wal-ākhirati wa-aʿadda lahum ʿadhāban muhīnan ","translations":["Indeed","those who","annoy","Allah","and His Messenger","Allah has cursed them","Allah has cursed them","in","the world","and the Hereafter","and prepared","for them","a punishment","humiliating","(57)"],"transliterationArr":["inna","alladhīna","yu'dhūna","al-laha","warasūlahu","laʿanahumu","al-lahu","fī","al-dun'yā","wal-ākhirati","wa-aʿadda","lahum","ʿadhāban","muhīnan",null],"verseTiming":[[1,0,1010],[2,1010,1960],[3,1960,2940],[4,2940,3830],[5,3830,5090],[6,5090,6160],[7,6160,6970],[8,6970,7200],[9,7200,8250],[10,8250,9630],[11,9630,10670],[12,10670,11160],[13,11160,12120],[14,12120,14215]]}},{"name":"33:58","price":"اور جو لوگ مومن مردوں اور مومن عورتوں کو ایذا دیں بغیر کسی جرم کے جو ان سے سرزد ہوا ہو، وه (بڑے ہی) بہتان اور صریح گناه کا بوجھ اٹھاتے ہیں.(1)","arabic":"وَٱلَّذِينَ يُؤۡذُونَ ٱلۡمُؤۡمِنِينَ وَٱلۡمُؤۡمِنَٰتِ بِغَيۡرِ مَا ٱكۡتَسَبُواْ فَقَدِ ٱحۡتَمَلُواْ بُهۡتَٰنٗا وَإِثۡمٗا مُّبِينٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3591,"juzNumber":22,"footnotes":"(1) یعنی ان کو بدنام کرنے کے لئے ان پر بہتان باندھنا، ان کی ناجائز تنقیص و توہین کرنا۔ جیسے روافض صحابہ کرام (رضي الله عنهم) پر سب وشتم کرتے اور ان کی طرف ایسی باتیں منسوب کرتے ہیں جن کا ارتکاب انہوں نے نہیں کیا۔ امام ابن کثیر فرماتے ہیں رافضی منکوس القلوب ہیں، ممدوح اشخاص کی مذمت کرتے اور مذموم لوگوں کی مدح کرتے ہیں۔","lang":"ur","meta":{"transliteration":"wa-alladhīna yu'dhūna al-mu'minīna wal-mu'mināti bighayri mā ik'tasabū faqadi iḥ'tamalū buh'tānan wa-ith'man mubīnan ","translations":["And those who","harm","the believing men","and the believing women","for other than","what","they have earned","then certainly","they bear","false accusation","and sin","manifest","(58)"],"transliterationArr":["wa-alladhīna","yu'dhūna","al-mu'minīna","wal-mu'mināti","bighayri","mā","ik'tasabū","faqadi","iḥ'tamalū","buh'tānan","wa-ith'man","mubīnan",null],"verseTiming":[[1,0,1170],[2,1170,2180],[3,2180,3640],[4,3640,5210],[5,5210,5940],[6,5940,6070],[7,6070,7030],[8,7030,7670],[9,7670,8480],[10,8480,10070],[11,10070,10910],[12,10910,11890],[13,11890,13460],[14,13460,14270],[15,14270,16575]]}},{"name":"33:59","price":"اے نبی! اپنی بیویوں سے اور اپنی صاحبزادیوں سے اور مسلمانوں کی عورتیں سے کہہ دو کہ وه اپنے اوپر اپنی چادریں لٹکا لیا کریں(1) ، اس سے بہت جلد ان کی شناخت ہو جایا کرے گی پھر نہ ستائی جائیں گی(2)، اور اللہ تعالیٰ بخشنے واﻻ مہربان ہے.","arabic":"يَٰٓأَيُّهَا ٱلنَّبِيُّ قُل لِّأَزۡوَٰجِكَ وَبَنَاتِكَ وَنِسَآءِ ٱلۡمُؤۡمِنِينَ يُدۡنِينَ عَلَيۡهِنَّ مِن جَلَٰبِيبِهِنَّۚ ذَٰلِكَ أَدۡنَىٰٓ أَن يُعۡرَفۡنَ فَلَا يُؤۡذَيۡنَۗ وَكَانَ ٱللَّهُ غَفُورٗا رَّحِيمٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3592,"juzNumber":22,"footnotes":"(1) جَلابِيبُ، جِلْبَابٌ کی جمع ہے، جو ایسی بڑی چادر کو کہتے ہیں جس سے پورا بدن ڈھک جائے۔ اپنے اوپر چادر لٹکانے سے مراد اپنے چہرے پر اس طرح گھونگٹ نکالنا ہے کہ جس سے چہرے کا بیشتر حصہ بھی چھپ جائے اور نظر جھکا کر چلنے سے راستہ بھی نظر آتا جائے۔ پاک وہند یا دیگر اسلامی ممالک میں برقعے کی جو مختلف صورتیں ہیں، عہد رسالت میں یہ برقعے عام نہیں تھے، پھربعد میں معاشرت میں وہ سادگی نہ رہی جو عہد رسالت اور صحابہ و تابعین کے دور میں تھی، عورتیں نہایت سادہ لباس پہنتی تھیں، بناؤ سنگھار اور زیب وزینت کاکوئی جذبہ ان کے اندر نہیں ہوتا تھا۔ اس لئے ایک بڑی چادر سے بھی پردے کے تقاضے پورے ہو جاتے تھے۔ لیکن بعد میں یہ سادگی نہ رہی، اس کی جگہ تجمل اور زینت لے لی اور عورتوں کے اندر زرق برق لباس اور زیورات کی نمائش عام ہو گئی، جس کی وجہ سے چادر سے پردہ کرنا مشکل ہوگیا اور اس کی جگہ مختلف انداز کے برقعے عام ہو گئے۔ گو اس سے بعض دفعہ عورت کو، بالخصوص سخت گرمی میں، کچھ دقت بھی محسوس ہوتی ہے۔ لیکن یہ ذرا سی تکلیف شریعت کے تقاضوں کے مقابلے میں کوئی اہمیت نہیں رکھتی۔ تاہم جو عورت برقعے کے بجائے پردے کے لئے بڑی چادر استعمال کرتی ہے اور پورے بدن کو ڈھانپتی اور چہرے پر صحیح معنوں میں گھونگٹ نکالتی ہے، وہ یقیناً پردے کے حکم کو بجا لاتی ہے، کیونکہ برقعہ ایسی لازمی شئی نہیں ہے جسے شریعت نے پردے کے لئے لازمی قرار دیا ہو۔ لیکن آج کل عورتوں نے چادر کو بےپردگی اختیار کرنے کا ذریعے بنا لیا ہے۔ پہلے وہ برقعے کی جگہ چادر اوڑھنا شروع کرتی ہیں۔ پھر چادر بھی غائب ہوجاتی ہے، صرف دوپٹہ رہ جاتا ہے اور بعض عورتوں کے لئے اس کا لینا بھی گراں ہوتا ہے۔ اس صورت حال کو دیکھتے ہوئے کہنا پڑتا ہے کہ اب برقع کا استعمال ہی صحیح ہے کیوں کہ جب سے برقعے کی جگہ چادر نے لی ہے، بےپردگی عام ہوگئی ہے بلکہ عورتیں نیم برہنگی پر بھی فخر کرنے لگی ہیں فَإِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ، بہرحال اس آیت میں نبی کریم (صلى الله عليه وسلم) کی بیویوں، بیٹیوں اور عام مومن عورتوں کو گھر سے باہر نکلتے وقت پردے کا حکم دیا گیا ہے، جس سے واضح ہے کہ پردے کا حکم علما کا ایجاد کردہ نہیں ہے، جیسا کہ آج کل بعض لوگ باور کراتے ہیں، یا اس کو قرار واقعی اہمیت نہیں دیتے، بلکہ یہ اللہ کا حکم ہے جو قرآن کی نص سے ثابت ہے، اس سے اعراض، انکار اور بےپردگی پر اصرار کفر تک پہنچا سکتا ہے۔ دوسری بات اس سے یہ معلوم ہوئی کہ نبی کریم (صلى الله عليه وسلم) کی ایک بیٹی نہیں تھی جیسا کہ رافضیوں کا عقیدہ ہے، بلکہ آپ (صلى الله عليه وسلم) کی ایک سے زائد بیٹیاں تھیں جیسا کہ نص قرآنی سے واضح ہے اور یہ چار تھیں جیسا کہ تاریخ وسیر اور احادیث کی کتابوں سے ثابت ہے۔\n(2) یہ پردے کی حکمت اور اس کے فائدے کا بیان ہے کہ اس سے ایک شریف زادی اور باحیا عورت اور بےشرم اور بدکار عورت کے درمیان پہچان ہوگی۔ پردے سے معلوم ہوگا کہ یہ خاندانی عورت ہے جس سے چھیڑ چھاڑ کی جرات کسی کو نہیں ہوگی، اس کے برعکس بےپردہ عورت اوباشوں کی نگاہوں کا مرکز اور ان کی بوالہوسی کا نشانہ بنے گی۔","lang":"ur","meta":{"transliteration":"yāayyuhā al-nabiyu qul li-azwājika wabanātika wanisāi al-mu'minīna yud'nīna ʿalayhinna min jalābībihinna dhālika adnā an yuʿ'rafna falā yu'dhayna wakāna al-lahu ghafūran raḥīman ","translations":["O Prophet","O Prophet","Say","to your wives","and your daughters","and (the) women","(of) the believers","to draw","over themselves","[of]","their outer garments","That","(is) more suitable","that","they should be known","and not","harmed","And is","Allah","Oft-Forgiving","Most Merciful","(59)"],"transliterationArr":["yāayyuhā","al-nabiyu","qul","li-azwājika","wabanātika","wanisāi","al-mu'minīna","yud'nīna","ʿalayhinna","min","jalābībihinna","dhālika","adnā","an","yuʿ'rafna","falā","yu'dhayna","wakāna","al-lahu","ghafūran","raḥīman",null],"verseTiming":[[1,0,2540],[2,2540,4090],[3,4090,4390],[4,4390,5850],[5,5850,7040],[6,7040,9240],[7,9240,10490],[8,10490,11510],[9,11510,13300],[10,13300,14370],[11,14370,16610],[12,16610,17860],[13,17860,19930],[14,19930,20200],[15,20200,21750],[16,21750,22320],[17,22320,24560],[18,24560,25640],[19,25640,26530],[20,26530,27280],[21,27280,28575]]}},{"name":"33:60","price":"اگر (اب بھی) یہ منافق اور وه جن کے دلوں میں بیماری ہے اور وه لوگ جو مدینہ میں غلط افواہیں اڑانے والے ہیں(1) باز نہ آئے تو ہم آپ کو ان (کی تباہی) پر مسلط کردیں گے پھر تو وه چند دن ہی آپ کے ساتھ اس (شہر) میں ره سکیں گے.","arabic":"۞ لَّئِن لَّمۡ يَنتَهِ ٱلۡمُنَٰفِقُونَ وَٱلَّذِينَ فِي قُلُوبِهِم مَّرَضٞ وَٱلۡمُرۡجِفُونَ فِي ٱلۡمَدِينَةِ لَنُغۡرِيَنَّكَ بِهِمۡ ثُمَّ لَا يُجَاوِرُونَكَ فِيهَآ إِلَّا قَلِيلٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3593,"juzNumber":22,"footnotes":"(1) مسلمانوں کے حوصلے پست کرنے کے لئے منافقین افواہیں اڑاتے رہتے تھے کہ مسلمان فلاں علاقے میں مغلوب ہوگئے، یا دشمن کا لشکر جرار حملہ آور ہونے کے لئے آرہا ہے، وغیرہ وغیرہ۔","lang":"ur","meta":{"transliteration":"la-in lam yantahi al-munāfiqūna wa-alladhīna fī qulūbihim maraḍun wal-mur'jifūna fī al-madīnati lanugh'riyannaka bihim thumma lā yujāwirūnaka fīhā illā qalīlan ","translations":["If","(do) not","cease","the hypocrites","and those who","in","their hearts","(is) a disease","and those who spread rumors","in","the city","We will let you overpower them","We will let you overpower them","then","not","they will remain your neighbors","therein","except","(for) a little","(60)"],"transliterationArr":["la-in","lam","yantahi","al-munāfiqūna","wa-alladhīna","fī","qulūbihim","maraḍun","wal-mur'jifūna","fī","al-madīnati","lanugh'riyannaka","bihim","thumma","lā","yujāwirūnaka","fīhā","illā","qalīlan",null],"verseTiming":[[1,0,490],[2,490,980],[3,980,2420],[4,2420,4060],[5,4060,5050],[6,5050,5430],[7,5430,6550],[8,6550,8310],[9,8310,9860],[10,9860,10080],[11,10080,11250],[12,11250,13260],[13,13260,14300],[14,14300,16230],[15,16230,16760],[16,16760,18060],[17,18060,18390],[18,18390,19950],[19,19950,21720],[20,21720,22500],[21,22500,23945]]}},{"name":"33:61","price":"ان پر پھٹکار برسائی گئی، جہاں بھی مل جائیں پکڑے جائیں اور خوب ٹکڑے ٹکڑے کردیئے جائیں.(1)","arabic":"مَّلۡعُونِينَۖ أَيۡنَمَا ثُقِفُوٓاْ أُخِذُواْ وَقُتِّلُواْ تَقۡتِيلٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3594,"juzNumber":22,"footnotes":"(1) یہ حکم نہیں ہے کہ ان کو پکڑ کر مار ڈالا جائے، بلکہ بد دعا ہے کہ اگر وہ اپنے نفاق اور ان حرکتوں سے باز نہ آئے تو ان کا نہایت عبرت ناک حشر ہوگا۔ بعض کہتے ہیں کہ یہ حکم ہے۔ لیکن یہ منافقین نزول آیت کے بعد اپنی حرکتوں سے باز آگئے تھے، اس لئے ان کے خلاف یہ کارروائی نہیں کی گئی جس کا حکم اس آیت میں دیا گیا تھا۔ (فتح القدیر)۔","lang":"ur","meta":{"transliteration":"malʿūnīna aynamā thuqifū ukhidhū waquttilū taqtīlan ","translations":["Accursed","wherever","they are found","they are seized","and massacred completely","and massacred completely","(61)"],"transliterationArr":["malʿūnīna","aynamā","thuqifū","ukhidhū","waquttilū","taqtīlan",null],"verseTiming":[[1,0,3090],[2,3090,4020],[3,4020,5980],[4,5980,6850],[5,6850,7880],[6,7880,9185]]}},{"name":"33:62","price":"ان سے اگلوں میں بھی اللہ کا یہی دستور جاری رہا۔ اور تو اللہ کے دستور میں ہرگز ردوبدل نہ پائے گا.","arabic":"سُنَّةَ ٱللَّهِ فِي ٱلَّذِينَ خَلَوۡاْ مِن قَبۡلُۖ وَلَن تَجِدَ لِسُنَّةِ ٱللَّهِ تَبۡدِيلٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3595,"juzNumber":22,"footnotes":"","lang":"ur","meta":{"transliteration":"sunnata al-lahi fī alladhīna khalaw min qablu walan tajida lisunnati al-lahi tabdīlan ","translations":["(Such is the) Way","(of) Allah","with","those who","passed away","before","before","and never","you will find","in (the) Way","(of) Allah","any change","(62)"],"transliterationArr":["sunnata","al-lahi","fī","alladhīna","khalaw","min","qablu","walan","tajida","lisunnati","al-lahi","tabdīlan",null],"verseTiming":[[1,0,1240],[2,1240,2060],[3,2060,2270],[4,2270,3230],[5,3230,3810],[6,3810,4980],[7,4980,5770],[8,5770,6730],[9,6730,7620],[10,7620,9000],[11,9000,9800],[12,9800,11465]]}},{"name":"33:63","price":"لوگ آپ سے قیامت کے بارے میں سوال کرتے ہیں۔ آپ کہہ دیجیئے! کہ اس کا علم تو اللہ ہی کو ہے، آپ کو کیا خبر بہت ممکن ہے قیامت بالکل ہی قریب ہو.","arabic":"يَسۡـَٔلُكَ ٱلنَّاسُ عَنِ ٱلسَّاعَةِۖ قُلۡ إِنَّمَا عِلۡمُهَا عِندَ ٱللَّهِۚ وَمَا يُدۡرِيكَ لَعَلَّ ٱلسَّاعَةَ تَكُونُ قَرِيبًا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3596,"juzNumber":22,"footnotes":"","lang":"ur","meta":{"transliteration":"yasaluka al-nāsu ʿani al-sāʿati qul innamā ʿil'muhā ʿinda al-lahi wamā yud'rīka laʿalla al-sāʿata takūnu qarīban ","translations":["Ask you","the people","about","the Hour","Say","Only","its knowledge","(is) with","Allah","And what","will make you know","Perhaps","the Hour","is","near","(63)"],"transliterationArr":["yasaluka","al-nāsu","ʿani","al-sāʿati","qul","innamā","ʿil'muhā","ʿinda","al-lahi","wamā","yud'rīka","laʿalla","al-sāʿata","takūnu","qarīban",null],"verseTiming":[[1,0,1030],[2,1030,2360],[3,2360,2740],[4,2740,4240],[5,4240,4570],[6,4570,6140],[7,6140,7120],[8,7120,8380],[9,8380,11070],[10,11070,11650],[11,11650,12610],[12,12610,13310],[13,13310,14380],[14,14380,15220],[15,15220,16595]]}},{"name":"33:64","price":"اللہ تعالیٰ نے کافروں پر لعنت کی ہے اور ان کے لئے بھڑکتی ہوئی آگ تیار کر رکھی ہے.","arabic":"إِنَّ ٱللَّهَ لَعَنَ ٱلۡكَٰفِرِينَ وَأَعَدَّ لَهُمۡ سَعِيرًا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3597,"juzNumber":22,"footnotes":"","lang":"ur","meta":{"transliteration":"inna al-laha laʿana al-kāfirīna wa-aʿadda lahum saʿīran ","translations":["Indeed","Allah","has cursed","the disbelievers","and has prepared","for them","a Blaze","(64)"],"transliterationArr":["inna","al-laha","laʿana","al-kāfirīna","wa-aʿadda","lahum","saʿīran",null],"verseTiming":[[1,0,1080],[2,1080,1850],[3,1850,2400],[4,2400,3900],[5,3900,4890],[6,4890,5370],[7,5370,6935]]}},{"name":"33:65","price":"جس میں وه ہمیشہ ہمیشہ رہیں گے۔ وه کوئی حامی ومددگار نہ پائیں گے.","arabic":"خَٰلِدِينَ فِيهَآ أَبَدٗاۖ لَّا يَجِدُونَ وَلِيّٗا وَلَا نَصِيرٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3598,"juzNumber":22,"footnotes":"","lang":"ur","meta":{"transliteration":"khālidīna fīhā abadan lā yajidūna waliyyan walā naṣīran ","translations":["Abiding","therein","forever","not","they will find","any protector","and not","any helper","(65)"],"transliterationArr":["khālidīna","fīhā","abadan","lā","yajidūna","waliyyan","walā","naṣīran",null],"verseTiming":[[1,0,1140],[2,1140,3280],[3,3280,3880],[4,3880,4430],[5,4430,5460],[6,5460,6350],[7,6350,7540],[8,7540,9115]]}},{"name":"33:66","price":"اس دن ان کے چہرے آگ میں الٹ پلٹ کئے جائیں گے۔ (حسرت وافسوس سے) کہیں گے کہ کاش ہم اللہ تعالیٰ اور رسول کی اطاعت کرتے.","arabic":"يَوۡمَ تُقَلَّبُ وُجُوهُهُمۡ فِي ٱلنَّارِ يَقُولُونَ يَٰلَيۡتَنَآ أَطَعۡنَا ٱللَّهَ وَأَطَعۡنَا ٱلرَّسُولَا۠","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3599,"juzNumber":22,"footnotes":"","lang":"ur","meta":{"transliteration":"yawma tuqallabu wujūhuhum fī al-nāri yaqūlūna yālaytanā aṭaʿnā al-laha wa-aṭaʿnā al-rasūlā ","translations":["(The) Day","will be turned about","their faces","in","the Fire","they will say","O we wish","we (had) obeyed","Allah","and obeyed","the Messenger","(66)"],"transliterationArr":["yawma","tuqallabu","wujūhuhum","fī","al-nāri","yaqūlūna","yālaytanā","aṭaʿnā","al-laha","wa-aṭaʿnā","al-rasūlā",null],"verseTiming":[[1,0,620],[2,620,1620],[3,1620,2850],[4,2850,3110],[5,3110,4430],[6,4430,5550],[7,5550,8330],[8,8330,9490],[9,9490,10270],[10,10270,11260],[11,11260,13035]]}},{"name":"33:67","price":"اور کہیں گے اے ہمارے رب! ہم نے اپنے سرداروں اور اپنے بڑوں کی مانی جنہوں نے ہمیں راه راست سے بھٹکا دیا.(1)","arabic":"وَقَالُواْ رَبَّنَآ إِنَّآ أَطَعۡنَا سَادَتَنَا وَكُبَرَآءَنَا فَأَضَلُّونَا ٱلسَّبِيلَا۠","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3600,"juzNumber":22,"footnotes":"(1) یعنی ہم نے تیرے پیغمبروں اور داعیان دین کے بجائے اپنے ان بڑوں اور بزرگوں کی پیروی کی، لیکن آج ہمیں معلوم ہوا کہ انہوں نے ہمیں تیرے پیغمبروں سے دور رکھ کر راہ راست سے بھٹکائے رکھا۔ آباپرستی اور تقلید اکابر آج بھی لوگوں کی گمراہی کا باعث ہے۔ کاش مسلمان آیات الٰہی پر غور کرکے ان پگڈنڈیوں سے نکلیں اور قرآن وحدیث کی صراط مستقیم کو اختیار کرلیں کہ نجات صرف اور صرف اللہ اور رسول کی پیروی میں ہی ہے۔ نہ کہ مشائخ واکابر کی تقلید میں یا آباواجداد کے فرسودہ طریقوں کے اختیار کرنے میں۔","lang":"ur","meta":{"transliteration":"waqālū rabbanā innā aṭaʿnā sādatanā wakubarāanā fa-aḍallūnā al-sabīlā ","translations":["And they will say","Our Lord","Indeed, we","[we] obeyed","our chiefs","and our great men","and they misled us","(from) the Way","(67)"],"transliterationArr":["waqālū","rabbanā","innā","aṭaʿnā","sādatanā","wakubarāanā","fa-aḍallūnā","al-sabīlā",null],"verseTiming":[[1,0,1100],[2,1100,2840],[3,2840,4570],[4,4570,6090],[5,6090,8150],[6,8150,11010],[7,11010,12450],[8,12450,14135]]}},{"name":"33:68","price":"پروردگار تو انہیں دگنا عذاب دے اور ان پر بہت بڑی لعنت نازل فرما.","arabic":"رَبَّنَآ ءَاتِهِمۡ ضِعۡفَيۡنِ مِنَ ٱلۡعَذَابِ وَٱلۡعَنۡهُمۡ لَعۡنٗا كَبِيرٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3601,"juzNumber":22,"footnotes":"","lang":"ur","meta":{"transliteration":"rabbanā ātihim ḍiʿ'fayni mina al-ʿadhābi wal-ʿanhum laʿnan kabīran ","translations":["Our Lord","Give them","double","[of]","punishment","and curse them","(with) a curse","great","(68)"],"transliterationArr":["rabbanā","ātihim","ḍiʿ'fayni","mina","al-ʿadhābi","wal-ʿanhum","laʿnan","kabīran",null],"verseTiming":[[1,0,2180],[2,2180,3300],[3,3300,4290],[4,4290,4570],[5,4570,7129],[6,7129,8339],[7,8339,9279],[8,9279,9639],[9,9639,10559],[10,10559,11759],[11,11759,12919],[12,12919,14574]]}},{"name":"33:69","price":"اے ایمان والو! ان لوگوں جیسے نہ بن جاؤ جنہوں نے موسیٰ کو تکلیف دی پس جو بات انہوں نے کہی تھی اللہ نے انہیں اس سے بری فرما دیا(1) ، اور وه اللہ کے نزدیک باعزت تھے.","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَكُونُواْ كَٱلَّذِينَ ءَاذَوۡاْ مُوسَىٰ فَبَرَّأَهُ ٱللَّهُ مِمَّا قَالُواْۚ وَكَانَ عِندَ ٱللَّهِ وَجِيهٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3602,"juzNumber":22,"footnotes":"(1) اس کی تفسیر حدیث میں اس طرح آئی ہے کہ حضرت موسیٰ (عليه السلام) نہایت باحیا تھے، چنانچہ اپنا جسم انہوں نے کبھی لوگوں کے سامنے ننگا نہیں کیا۔ بنی اسرائیل کہنے لگے کہ شاید موسیٰ (عليه السلام) کے جسم میں برص کے داغ یا کوئی اس قسم کی آفت ہے جس کی وجہ سے یہ ہر وقت لباس میں ڈھکا چھپا رہتا ہے۔ ایک مرتبہ حضرت موسیٰ (عليه السلام) تنہائی میں غسل کرنے لگے، کپڑے اتار کر ایک پتھر پر رکھ دیئے، پتھر (اللہ کے حکم سے) کپڑے لے بھاگ کھڑا ہوا۔ حضرت موسی (عليه السلام) اس کے پیچھے پیچھے دوڑے، حتیٰ کہ بنی اسرائیل کی ایک مجلس میں پہنچ گئے، انہوں نے حضرت موسیٰ (عليه السلام) کو ننگا دیکھا تو ان کے سارے شبہات دور ہوگئے۔ موسیٰ (عليه السلام) نہایت حسین وجمیل اور ہر قسم کے داغ اور عیب سے پاک تھے۔ یوں اللہ تبارک وتعالیٰ نے معجزانہ طور پر پتھر کے ذریعے سے ان کی اس الزام اور شبہے سے براءت کردی جو بنی اسرائیل کی طرف سے ان پر کیا جاتا تھا (صحيح بخاري كتاب الأنبياء) حضرت موسیٰ (عليه السلام) کے حوالے سے اہل ایمان کو سمجھایا جا رہا ہے کہ تم ہمارے پیغمبر آخر الزمان حضرت محمد (صلى الله عليه وسلم) کو بنی اسرائیل کی طرح ایذا مت پہنچاؤ اور آپ (صلى الله عليه وسلم) کی بابت ایسی بات مت کرو جسے سن کر آپ (صلى الله عليه وسلم) قلق اور اضطراب محسوس کریں، جیسے ایک موقعے پر مال غنیمت کی تقسیم میں ایک شخص نے کہا کہ اس میں عدل وانصاف سے کام نہیں لیا گیا۔ جب آپ (صلى الله عليه وسلم) تک یہ الفاظ پہنچے تو غضب ناک ہوئے حتیٰ کہ آپ (صلى الله عليه وسلم) کا چہرۂ مبارک سرخ ہوگیا آپ (صلى الله عليه وسلم) نے فرمایا ”موسیٰ (عليه السلام) پر اللہ کی رحمت ہو، انہیں اس سے کہیں زیادہ ایذا پہنچائی گئی، لیکن انہوں نے صبر کیا“۔ (بخاري كتاب الأنبياء، مسلم، كتاب الزكاة، باب إعطاء المؤلفة قلوبهم على الإسلام..)۔","lang":"ur","meta":{"transliteration":"yāayyuhā alladhīna āmanū lā takūnū ka-alladhīna ādhaw mūsā fabarra-ahu al-lahu mimmā qālū wakāna ʿinda al-lahi wajīhan ","translations":["O you who believe","O you who believe","O you who believe","(Do) not","be","like those who","abused","Musa","then Allah cleared him","then Allah cleared him","of what","they said","And he was","near","Allah","honorable","(69)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","lā","takūnū","ka-alladhīna","ādhaw","mūsā","fabarra-ahu","al-lahu","mimmā","qālū","wakāna","ʿinda","al-lahi","wajīhan",null],"verseTiming":[[1,0,2440],[2,2440,3380],[3,3380,4380],[4,4380,4760],[5,4760,5710],[6,5710,6930],[7,6930,7660],[8,7660,8380],[9,8380,9560],[10,9560,10340],[11,10340,11450],[12,11450,12440],[13,12440,13580],[14,13580,14770],[15,14770,15620],[16,15620,16695]]}},{"name":"33:70","price":"اے ایمان والو! اللہ تعالیٰ سے ڈرو اور سیدھی سیدھی (سچی) باتیں کیا کرو.(1)","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱتَّقُواْ ٱللَّهَ وَقُولُواْ قَوۡلٗا سَدِيدٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3603,"juzNumber":22,"footnotes":"(1) یعنی ایسی بات جس میں کجی اور انحراف ہو، نہ دھوکہ اور فریب۔ بلکہ سچ اور حق ہو۔ سَدِيدٌ يَعْنِي تَسْدِيدُ السَّهْمِ سے ہے، یعنی جس طرح تیر کو سیدھا کیا جاتا ہے تاکہ ٹھیک نشانے پر لگے، اسی طرح تمہاری زبان سےنکلی ہوئی بات اور تمہارا کردار راستی پر مبنی ہو، حق وصداقت سے بال برابر انحراف نہ ہو۔","lang":"ur","meta":{"transliteration":"yāayyuhā alladhīna āmanū ittaqū al-laha waqūlū qawlan sadīdan ","translations":["O you who believe","O you who believe","O you who believe","Fear","Allah","and speak","a word","right","(70)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","ittaqū","al-laha","waqūlū","qawlan","sadīdan",null],"verseTiming":[[1,0,2560],[2,2560,3460],[3,3460,4270],[4,4270,4910],[5,4910,5700],[6,5700,6630],[7,6630,7310],[8,7310,9435]]}},{"name":"33:71","price":"تاکہ اللہ تعالیٰ تمہارے کام سنوار دے اور تمہارے گناه معاف فرما دے(1) ، اور جو بھی اللہ اور اس کے رسول کی تابعداری کرے گا اس نے بڑی مراد پالی.","arabic":"يُصۡلِحۡ لَكُمۡ أَعۡمَٰلَكُمۡ وَيَغۡفِرۡ لَكُمۡ ذُنُوبَكُمۡۗ وَمَن يُطِعِ ٱللَّهَ وَرَسُولَهُۥ فَقَدۡ فَازَ فَوۡزًا عَظِيمًا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3604,"juzNumber":22,"footnotes":"(1) یہ تقویٰ اور قول سدید کا نتیجہ ہے کہ تمہارے عملوں کی اصلاح ہوگی اور مزید توفیق مرضیات سے نوازے جاؤ گے اور کچھ کمی کوتاہی رہ جائے گی، تو اسے اللہ تعالیٰ معاف فرما دے گا۔","lang":"ur","meta":{"transliteration":"yuṣ'liḥ lakum aʿmālakum wayaghfir lakum dhunūbakum waman yuṭiʿi al-laha warasūlahu faqad fāza fawzan ʿaẓīman ","translations":["He will amend","for you","your deeds","and forgive","for you","your sins","And whoever","obeys","Allah","and His Messenger","certainly","has attained","an attainment","great","(71)"],"transliterationArr":["yuṣ'liḥ","lakum","aʿmālakum","wayaghfir","lakum","dhunūbakum","waman","yuṭiʿi","al-laha","warasūlahu","faqad","fāza","fawzan","ʿaẓīman",null],"verseTiming":[[1,0,850],[2,850,1420],[3,1420,2760],[4,2760,3740],[5,3740,4260],[6,4260,5810],[7,5810,6200],[8,6200,7560],[9,7560,8280],[10,8280,9520],[11,9520,10190],[12,10190,10800],[13,10800,11550],[14,11550,12725]]}},{"name":"33:72","price":"ہم نے اپنی امانت کو آسمانوں پر زمین پر اور پہاڑوں پر پیش کیا لیکن سب نے اس کے اٹھانے سے انکار کردیا اور اس سے ڈر گئے (مگر) انسان نے اسے اٹھا لیا(1) ، وه بڑا ہی ﻇالم جاہل ہے.(2)","arabic":"إِنَّا عَرَضۡنَا ٱلۡأَمَانَةَ عَلَى ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَٱلۡجِبَالِ فَأَبَيۡنَ أَن يَحۡمِلۡنَهَا وَأَشۡفَقۡنَ مِنۡهَا وَحَمَلَهَا ٱلۡإِنسَٰنُۖ إِنَّهُۥ كَانَ ظَلُومٗا جَهُولٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3605,"juzNumber":22,"footnotes":"(1) جب اللہ تعالیٰ نے اہل اطاعت کا اجر وثواب اور اہل معصیت کا وبال اور عذاب بیان کردیا تو اب شرعی احکام اور اس کی صعوبت کا تذکرہ فرما رہا ہے۔ امانت سے وہ احکام شرعیہ اور فرائض وواجبات مراد ہیں جن کی ادائیگی پر ثواب اور ان سے اعراض وانکار پر عذاب ہوگا۔ جب یہ تکالیف شرعیہ آسمان وزمین اور پہاڑوں پر پیش کی گئیں تو وہ ان کے اٹھانے سے ڈر گئے۔ لیکن جب انسان پر یہ چیز پیش کی گئی تو وہ اطاعت الٰہی (امانت) کے اجر وثواب اور اس کی فضیلت کو دیکھ کر اس بار گراں کو اٹھانے پر آمادہ ہوگیا۔ احکام شرعیہ کو امانت سے تعبیر کرکے اشارہ فرما دیا کہ ان کی ادائیگی انسانوں پر اسی طرح واجب ہے، جس طرح امانت کی ادائیگی ضروری ہوتی ہے۔ پیش کرنے کا مطلب کیا ہے؟ اور آسمان وزمین اور پہاڑوں نے کس طرح اس کا جواب دیا؟ اور انسان نے اسے کس وقت قبول کیا؟ اس کی پوری کیفیت نہ ہم جان سکتے ہیں نہ اسے بیان کرسکتے ہیں۔ ہمیں یقین رکھنا چاہیے کہ اللہ نے اپنی ہر مخلوق میں ایک خاص قسم کا احساس وشعور رکھا ہے، گو ہم اس کی حقیقت سے آگاہ نہیں ہیں، لیکن اللہ تعالیٰ تو ان کی بات سمجھنے پر قادر ہے، اس نے ضرور اس امانت کو ان پر پیش کیا ہوگا جسے قبول کرنے سے انہوں نے انکار کردیا۔ اور یہ ا نکار انہوں نے سرکشی وبغاوت کی بنا پر نہیں کیا بلکہ اس میں یہ خوف کار فرما تھا کہ اگر ہم اس امانت کے تقاضے پورے نہ کرسکے تو اس کی سخت سزا ہمیں بھگتنی ہوگی۔ انسان چونکہ جلد باز ہے، اس نے عقوبت وتعزیر کے پہلو پر زیادہ غور نہیں کیا اور حصول فضیلت کے شوق میں اس ذمے داری کو قبول کرلیا۔","lang":"ur","meta":{"transliteration":"innā ʿaraḍnā al-amānata ʿalā al-samāwāti wal-arḍi wal-jibāli fa-abayna an yaḥmil'nahā wa-ashfaqna min'hā waḥamalahā al-insānu innahu kāna ẓalūman jahūlan ","translations":["Indeed, We","[We] offered","the Trust","to","the heavens","and the earth","and the mountains","but they refused","to","bear it","and they feared","from it","but bore it","the man","Indeed, he","was","unjust","ignorant","(72)"],"transliterationArr":["innā","ʿaraḍnā","al-amānata","ʿalā","al-samāwāti","wal-arḍi","wal-jibāli","fa-abayna","an","yaḥmil'nahā","wa-ashfaqna","min'hā","waḥamalahā","al-insānu","innahu","kāna","ẓalūman","jahūlan",null],"verseTiming":[[1,0,1500],[2,1500,2290],[3,2290,3490],[4,3490,3870],[5,3870,5270],[6,5270,6230],[7,6230,7340],[8,7340,8260],[9,8260,8620],[10,8620,10600],[11,10600,12070],[12,12070,12360],[13,12360,14330],[14,14330,15490],[15,15490,16230],[16,16230,17180],[17,17180,21270],[18,21270,22740],[19,22740,23390],[20,23390,24470],[21,24470,26585]]}},{"name":"33:73","price":"(یہ اس لئے) کہ اللہ تعالیٰ منافق مردوں عورتوں اور مشرک مردوں عورتوں کو سزا دے اور مومن مردوں عورتوں کی توبہ قبول فرمائے(1) ، اور اللہ تعالیٰ بڑا ہی بخشنے واﻻ اور مہربان ہے.","arabic":"لِّيُعَذِّبَ ٱللَّهُ ٱلۡمُنَٰفِقِينَ وَٱلۡمُنَٰفِقَٰتِ وَٱلۡمُشۡرِكِينَ وَٱلۡمُشۡرِكَٰتِ وَيَتُوبَ ٱللَّهُ عَلَى ٱلۡمُؤۡمِنِينَ وَٱلۡمُؤۡمِنَٰتِۗ وَكَانَ ٱللَّهُ غَفُورٗا رَّحِيمَۢا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab"],"ayahNumber":3606,"juzNumber":22,"footnotes":"(1) یعنی یہ بار گراں اٹھا کر اس نے اپنے نفس پر ظلم کا ارتکاب کیا اور اس کے مقتضیات سے اعراض یا اس کی قدر وقیمت سے غفلت کرکے جہالت کا مظاہرہ پیش کیا۔\n(2) اس کا تعلق حَمَلَهَا سے ہے یعنی انسان کو اس امانت کا ذمے دار بنانے سے مقصد یہ ہے کہ اہل نفاق واہل شرک کا نفاق وشرک اور اہل ایمان کا ایمان ظاہر ہوجائے اور پھر اس کے مطابق جزا وسزا دی جائے۔","lang":"ur","meta":{"transliteration":"liyuʿadhiba al-lahu al-munāfiqīna wal-munāfiqāti wal-mush'rikīna wal-mush'rikāti wayatūba al-lahu ʿalā al-mu'minīna wal-mu'mināti wakāna al-lahu ghafūran raḥīman ","translations":["So that Allah may punish","So that Allah may punish","the hypocrite men","and the hypocrite women","and the polytheist men","and the polytheist women","and Allah will turn (in Mercy)","and Allah will turn (in Mercy)","to","the believing men","and the believing women","And Allah is","And Allah is","Oft-Forgiving","Most Merciful","(73)"],"transliterationArr":["liyuʿadhiba","al-lahu","al-munāfiqīna","wal-munāfiqāti","wal-mush'rikīna","wal-mush'rikāti","wayatūba","al-lahu","ʿalā","al-mu'minīna","wal-mu'mināti","wakāna","al-lahu","ghafūran","raḥīman",null],"verseTiming":[[1,0,1150],[2,1150,1980],[3,1980,3560],[4,3560,5350],[5,5350,6990],[6,6990,8570],[7,8570,9500],[8,9500,10280],[9,10280,10630],[10,10630,12010],[11,12010,15380],[12,15380,16110],[13,16110,17030],[14,17030,17940],[15,17940,19525]]}}],"chapter":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab","Chapter Al-Ahzab","Ahzab","Surah Ahzab","Chapter Ahzab","Al Ahzab","Surah Al Ahzab","Chapter Al Ahzab","Surah 33","Chapter 33","The Combined Forces","الأحزَاب"],"version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."}}