{"data":[{"name":"42:1","price":"حٰم.","arabic":"حمٓ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura"],"ayahNumber":4273,"juzNumber":25,"footnotes":"","lang":"ur","meta":{"transliteration":"hha-meem ","translations":["Ha Meem","(1)"],"transliterationArr":["hha-meem",null],"verseTiming":[[1,0,4775]]}},{"name":"42:2","price":"عسق.","arabic":"عٓسٓقٓ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura"],"ayahNumber":4274,"juzNumber":25,"footnotes":"","lang":"ur","meta":{"transliteration":"ain-seen-qaf ","translations":["Ayn Seen Qaaf","(2)"],"transliterationArr":["ain-seen-qaf",null],"verseTiming":[[1,0,15125]]}},{"name":"42:3","price":"اللہ تعالیٰ جو زبردست ہے اور حکمت واﻻ ہے اسی طرح تیری طرف اور تجھ سے اگلوں کی طرف وحی بھیجتا رہا.(1)","arabic":"كَذَٰلِكَ يُوحِيٓ إِلَيۡكَ وَإِلَى ٱلَّذِينَ مِن قَبۡلِكَ ٱللَّهُ ٱلۡعَزِيزُ ٱلۡحَكِيمُ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura"],"ayahNumber":4275,"juzNumber":25,"footnotes":"(1) یعنی جس طرح یہ قرآن تیری طرف نازل کیا گیا ہے اسی طرح تجھ سے پہلے انبیا پر صحیفے اور کتابیں نازل کی گئیں۔ وحی، اللہ کا وہ کلام ہے جو فرشتے کے ذریعے سے اللہ تعالیٰ اپنے پیغمبروں کے پاس بھیجتا رہا ہے۔ ایک صحابی نے رسول اللہ (صلى الله عليه وسلم) سے وحی کی کیفیت پوچھی تو آپ نے فرمایا کہ کبھی تو یہ میرے پاس گھنٹی کی آواز کی مثل آتی ہے اور یہ مجھ پر سب سے سخت ہوتی ہے، جب یہ ختم ہوجاتی ہے تو مجھے یاد ہوچکی ہوتی ہے اور کبھی فرشتہ انسانی شکل میں آتا ہے اور مجھ سے کلام کرتا ہے اور وہ جو کہتا ہے میں یاد کرلیتا ہوں۔ حضرت عائشہ (رضی الله عنها) فرماتی ہیں، میں نے سخت سردی میں مشاہدہ کیا جب وحی کی کیفیت ختم ہوتی تو آپ صلی اللہ علیہ وسلم پسینے میں شرابور ہوتے اور آپ کی پیشانی سے پسینے کے قطرے گر رہے ہوتے۔ (صحیح بخاری، باب بدء الوحی)۔","lang":"ur","meta":{"transliteration":"kadhālika yūḥī ilayka wa-ilā alladhīna min qablika al-lahu al-ʿazīzu al-ḥakīmu ","translations":["Thus","reveals","to you","and to","those","before you ","before you ","Allah","the All-Mighty","the All-Wise","(3)"],"transliterationArr":["kadhālika","yūḥī","ilayka","wa-ilā","alladhīna","min","qablika","al-lahu","al-ʿazīzu","al-ḥakīmu",null],"verseTiming":[[1,0,1170],[2,1170,3470],[3,3470,4290],[4,4290,4790],[5,4790,5740],[6,5740,6750],[7,6750,7640],[8,7640,8460],[9,8460,9520],[10,9520,11915]]}},{"name":"42:4","price":"آسمانوں کی (تمام) چیزیں اور جو کچھ زمین میں ہے سب اسی کا ہے وه برتر اور عظیم الشان ہے.","arabic":"لَهُۥ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۖ وَهُوَ ٱلۡعَلِيُّ ٱلۡعَظِيمُ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura"],"ayahNumber":4276,"juzNumber":25,"footnotes":"","lang":"ur","meta":{"transliteration":"lahu mā fī al-samāwāti wamā fī al-arḍi wahuwa al-ʿaliyu al-ʿaẓīmu ","translations":["To Him","(belong) whatever","(is) in","the heavens","and whatever","(is) in","the earth","and He","(is) the Most High","the Most Great","(4)"],"transliterationArr":["lahu","mā","fī","al-samāwāti","wamā","fī","al-arḍi","wahuwa","al-ʿaliyu","al-ʿaẓīmu",null],"verseTiming":[[1,0,690],[2,690,1060],[3,1060,1280],[4,1280,2700],[5,2700,3280],[6,3280,3520],[7,3520,4330],[8,4330,4870],[9,4870,5900],[10,5900,8785]]}},{"name":"42:5","price":"قریب ہے آسمان اوپر سے پھٹ پڑیں(1) اور تمام فرشتے اپنے رب کی پاکی تعریف کے ساتھ بیان کر رہے ہیں اور زمین والوں کے لیے استغفار کر رہے ہیں(2)۔ خوب سمجھ رکھو کہ اللہ تعالیٰ ہی معاف فرمانے واﻻ رحمت واﻻ ہے.(3)","arabic":"تَكَادُ ٱلسَّمَٰوَٰتُ يَتَفَطَّرۡنَ مِن فَوۡقِهِنَّۚ وَٱلۡمَلَٰٓئِكَةُ يُسَبِّحُونَ بِحَمۡدِ رَبِّهِمۡ وَيَسۡتَغۡفِرُونَ لِمَن فِي ٱلۡأَرۡضِۗ أَلَآ إِنَّ ٱللَّهَ هُوَ ٱلۡغَفُورُ ٱلرَّحِيمُ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura"],"ayahNumber":4277,"juzNumber":25,"footnotes":"(1) اللہ کی عظمت وجلال کی وجہ سے۔\n(2) یہ مضمون سورۂ مؤمن کی آیت 7 میں بھی بیان ہوا ہے۔\n(3) اپنے دوستوں اور اہل طاعت کے لیے یا تمام ہی بندوں کے لیے، کیونکہ کفار اور نافرمانوں کی فوراً گرفت نہ کرنا بلکہ انہیں ایک وقت معین تک مہلت دینا، یہ بھی اسی کی رحمت ومغفرت ہی کی قسم سے ہے۔","lang":"ur","meta":{"transliteration":"takādu al-samāwātu yatafaṭṭarna min fawqihinna wal-malāikatu yusabbiḥūna biḥamdi rabbihim wayastaghfirūna liman fī al-arḍi alā inna al-laha huwa al-ghafūru al-raḥīmu ","translations":["Almost","the heavens","break up","from","above them","and the Angels","glorify","(the) praise","(of) their Lord","and ask for forgiveness","for those","on","the earth","Unquestionably","indeed","Allah","He","(is) the Oft-Forgiving","the Most Merciful","(5)"],"transliterationArr":["takādu","al-samāwātu","yatafaṭṭarna","min","fawqihinna","wal-malāikatu","yusabbiḥūna","biḥamdi","rabbihim","wayastaghfirūna","liman","fī","al-arḍi","alā","inna","al-laha","huwa","al-ghafūru","al-raḥīmu",null],"verseTiming":[[1,0,970],[2,970,2410],[3,2410,3870],[4,3870,4780],[5,4780,6880],[6,6880,10610],[7,10610,12050],[8,12050,12830],[9,12830,13890],[10,13890,15730],[11,15730,17040],[12,17040,17290],[13,17290,18200],[14,18200,20850],[15,20850,22020],[16,22020,22960],[17,22960,23320],[18,23320,24420],[19,24420,27225]]}},{"name":"42:6","price":"اور جن لوگوں نے اس کے سوا دوسروں کو کارساز بنالیا ہے اللہ تعالیٰ ان پر نگران(1) ہے اور آپ ان کے ذمہ دار نہیں ہیں.(2)","arabic":"وَٱلَّذِينَ ٱتَّخَذُواْ مِن دُونِهِۦٓ أَوۡلِيَآءَ ٱللَّهُ حَفِيظٌ عَلَيۡهِمۡ وَمَآ أَنتَ عَلَيۡهِم بِوَكِيلٖ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura"],"ayahNumber":4278,"juzNumber":25,"footnotes":"(1) یعنی ان کے عملوں کو محفوظ کررہا ہے تاکہ اس پر ان کو جزا دے۔\n(2) یعنی آپ اس بات کے مکلف نہیں ہیں کہ ان کو ہدایت کے راستے پر لگادیں یا ان کے گناہوں پر ان کا مواخذہ فرمائیں، بلکہ یہ کام ہمارے ہیں، آپ کا کام صرف ابلاغ (پہنچا دینا) ہے۔","lang":"ur","meta":{"transliteration":"wa-alladhīna ittakhadhū min dūnihi awliyāa al-lahu ḥafīẓun ʿalayhim wamā anta ʿalayhim biwakīlin ","translations":["And those who","take","besides","besides","protectors","Allah","(is) a Guardian","over them","and not","you","(are) over them","a manager","(6)"],"transliterationArr":["wa-alladhīna","ittakhadhū","min","dūnihi","awliyāa","al-lahu","ḥafīẓun","ʿalayhim","wamā","anta","ʿalayhim","biwakīlin",null],"verseTiming":[[1,0,1430],[2,1430,2560],[3,2560,3570],[4,3570,6120],[5,6120,9270],[6,9270,10080],[7,10080,11150],[8,11150,12200],[9,12200,14230],[10,14230,15730],[11,15730,17300],[12,17300,20365]]}},{"name":"42:7","price":"اسی طرح ہم نے آپ کی طرف عربی قرآن کی وحی کی ہے(1) تاکہ آپ مکہ والوں کو اور اس کے آس پاس کے لوگوں کو خبردار کردیں(2) اور جمع ہونے کے دن سے جس(3) کے آنے میں کوئی شک نہیں ڈرا دیں۔ ایک گروه جنت میں ہوگا اور ایک گروه جہنم میں ہوگا.(4)","arabic":"وَكَذَٰلِكَ أَوۡحَيۡنَآ إِلَيۡكَ قُرۡءَانًا عَرَبِيّٗا لِّتُنذِرَ أُمَّ ٱلۡقُرَىٰ وَمَنۡ حَوۡلَهَا وَتُنذِرَ يَوۡمَ ٱلۡجَمۡعِ لَا رَيۡبَ فِيهِۚ فَرِيقٞ فِي ٱلۡجَنَّةِ وَفَرِيقٞ فِي ٱلسَّعِيرِ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura"],"ayahNumber":4279,"juzNumber":25,"footnotes":"(1) یعنی جس طرح ہم نے ہر رسول اس کی قوم کی زبان میں بھیجا، اسی طرح ہم نے آپ پر عربی زبان میں قرآن نازل کیا ہے، کیونکہ آپ کی قوم یہی زبان بولتی اور سمجھتی ہے۔\n(2) أُمّ الْقُرَى، مکے کا نام ہے۔ اسے بستیوں کی ماں اس لیے کہا گیا کہ یہ عرب کی قدیم ترین بستی ہے۔ گویا یہ تمام بستیوں کی ماں ہے جنہوں نے اسی سے جنم لیا ہے۔ مراد اہل مکہ ہیں۔ وَمَنْ حَوْلَهَا میں اس کے شرق و غرب کے تمام علاقے شامل ہیں۔ ان سب کو ڈرائیں کہ اگر وہ کفر و شرک سے تائب نہ ہوئے تو عذاب الٰہی کے مستحق قرار پائیں گے۔\n(3) قیامت والے دن کو جمع ہونے والا دن اس لیے کہا کہ اس میں اگلے پچھلے تمام انسان جمع ہوں گے علاوہ ازیں ظالم مظلوم اور مومن وکافر سب جمع ہوں گے اور اپنے اپنے اعمال کے مطابق جزا وسزا سے بہرہ ور ہوں گے۔\n(4) جو اللہ کے حکموں کو بجالایا ہوگا اور اس کی منہیات ومحرمات سے دور رہا ہوگا وہ جنت میں اور اس کی نافرمانی اور محرمات کا ارتکاب کرنے والا جہنم میں ہوگا۔ یہی دو گروہ ہوں گے۔ تیسرا گروہ نہیں ہوگا۔","lang":"ur","meta":{"transliteration":"wakadhālika awḥaynā ilayka qur'ānan ʿarabiyyan litundhira umma al-qurā waman ḥawlahā watundhira yawma al-jamʿi lā rayba fīhi farīqun fī al-janati wafarīqun fī al-saʿīri ","translations":["And thus","We have revealed","to you","a Quran","(in) Arabic","that you may warn","(the) mother","(of) the towns","and whoever","(is) around it","and warn","(of the) Day","(of) Assembly","(there is) no","doubt","in it","A party","(will be) in","Paradise","and a party","in","the Blazing Fire","(7)"],"transliterationArr":["wakadhālika","awḥaynā","ilayka","qur'ānan","ʿarabiyyan","litundhira","umma","al-qurā","waman","ḥawlahā","watundhira","yawma","al-jamʿi","lā","rayba","fīhi","farīqun","fī","al-janati","wafarīqun","fī","al-saʿīri",null],"verseTiming":[[1,0,1450],[2,1450,4459],[3,4459,5259],[4,5259,6499],[5,6499,7549],[6,7549,9689],[7,9689,10749],[8,10749,11689],[9,11689,12229],[10,12229,13549],[11,13549,16029],[12,16029,17129],[13,17129,18089],[14,18089,18649],[15,18649,19779],[16,19779,21489],[17,21489,22059],[18,22059,23019],[19,23019,23389],[20,23389,23999],[21,23999,26539],[22,26539,28299],[23,28299,28569],[24,28569,30469],[25,30469,32289],[26,32289,32509],[27,32509,35584]]}},{"name":"42:8","price":"اگر اللہ تعالیٰ چاہتا تو ان سب کو ایک ہی امت کا بنا دیتا(1) لیکن وه جسے چاہتا ہے اپنی رحمت میں داخل کرلیتا ہے اور ﻇالموں کا حامی اور مددگار کوئی نہیں.","arabic":"وَلَوۡ شَآءَ ٱللَّهُ لَجَعَلَهُمۡ أُمَّةٗ وَٰحِدَةٗ وَلَٰكِن يُدۡخِلُ مَن يَشَآءُ فِي رَحۡمَتِهِۦۚ وَٱلظَّٰلِمُونَ مَا لَهُم مِّن وَلِيّٖ وَلَا نَصِيرٍ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura"],"ayahNumber":4280,"juzNumber":25,"footnotes":"(1) اس صورت میں قیامت والے دن صرف ایک ہی گروہ ہوتا یعنی اہل ایمان اور اہل جنت کا لیکن اللہ کی حکمت و مشیت نے اس جبر کو پسند نہیں کیا بلکہ انسانوں کو آزمانے کے لیے اس نے انسانوں کو ارادہ و اختیار کی آزادی دی، جس نے اس آزادی کا صحیح استعمال کیا، وہ اللہ کی رحمت کا مستحق ہوگیا،اور جس نے اس کا غلط استعمال کیا، اس نے ظلم کا ارتکاب کیا کہ اللہ کی دی ہوئی آزادی اور اختیار کو اللہ ہی کی نافرمانی میں استعمال کیا۔ چنانچہ ایسے ظالموں کا قیامت والے دن کوئی مددگار نہیں ہوگا۔","lang":"ur","meta":{"transliteration":"walaw shāa al-lahu lajaʿalahum ummatan wāḥidatan walākin yud'khilu man yashāu fī raḥmatihi wal-ẓālimūna mā lahum min waliyyin walā naṣīrin ","translations":["And if","Allah willed","Allah willed","He could have made them","a community","one","but","He admits","whom","He wills","in (to)","His Mercy","And the wrongdoers","not","for them","any","protector","and not","any helper","(8)"],"transliterationArr":["walaw","shāa","al-lahu","lajaʿalahum","ummatan","wāḥidatan","walākin","yud'khilu","man","yashāu","fī","raḥmatihi","wal-ẓālimūna","mā","lahum","min","waliyyin","walā","naṣīrin",null],"verseTiming":[[1,0,800],[2,800,3070],[3,3070,3840],[4,3840,5090],[5,5090,7260],[6,7260,9110],[7,9110,10550],[8,10550,11380],[9,11380,11600],[10,11600,12510],[11,12510,14710],[12,14710,15130],[13,15130,16880],[14,16880,18570],[15,18570,18900],[16,18900,19510],[17,19510,21400],[18,21400,22500],[19,22500,23810],[20,23810,26545]]}},{"name":"42:9","price":"کیا ان لوگوں نے اللہ تعالیٰ کے سوا اور کارساز بنالیے ہیں، (حقیقتاً تو) اللہ تعالیٰ ہی کارساز ہے وہی مُردوں کو زنده کرے گا اور وہی ہر چیز پر قادر ہے.(1)","arabic":"أَمِ ٱتَّخَذُواْ مِن دُونِهِۦٓ أَوۡلِيَآءَۖ فَٱللَّهُ هُوَ ٱلۡوَلِيُّ وَهُوَ يُحۡيِ ٱلۡمَوۡتَىٰ وَهُوَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura"],"ayahNumber":4281,"juzNumber":25,"footnotes":"(1) جب یہ بات ہے تو پھر اللہ تعالیٰ ہی اس بات کا مستحق ہے کہ اس کو ولی اور کارساﺯ مانا جائے نہ کہ ان کو جن کے پاس کوئی اختیاری ہی نہیں ہے، اور جو سننے اور جواب دینے کی طاقت رکھتے ہیں، نہ نفع ونقصان پہنچانے کی صلاحیت۔","lang":"ur","meta":{"transliteration":"ami ittakhadhū min dūnihi awliyāa fal-lahu huwa al-waliyu wahuwa yuḥ'yī al-mawtā wahuwa ʿalā kulli shayin qadīrun ","translations":["Or","have they taken","besides Him","besides Him","protectors","But Allah ","He","(is) the Protector","and He","gives life","(to) the dead","And He","(is) on","every","thing","All-Powerful","(9)"],"transliterationArr":["ami","ittakhadhū","min","dūnihi","awliyāa","fal-lahu","huwa","al-waliyu","wahuwa","yuḥ'yī","al-mawtā","wahuwa","ʿalā","kulli","shayin","qadīrun",null],"verseTiming":[[1,0,480],[2,480,1460],[3,1460,2430],[4,2430,4660],[5,4660,8080],[6,8080,9190],[7,9190,9470],[8,9470,10580],[9,10580,11150],[10,11150,11880],[11,11880,12880],[12,12880,13580],[13,13580,14190],[14,14190,14810],[15,14810,16500],[16,16500,17425]]}},{"name":"42:10","price":"اور جس جس چیز میں تمہارا اختلاف ہو اس کا فیصلہ اللہ تعالیٰ ہی کی طرف ہے(1) ، یہی اللہ میرا رب ہے جس پر میں نے بھروسہ کر رکھا ہے اور جس کی طرف میں جھکتا ہوں.","arabic":"وَمَا ٱخۡتَلَفۡتُمۡ فِيهِ مِن شَيۡءٖ فَحُكۡمُهُۥٓ إِلَى ٱللَّهِۚ ذَٰلِكُمُ ٱللَّهُ رَبِّي عَلَيۡهِ تَوَكَّلۡتُ وَإِلَيۡهِ أُنِيبُ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura"],"ayahNumber":4282,"juzNumber":25,"footnotes":"(1) اس اختلاف سے مراد دین کا اختلاف ہے جس طرح یہودیت، عیسائیت اور اسلام وغیرہ میں آپس میں اختلافات ہیں اور ہر مذہب کا پیروکار دعویٰ کرتا ہے کہ اس کا دین سچا ہے، دراں حالیکہ سارے دین بیک وقت صحیح نہیں ہوسکتے۔ سچا دین تو صرف ایک ہی ہے اور ایک ہی ہوسکتا ہے۔ دنیا میں سچا دین اور حق کا راستہ پہچاننے کے لیے اللہ تعالیٰ کا قرآن موجود ہے۔ لیکن دنیا میں لوگ اس کلام الٰہی کو اپنا حکم اور ثالث ماننے کے لیے تیار نہیں۔ بالآخر پھر قیامت کا دن ہی رہ جاتا ہے جس میں اللہ تعالیٰ ان اختلافات کا فیصلہ فرمائے گا اور سچوں کو جنت میں اور دوسروں کو جہنم میں داخل فرمائے گا۔","lang":"ur","meta":{"transliteration":"wamā ikh'talaftum fīhi min shayin faḥuk'muhu ilā al-lahi dhālikumu al-lahu rabbī ʿalayhi tawakkaltu wa-ilayhi unību ","translations":["And whatever","you differ","in it","of","a thing","then its ruling","(is) to","Allah","That","(is) Allah","my Lord","upon Him","I put my trust","and to Him","I turn","(10)"],"transliterationArr":["wamā","ikh'talaftum","fīhi","min","shayin","faḥuk'muhu","ilā","al-lahi","dhālikumu","al-lahu","rabbī","ʿalayhi","tawakkaltu","wa-ilayhi","unību",null],"verseTiming":[[1,0,590],[2,590,1840],[3,1840,2580],[4,2580,3520],[5,3520,5030],[6,5030,7750],[7,7750,8130],[8,8130,11170],[9,11170,12260],[10,12260,13140],[11,13140,13940],[12,13940,14840],[13,14840,16170],[14,16170,17120],[15,17120,19215]]}},{"name":"42:11","price":"وه آسمانوں اور زمین کا پیدا کرنے واﻻ ہے اس نے تمہارے لیے تمہاری جنس کے جوڑے بنادیئے ہیں(1) اور چوپایوں کے جوڑے بنائے ہیں(2) تمہیں وه اس میں پھیلا رہا ہے(3) اس جیسی کوئی چیز نہیں(4) وه سننے اور دیکھنے واﻻ ہے.","arabic":"فَاطِرُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ جَعَلَ لَكُم مِّنۡ أَنفُسِكُمۡ أَزۡوَٰجٗا وَمِنَ ٱلۡأَنۡعَٰمِ أَزۡوَٰجٗا يَذۡرَؤُكُمۡ فِيهِۚ لَيۡسَ كَمِثۡلِهِۦ شَيۡءٞۖ وَهُوَ ٱلسَّمِيعُ ٱلۡبَصِيرُ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura"],"ayahNumber":4283,"juzNumber":25,"footnotes":"(1) یعنی یہ اس کا احسان ہے کہ تمہاری جنس سے ہی اس نے تمہارے جوڑے بنائے، ورنہ اگر تمہاری بیویاں انسانوں کے بجائے کسی اور مخلوق سے بنائی جاتیں تو تمہیں یہ سکون حاصل نہ ہوتا جو اپنی ہم جنس اور ہم شکل بیوی سے ملتا ہے۔\n(2) یعنی یہی جوڑے بنانے (مذکر ومونث) کا سلسلہ ہم نے چوپایوں میں بھی رکھا ہے، چوپایوں سے مراد وہی نر اور مادہ آٹھ جانور ہیں جن کا ذکر سورۃ الانعام میں کیا گیا ہے۔\n(3) يَذْرَؤُكُمْ کے معنی پھیلانے یا پیدا کرنے کے ہیں یعنی وہ تمہیں کثرت سے پھیلا رہا ہے۔ یا نسلاً بعد نسل پیدا کررہا ہے۔ انسانی نسل کو بھی اور چوپائے کی نسل کو بھی ،فیہ کا مطلب ہے فِي ذَلِكَ الْخَلْقِ عَلَى هَذِهِ الصِّفَةِ یعنی اس پیدائش میں اس طریقے پر وہ تمہیں ابتدا سے پیدا کرتا آرہا ہے۔ یا ”رحم میں“ یا ”پیٹ میں“ مراد ہے۔ یا فِيهِ بمعنی بہ ہے یعنی تمہارا جوڑا بنانے کے سبب سے تمہیں پیدا کرتا یا پھیلاتا ہے کیونکہ یہ زوجیت ہی نسل کا سبب ہے۔ (فتح القدیر وابن کثیر)۔\n(4) نہ ذات میں نہ صفات میں، پس وہ اپنی نظیر آپ ہی ہے، واحد اور بے نیاز۔","lang":"ur","meta":{"transliteration":"fāṭiru al-samāwāti wal-arḍi jaʿala lakum min anfusikum azwājan wamina al-anʿāmi azwājan yadhra-ukum fīhi laysa kamith'lihi shayon wahuwa al-samīʿu al-baṣīru ","translations":["(The) Creator","(of) the heavens","and the earth","He made","for you","from","yourselves","mates","and among","the cattle","mates","He multiplies you","thereby","(There) is not","like Him","anything","and He","(is) the All-Hearer","the All-Seer","(11)"],"transliterationArr":["fāṭiru","al-samāwāti","wal-arḍi","jaʿala","lakum","min","anfusikum","azwājan","wamina","al-anʿāmi","azwājan","yadhra-ukum","fīhi","laysa","kamith'lihi","shayon","wahuwa","al-samīʿu","al-baṣīru",null],"verseTiming":[[1,0,1010],[2,1010,2520],[3,2520,4060],[4,4060,4770],[5,4770,5340],[6,5340,6490],[7,6490,8440],[8,8440,10460],[9,10460,10950],[10,10950,12330],[11,12330,13580],[12,13580,15380],[13,15380,17680],[14,17680,18320],[15,18320,19590],[16,19590,21120],[17,21120,21600],[18,21600,22760],[19,22760,25465]]}},{"name":"42:12","price":"آسمانوں اور زمین کی کنجیاں اسی کی ہیں(1) ، جس کی چاہے روزی کشاده کردے اور تنگ کردے، یقیناً وه ہر چیز کو جاننے واﻻ ہے.","arabic":"لَهُۥ مَقَالِيدُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ يَبۡسُطُ ٱلرِّزۡقَ لِمَن يَشَآءُ وَيَقۡدِرُۚ إِنَّهُۥ بِكُلِّ شَيۡءٍ عَلِيمٞ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura"],"ayahNumber":4284,"juzNumber":25,"footnotes":"(1) مَقَالِيدُ، مِقْلِيدٌ اور مِقْلادٌ کی جمع ہے۔ خزانے یا چابیاں۔","lang":"ur","meta":{"transliteration":"lahu maqālīdu al-samāwāti wal-arḍi yabsuṭu al-riz'qa liman yashāu wayaqdiru innahu bikulli shayin ʿalīmun ","translations":["To Him (belongs)","(the) keys","(of) the heavens","and the earth","He extends","the provision","for whom","He wills","and restricts","Indeed, He","of every","thing","(is) All-Knower","(12)"],"transliterationArr":["lahu","maqālīdu","al-samāwāti","wal-arḍi","yabsuṭu","al-riz'qa","liman","yashāu","wayaqdiru","innahu","bikulli","shayin","ʿalīmun",null],"verseTiming":[[1,0,760],[2,760,2030],[3,2030,3680],[4,3680,5240],[5,5240,6050],[6,6050,6910],[7,6910,7290],[8,7290,10450],[9,10450,11960],[10,11960,13660],[11,13660,14470],[12,14470,15400],[13,15400,18075]]}},{"name":"42:13","price":"اللہ تعالیٰ نے تمہارے لیے وہی دین مقرر کردیا ہے جس کے قائم کرنے کا اس نے نوح (علیہ السلام) کو حکم دیا تھا اور جو (بذریعہ وحی) ہم نے تیری طرف بھیج دی ہے، اور جس کا تاکیدی حکم ہم نے ابراہیم اور موسیٰ اور عیسیٰ (علیہم السلام) کو دیا تھا(1) ، کہ اس دین کو قائم رکھنا(2) اور اس میں پھوٹ نہ(3) ڈالنا جس چیز کی طرف آپ انہیں بلا رہے ہیں وه تو (ان) مشرکین پر گراں گزرتی ہے(4)، اللہ تعالیٰ جسے چاہتا ہے اپنا برگزیده بناتا ہے(5) اور جو بھی اس کی طرف رجوع کرے وه اس کی صحیح ره نمائی کرتا ہے.(6)","arabic":"۞ شَرَعَ لَكُم مِّنَ ٱلدِّينِ مَا وَصَّىٰ بِهِۦ نُوحٗا وَٱلَّذِيٓ أَوۡحَيۡنَآ إِلَيۡكَ وَمَا وَصَّيۡنَا بِهِۦٓ إِبۡرَٰهِيمَ وَمُوسَىٰ وَعِيسَىٰٓۖ أَنۡ أَقِيمُواْ ٱلدِّينَ وَلَا تَتَفَرَّقُواْ فِيهِۚ كَبُرَ عَلَى ٱلۡمُشۡرِكِينَ مَا تَدۡعُوهُمۡ إِلَيۡهِۚ ٱللَّهُ يَجۡتَبِيٓ إِلَيۡهِ مَن يَشَآءُ وَيَهۡدِيٓ إِلَيۡهِ مَن يُنِيبُ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura"],"ayahNumber":4285,"juzNumber":25,"footnotes":"(1) شَرَعَ کے معنی ہیں، بیان کیا، واضح کیا اور مقرر کیا، لَكُمْ (تمہارے لیے) یہ امت محمدیہ سے خطاب ہے۔ مطلب ہے کہ تمہارے لیے وہی دین مقرر یا بیان کیا ہے جس کی وصیت اس سے قبل تمام انبیا کو کی جاتی رہی ہے۔ اس ضمن میں چند جلیل القدر انبیا کے نام ذکر فرمائے۔\n(2) الدِّينِ سے مراد، اللہ پر ایمان، توحید اطاعت رسول اور شریعت الٰہیہ کو ماننا ہے۔ تمام انبیا کا یہی دین تھا جس کی وہ دعوت اپنی اپنی قوم کو دیتے رہے۔ اگرچہ ہر نبی کی شریعت اور منہج میں بعض جزوی اختلافات ہوتے تھے جیسا کہ فرمایا: «لِكُلٍّ جَعَلْنَا مِنْكُمْ شِرْعَةً وَمِنْهَاجًا» (المائدة: 48) لیکن مذکورہ اصول سب کے درمیان مشترکہ تھے۔ اسی بات کو نبی (صلى الله عليه وسلم) نے ان الفاظ میں بیان فرمایا ہے : ہم انبیاء کی جماعت علاتی بھائی، ہیں، ہمارا دین ایک ہے۔ (صحیح بخاری وغیرہ) اور یہ ایک دین وہی توحید واطاعت رسول ہے، یعنی ان کا تعلق ان فروعی مسائل سے نہیں ہے جن میں دلائل باہم مختلف یا متعارض ہوتے ہیں یا جن میں کبھی فہم کاﺗﺒایﻦ اور تفاوت ہوتا ہے۔ کیونکہ ان میں اجتہاد یا اختلاف کی گنجائش ہوتی ہے اس لیے یہ مختلف ہوتے ہیں اور ہوسکتے ہیں، تاہم توحید واطاعت، فروعی نہیں، اصولی مسئلہ ہے جس پر کفر و ایمان کا دارومدار ہے۔\n(3) صرف ایک اللہ کی عبادت اور اس کی اطاعت (یا اس کے رسول کی اطاعت جو دراصل اللہ ہی کی اطاعت ہے) وحدت وائتلاف کی بنیاد ہے اور اس کی عبادت واطاعت سے گریز یا ان میں دوسروں کو شریک کرنا، افتراق وانتشار انگیزی ہے، جس سے (پھوٹ نہ ڈالنا) کہہ کر منع کیا گیا ہے۔\n(4) اور وہ وہی توحید اور اللہ ورسول کی اطاعت ہے۔\n(5) یعنی جس کو ہدایت کا مستحق سمجھتا ہے، اسے ہدایت کے لیے چن لیتا ہے۔\n(6) یعنی اپنا دین اپنانے کی اور عبادت کو اللہ کے لیے خالص کرنے کی توفیق اس شخص کو عطا کر دیتا ہے جو اس کی اطاعت و عبادت کی طرف رجوع کرتا ہے۔","lang":"ur","meta":{"transliteration":"sharaʿa lakum mina al-dīni mā waṣṣā bihi nūḥan wa-alladhī awḥaynā ilayka wamā waṣṣaynā bihi ib'rāhīma wamūsā waʿīsā an aqīmū al-dīna walā tatafarraqū fīhi kabura ʿalā al-mush'rikīna mā tadʿūhum ilayhi al-lahu yajtabī ilayhi man yashāu wayahdī ilayhi man yunību ","translations":["He has ordained","for you","of","the religion","what","He enjoined","upon","Nuh","and that which","We have revealed","to you","and what","We enjoined","upon","Ibrahim","and Musa","and Isa","To","establish","the religion","and not","be divided","therein","Is difficult","on","the polytheists","what","you call them","to it","Allah","chooses","for Himself","whom","He wills","and guides","to Himself","whoever","turns","(13)"],"transliterationArr":["sharaʿa","lakum","mina","al-dīni","mā","waṣṣā","bihi","nūḥan","wa-alladhī","awḥaynā","ilayka","wamā","waṣṣaynā","bihi","ib'rāhīma","wamūsā","waʿīsā","an","aqīmū","al-dīna","walā","tatafarraqū","fīhi","kabura","ʿalā","al-mush'rikīna","mā","tadʿūhum","ilayhi","al-lahu","yajtabī","ilayhi","man","yashāu","wayahdī","ilayhi","man","yunību",null],"verseTiming":[[1,0,770],[2,770,1340],[3,1340,2380],[4,2380,3350],[5,3350,3740],[6,3740,4610],[7,4610,5290],[8,5290,6010],[9,6010,7040],[10,7040,9210],[11,9210,12130],[12,12130,13020],[13,13020,13460],[14,13460,14880],[15,14880,16849],[16,16849,18319],[17,18319,19419],[18,19419,22099],[19,22099,22529],[20,22529,23379],[21,23379,24189],[22,24189,24829],[23,24829,26339],[24,26339,28239],[25,28239,29019],[26,29019,29379],[27,29379,30779],[28,30779,31239],[29,31239,32509],[30,32509,34749],[31,34749,35729],[32,35729,38189],[33,38189,38979],[34,38979,39319],[35,39319,42449],[36,42449,45099],[37,45099,45939],[38,45939,46159],[39,46159,47149],[40,47149,48904]]}},{"name":"42:14","price":"ان لوگوں نے اپنے پاس علم آجانے کے بعد ہی اختلاف کیا (اور وه بھی) باہمی ضد بحﺚ سے(1) اور اگر آپ کے رب کی بات ایک وقت مقرر تک کے لیے پہلے ہی سے قرار پا گئی ہوئی نہ ہوتی تو یقیناً ان کا فیصلہ ہوچکا ہوتا اور جن لوگوں کو ان کے بعد کتاب دی گئی ہے وه بھی اس کی طرف سے الجھن والے شک میں پڑے ہوئے ہیں.(2)","arabic":"وَمَا تَفَرَّقُوٓاْ إِلَّا مِنۢ بَعۡدِ مَا جَآءَهُمُ ٱلۡعِلۡمُ بَغۡيَۢا بَيۡنَهُمۡۚ وَلَوۡلَا كَلِمَةٞ سَبَقَتۡ مِن رَّبِّكَ إِلَىٰٓ أَجَلٖ مُّسَمّٗى لَّقُضِيَ بَيۡنَهُمۡۚ وَإِنَّ ٱلَّذِينَ أُورِثُواْ ٱلۡكِتَٰبَ مِنۢ بَعۡدِهِمۡ لَفِي شَكّٖ مِّنۡهُ مُرِيبٖ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura"],"ayahNumber":4286,"juzNumber":25,"footnotes":"(1) یعنی انہوں نے اختلاف اور تفرق کا راستہ علم یعنی ہدایت آجانے اور اتمام حجت کے بعد اختیار کیا، جب کہ اختلاف کا کوئی جواز باقی نہیں رہتا۔ لیکن محض بغض وعناد، ضد اور حسد کی وجہ سے ایسا کیا۔ اس سے بعض نے یہود اور بعض نے قریش مکہ مراد لیے ہیں۔\n(2) یعنی اگر ان کی بابت عقوبت میں تاخیر کا فیصلہ پہلے سے نہ ہوتا تو فوراً عذاب بھیج کر ان کو ہلاک کردیا جاتا۔\n(3) اس سے مراد یہود و نصاریٰ ہیں جو اپنے سے ماقبل کے یہود و نصاریٰ کے بعد کتاب یعنی تورات وانجیل کے وارث بنائے گئے۔ یا مراد عرب ہیں، جن میں اللہ تعالیٰ نے اپنا قرآن نازل فرمایا اور انہیں قرآن کا وارث بنایا۔ پہلے مفہوم کے اعتبار سے ”الکتاب“ سے تورات وانجیل اور دوسرے مفہوم کے لحاظ سے اس سے مراد قرآن کریم ہے۔","lang":"ur","meta":{"transliteration":"wamā tafarraqū illā min baʿdi mā jāahumu al-ʿil'mu baghyan baynahum walawlā kalimatun sabaqat min rabbika ilā ajalin musamman laquḍiya baynahum wa-inna alladhīna ūrithū al-kitāba min baʿdihim lafī shakkin min'hu murībin ","translations":["And not","they became divided","until","after","after","[what]","came to them","the knowledge","(out of) rivalry","among them","And if not","(for) a word","(that) preceded","from","your Lord","for","a term","specified","surely, it (would have) been settled","between them","And indeed","those who","were made to inherit","the Book","after them","after them","(are) surely in","doubt","concerning it ","disquieting","(14)"],"transliterationArr":["wamā","tafarraqū","illā","min","baʿdi","mā","jāahumu","al-ʿil'mu","baghyan","baynahum","walawlā","kalimatun","sabaqat","min","rabbika","ilā","ajalin","musamman","laquḍiya","baynahum","wa-inna","alladhīna","ūrithū","al-kitāba","min","baʿdihim","lafī","shakkin","min'hu","murībin",null],"verseTiming":[[1,0,820],[2,820,3850],[3,3850,4670],[4,4670,5760],[5,5760,6430],[6,6430,6830],[7,6830,9650],[8,9650,10550],[9,10550,12130],[10,12130,13830],[11,13830,14860],[12,14860,16110],[13,16110,17450],[14,17450,17570],[15,17570,18680],[16,18680,20470],[17,20470,21150],[18,21150,23630],[19,23630,24710],[20,24710,26280],[21,26280,27680],[22,27680,28830],[23,28830,29590],[24,29590,30670],[25,30670,31700],[26,31700,32750],[27,32750,33340],[28,33340,34090],[29,34090,36020],[30,36020,38485]]}},{"name":"42:15","price":"پس آپ لوگوں کو اسی طرف بلاتے رہیں اور جو کچھ آپ سے کہا گیا ہے اس پر مضبوطی(1) سے جم جائیں اور ان کی خواہشوں پر نہ چلیں(2) اور کہہ دیں کہ اللہ تعالیٰ نے جتنی کتابیں نازل فرمائی ہیں میرا ان پر ایمان ہے اور مجھے حکم دیا گیا ہے کہ تم میں انصاف کرتا رہوں(3)۔ ہمارا اور تم سب کا پروردگار اللہ ہی ہے ہمارے اعمال ہمارے لیے ہیں اور تمہارے اعمال تمہارے لیے ہیں، ہم تم میں کوئی کٹ حجتی نہیں(4) اللہ تعالیٰ ہم (سب) کو جمع کرے گا اور اسی کی طرف لوٹنا ہے.","arabic":"فَلِذَٰلِكَ فَٱدۡعُۖ وَٱسۡتَقِمۡ كَمَآ أُمِرۡتَۖ وَلَا تَتَّبِعۡ أَهۡوَآءَهُمۡۖ وَقُلۡ ءَامَنتُ بِمَآ أَنزَلَ ٱللَّهُ مِن كِتَٰبٖۖ وَأُمِرۡتُ لِأَعۡدِلَ بَيۡنَكُمُۖ ٱللَّهُ رَبُّنَا وَرَبُّكُمۡۖ لَنَآ أَعۡمَٰلُنَا وَلَكُمۡ أَعۡمَٰلُكُمۡۖ لَا حُجَّةَ بَيۡنَنَا وَبَيۡنَكُمُۖ ٱللَّهُ يَجۡمَعُ بَيۡنَنَاۖ وَإِلَيۡهِ ٱلۡمَصِيرُ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura"],"ayahNumber":4287,"juzNumber":25,"footnotes":"(1) یعنی اس تفرق اور شک کی وجہ سے، جس کا ذکر پہلے ہوا، آپ ان کو توحید کی دعوت دیں اور اس پر جمے رہیں۔\n(2) یعنی انہوں نے اپنی خواہش سے جو چیزیں گھڑ لی ہیں، مثلاً بتوں کی عبادت وغیرہ، اس میں ان کی خواہش کے پیچھے مت چلیں۔\n(3) یعنی جب بھی تم اپنا کوئی معاملہ میرے پاس لاؤ گے تو اللہ کے احکام کے مطابق اس کا عدل وانصاف کے ساتھ فیصلہ کروں گا۔\n(4) یعنی کوئی جھگڑا نہیں، اس لیے کہ حق ظاہر اور واضح ہوچکا ہے۔","lang":"ur","meta":{"transliteration":"falidhālika fa-ud'ʿu wa-is'taqim kamā umir'ta walā tattabiʿ ahwāahum waqul āmantu bimā anzala al-lahu min kitābin wa-umir'tu li-aʿdila baynakumu al-lahu rabbunā warabbukum lanā aʿmālunā walakum aʿmālukum lā ḥujjata baynanā wabaynakumu al-lahu yajmaʿu baynanā wa-ilayhi al-maṣīru ","translations":["So to that","then invite","and stand firm","as","you are commanded","and (do) not","follow","their desires","but say","I believe","in what","Allah has sent down","Allah has sent down","of","(the) Book","and I am commanded","that I do justice","between you","Allah","(is) our Lord","and your Lord","For us","our deeds","and for you","your deeds","(There is) no","argument","between us","and between you","Allah","will assemble","[between] us","and to Him","(is) the final return","(15)"],"transliterationArr":["falidhālika","fa-ud'ʿu","wa-is'taqim","kamā","umir'ta","walā","tattabiʿ","ahwāahum","waqul","āmantu","bimā","anzala","al-lahu","min","kitābin","wa-umir'tu","li-aʿdila","baynakumu","al-lahu","rabbunā","warabbukum","lanā","aʿmālunā","walakum","aʿmālukum","lā","ḥujjata","baynanā","wabaynakumu","al-lahu","yajmaʿu","baynanā","wa-ilayhi","al-maṣīru",null],"verseTiming":[[1,0,1270],[2,1270,1990],[3,1990,2910],[4,2910,4870],[5,4870,5710],[6,5710,6270],[7,6270,7360],[8,7360,11180],[9,11180,11780],[10,11780,13670],[11,13670,15620],[12,15620,17320],[13,17320,18250],[14,18250,19220],[15,19220,21480],[16,21480,22980],[17,22980,24040],[18,24040,25630],[19,25630,26690],[20,26690,27700],[21,27700,28890],[22,28890,31280],[23,31280,32710],[24,32710,33560],[25,33560,35590],[26,35590,35990],[27,35990,36910],[28,36910,37870],[29,37870,39610],[30,39610,40550],[31,40550,41460],[32,41460,42370],[33,42370,43440],[34,43440,46365]]}},{"name":"42:16","price":"اور جو لوگ اللہ تعالیٰ کی باتوں میں جھگڑا ڈالتے ہیں اس کے بعد کہ (مخلوق) اسے مان چکی(1) ان کی کٹ حجتی اللہ کے نزدیک باطل ہے(2)، اور ان پر غضب ہے اور ان کے لیے سخت عذاب ہے.","arabic":"وَٱلَّذِينَ يُحَآجُّونَ فِي ٱللَّهِ مِنۢ بَعۡدِ مَا ٱسۡتُجِيبَ لَهُۥ حُجَّتُهُمۡ دَاحِضَةٌ عِندَ رَبِّهِمۡ وَعَلَيۡهِمۡ غَضَبٞ وَلَهُمۡ عَذَابٞ شَدِيدٌ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura"],"ayahNumber":4288,"juzNumber":25,"footnotes":"(1) یعنی یہ مشرکین مسلمانوں سے لڑتے جھگڑتے ہیں۔ جنہوں نے اللہ اور رسول کی بات مان لی ہے، تاکہ انہیں پھر راہ ہدایت سے ہٹادیں۔ یا مراد یہود ونصاریٰ ہیں جو مسلمانوں سے جھگڑتے تھے اور کہتے تھے کہ ہمارا دین تمہارے دین سے بہتر ہے اور ہمارا نبی بھی تمہارے نبی سے پہلے ہوا ہے، اس لیے ہم تم سے بہتر ہیں۔\n(2) دَاحِضَةٌ کے معنی کمزور، باطل، جس کو ثبات نہیں۔","lang":"ur","meta":{"transliteration":"wa-alladhīna yuḥājjūna fī al-lahi min baʿdi mā us'tujība lahu ḥujjatuhum dāḥiḍatun ʿinda rabbihim waʿalayhim ghaḍabun walahum ʿadhābun shadīdun ","translations":["And those who","argue","concerning","Allah","after","after","[what]","response has been made to Him","response has been made to Him","their argument","(is) invalid","with","their Lord","and upon them","(is) wrath","and for them","(is) a punishment","severe","(16)"],"transliterationArr":["wa-alladhīna","yuḥājjūna","fī","al-lahi","min","baʿdi","mā","us'tujība","lahu","ḥujjatuhum","dāḥiḍatun","ʿinda","rabbihim","waʿalayhim","ghaḍabun","walahum","ʿadhābun","shadīdun",null],"verseTiming":[[1,0,1390],[2,1390,6059],[3,6059,6289],[4,6289,7139],[5,7139,8069],[6,8069,8779],[7,8779,8889],[8,8889,10039],[9,10039,10549],[10,10549,11889],[11,11889,13489],[12,13489,14809],[13,14809,15999],[14,15999,17479],[15,17479,18489],[16,18489,19729],[17,19729,21109],[18,21109,21889],[19,21889,23089],[20,23089,26154]]}},{"name":"42:17","price":"اللہ تعالیٰ نے حق کے ساتھ کتاب نازل فرمائی ہے اور ترازو بھی (اتاری ہے)(1) اور آپ کو کیا خبر شاید قیامت قریب(2) ہی ہو.","arabic":"ٱللَّهُ ٱلَّذِيٓ أَنزَلَ ٱلۡكِتَٰبَ بِٱلۡحَقِّ وَٱلۡمِيزَانَۗ وَمَا يُدۡرِيكَ لَعَلَّ ٱلسَّاعَةَ قَرِيبٞ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura"],"ayahNumber":4289,"juzNumber":25,"footnotes":"(1) الکتاب سے مراد جنس ہے یعنی تمام پیغمبروں پر جتنی کتابیں بھی نازل ہوئیں، وہ سب حق اور سچی تھیں۔ یا بطور خاص قرآن مجید مراد ہے اور اس کی صداقت کو واضح کیا جا رہا ہے ۔میزان سے مراد عدل و انصاف ہے۔ عدل کو ترازو سے اس لئے تعبیر فرمایا کہ یہ برابری اور انصاف کا آلہ ہے۔ اس کے ذریعے سے ہی لوگوں کے درمیان برابری ممکن ہے۔اسی کے ہم معنی یہ آیات بھی ہیں«لَقَدْ أَرْسَلْنَا رُسُلَنَا بِالْبَيِّنَاتِ وَأَنْزَلْنَا مَعَهُمُ الْكِتَابَ وَالْمِيزَانَ لِيَقُومَ النَّاسُ بِالْقِسْطِ» (الحديد:25) ”یقینا ہم نے پیغمبروں کو کھلی دلیلیں دے کر بھجوایا اور ان کے ساتھ کتاب اور انصاف نازل فرمایا تاکہ لوگ عدل پر قائم رہیں“ ۔«وَالسَّمَاءَ رَفَعَهَا وَوَضَعَ الْمِيزَانَ، أَلا تَطْغَوْا فِي الْمِيزَانِ، وَأَقِيمُوا الْوَزْنَ بِالْقِسْطِ وَلا تُخْسِرُوا الْمِيزَانَ» (سورة الرحمن: 7-9) اسی نے آسمان کو بلند کیا اور اسی نے ترازو رکھی تاکہ تم تولنے میں کمی بیشی نہ کرو ،انصاف کے ساتھ وزن کو ٹھیک رکھو اور تول میں جمی نہ کرو\"۔ (2) قريب، مذکر اور مونث دونوں کی صفت کے لیے آجاتا ہے۔ خصوصاً جب کہ موصوف مونث غیرحقیقی ہو۔ إِنَّ رَحْمَةَ اللَّهِ قَرِيبٌ مِنَ الْمُحْسِنِينَ ۔ (فتح القدير)۔","lang":"ur","meta":{"transliteration":"al-lahu alladhī anzala al-kitāba bil-ḥaqi wal-mīzāna wamā yud'rīka laʿalla al-sāʿata qarībun ","translations":["Allah","(is) the One Who","(has) sent down","the Book","in truth","and the Balance","And what","will make you know","Perhaps","the Hour","(is) near","(17)"],"transliterationArr":["al-lahu","alladhī","anzala","al-kitāba","bil-ḥaqi","wal-mīzāna","wamā","yud'rīka","laʿalla","al-sāʿata","qarībun",null],"verseTiming":[[1,0,1170],[2,1170,3580],[3,3580,5060],[4,5060,6190],[5,6190,7190],[6,7190,10450],[7,10450,11060],[8,11060,12140],[9,12140,12880],[10,12880,14010],[11,14010,16665]]}},{"name":"42:18","price":"اس کی جلدی انہیں پڑی ہے جو اسے نہیں مانتے(1) اور جو اس پر یقین رکھتے ہیں وه تو اس سے ڈر رہے ہیں(2) انہیں اس کے حق ہونے کا پورا علم ہے۔ یاد رکھو جو لوگ قیامت کے معاملہ میں لڑ جھگڑ رہے ہیں(3)، وه دور کی گمراہی میں پڑے ہوئے ہیں.(4)","arabic":"يَسۡتَعۡجِلُ بِهَا ٱلَّذِينَ لَا يُؤۡمِنُونَ بِهَاۖ وَٱلَّذِينَ ءَامَنُواْ مُشۡفِقُونَ مِنۡهَا وَيَعۡلَمُونَ أَنَّهَا ٱلۡحَقُّۗ أَلَآ إِنَّ ٱلَّذِينَ يُمَارُونَ فِي ٱلسَّاعَةِ لَفِي ضَلَٰلِۭ بَعِيدٍ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura"],"ayahNumber":4290,"juzNumber":25,"footnotes":"(1) یعنی استہزا کے طور پر یہ سمجھتے ہوئے کہ اس کو آنا ہی کہاں ہے؟ اس لیے کہتے ہیں کہ قیامت جلدی آئے۔\n(2) اس لیے کہ ایک تو ان کو اس کے وقوع کا پورا یقین ہے۔ دوسرے ان کو خوف ہے کہ اس روز بے لاگ حساب ہوگا، کہیں وہ بھی مواخذہ الٰہی کی زد میں نہ آجائیں۔ جیسے دوسرے مقام پر ہے۔ «وَالَّذِينَ يُؤْتُونَ مَا آتَوْا وَقُلُوبُهُمْ وَجِلَةٌ أَنَّهُمْ إِلَى رَبِّهِمْ رَاجِعُونَ» (المؤمنون: 60)۔\n(3) يُمَارُونَ، مُمَارَاةٌ سے ہے جس کے معنی لڑنا جھگڑنا ہیں۔ یا مریہ سے ہے، بمعنی ریب وشک۔\n(4) اس لیے کہ وہ ان دلائل پر غوروفکر ہی نہیں کرتے جو ایمان لانے کےموجب بن سکتے ہیں حالانکہ یہ دلائل روز وشب ان کے مشاہدے میں آتے ہیں۔ ان کی نظروں سے گزرتے ہیں اور ان کی عقل وفہم میں آسکتے ہیں۔ اس لیے وہ حق سے بہت دور جا پڑے ہیں۔","lang":"ur","meta":{"transliteration":"yastaʿjilu bihā alladhīna lā yu'minūna bihā wa-alladhīna āmanū mush'fiqūna min'hā wayaʿlamūna annahā al-ḥaqu alā inna alladhīna yumārūna fī al-sāʿati lafī ḍalālin baʿīdin ","translations":["Seek to hasten","[of] it","those who","(do) not","believe","in it","and those who","believe","(are) fearful","of it","and know","that it","(is) the truth","Unquestionably","indeed","those who","dispute","concerning","the Hour","(are) certainly in","error","far","(18)"],"transliterationArr":["yastaʿjilu","bihā","alladhīna","lā","yu'minūna","bihā","wa-alladhīna","āmanū","mush'fiqūna","min'hā","wayaʿlamūna","annahā","al-ḥaqu","alā","inna","alladhīna","yumārūna","fī","al-sāʿati","lafī","ḍalālin","baʿīdin",null],"verseTiming":[[1,0,1410],[2,1410,1810],[3,1810,2890],[4,2890,3280],[5,3280,4450],[6,4450,5230],[7,5230,7030],[8,7030,8130],[9,8130,9430],[10,9430,10260],[11,10260,11840],[12,11840,13280],[13,13280,14430],[14,14430,17050],[15,17050,18440],[16,18440,19530],[17,19530,20840],[18,20840,21040],[19,21040,22170],[20,22170,22720],[21,22720,23830],[22,23830,27585]]}},{"name":"42:19","price":"اللہ تعالیٰ اپنے بندوں پر بڑا ہی لطف کرنے واﻻ ہے، جسے چاہتا ہے کشاده روزی دیتا ہے اور وه بڑی طاقت، بڑے غلبہ واﻻ ہے.","arabic":"ٱللَّهُ لَطِيفُۢ بِعِبَادِهِۦ يَرۡزُقُ مَن يَشَآءُۖ وَهُوَ ٱلۡقَوِيُّ ٱلۡعَزِيزُ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura"],"ayahNumber":4291,"juzNumber":25,"footnotes":"","lang":"ur","meta":{"transliteration":"al-lahu laṭīfun biʿibādihi yarzuqu man yashāu wahuwa al-qawiyu al-ʿazīzu ","translations":["Allah","(is) Subtle","with His slaves","He gives provision","(to) whom","He wills","And He","(is) the All-Strong","the All-Mighty","(19)"],"transliterationArr":["al-lahu","laṭīfun","biʿibādihi","yarzuqu","man","yashāu","wahuwa","al-qawiyu","al-ʿazīzu",null],"verseTiming":[[1,0,1140],[2,1140,2990],[3,2990,4540],[4,4540,5430],[5,5430,5630],[6,5630,9700],[7,9700,10270],[8,10270,11350],[9,11350,14545]]}},{"name":"42:20","price":"جس کا اراده آخرت کی کھیتی کا ہو ہم اسے اس کی کھیتی میں ترقی دیں گے(1) اور جو دنیا کی کھیتی کی طلب رکھتا ہو ہم اسے اس میں سے ہی کچھ دے دیں گے(2)، ایسے شخص کا آخرت میں کوئی حصہ نہیں.(3)","arabic":"مَن كَانَ يُرِيدُ حَرۡثَ ٱلۡأٓخِرَةِ نَزِدۡ لَهُۥ فِي حَرۡثِهِۦۖ وَمَن كَانَ يُرِيدُ حَرۡثَ ٱلدُّنۡيَا نُؤۡتِهِۦ مِنۡهَا وَمَا لَهُۥ فِي ٱلۡأٓخِرَةِ مِن نَّصِيبٍ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura"],"ayahNumber":4292,"juzNumber":25,"footnotes":"(1) حَرَثٌ کے معنی تخم ریزی کے ہیں۔ یہاں یہ بہ طریق استعارہ اعمال کے ثمرات وفوائد پر بولا گیا ہے۔ مطلب یہ ہے کہ جو شخص دنیا میں اپنے اعمال ومحنت کے ذریعے سے آخرت کے اجر وثواب کا طالب ہے تو اللہ تعالیٰ اس کی آخرت کی کھیتی میں اضافہ فرمائے گا کہ ایک ایک نیکی کا اجر دس گنا سے لے کر سات سو گنا بلکہ اس سے زیادہ تک بھی عطا فرمائے گا۔\n(2) یعنی طالب دنیا کو دنیا تو ملتی ہے لیکن اتنی نہیں جتنی وہ چاہتا ہے بلکہ اتنی ہی ملتی ہے جتنی اللہ کی مشیت اور تقدیر کے مطابق ہوتی ہے۔\n(3) یہ وہی مضمون ہے جو سورۂ بنی اسرائیل: 18 میں بھی بیان ہوا ہے۔ مطلب یہ ہے کہ دنیا تو اللہ تعالیٰ ہر ایک کو اتنی ضرور دیتا ہے جتنی اس نے لکھ دی ہے، کیونکہ وہ سب کی روزی کا ذمہ لئے ہوئے ہے، طالب دنیا کو بھی اور طالب آخرت کو بھی۔ تاہم جو طالب آخرت ہوگا یعنی آخرت کے لیے کسب و محنت کرے گا تو قیامت والے دن اللہ تعالیٰ اسے أَضْعَافًا مُضَاعَفَةً اجر وثواب عطا فرمائے گا، جب کہ کے لئے آخرت میں سوائے جہنم کے عذاب کے کچھ نہیں ہوگا ۔اب یہ انسان کو خود سوچ لینا چاہیئے کہ اس کا فائدہ طالب دنیا بننے میں ہے یا طالب آخرت بننے میں۔","lang":"ur","meta":{"transliteration":"man kāna yurīdu ḥartha al-ākhirati nazid lahu fī ḥarthihi waman kāna yurīdu ḥartha al-dun'yā nu'tihi min'hā wamā lahu fī al-ākhirati min naṣībin ","translations":["Whoever","is","desiring","(the) harvest","(of) the Hereafter ","We increase","for him","in","his harvest","And whoever","is","desiring","(the) harvest","(of) the world","We give him","of it","but not","for him","in","the Hereafter","any","share","(20)"],"transliterationArr":["man","kāna","yurīdu","ḥartha","al-ākhirati","nazid","lahu","fī","ḥarthihi","waman","kāna","yurīdu","ḥartha","al-dun'yā","nu'tihi","min'hā","wamā","lahu","fī","al-ākhirati","min","naṣībin",null],"verseTiming":[[1,0,1489],[2,1489,2099],[3,2099,2979],[4,2979,3599],[5,3599,4899],[6,4899,5539],[7,5539,6099],[8,6099,6539],[9,6539,7939],[10,7939,8989],[11,8989,9939],[12,9939,10819],[13,10819,11439],[14,11439,12599],[15,12599,13649],[16,13649,14509],[17,14509,15189],[18,15189,15789],[19,15789,16049],[20,16049,17339],[21,17339,17619],[22,17619,21494]]}},{"name":"42:21","price":"کیا ان لوگوں نے ایسے (اللہ کے) شریک (مقرر کر رکھے) ہیں جنہوں نے ایسے احکام دین مقرر کر دیئے ہیں جو اللہ کے فرمائے ہوئے نہیں ہیں(1) ۔ اگر فیصلے کے دن کا وعده نہ ہوتا تو (ابھی ہی) ان میں فیصلہ کردیا جاتا۔ یقیناً (ان) ﻇالموں کے لیے ہی دردناک عذاب ہے.","arabic":"أَمۡ لَهُمۡ شُرَكَٰٓؤُاْ شَرَعُواْ لَهُم مِّنَ ٱلدِّينِ مَا لَمۡ يَأۡذَنۢ بِهِ ٱللَّهُۚ وَلَوۡلَا كَلِمَةُ ٱلۡفَصۡلِ لَقُضِيَ بَيۡنَهُمۡۗ وَإِنَّ ٱلظَّٰلِمِينَ لَهُمۡ عَذَابٌ أَلِيمٞ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura"],"ayahNumber":4293,"juzNumber":25,"footnotes":"(1) یعنی شرک و معاصی، جن کا حکم اللہ نے نہیں دیا ہے، ان کے بنائے ہوئے شریکوں نے انسانوں کو اس راہ پر لگایا ہے۔","lang":"ur","meta":{"transliteration":"am lahum shurakāu sharaʿū lahum mina al-dīni mā lam yadhan bihi al-lahu walawlā kalimatu al-faṣli laquḍiya baynahum wa-inna al-ẓālimīna lahum ʿadhābun alīmun ","translations":["Or","for them","(are) partners","who have ordained","for them","of","the religion","what","not","Allah has given permission of it","Allah has given permission of it","Allah has given permission of it","And if not","(for) a word","decisive","surely, it (would have) been judged","between them","And indeed","the wrongdoers","for them","(is a) punishment","painful","(21)"],"transliterationArr":["am","lahum","shurakāu","sharaʿū","lahum","mina","al-dīni","mā","lam","yadhan","bihi","al-lahu","walawlā","kalimatu","al-faṣli","laquḍiya","baynahum","wa-inna","al-ẓālimīna","lahum","ʿadhābun","alīmun",null],"verseTiming":[[1,0,460],[2,460,1040],[3,1040,3660],[4,3660,4550],[5,4550,5130],[6,5130,6050],[7,6050,7040],[8,7040,7440],[9,7440,7810],[10,7810,9300],[11,9300,9810],[12,9810,12530],[13,12530,13530],[14,13530,14360],[15,14360,15230],[16,15230,16030],[17,16030,17460],[18,17460,18890],[19,18890,20460],[20,20460,20970],[21,20970,22060],[22,22060,25285]]}},{"name":"42:22","price":"آپ دیکھیں گے کہ یہ ﻇالم اپنے اعمال سے ڈر رہے ہوں گے(1) جن کے وبال ان پر واقع ہونے والے ہیں(2)، اور جو لوگ ایمان ﻻئے اور انہوں نے نیک اعمال کیے وه بہشتوں کے باغات میں ہوں گے وه جو خواہش کریں اپنے رب کے پاس موجود پائیں گے یہی ہے بڑا فضل.","arabic":"تَرَى ٱلظَّٰلِمِينَ مُشۡفِقِينَ مِمَّا كَسَبُواْ وَهُوَ وَاقِعُۢ بِهِمۡۗ وَٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ فِي رَوۡضَاتِ ٱلۡجَنَّاتِۖ لَهُم مَّا يَشَآءُونَ عِندَ رَبِّهِمۡۚ ذَٰلِكَ هُوَ ٱلۡفَضۡلُ ٱلۡكَبِيرُ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura"],"ayahNumber":4294,"juzNumber":25,"footnotes":"(1) یعنی قیامت والے دن۔\n(2) حالانکہ ڈرنابے فائدہ ہوگا کیوں کہ اپنے کیے کی سزا تو انہیں بہرحال بھگتنی ہو گی۔","lang":"ur","meta":{"transliteration":"tarā al-ẓālimīna mush'fiqīna mimmā kasabū wahuwa wāqiʿun bihim wa-alladhīna āmanū waʿamilū al-ṣāliḥāti fī rawḍāti al-janāti lahum mā yashāūna ʿinda rabbihim dhālika huwa al-faḍlu al-kabīru ","translations":["You will see","the wrongdoers","fearful","of what","they earned","and it","(will) befall","[on] them","And those who","believe","and do","righteous deeds","(will be) in","flowering meadows","(of) the Gardens","for them","(is) whatever","they wish","with","their Lord","That ","it","(is) the Bounty","the Great","(22)"],"transliterationArr":["tarā","al-ẓālimīna","mush'fiqīna","mimmā","kasabū","wahuwa","wāqiʿun","bihim","wa-alladhīna","āmanū","waʿamilū","al-ṣāliḥāti","fī","rawḍāti","al-janāti","lahum","mā","yashāūna","ʿinda","rabbihim","dhālika","huwa","al-faḍlu","al-kabīru",null],"verseTiming":[[1,0,550],[2,550,2040],[3,2040,3160],[4,3160,4620],[5,4620,5640],[6,5640,6280],[7,6280,8100],[8,8100,9370],[9,9370,10570],[10,10570,11750],[11,11750,12470],[12,12470,14060],[13,14060,14420],[14,14420,15500],[15,15500,19520],[16,19520,20290],[17,20290,21350],[18,21350,24290],[19,24290,25770],[20,25770,27250],[21,27250,28180],[22,28180,28510],[23,28510,29470],[24,29470,32135]]}},{"name":"42:23","price":"یہی وه ہے جس کی بشارت اللہ تعالیٰ اپنے ان بندوں کو دے رہا ہے جو ایمان ﻻئے اور (سنت کے مطابق) نیک عمل کیے تو کہہ دیجئے! کہ میں اس پر تم سے کوئی بدلہ نہیں چاہتا مگر محبت رشتہ داری کی(1) ، جو شخص کوئی نیکی کرے ہم اس کے لیے اس کی نیکی میں اور نیکی بڑھا دیں گے(2)۔ بیشک اللہ تعالیٰ بخشنے واﻻ (اور) بہت قدر دان ہے.(3)","arabic":"ذَٰلِكَ ٱلَّذِي يُبَشِّرُ ٱللَّهُ عِبَادَهُ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِۗ قُل لَّآ أَسۡـَٔلُكُمۡ عَلَيۡهِ أَجۡرًا إِلَّا ٱلۡمَوَدَّةَ فِي ٱلۡقُرۡبَىٰۗ وَمَن يَقۡتَرِفۡ حَسَنَةٗ نَّزِدۡ لَهُۥ فِيهَا حُسۡنًاۚ إِنَّ ٱللَّهَ غَفُورٞ شَكُورٌ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura"],"ayahNumber":4295,"juzNumber":25,"footnotes":"(1) قبائل قریش اور نبی (صلى الله عليه وسلم) کے درمیان رشتے داری کا تعلق تھا، آیت کا مطلب بالکل واضح ہے کہ میں وعظ ونصیحت اور تبلیغ ودعوت کی کوئی اجرت تم سے نہیں مانگتا، البتہ ایک چیز کا سوال ضرور ہے کہ میرے اور تمہارے درمیان جو رشتے داری ہے، اس کا لحاظ کرو، تم میری دعوت کو نہیں مانتے تو نہ مانو، تمہاری مرضی۔ لیکن مجھے نقصان پہنچانے سے تو باز رہو، تم میرے دست وبازو نہیں بن سکتے تو رشتہ داری وقرابت کے ناطے مجھے ایذا تو نہ پہنچاؤ اور میرے راستے کا روڑہ تو نہ بنو کہ میں فریضۂ رسالت ادا کرسکوں۔ حضرت ابن عباس ب نے اس کے معنی کیے ہیں کہ میرے اور تمہارے درمیان جو قرابت (رشتہ داری) ہے اس کو قائم رکھو۔ (صحيح البخاري، تفسير سور الشورىٰ) نبی کریم (صلى الله عليه وسلم) کی آل، یقیناً حسب ونسب کے اعتبار سے دنیا کی اشرف ترین آل ہے اس سے محبت، اس کی تعظیم وتوقیر جزو ایمان ہے۔ اس لیے کہ نبی (صلى الله عليه وسلم) نے بھی احادیث میں ان کی تکریم اور حفاظت کی تاکید فرمائی ہے لیکن اس آیت کا کوئی تعلق اس موضوع سے نہیں ہے، جیسا کہ شیعہ حضرات کھینچا تانی کرکے اس آیت کو آل محمد (صلى الله عليه وسلم) کی محبت کے ساتھ جوڑتے ہیں اور پھر آل کو بھی انہوں نے محدود کردیا ہے، حضرت علی رضی اللہ عنہ و حضرت فاطمہ رضی الله عنها اور حسنین رضی اللہ عنہما تک۔ نیز محبت کا مفہوم بھی ان کے نزدیک یہ ہے کہ انہیں معصوم اور الٰہی اختیارات سے متصف مانا جائے۔ علاوہ ازیں کفار مکہ سے اپنے گھرانے کی محبت کا سوال بطور اجرت تبلیغ نہایت عجیب بات ہے جو نبی (صلى الله عليه وسلم) کی شان ارفع سے بہت ہی فروتر ہے آپ (صلى الله عليه وسلم) کی تبلیغ کو قبول نہ کرنے کے باوجود آپ (صلى الله عليه وسلم) کی طلب تو صرف قرابت اور صلۂ رحمی کی بنیاد پر محبت برقرار رکھنے کی تھی پھر یہ آیت اور سورت مکی ہے جب کہ حضرت علی ﺅ اور حضرت فاطمہ (رضی الله عنها) کے درمیان ابھی عقد زواج بھی قائم نہیں ہوا تھا۔ یعنی ابھی وہ گھرانہ معرض وجود میں ہی نہیں آیا تھا جس کی خودساختہ محبت کا اثبات اس آیت سے کیا جاتا ہے۔\n(2) یعنی اجر وثواب میں اضافہ کریں گے۔ یا نیکی کے بعد اس کا بدلہ مزید نیکی کی توفیق کی صورت میں دیں گے جس طرح بدی کا بدلہ مزید بدیوں کا ارتکاب ہے۔\n(3) اس لیے وہ پردہ پوشی فرماتا اور معاف کردیتا ہے اور زیادہ سے زیادہ اجر دیتا ہے۔","lang":"ur","meta":{"transliteration":"dhālika alladhī yubashiru al-lahu ʿibādahu alladhīna āmanū waʿamilū al-ṣāliḥāti qul lā asalukum ʿalayhi ajran illā al-mawadata fī al-qur'bā waman yaqtarif ḥasanatan nazid lahu fīhā ḥus'nan inna al-laha ghafūrun shakūrun ","translations":["That","(is of) which","Allah gives glad tidings","Allah gives glad tidings","(to) His slaves ","those who","believe","and do","righteous deeds","Say","Not","I ask you","for it","any payment","except","the love","among","the relatives","And whoever","earns","any good","We increase","for him","therein","good","Indeed","Allah","(is) Oft-Forgiving","All-Appreciative","(23)"],"transliterationArr":["dhālika","alladhī","yubashiru","al-lahu","ʿibādahu","alladhīna","āmanū","waʿamilū","al-ṣāliḥāti","qul","lā","asalukum","ʿalayhi","ajran","illā","al-mawadata","fī","al-qur'bā","waman","yaqtarif","ḥasanatan","nazid","lahu","fīhā","ḥus'nan","inna","al-laha","ghafūrun","shakūrun",null],"verseTiming":[[1,0,970],[2,970,1850],[3,1850,2780],[4,2780,3660],[5,3660,4720],[6,4720,5740],[7,5740,6920],[8,6920,7640],[9,7640,9450],[10,9450,9550],[11,9550,10500],[12,10500,11590],[13,11590,13480],[14,13480,14660],[15,14660,15570],[16,15570,16360],[17,16360,16900],[18,16900,18200],[19,18200,18430],[20,18430,19650],[21,19650,20570],[22,20570,21570],[23,21570,22520],[24,22520,23510],[25,23510,24880],[26,24880,25450],[27,25450,26300],[28,26300,27820],[29,27820,28950],[30,28950,29860],[31,29860,31500],[32,31500,34245]]}},{"name":"42:24","price":"کیا یہ کہتے ہیں کہ (پیغمبر نے) اللہ پر جھوٹ باندھا ہے، اگر اللہ تعالیٰ چاہے تو آپ کے دل پر مہر لگادے(1) اور اللہ تعالیٰ اپنی باتوں سے جھوٹ کو مٹا دیتا ہے(2) اور سچ کو ﺛابت رکھتا ہے۔ وه سینے کی باتوں کو جاننے واﻻ ہے.","arabic":"أَمۡ يَقُولُونَ ٱفۡتَرَىٰ عَلَى ٱللَّهِ كَذِبٗاۖ فَإِن يَشَإِ ٱللَّهُ يَخۡتِمۡ عَلَىٰ قَلۡبِكَۗ وَيَمۡحُ ٱللَّهُ ٱلۡبَٰطِلَ وَيُحِقُّ ٱلۡحَقَّ بِكَلِمَٰتِهِۦٓۚ إِنَّهُۥ عَلِيمُۢ بِذَاتِ ٱلصُّدُورِ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura"],"ayahNumber":4296,"juzNumber":25,"footnotes":"(1) یعنی اس الزام میں اگر صداقت ہوتی تو ہم آپ کے دل پر مہر لگا دیتے، جس سے وہ قرآن ہی محو ہوجاتا جس کے گھڑنے کا انتساب آپ کی طرف کیا جاتا ہے، مطلب یہ ہے کہ ہم آپ کو اس کی سخت ترین سزا دیتے۔\n(2) یہ قرآن بھی اگر باطل ہوتا (جیسا کہ مکذبین کا دعویٰ ہے) تو یقیناً اللہ تعالیٰ اس کو بھی مٹا ڈالتا، جیسا کہ اس کی عادت ہے۔","lang":"ur","meta":{"transliteration":"am yaqūlūna if'tarā ʿalā al-lahi kadhiban fa-in yasha-i al-lahu yakhtim ʿalā qalbika wayamḥu al-lahu al-bāṭila wayuḥiqqu al-ḥaqa bikalimātihi innahu ʿalīmun bidhāti al-ṣudūri ","translations":["Or","(do) they say","He has invented","about","Allah","a lie","But if","Allah willed","Allah willed","He would seal","[over]","your heart","And Allah eliminates","And Allah eliminates","the falsehood","and establishes","the truth","by His Words","Indeed, He","(is) All-Knowing","of what","(is in) the breasts","(24)"],"transliterationArr":["am","yaqūlūna","if'tarā","ʿalā","al-lahi","kadhiban","fa-in","yasha-i","al-lahu","yakhtim","ʿalā","qalbika","wayamḥu","al-lahu","al-bāṭila","wayuḥiqqu","al-ḥaqa","bikalimātihi","innahu","ʿalīmun","bidhāti","al-ṣudūri",null],"verseTiming":[[1,0,470],[2,470,1710],[3,1710,2620],[4,2620,2950],[5,2950,3870],[6,3870,4840],[7,4840,6410],[8,6410,7050],[9,7050,7850],[10,7850,8660],[11,8660,9280],[12,9280,10610],[13,10610,11440],[14,11440,12210],[15,12210,13330],[16,13330,14310],[17,14310,15180],[18,15180,17020],[19,17020,18630],[20,18630,20170],[21,20170,21030],[22,21030,23795]]}},{"name":"42:25","price":"وہی ہے جو اپنے بندوں کی توبہ قبول فرماتا ہے(1) اور گناہوں سے درگزر فرماتا ہے اور جو کچھ تم کررہے ہو (سب) جانتا ہے.","arabic":"وَهُوَ ٱلَّذِي يَقۡبَلُ ٱلتَّوۡبَةَ عَنۡ عِبَادِهِۦ وَيَعۡفُواْ عَنِ ٱلسَّيِّـَٔاتِ وَيَعۡلَمُ مَا تَفۡعَلُونَ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura"],"ayahNumber":4297,"juzNumber":25,"footnotes":"(1) توبہ کا مطلب ہے، معصیت پر ندامت کا اظہار اور آئندہ اس کو نہ کرنے کا عزم۔ محض زبان سے توبہ توبہ کرلینا یا اس گناہ اور معصیت کے کام کو تو نہ چھوڑنا اور توبہ کا اظہار کیے جانا، توبہ نہیں ہے۔ یہ استہزا اور مذاق ہے۔ تاہم خالص اور سچی توبہ اللہ تعالیٰ یقیناً قبول فرماتا ہے۔","lang":"ur","meta":{"transliteration":"wahuwa alladhī yaqbalu al-tawbata ʿan ʿibādihi wayaʿfū ʿani al-sayiāti wayaʿlamu mā tafʿalūna ","translations":["And He","(is) the One Who","accepts","the repentance","of","His slaves","and pardons","[of]","the evil","and He knows","what","you do","(25)"],"transliterationArr":["wahuwa","alladhī","yaqbalu","al-tawbata","ʿan","ʿibādihi","wayaʿfū","ʿani","al-sayiāti","wayaʿlamu","mā","tafʿalūna",null],"verseTiming":[[1,0,670],[2,670,1600],[3,1600,2390],[4,2390,3430],[5,3430,3840],[6,3840,5110],[7,5110,6180],[8,6180,6580],[9,6580,8160],[10,8160,9230],[11,9230,9580],[12,9580,12585]]}},{"name":"42:26","price":"ایمان والوں اور نیکوکار لوگوں کی سنتا ہے(1) اور انہیں اپنے فضل سے اور بڑھا کر دیتا ہے اور کفار کے لیے سخت عذاب ہے.","arabic":"وَيَسۡتَجِيبُ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ وَيَزِيدُهُم مِّن فَضۡلِهِۦۚ وَٱلۡكَٰفِرُونَ لَهُمۡ عَذَابٞ شَدِيدٞ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura"],"ayahNumber":4298,"juzNumber":25,"footnotes":"(1) یعنی ان کی دعائیں سنتا ہے اور ان کی خواہشیں اور آرزوئیں پوری فرماتا ہے۔ بشرطیکہ دعا کے آداب وشرائط کا بھی پورا اہتمام کیا گیا ہو۔ اور حدیث میں آتا ہے کہ اللہ بندے کی توبہ سے اس شخص سے بھی زیادہ خوش ہوتا ہے جس کی سواری مع کھانے پینے کے سامان کے، صحرا، بیابان میں گم ہوجائے اور وہ ناامید ہوکر کسی درخت کے نیچے لیٹ جائے کہ اچانک اسے اپنی سواری مل جائے اور فرط مسرت میں اس کے منہ سے نکل جائے، اے اللہ! تو میرا بندہ اور میں تیرا رب یعنی شدت فرح میں وہ غلطی کرجائے۔ (صحيح مسلم كتاب التوبة ، باب في الحض على التوبة والفرح بها)۔","lang":"ur","meta":{"transliteration":"wayastajību alladhīna āmanū waʿamilū al-ṣāliḥāti wayazīduhum min faḍlihi wal-kāfirūna lahum ʿadhābun shadīdun ","translations":["And He answers","those who","believe","and do","righteous deeds","and increases (for) them","from","His Bounty","And the disbelievers ","for them","(will be) a punishment","severe","(26)"],"transliterationArr":["wayastajību","alladhīna","āmanū","waʿamilū","al-ṣāliḥāti","wayazīduhum","min","faḍlihi","wal-kāfirūna","lahum","ʿadhābun","shadīdun",null],"verseTiming":[[1,0,1470],[2,1470,2500],[3,2500,3690],[4,3690,4410],[5,4410,5910],[6,5910,7540],[7,7540,9330],[8,9330,10710],[9,10710,12500],[10,12500,13050],[11,13050,14780],[12,14780,17835]]}},{"name":"42:27","price":"اگر اللہ تعالیٰ اپنے (سب) بندوں کی روزی فراخ کر دیتا تو وه زمین میں فساد(1) برپا کردیتے لیکن وه اندازے کے ساتھ جو کچھ چاہتا ہے نازل فرماتا ہے۔ وه اپنے بندوں سے پورا خبردار ہے اور خوب دیکھنے واﻻ ہے.","arabic":"۞ وَلَوۡ بَسَطَ ٱللَّهُ ٱلرِّزۡقَ لِعِبَادِهِۦ لَبَغَوۡاْ فِي ٱلۡأَرۡضِ وَلَٰكِن يُنَزِّلُ بِقَدَرٖ مَّا يَشَآءُۚ إِنَّهُۥ بِعِبَادِهِۦ خَبِيرُۢ بَصِيرٞ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura"],"ayahNumber":4299,"juzNumber":25,"footnotes":"(1) یعنی اگر اللہ تعالیٰ ہر شخص کو حاجت و ضرورت سے زیادہ یکساں طور پر وسائل رزق عطا فرما دیتا تو اس کا نتیجہ یہ ہوتا کہ کوئی کسی کی ماتحتی قبول نہ کرتا، ہر شخص شر وفساد اور بغی وعدوان میں ایک سے بڑھ کر ایک ہوتا، جس سے زمین فساد سے بھرجاتی۔","lang":"ur","meta":{"transliteration":"walaw basaṭa al-lahu al-riz'qa liʿibādihi labaghaw fī al-arḍi walākin yunazzilu biqadarin mā yashāu innahu biʿibādihi khabīrun baṣīrun ","translations":["And if","Allah extends","Allah extends","the provision","for His slaves","surely they would rebel","in","the earth","but","He sends down","in (due) measure","what","He wills","Indeed, He","of His slaves","(is) All-Aware","All-Seer","(27)"],"transliterationArr":["walaw","basaṭa","al-lahu","al-riz'qa","liʿibādihi","labaghaw","fī","al-arḍi","walākin","yunazzilu","biqadarin","mā","yashāu","innahu","biʿibādihi","khabīrun","baṣīrun",null],"verseTiming":[[1,0,770],[2,770,1400],[3,1400,2320],[4,2320,3100],[5,3100,4640],[6,4640,5420],[7,5420,5650],[8,5650,6500],[9,6500,8190],[10,8190,9330],[11,9330,10370],[12,10370,11560],[13,11560,14840],[14,14840,16730],[15,16730,18220],[16,18220,20260],[17,20260,22725]]}},{"name":"42:28","price":"اور وہی ہے جو لوگوں کے ناامید ہوجانے کے بعد بارش برساتا(1) اور اپنی رحمت پھیلا دیتا ہے وہی ہے کارساز اور قابل حمد و ثنا.(2)","arabic":"وَهُوَ ٱلَّذِي يُنَزِّلُ ٱلۡغَيۡثَ مِنۢ بَعۡدِ مَا قَنَطُواْ وَيَنشُرُ رَحۡمَتَهُۥۚ وَهُوَ ٱلۡوَلِيُّ ٱلۡحَمِيدُ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura"],"ayahNumber":4300,"juzNumber":25,"footnotes":"(1) جو انواع رزق کی پیداوار میں سب سے زیادہ مفید اور اہم ہے۔ یہ بارش جب ناامیدی کے بعد ہوتی ہے تو اس نعمت کا صحیح احساس بھی اسی وقت ہوتا ہے۔ اللہ تعالیٰ کے اس طرح کرنے میں حکمت بھی یہی ہے کہ بندے اللہ کی نعمتوں کی قدر کریں اور اس کا شکر بجالائیں۔\n(2) کارساز ہے، اپنے نیک بندوں کی چارہ سازی فرماتا ہے، انہیں منافع سے نوازتا اور شرور ومہلکات سے ان کی حفاظت فرماتا ہے۔ اپنے ان انعامات بے پایاں اور احسانات فراواں پر قابل حمد وثنا ہے۔","lang":"ur","meta":{"transliteration":"wahuwa alladhī yunazzilu al-ghaytha min baʿdi mā qanaṭū wayanshuru raḥmatahu wahuwa al-waliyu al-ḥamīdu ","translations":["And He","(is) the One Who","sends down","the rain","after","after","[what]","they have despaired","and spreads","His mercy","And He","(is) the Protector","the Praiseworthy","(28)"],"transliterationArr":["wahuwa","alladhī","yunazzilu","al-ghaytha","min","baʿdi","mā","qanaṭū","wayanshuru","raḥmatahu","wahuwa","al-waliyu","al-ḥamīdu",null],"verseTiming":[[1,0,770],[2,770,1710],[3,1710,2710],[4,2710,3620],[5,3620,4800],[6,4800,5470],[7,5470,5870],[8,5870,6830],[9,6830,8790],[10,8790,10300],[11,10300,10890],[12,10890,11980],[13,11980,14705]]}},{"name":"42:29","price":"اور اس کی نشانیوں میں سے آسمانوں اور زمین کی پیدائش ہے اور ان میں جانداروں کا پھیلانا ہے۔ وه اس پر بھی قادر ہے کہ جب چاہے انہیں جمع کردے.(1)","arabic":"وَمِنۡ ءَايَٰتِهِۦ خَلۡقُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَمَا بَثَّ فِيهِمَا مِن دَآبَّةٖۚ وَهُوَ عَلَىٰ جَمۡعِهِمۡ إِذَا يَشَآءُ قَدِيرٞ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura"],"ayahNumber":4301,"juzNumber":25,"footnotes":"(1) دَابَّةٍ (زمین پر چلنے پھرنے والا) کا لفظ عام ہے، جس میں جن وانس کے علاوہ تمام حیوانات شامل ہیں، جن کی شکلیں، رنگ، زبانیں، طبائع، اور انواع واجناس ایک دوسرے سے قطعاً مختلف ہیں۔ اور وہ روئے زمین پر پھیلے ہوئے ہیں۔ ان سب کو اللہ تعالیٰ قیامت والے دن ایک ہی میدان میں جمع فرمائے گا۔","lang":"ur","meta":{"transliteration":"wamin āyātihi khalqu al-samāwāti wal-arḍi wamā batha fīhimā min dābbatin wahuwa ʿalā jamʿihim idhā yashāu qadīrun ","translations":["And among","His Signs","(is the) creation","(of) the heavens","and the earth","and whatever","He has dispersed","in both of them","of","(the) creatures","And He","(is) over","their gathering","when","He wills","All-Powerful","(29)"],"transliterationArr":["wamin","āyātihi","khalqu","al-samāwāti","wal-arḍi","wamā","batha","fīhimā","min","dābbatin","wahuwa","ʿalā","jamʿihim","idhā","yashāu","qadīrun",null],"verseTiming":[[1,0,640],[2,640,2100],[3,2100,2750],[4,2750,4290],[5,4290,5330],[6,5330,5950],[7,5950,6570],[8,6570,7630],[9,7630,8890],[10,8890,11870],[11,11870,13670],[12,13670,14310],[13,14310,15390],[14,15390,15990],[15,15990,18460],[16,18460,20975]]}},{"name":"42:30","price":"تمہیں جو کچھ مصیبتیں پہنچتی ہیں وه تمہارے اپنے ہاتھوں کے کرتوت کابدلہ ہے، اور وه تو بہت سی باتوں سے درگزر فرما دیتا ہے.(1)","arabic":"وَمَآ أَصَٰبَكُم مِّن مُّصِيبَةٖ فَبِمَا كَسَبَتۡ أَيۡدِيكُمۡ وَيَعۡفُواْ عَن كَثِيرٖ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura"],"ayahNumber":4302,"juzNumber":25,"footnotes":"(1) اس کا خطاب اگر اہل ایمان سے ہو تو مطلب ہوگا کہ تمہارے بعض گناہوں کا کفارہ تو وہ مصائب بن جاتے ہیں جو تمہیں گناہوں کی پاداش میں پہنچتے ہیں اور کچھ گناہ وہ ہیں جو اللہ تعالیٰ یوں ہی معاف فرما دیتا ہے اور اللہ کی ذات بڑی کریم ہے، معاف کرنے کےبعد آخرت میں اس پر مواخذہ نہیں فرمائے گی۔\nحدیث میں بھی آتا ہے کہ مومن کو جو بھی تکلیف اور ہم وحزن پہنچتا ہے حتیٰ کہ اس کے پیر میں کانٹا بھی چبھتا ہے تو اللہ تعالیٰ اس کی وجہ سے اس کے گناہ معاف فرما دیتا ہے۔ (صحيح بخاري، كتاب المرضى ، باب ما جاء في كفارة المرض - مسلم ، كتاب البر، باب ثواب المؤمن فيما يصيبه من مرض) اگر خطاب عام ہو تو مطلب ہوگا کہ تمہیں جو مصائب دنیا پہنچتے ہیں، یہ تمہارے اپنے گناہوں کانتیجہ ہے حالانکہ اللہ تعالیٰ بہت سے گناہوں سے تو درگزر ہی فرما دیتا ہے یعنی یا تو ہمیشہ کے لیے معاف کردیتا ہے۔ یا ان پر فوری سزا نہیں دیتا۔ (اور عقوبت و تعزیر میں تاخیر، یہ بھی ایک گونہ معافی ہی ہے) جیسے دوسرے مقام پر فرمایا «وَلَوْ يُؤَاخِذُ اللَّهُ النَّاسَ بِمَا كَسَبُوا مَا تَرَكَ عَلَى ظَهْرِهَا مِنْ دَابَّةٍ» (فاطر: 45) ”اگر اللہ تعالیٰ لوگوں کے کرتوتوں پر فوراً مواخذہ فرما دے تو زمین پر کوئی چلنے والا ہی باقی نہ رہے“۔ اسی مفہوم کی آیت النحل 61 بھی ہے۔","lang":"ur","meta":{"transliteration":"wamā aṣābakum min muṣībatin fabimā kasabat aydīkum wayaʿfū ʿan kathīrin ","translations":["And whatever","befalls you","of","(the) misfortune","(is because) of what","have earned","your hands","But He pardons","[from]","much","(30)"],"transliterationArr":["wamā","aṣābakum","min","muṣībatin","fabimā","kasabat","aydīkum","wayaʿfū","ʿan","kathīrin",null],"verseTiming":[[1,0,1920],[2,1920,3460],[3,3460,4100],[4,4100,5890],[5,5890,7710],[6,7710,8690],[7,8690,9990],[8,9990,11130],[9,11130,12210],[10,12210,15105]]}},{"name":"42:31","price":"اور تم ہمیں زمین میں عاجز کرنے والے نہیں ہو(1) ، تمہارے لیے سوائے اللہ تعالیٰ کے نہ کوئی کارساز ہے نہ مددگار.","arabic":"وَمَآ أَنتُم بِمُعۡجِزِينَ فِي ٱلۡأَرۡضِۖ وَمَا لَكُم مِّن دُونِ ٱللَّهِ مِن وَلِيّٖ وَلَا نَصِيرٖ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura"],"ayahNumber":4303,"juzNumber":25,"footnotes":"(1) یعنی تم بھاگ کر کسی ایسی جگہ نہیں جاسکتے کہ جہاں تم ہماری گرفت میں نہ آسکو یا جو مصیبت ہم تم پر نازل کرنا چاہیں، اس سے تم بچ جاؤ۔","lang":"ur","meta":{"transliteration":"wamā antum bimuʿ'jizīna fī al-arḍi wamā lakum min dūni al-lahi min waliyyin walā naṣīrin ","translations":["And not","you","(can) escape","in","the earth","and not","for you","besides","besides","Allah","any","protector","and not","any helper","(31)"],"transliterationArr":["wamā","antum","bimuʿ'jizīna","fī","al-arḍi","wamā","lakum","min","dūni","al-lahi","min","waliyyin","walā","naṣīrin",null],"verseTiming":[[1,0,2260],[2,2260,4600],[3,4600,6060],[4,6060,6300],[5,6300,7730],[6,7730,8280],[7,8280,9090],[8,9090,10020],[9,10020,10780],[10,10780,11420],[11,11420,12270],[12,12270,13290],[13,13290,15030],[14,15030,15630],[15,15630,18235]]}},{"name":"42:32","price":"اور دریا میں چلنے والی پہاڑوں جیسی کشتیاں اس کی نشانیوں میں سے ہیں.(1)","arabic":"وَمِنۡ ءَايَٰتِهِ ٱلۡجَوَارِ فِي ٱلۡبَحۡرِ كَٱلۡأَعۡلَٰمِ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura"],"ayahNumber":4304,"juzNumber":25,"footnotes":"(1) الْجَوَارِ یا الْجَوَارِي جَارِيَةٌ (چلنے والی) کی جمع ہے، بمعنی کشتیاں، جہاز، یہ اللہ کی قدرت تامہ کی دلیل ہے کہ سمندروں میں پہاڑوں جیسی کشتیاں اور جہاز اس کے حکم سے چلتے ہیں، ورنہ اگر وہ حکم دے تو یہ سمندروں میں ہی کھڑے رہیں۔","lang":"ur","meta":{"transliteration":"wamin āyātihi al-jawāri fī al-baḥri kal-aʿlāmi ","translations":["And among","His Signs","(are) the ships","in","the sea","like [the] mountains","(32)"],"transliterationArr":["wamin","āyātihi","al-jawāri","fī","al-baḥri","kal-aʿlāmi",null],"verseTiming":[[1,0,710],[2,710,2000],[3,2000,3060],[4,3060,3320],[5,3320,4180],[6,4180,7445]]}},{"name":"42:33","price":"اگر وه چاہے تو ہوا بند کردے اور یہ کشتیاں سمندروں پر رکی ره جائیں۔ یقیناً اس میں ہر صبر کرنے والے شکرگزار کے لیے نشانیاں ہیں.","arabic":"إِن يَشَأۡ يُسۡكِنِ ٱلرِّيحَ فَيَظۡلَلۡنَ رَوَاكِدَ عَلَىٰ ظَهۡرِهِۦٓۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّكُلِّ صَبَّارٖ شَكُورٍ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura"],"ayahNumber":4305,"juzNumber":25,"footnotes":"","lang":"ur","meta":{"transliteration":"in yasha yus'kini al-rīḥa fayaẓlalna rawākida ʿalā ẓahrihi inna fī dhālika laāyātin likulli ṣabbārin shakūrin ","translations":["If","He wills","He can cause the wind to become still","He can cause the wind to become still","then they would remain","motionless","on","its back","Indeed","in","that","surely (are) Signs","for everyone","patient","(and) grateful","(33)"],"transliterationArr":["in","yasha","yus'kini","al-rīḥa","fayaẓlalna","rawākida","ʿalā","ẓahrihi","inna","fī","dhālika","laāyātin","likulli","ṣabbārin","shakūrin",null],"verseTiming":[[1,0,1240],[2,1240,1940],[3,1940,2770],[4,2770,3620],[5,3620,4910],[6,4910,5940],[7,5940,6560],[8,6560,8040],[9,8040,9240],[10,9240,9720],[11,9720,10580],[12,10580,11910],[13,11910,12850],[14,12850,15110],[15,15110,17895]]}},{"name":"42:34","price":"یا انہیں ان کے کرتوتوں کے باعﺚ تباه کردے(1) ، وه تو بہت سے خطاؤں سے درگزر فرمایا کرتا ہے.(2)","arabic":"أَوۡ يُوبِقۡهُنَّ بِمَا كَسَبُواْ وَيَعۡفُ عَن كَثِيرٖ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura"],"ayahNumber":4306,"juzNumber":25,"footnotes":"(1) یعنی سمندر کو حکم دے اور اس کی موجوں میں طغیانی آجائے اور یہ ان میں ڈوب جائیں۔\n(2) ورنہ سمندر میں سفر کرنے والا کوئی بھی سلامتی کے ساتھ واپس نہ آسکے۔","lang":"ur","meta":{"transliteration":"aw yūbiq'hunna bimā kasabū wayaʿfu ʿan kathīrin ","translations":["Or","He could destroy them","for what","they have earned","but He pardons","[from]","much","(34)"],"transliterationArr":["aw","yūbiq'hunna","bimā","kasabū","wayaʿfu","ʿan","kathīrin",null],"verseTiming":[[1,0,480],[2,480,2750],[3,2750,3340],[4,3340,4350],[5,4350,5150],[6,5150,6180],[7,6180,9065]]}},{"name":"42:35","price":"اور تاکہ جو لوگ ہماری نشانیوں میں جھگڑتے ہیں(1) وه معلوم کرلیں کہ ان کے لیے کوئی چھٹکارا نہیں.(2)","arabic":"وَيَعۡلَمَ ٱلَّذِينَ يُجَٰدِلُونَ فِيٓ ءَايَٰتِنَا مَا لَهُم مِّن مَّحِيصٖ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura"],"ayahNumber":4307,"juzNumber":25,"footnotes":"(1) یعنی ان کا انکار کرتے ہیں۔\n(2) یعنی اللہ کے عذاب سے وہ کہیں بھاگ کر چھٹکارا حاصل نہیں کرسکتے۔","lang":"ur","meta":{"transliteration":"wayaʿlama alladhīna yujādilūna fī āyātinā mā lahum min maḥīṣin ","translations":["And may know","those who","dispute","concerning","Our Signs","(that) not","for them","any","place of refuge","(35)"],"transliterationArr":["wayaʿlama","alladhīna","yujādilūna","fī","āyātinā","mā","lahum","min","maḥīṣin",null],"verseTiming":[[1,0,1100],[2,1100,2180],[3,2180,3600],[4,3600,5370],[5,5370,6830],[6,6830,7230],[7,7230,7970],[8,7970,8850],[9,8850,12405]]}},{"name":"42:36","price":"تو تمہیں جو کچھ دیا گیا ہے وه زندگانی دنیا کا کچھ یونہی سا اسباب ہے(1) ، اور اللہ کے پاس جو ہے وه اس سے بدرجہ بہتر(2) اور پائیدار ہے، وه ان کے لیے ہے جو ایمان ﻻئے اور صرف اپنے رب ہی پر بھروسہ رکھتے ہیں.","arabic":"فَمَآ أُوتِيتُم مِّن شَيۡءٖ فَمَتَٰعُ ٱلۡحَيَوٰةِ ٱلدُّنۡيَاۚ وَمَا عِندَ ٱللَّهِ خَيۡرٞ وَأَبۡقَىٰ لِلَّذِينَ ءَامَنُواْ وَعَلَىٰ رَبِّهِمۡ يَتَوَكَّلُونَ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura"],"ayahNumber":4308,"juzNumber":25,"footnotes":"(1) یعنی معمولی اور حقیر ہے، چاہے قارون کا خزانہ ہی کیوں نہ ہو، اس لیے اس سے دھوکے میں مبتلا نہ ہونا، اس لیے کہ یہ عارضی اور فانی ہے۔\n(2) یعنی نیکیوں کا جو اجر وثواب اللہ کے ہاں ملے گا وہ متاع دنیا سے کہیں زیادہ بہتر بھی ہے اور پائیدار بھی، کیونکہ اس کو زوال اور فنا نہیں، مطلب ہے کہ دنیا کو آخرت پر ترجیح مت دو، ایسا کرو گے تو پچھتاؤ گے۔","lang":"ur","meta":{"transliteration":"famā ūtītum min shayin famatāʿu al-ḥayati al-dun'yā wamā ʿinda al-lahi khayrun wa-abqā lilladhīna āmanū waʿalā rabbihim yatawakkalūna ","translations":["So whatever","you are given","of","a thing","(is) but a passing enjoyment","(for) the life","(of) the world","But what","(is) with","Allah","(is) better","and more lasting","for those who","believe","and upon","their Lord","put (their) trust","(36)"],"transliterationArr":["famā","ūtītum","min","shayin","famatāʿu","al-ḥayati","al-dun'yā","wamā","ʿinda","al-lahi","khayrun","wa-abqā","lilladhīna","āmanū","waʿalā","rabbihim","yatawakkalūna",null],"verseTiming":[[1,0,2120],[2,2120,3300],[3,3300,4590],[4,4590,5320],[5,5320,7180],[6,7180,8290],[7,8290,9400],[8,9400,10480],[9,10480,11670],[10,11670,13000],[11,13000,13850],[12,13850,15630],[13,15630,16640],[14,16640,17810],[15,17810,19010],[16,19010,19750],[17,19750,20820],[18,20820,24745]]}},{"name":"42:37","price":"اور کبیره گناہوں سے اور بے حیائیوں سے بچتے ہیں اور غصے کے وقت (بھی) معاف کردیتے ہیں.(1)","arabic":"وَٱلَّذِينَ يَجۡتَنِبُونَ كَبَٰٓئِرَ ٱلۡإِثۡمِ وَٱلۡفَوَٰحِشَ وَإِذَا مَا غَضِبُواْ هُمۡ يَغۡفِرُونَ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura"],"ayahNumber":4309,"juzNumber":25,"footnotes":"(1) یعنی لوگوں سے عفو ودرگزر کرنا ان کے مزاج وطبیعت کا حصہ ہے نہ کہ انتقام اور بدلہ لینا۔ جس طرح نبی (صلى الله عليه وسلم) کے بارے میں آتا ہے۔ ”مَا انْتَقَمَ لِنَفْسِهِ قَطُّ إِلا أَنْ تُنْتَهَكَ حُرُمَات اللهِ“ (البخاري ، كتاب الأدب ، باب يسروا ولا تعسروا - مسلم كتاب الفضائل، باب مباعدته صلى الله عليه وسلم للآثام) نبی (صلى الله عليه وسلم) نے اپنی ذات کے لیے کبھی بدلہ نہیں لیا، ہاں اللہ تعالیٰ کی حرمتوں کا توڑا جانا آپ کے لیے ناقابل برداشت تھا۔","lang":"ur","meta":{"transliteration":"wa-alladhīna yajtanibūna kabāira al-ith'mi wal-fawāḥisha wa-idhā mā ghaḍibū hum yaghfirūna ","translations":["And those who","avoid","(the) greater","sins","and the immoralities","and when","and when","they are angry","they","forgive","(37)"],"transliterationArr":["wa-alladhīna","yajtanibūna","kabāira","al-ith'mi","wal-fawāḥisha","wa-idhā","mā","ghaḍibū","hum","yaghfirūna",null],"verseTiming":[[1,0,1200],[2,1200,2720],[3,2720,5200],[4,5200,6090],[5,6090,7540],[6,7540,8350],[7,8350,8800],[8,8800,9680],[9,9680,10120],[10,10120,12975]]}},{"name":"42:38","price":"اور اپنے رب کے فرمان کو قبول کرتے ہیں(1) اور نماز کی پابندی کرتے ہیں(2) اور ان کا (ہر) کام آپس کے مشورے سے ہوتا ہے(3)، اور جو ہم نے انہیں دے رکھا ہے اس میں سے (ہمارے نام پر) دیتے ہیں.","arabic":"وَٱلَّذِينَ ٱسۡتَجَابُواْ لِرَبِّهِمۡ وَأَقَامُواْ ٱلصَّلَوٰةَ وَأَمۡرُهُمۡ شُورَىٰ بَيۡنَهُمۡ وَمِمَّا رَزَقۡنَٰهُمۡ يُنفِقُونَ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura"],"ayahNumber":4310,"juzNumber":25,"footnotes":"(1) یعنی اس کے حکم کی اطاعت، اس کے رسول کا اتباع اور اس کے زواجر سے اجتناب کرتے ہیں۔\n(2) نماز کی پابندی اور اقامت کا بطور خاص ذکر کیا کہ عبادات میں اس کی اہمیت سب سے زیادہ ہے۔\n(3) شُورَى ٰ، کا لفظ ذِكْرَىٰ اور بُشْرَىٰ کی طرح باب مفاعلہ سے اسم مصدر ہے۔ یعنی اہل ایمان ہر اہم کام باہمی مشاورت سے کرتے ہیں، اپنی ہی رائے کو حرف آخر نہیں سمجھتے خود نبی (صلى الله عليه وسلم) کو بھی اللہ نے حکم دیا کہ مسلمانوں سے مشورہ کرو (آل عمران: 159) چنانچہ آپ جنگی معاملات اور دیگر اہم کاموں میں مشاورت کا اہتمام فرماتے تھے۔ جس سے مسلمانوں کی بھی حوصلہ افزائی ہوتی اور معاملے کے مختلف گوشے واضح ہوجاتے۔ حضرت عمر (رضي الله عنه) جب نیزے کے وار سے زخمی ہوگئے اور زندگی کی کوئی امید باقی نہ رہی تو امر خلافت میں مشاورت کے لیے چھ آدمی نامزد فرما دیے۔ عثمان، علی، طلحہ، زبیر، سعد اور عبدالرحمٰن بن عوف (رضي الله عنهم) ۔ انہوں نے باہم مشورہ کیا اور دیگر لوگوں سے بھی مشاورت کی اور اس کے بعد حضرت عثمان (رضي الله عنه) کو خلافت کے لیے مقرر فرمادیا۔ بعض لوگ مشاورت کے اس حکم اور تاکید سے ملوکیت کی تردید اور جمہوریت کا اثبات کرتے ہیں۔ حالانکہ مشاورت کا اہتمام ملوکیت میں بھی ہوتا ہے۔ بادشاہ کی بھی مجلس مشاورت ہوتی ہے، جس میں ہر اہم معاملے پر سوچ بچار ہوتا ہے اس لیے اس آیت سے ملوکیت کی نفی قطعاً نہیں ہوتی۔ علاوہ ازیں جمہوریت کو مشاورت کے ہم معنی سمجھنا یکسر غلط ہے۔ مشاورت ہر کہ و مہ سے نہیں ہوسکتی، نہ اس کی ضرورت ہی ہے۔ مشاورت کا مطلب ان لوگوں سے مشورہ کرنا ہے جو اس معاملے کی نزاکتوں اور ضرورتوں کو سمجھتے ہیں جس میں مشورہ درکار ہوتا ہے۔ جیسے بلڈنگ، پل وغیرہ بنانا ہو تو، کسی تانگہ بان، درزی یا رکشہ ڈرائیور سے نہیں، کسی انجینئر سے مشورہ کیا جائے گا، کسی مرض کے بارے میں مشورے کی ضرورت ہوگی تو طب و حکمت کے ماہرین کی طرف رجوع کیا جائے گا۔ جب کہ جمہوریت میں اس کے برعکس ہر بالغ شخص کو مشورے کا اہل سمجھا جاتا ہے، چاہے وہ کورا ان پڑھ، بےشعور اور امور سلطنت کی نزاکتوں سے یکسر بے خبر ہو۔ بنابریں مشاورت کے لفظ سے جمہوریت کا اثبات، تحکم اور دھاندلی کے سوا کچھ نہیں، اور جس طرح سوشلزم کے ساتھ اسلامی کا لفظ لگانے سے سوشلزم مشرف بہ اسلام نہیں ہوسکتا، اسی طرح جمہوریت میں اسلامی کی پیوند کاری سے مغربی جمہوریت پر خلافت کی قباراست نہیں آسکتی۔ مغرب کا یہ پودا اسلام کی سرزمین پر نہیں پنپ سکتا۔","lang":"ur","meta":{"transliteration":"wa-alladhīna is'tajābū lirabbihim wa-aqāmū al-ṣalata wa-amruhum shūrā baynahum wamimmā razaqnāhum yunfiqūna ","translations":["And those who","respond","to their Lord","and establish","prayer","and their affairs","(are conducted by) consultation","among them","and from what","We have provided them","they spend","(38)"],"transliterationArr":["wa-alladhīna","is'tajābū","lirabbihim","wa-aqāmū","al-ṣalata","wa-amruhum","shūrā","baynahum","wamimmā","razaqnāhum","yunfiqūna",null],"verseTiming":[[1,0,1240],[2,1240,2540],[3,2540,3820],[4,3820,4810],[5,4810,5980],[6,5980,7130],[7,7130,8030],[8,8030,9130],[9,9130,10770],[10,10770,12310],[11,12310,15985]]}},{"name":"42:39","price":"اور جب ان پر ﻇلم (و زیادتی) ہو تو وه صرف بدلہ لے لیتے ہیں.(1)","arabic":"وَٱلَّذِينَ إِذَآ أَصَابَهُمُ ٱلۡبَغۡيُ هُمۡ يَنتَصِرُونَ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura"],"ayahNumber":4311,"juzNumber":25,"footnotes":"(1) یعنی بدلہ لینے سے وہ عاجز نہیں ہیں، اگر بدلہ لینا چاہیں تو لے سکتے ہیں، تاہم قدرت کے باوجود وہ معافی کو ترجیح دیتے ہیں جیسے نبی (صلى الله عليه وسلم) نے فتح مکہ والے دن اپنے خون کے پیاسوں کے لیے عفوعام کا اعلان فرما دیا، حدیبیہ میں آپ نے ان 80 آدمیوں کو معاف کردیا، جنہوں نے آپ کے خلاف سازش تیار کی تھی، لبید بں عاصم یہودی سے بدلہ نہیں لیا جس نے آپ پر جادو کیا تھا، اس یہودیہ عورت کو آپ نے کچھ نہیں کہا جس نے آپ کے کھانے میں زہر ملادیا تھا، جس کی تکلیف آپ دم واپسیں تک محسوس فرماتے رہے، (صلى الله عليه وسلم) (ابن کثیر)۔","lang":"ur","meta":{"transliteration":"wa-alladhīna idhā aṣābahumu al-baghyu hum yantaṣirūna ","translations":["And those who","when","strikes them","tyranny","they","defend themselves","(39)"],"transliterationArr":["wa-alladhīna","idhā","aṣābahumu","al-baghyu","hum","yantaṣirūna",null],"verseTiming":[[1,0,1410],[2,1410,3720],[3,3720,4960],[4,4960,5820],[5,5820,6280],[6,6280,10235]]}},{"name":"42:40","price":"اور برائی کا بدلہ اسی جیسی برائی ہے(1) ، اور جو معاف کر دے اور اصلاح کرلے اس کا اجر اللہ کے ذمے ہے، (فی الواقع) اللہ تعالیٰ ﻇالموں سے محبت نہیں کرتا.","arabic":"وَجَزَٰٓؤُاْ سَيِّئَةٖ سَيِّئَةٞ مِّثۡلُهَاۖ فَمَنۡ عَفَا وَأَصۡلَحَ فَأَجۡرُهُۥ عَلَى ٱللَّهِۚ إِنَّهُۥ لَا يُحِبُّ ٱلظَّٰلِمِينَ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura"],"ayahNumber":4312,"juzNumber":25,"footnotes":"(1) یہ قصاص (بدلہ لینے) کی اجازت ہے۔ برائی کا بدلہ اگرچہ برائی نہیں ہے لیکن مشاکلت کی وجہ سے اسے بھی برائی ہی کہا گیا ہے۔","lang":"ur","meta":{"transliteration":"wajazāu sayyi-atin sayyi-atun mith'luhā faman ʿafā wa-aṣlaḥa fa-ajruhu ʿalā al-lahi innahu lā yuḥibbu al-ẓālimīna ","translations":["(The) recompense","(of) an evil","(is) an evil","like it","But whoever","pardons","and makes reconciliation","then his reward","(is) on","Allah","Indeed, He","(does) not","like","the wrongdoers","(40)"],"transliterationArr":["wajazāu","sayyi-atin","sayyi-atun","mith'luhā","faman","ʿafā","wa-aṣlaḥa","fa-ajruhu","ʿalā","al-lahi","innahu","lā","yuḥibbu","al-ẓālimīna",null],"verseTiming":[[1,0,2839],[2,2839,4759],[3,4759,6179],[4,6179,8109],[5,8109,9199],[6,9199,9929],[7,9929,11029],[8,11029,12279],[9,12279,12689],[10,12689,15519],[11,15519,17478],[12,17478,17878],[13,17878,18808],[14,18808,21733]]}},{"name":"42:41","price":"اور جو شخص اپنے مظلوم ہونے کے بعد (برابر کا) بدلہ لے لے تو ایسے لوگوں پر (الزام کا) کوئی راستہ نہیں.","arabic":"وَلَمَنِ ٱنتَصَرَ بَعۡدَ ظُلۡمِهِۦ فَأُوْلَٰٓئِكَ مَا عَلَيۡهِم مِّن سَبِيلٍ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura"],"ayahNumber":4313,"juzNumber":25,"footnotes":"","lang":"ur","meta":{"transliteration":"walamani intaṣara baʿda ẓul'mihi fa-ulāika mā ʿalayhim min sabīlin ","translations":["And surely whosoever","defends himself","after","he has been wronged","then those","not","(is) against them","any","way","(41)"],"transliterationArr":["walamani","intaṣara","baʿda","ẓul'mihi","fa-ulāika","mā","ʿalayhim","min","sabīlin",null],"verseTiming":[[1,0,980],[2,980,2670],[3,2670,3250],[4,3250,4270],[5,4270,7070],[6,7070,7490],[7,7490,8410],[8,8410,10360],[9,10360,13315]]}},{"name":"42:42","price":"یہ راستہ صرف ان لوگوں پر ہے جو خود دوسروں پر ﻇلم کریں اور زمین میں ناحق فساد کرتے پھریں، یہی لوگ ہیں جن کے لیے دردناک عذاب ہے.","arabic":"إِنَّمَا ٱلسَّبِيلُ عَلَى ٱلَّذِينَ يَظۡلِمُونَ ٱلنَّاسَ وَيَبۡغُونَ فِي ٱلۡأَرۡضِ بِغَيۡرِ ٱلۡحَقِّۚ أُوْلَٰٓئِكَ لَهُمۡ عَذَابٌ أَلِيمٞ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura"],"ayahNumber":4314,"juzNumber":25,"footnotes":"","lang":"ur","meta":{"transliteration":"innamā al-sabīlu ʿalā alladhīna yaẓlimūna al-nāsa wayabghūna fī al-arḍi bighayri al-ḥaqi ulāika lahum ʿadhābun alīmun ","translations":["Only","the way","against","those who","oppress","the people","and rebel","in","the earth","without","right","Those","for them","(is) a punishment","painful","(42)"],"transliterationArr":["innamā","al-sabīlu","ʿalā","alladhīna","yaẓlimūna","al-nāsa","wayabghūna","fī","al-arḍi","bighayri","al-ḥaqi","ulāika","lahum","ʿadhābun","alīmun",null],"verseTiming":[[1,0,1840],[2,1840,2890],[3,2890,3380],[4,3380,4440],[5,4440,5670],[6,5670,7380],[7,7380,8620],[8,8620,8840],[9,8840,9710],[10,9710,10550],[11,10550,11990],[12,11990,14580],[13,14580,15120],[14,15120,16270],[15,16270,19355]]}},{"name":"42:43","price":"اور جو شخص صبر کر لے اور معاف کردے یقیناً یہ بڑی ہمت کے کاموں میں سے (ایک کام) ہے.","arabic":"وَلَمَن صَبَرَ وَغَفَرَ إِنَّ ذَٰلِكَ لَمِنۡ عَزۡمِ ٱلۡأُمُورِ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura"],"ayahNumber":4315,"juzNumber":25,"footnotes":"","lang":"ur","meta":{"transliteration":"walaman ṣabara waghafara inna dhālika lamin ʿazmi al-umūri ","translations":["And whoever","(is) patient","and forgives","indeed","that","(is) surely of","matters of determination","matters of determination","(43)"],"transliterationArr":["walaman","ṣabara","waghafara","inna","dhālika","lamin","ʿazmi","al-umūri",null],"verseTiming":[[1,0,1640],[2,1640,2470],[3,2470,3240],[4,3240,4490],[5,4490,5410],[6,5410,5950],[7,5950,6720],[8,6720,9305]]}},{"name":"42:44","price":"اور جسے اللہ تعالیٰ بہکا دے اس کا اس کے بعد کوئی چاره ساز نہیں، اور تو دیکھے گا کہ ﻇالم لوگ عذاب کو دیکھ کر کہہ رہے ہوں گے کہ کیا واپس جانے کی کوئی راه ہے.","arabic":"وَمَن يُضۡلِلِ ٱللَّهُ فَمَا لَهُۥ مِن وَلِيّٖ مِّنۢ بَعۡدِهِۦۗ وَتَرَى ٱلظَّٰلِمِينَ لَمَّا رَأَوُاْ ٱلۡعَذَابَ يَقُولُونَ هَلۡ إِلَىٰ مَرَدّٖ مِّن سَبِيلٖ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura"],"ayahNumber":4316,"juzNumber":25,"footnotes":"","lang":"ur","meta":{"transliteration":"waman yuḍ'lili al-lahu famā lahu min waliyyin min baʿdihi watarā al-ẓālimīna lammā ra-awū al-ʿadhāba yaqūlūna hal ilā maraddin min sabīlin ","translations":["And whoever","Allah lets go astray","Allah lets go astray","then not","for him","any","protector","after Him","after Him","And you will see","the wrongdoers","when","they see","the punishment","saying","Is","(there) for","return","any","way","(44)"],"transliterationArr":["waman","yuḍ'lili","al-lahu","famā","lahu","min","waliyyin","min","baʿdihi","watarā","al-ẓālimīna","lammā","ra-awū","al-ʿadhāba","yaqūlūna","hal","ilā","maraddin","min","sabīlin",null],"verseTiming":[[1,0,570],[2,570,2390],[3,2390,3070],[4,3070,3770],[5,3770,5320],[6,5320,5380],[7,5380,6220],[8,6220,8450],[9,8450,9850],[10,9850,10540],[11,10540,11930],[12,11930,13650],[13,13650,14290],[14,14290,15430],[15,15430,16660],[16,16660,17150],[17,17150,17800],[18,17800,19110],[19,19110,20180],[20,20180,24575]]}},{"name":"42:45","price":"اور تو انہیں دیکھے گا کہ وه (جہنم کے) سامنے ﻻکھڑے کیے جائیں گے مارے ذلت کے جھکے جارہے ہوں گے اور کنکھیوں سے دیکھ رہے ہوں گے، ایمان والے صاف کہیں گے کہ حقیقی زیاںکار وه ہیں جنہوں نے آج قیامت کے دن اپنے آپ کو اور اپنے گھر والوں کو نقصان میں ڈال دیا۔ یاد رکھو کہ یقیناً ﻇالم لوگ دائمی عذاب میں ہیں.(1)","arabic":"وَتَرَىٰهُمۡ يُعۡرَضُونَ عَلَيۡهَا خَٰشِعِينَ مِنَ ٱلذُّلِّ يَنظُرُونَ مِن طَرۡفٍ خَفِيّٖۗ وَقَالَ ٱلَّذِينَ ءَامَنُوٓاْ إِنَّ ٱلۡخَٰسِرِينَ ٱلَّذِينَ خَسِرُوٓاْ أَنفُسَهُمۡ وَأَهۡلِيهِمۡ يَوۡمَ ٱلۡقِيَٰمَةِۗ أَلَآ إِنَّ ٱلظَّٰلِمِينَ فِي عَذَابٖ مُّقِيمٖ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura"],"ayahNumber":4317,"juzNumber":25,"footnotes":"(1) یعنی دنیا میں یہ کافر ہمیں بیوقوف اور دنیوی خسارے کا حامل سمجھتے تھے، جب کہ ہم دنیا میں صرف آخرت کو ترجیح دیتے تھے اور دنیا کے خساروں کو کوئی اہمیت نہیں دیتے تھے۔ آج دیکھ لو حقیقی خسارے سے کون دوچار ہے۔ وہ جنہوں نے دنیا کے عارضی خسارے کو نظر انداز کیے رکھا اور آج وہ جنت کے مزے لوٹ رہے ہیں یا وہ جنہوں نے دنیا کو ہی سب کچھ سمجھ رکھا تھا اور آج ایسے عذاب میں گرفتار ہیں، جس سے اب چھٹکارا ممکن ہی نہیں۔","lang":"ur","meta":{"transliteration":"watarāhum yuʿ'raḍūna ʿalayhā khāshiʿīna mina al-dhuli yanẓurūna min ṭarfin khafiyyin waqāla alladhīna āmanū inna al-khāsirīna alladhīna khasirū anfusahum wa-ahlīhim yawma al-qiyāmati alā inna al-ẓālimīna fī ʿadhābin muqīmin ","translations":["And you will see them","being exposed","to it","humbled","by","disgrace","looking","with","a glance","stealthy","And will say","those who","believed","Indeed","the losers","(are) those who","lost","themselves","and their families","(on the) Day","(of) the Resurrection","Unquestionably","Indeed","the wrongdoers","(are) in","a punishment","lasting","(45)"],"transliterationArr":["watarāhum","yuʿ'raḍūna","ʿalayhā","khāshiʿīna","mina","al-dhuli","yanẓurūna","min","ṭarfin","khafiyyin","waqāla","alladhīna","āmanū","inna","al-khāsirīna","alladhīna","khasirū","anfusahum","wa-ahlīhim","yawma","al-qiyāmati","alā","inna","al-ẓālimīna","fī","ʿadhābin","muqīmin",null],"verseTiming":[[1,0,1440],[2,1440,2690],[3,2690,3760],[4,3760,5070],[5,5070,5500],[6,5500,6340],[7,6340,8230],[8,8230,9660],[9,9660,10520],[10,10520,11080],[11,11080,12750],[12,12750,13730],[13,13730,16449],[14,16449,17749],[15,17749,19359],[16,19359,20449],[17,20449,22639],[18,22639,24479],[19,24479,25939],[20,25939,26599],[21,26599,28329],[22,28329,30289],[23,30289,31449],[24,31449,33019],[25,33019,33459],[26,33459,34399],[27,34399,38114]]}},{"name":"42:46","price":"ان کے کوئی مددگار نہیں جو اللہ تعالیٰ سے الگ ان کی امداد کرسکیں اور جسے اللہ گمراه کردے اس کے لیے کوئی راستہ ہی نہیں.","arabic":"وَمَا كَانَ لَهُم مِّنۡ أَوۡلِيَآءَ يَنصُرُونَهُم مِّن دُونِ ٱللَّهِۗ وَمَن يُضۡلِلِ ٱللَّهُ فَمَا لَهُۥ مِن سَبِيلٍ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura"],"ayahNumber":4318,"juzNumber":25,"footnotes":"","lang":"ur","meta":{"transliteration":"wamā kāna lahum min awliyāa yanṣurūnahum min dūni al-lahi waman yuḍ'lili al-lahu famā lahu min sabīlin ","translations":["And not","will be","for them","any","protector","(who) will help them","besides","besides","Allah","And whom","Allah lets go astray","Allah lets go astray","then not","for him","any","way","(46)"],"transliterationArr":["wamā","kāna","lahum","min","awliyāa","yanṣurūnahum","min","dūni","al-lahi","waman","yuḍ'lili","al-lahu","famā","lahu","min","sabīlin",null],"verseTiming":[[1,0,630],[2,630,1390],[3,1390,1850],[4,1850,2930],[5,2930,5750],[6,5750,7970],[7,7970,9960],[8,9960,10680],[9,10680,12540],[10,12540,13570],[11,13570,15200],[12,15200,15810],[13,15810,16490],[14,16490,17240],[15,17240,18530],[16,18530,19050],[17,19050,21895]]}},{"name":"42:47","price":"اپنے رب کا حکم مان لو اس سے پہلے کہ اللہ کی جانب سے وه دن آجائے جس کا ہٹ جانا ناممکن(1) ہے، تمہیں اس روز نہ تو کوئی پناه کی جگہ ملے گی نہ چھﭗ کر انجان بن جانے کی.(2)","arabic":"ٱسۡتَجِيبُواْ لِرَبِّكُم مِّن قَبۡلِ أَن يَأۡتِيَ يَوۡمٞ لَّا مَرَدَّ لَهُۥ مِنَ ٱللَّهِۚ مَا لَكُم مِّن مَّلۡجَإٖ يَوۡمَئِذٖ وَمَا لَكُم مِّن نَّكِيرٖ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura"],"ayahNumber":4319,"juzNumber":25,"footnotes":"(1) یعنی جس کو رد کرنے اور ٹالنے کی کوئی طاقت نہیں رکھے گا۔ .\n(2) یعنی تمہارے لیے کوئی ایسی جگہ نہیں ہوگی، کہ جس میں تم چھپ کر انجان بن جاؤ اور پہچانے نہ جاسکو یا نظر میں نہ آسکو جیسے فرمایا: «يَقُولُ الإِنْسَانُ يَوْمَئِذٍ أَيْنَ الْمَفَرُّ ، كَلا لا وَزَرَ، إِلَى رَبِّكَ يَوْمَئِذٍ الْمُسْتَقَرُّ» (القيامة: 10۔ 12) ”اس دن انسان کہے گا، کہیں بھاگنے کی جگہ ہے، ہرگز نہیں، کوئی راہ فرار نہیں ہوگی، اس دن تیرے رب کے پاس ہی ٹھکانا ہو گا“۔ یا نکیر بمعنی انکار ہے کہ تم اپنے گناہوں کا انکار نہ کرسکو گے کیوں کہ ایک تو وہ سب لکھے ہوئے ہوں گے۔ دوسرے خود انسان کے اعضا بھی گواہی دیں گے۔ یا جو عذاب تمہیں تمہارے گناہوں کی وجہ سے دیا جائے گا تم اس عذاب کا انکار نہیں کرسکو گے، کیوں کہ اعتراف گناہ کے بغیر تمہیں چارہ نہیں ہوگا۔","lang":"ur","meta":{"transliteration":"is'tajībū lirabbikum min qabli an yatiya yawmun lā maradda lahu mina al-lahi mā lakum min malja-in yawma-idhin wamā lakum min nakīrin ","translations":["Respond","to your Lord","before","before","[that]","comes","a Day","(there is) no","averting","for it","from","Allah","Not","(is) for you","any","refuge","(on) that Day","and not","for you","any","denial","(47)"],"transliterationArr":["is'tajībū","lirabbikum","min","qabli","an","yatiya","yawmun","lā","maradda","lahu","mina","al-lahi","mā","lakum","min","malja-in","yawma-idhin","wamā","lakum","min","nakīrin",null],"verseTiming":[[1,0,1520],[2,1520,2930],[3,2930,5180],[4,5180,5800],[5,5800,6000],[6,6000,7080],[7,7080,8500],[8,8500,9140],[9,9140,10060],[10,10060,10720],[11,10720,10990],[12,10990,13680],[13,13680,14160],[14,14160,14740],[15,14740,15720],[16,15720,17740],[17,17740,19430],[18,19430,20720],[19,20720,21310],[20,21310,22450],[21,22450,26195]]}},{"name":"42:48","price":"اگر یہ منھ پھیرلیں تو ہم نے آپ کو ان پر نگہبان بنا کر نہیں بھیجا، آپ کے ذمہ تو صرف پیغام پہنچا دینا ہے(1) ، ہم جب کبھی انسان کو اپنی مہربانی کا مزه چکھاتے ہیں(2) تو وه اس پر اترا جاتا ہے(3) اور اگر انہیں ان کے اعمال کی وجہ سے کوئی مصیبت(4) پہنچتی ہے تو بےشک انسان بڑا ہی ناشکرا ہے.(5)","arabic":"فَإِنۡ أَعۡرَضُواْ فَمَآ أَرۡسَلۡنَٰكَ عَلَيۡهِمۡ حَفِيظًاۖ إِنۡ عَلَيۡكَ إِلَّا ٱلۡبَلَٰغُۗ وَإِنَّآ إِذَآ أَذَقۡنَا ٱلۡإِنسَٰنَ مِنَّا رَحۡمَةٗ فَرِحَ بِهَاۖ وَإِن تُصِبۡهُمۡ سَيِّئَةُۢ بِمَا قَدَّمَتۡ أَيۡدِيهِمۡ فَإِنَّ ٱلۡإِنسَٰنَ كَفُورٞ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura"],"ayahNumber":4320,"juzNumber":25,"footnotes":"(1) جیسے دوسرے مقام پر فرمایا «لَيْسَ عَلَيْكَ هُدَاهُمْ وَلَكِنَّ اللَّهَ يَهْدِي مَنْ يَشَاءُ» (البقرة: 272) اور «فَإِنَّمَا عَلَيْكَ الْبَلاغُ وَعَلَيْنَا الْحِسَابُ» (الرعد: 40) «فَذَكِّرْ إِنَّمَا أَنْتَ مُذَكِّرٌ ، لَسْتَ عَلَيْهِمْ بِمُسَيْطِرٍ» (الغاشية :21 -22) ان سب کا مطلب یہ ہے کہ آپ (صلى الله عليه وسلم) کی ذمہ داری صرف اور صرف یہ ہے کہ اللہ کا پیغام لوگوں تک پہنچادیں، مانیں نہ مانیں، آپ سے اس کی بازپرس نہیں ہوگی، کیونکہ ہدایت دینا آپ کے اختیار میں ہی نہیں ہے، یہ صرف اللہ کے اختیار میں ہے۔\n(2) یعنی وسائل رزق کی فراوانی، صحت وعافیت، اولاد کی کثرت، جاہ ومنصب وغیرہ۔\n(3) یعنی تکبر اور غرور کا اظہار کرتا ہے، ورنہ اللہ کی نعمتوں پر خوش ہونا یا اس کا اظہار ہونا، ناپسندیدہ امر نہیں، لیکن وہ تحدیث نعمت اور شکر کے طور پر ہو نہ کہ فخر وریا اور تکبر کے طور پر۔\n(4) مال کی کمی، بیماری، اولاد سے محرومی وغیرہ۔\n(5) یعنی فوراً نعمتوں کوبھی بھول جاتا ہے اور مُنْعِمٌ (نعمتیں دینے والے) کو بھی۔ یہ انسانوں کی غالب اکثریت کے اعتبار سے ہے جس میں ضعیف الایمان لوگ بھی شامل ہیں۔ لیکن اللہ کے نیک بندے اور کامل الایمان لوگوں کا حال ایسا نہیں ہوتا۔ وہ تکلیفوں پر صبر کرتے ہیں اور نعمتوں پر شکر۔ جیسا کہ رسول اللہ (صلى الله عليه وسلم) نے فرمایا ”إِنْ أَصَابَتْهُ سَرَّاءُ شَكَرَ فَكَانَ خَيْرًا لَهُ وَإِنْ أَصَابَتْهُ ضَرَّاءُ صَبَرَ فَكَانَ خَيْرًا لَهُ ، وَلَيْس ذَلِك لأَحَدٍ إٍلا لِلْمُؤْمِنِ“ (صحيح مسلم، كتاب الزهد ، باب أمر المؤمن أمره خير له)۔","lang":"ur","meta":{"transliteration":"fa-in aʿraḍū famā arsalnāka ʿalayhim ḥafīẓan in ʿalayka illā al-balāghu wa-innā idhā adhaqnā al-insāna minnā raḥmatan fariḥa bihā wa-in tuṣib'hum sayyi-atun bimā qaddamat aydīhim fa-inna al-insāna kafūrun ","translations":["Then if","they turn away","then not","We have sent you","over them","(as) a guardian","Not","(is) on you","except","the conveyance","And indeed","when","We cause to taste","[the] man","from Us","Mercy","he rejoices","in it","But if","befalls them","evil","for what","have sent forth","their hands","then indeed","[the] man","(is) ungrateful","(48)"],"transliterationArr":["fa-in","aʿraḍū","famā","arsalnāka","ʿalayhim","ḥafīẓan","in","ʿalayka","illā","al-balāghu","wa-innā","idhā","adhaqnā","al-insāna","minnā","raḥmatan","fariḥa","bihā","wa-in","tuṣib'hum","sayyi-atun","bimā","qaddamat","aydīhim","fa-inna","al-insāna","kafūrun",null],"verseTiming":[[1,0,730],[2,730,1750],[3,1750,3700],[4,3700,5220],[5,5220,6270],[6,6270,7580],[7,7580,8430],[8,8430,9350],[9,9350,9930],[10,9930,12779],[11,12779,16269],[12,16269,18379],[13,18379,19199],[14,19199,21239],[15,21239,22559],[16,22559,24389],[17,24389,25269],[18,25269,25969],[19,25969,27459],[20,27459,29019],[21,29019,31239],[22,31239,31799],[23,31799,32919],[24,32919,34199],[25,34199,35749],[26,35749,37899],[27,37899,40744]]}},{"name":"42:49","price":"آسمانوں کی اور زمین کی سلطنت اللہ تعالیٰ ہی کے لیے ہے، وه جو چاہتا ہے پیدا کرتا ہے(1) جس کو چاہتا ہے بیٹیاں دیتا ہے اور جسے چاہتا ہے بیٹے دیتا ہے.","arabic":"لِّلَّهِ مُلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ يَخۡلُقُ مَا يَشَآءُۚ يَهَبُ لِمَن يَشَآءُ إِنَٰثٗا وَيَهَبُ لِمَن يَشَآءُ ٱلذُّكُورَ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura"],"ayahNumber":4321,"juzNumber":25,"footnotes":"(1) یعنی کائنات میں صرف اللہ ہی کی مشیت اور اسی کی تدبیر چلتی ہے، وہ جو چاہتا ہے، ہوتا ہے، جو نہیں چاہتا، نہیں ہوتا۔ کوئی دوسرا اس میں دخل اندازی کرنے کی قدرت و اختیار نہیں رکھتا۔","lang":"ur","meta":{"transliteration":"lillahi mul'ku al-samāwāti wal-arḍi yakhluqu mā yashāu yahabu liman yashāu ināthan wayahabu liman yashāu al-dhukūra ","translations":["To Allah","(belongs the) dominion","(of) the heavens","and the earth","He creates","what","He wills","He grants","to whom","He wills","females","and He grants","to whom","He wills","[the] males","(49)"],"transliterationArr":["lillahi","mul'ku","al-samāwāti","wal-arḍi","yakhluqu","mā","yashāu","yahabu","liman","yashāu","ināthan","wayahabu","liman","yashāu","al-dhukūra",null],"verseTiming":[[1,0,1230],[2,1230,1860],[3,1860,3510],[4,3510,4970],[5,4970,5910],[6,5910,6330],[7,6330,9180],[8,9180,10390],[9,10390,10850],[10,10850,13790],[11,13790,15550],[12,15550,16380],[13,16380,16820],[14,16820,19540],[15,19540,22515]]}},{"name":"42:50","price":"یا انہیں جمع کردیتا ہے(1) بیٹے بھی اور بیٹیاں بھی اور جسے چاہے بانجھ کر دیتا ہے، وه بڑے علم واﻻ اور کامل قدرت واﻻ ہے.","arabic":"أَوۡ يُزَوِّجُهُمۡ ذُكۡرَانٗا وَإِنَٰثٗاۖ وَيَجۡعَلُ مَن يَشَآءُ عَقِيمًاۚ إِنَّهُۥ عَلِيمٞ قَدِيرٞ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura"],"ayahNumber":4322,"juzNumber":25,"footnotes":"(1) یعنی جس کو چاہتا ہے، مذکر اور مونث دونوں دیتا ہے۔ اس مقام پر اللہ نے لوگوں کی چار قسمیں بیان فرمائی ہیں۔ ایک وہ جن کو صرف بیٹے دیئے۔ دوسرے، وہ جن کو صرف بیٹیاں، تیسرے وہ جن کو بیٹے، بیٹیاں دونوں اور چوتھے، وہ جن کو بیٹا نہ بیٹی۔ لوگوں کے درمیان یہ فرق و تفاوت اللہ کی قدرت کی نشانیوں میں سے ہے، اس تفاوت الٰہی کو دنیا کی کوئی طاقت بدلنے پر قادر نہیں ہے۔ یہ تقسیم اولاد کے اعتبار سے ہے۔ باپوں کے اعتبار سے بھی انسانوں کی چار قسمیں ہیں۔ 1۔ آدم (عليه السلام) کو صرف مٹی سے پیدا کیا، ان کا باپ ہے نہ ماں۔ 2۔ حضرت حوا کو آدم (عليه السلام) سے یعنی مرد سے پیدا کیا، ان کی ماں نہیں ہے۔ 3۔ حضرت عیسیٰ (عليه السلام) کو صرف عورت کے بطن سے پیدا کیا، ان کا باپ نہیں ہے۔ 4۔ اور باقی تمام انسانوں کو مرد اور عورت کے ملاپ سے۔ ان کے باپ بھی ہیں اور مائیں بھی۔ فَسُبْحَانَ اللهِ الْعَلِيمِ الْقَدِيرِ(ابن کثیر)۔","lang":"ur","meta":{"transliteration":"aw yuzawwijuhum dhuk'rānan wa-ināthan wayajʿalu man yashāu ʿaqīman innahu ʿalīmun qadīrun ","translations":["Or","He grants them","males","and females","and He makes","whom","He wills","barren","Indeed, He","(is) All-Knower","All-Powerful","(50)"],"transliterationArr":["aw","yuzawwijuhum","dhuk'rānan","wa-ināthan","wayajʿalu","man","yashāu","ʿaqīman","innahu","ʿalīmun","qadīrun",null],"verseTiming":[[1,0,410],[2,410,2060],[3,2060,4250],[4,4250,6310],[5,6310,7350],[6,7350,7810],[7,7810,10760],[8,10760,12410],[9,12410,14120],[10,14120,16180],[11,16180,18755]]}},{"name":"42:51","price":"ناممکن ہے کہ کسی بنده سے اللہ تعالیٰ کلام کرے مگر وحی کے ذریعہ یا پردے کے پیچھے سے یا کسی فرشتہ کو بھیجے اور وه اللہ کے حکم سے جو وه چاہے وحی(1) کرے، بیشک وه برتر ہے حکمت واﻻ ہے.","arabic":"۞ وَمَا كَانَ لِبَشَرٍ أَن يُكَلِّمَهُ ٱللَّهُ إِلَّا وَحۡيًا أَوۡ مِن وَرَآيِٕ حِجَابٍ أَوۡ يُرۡسِلَ رَسُولٗا فَيُوحِيَ بِإِذۡنِهِۦ مَا يَشَآءُۚ إِنَّهُۥ عَلِيٌّ حَكِيمٞ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura"],"ayahNumber":4323,"juzNumber":25,"footnotes":"(1) اس آیت میں وحی الٰہی کی تین صورتیں بیان کی گئی ہیں پہلی یہ کہ دل میں کسی بات کا ڈال دینا یا خواب میں بتلا دینا اس یقین کے ساتھ کہ یہ اللہ ہی کی طرف سے ہے۔ دوسری، پردے کے پیچھے سے کلام کرنا، جیسے حضرت موسیٰ (عليه السلام) سے کوہ طور پر کیا گیا۔ تیسری، فرشتے کے ذریعے اپنی وحی بھیجنا، جیسے جبرائیل (عليه السلام) اللہ کا پیغام لے کر آتے اور پیغمبروں کو سناتے رہے۔","lang":"ur","meta":{"transliteration":"wamā kāna libasharin an yukallimahu al-lahu illā waḥyan aw min warāi ḥijābin aw yur'sila rasūlan fayūḥiya bi-idh'nihi mā yashāu innahu ʿaliyyun ḥakīmun ","translations":["And not","is","for any human","that","Allah should speak to him","Allah should speak to him","except","(by) revelation","or","from","behind","a veil","or","(by) sending","a messenger","then he reveals","by His permission","what","He wills","Indeed, He","(is) Most High","Most Wise","(51)"],"transliterationArr":["wamā","kāna","libasharin","an","yukallimahu","al-lahu","illā","waḥyan","aw","min","warāi","ḥijābin","aw","yur'sila","rasūlan","fayūḥiya","bi-idh'nihi","mā","yashāu","innahu","ʿaliyyun","ḥakīmun",null],"verseTiming":[[1,0,780],[2,780,1440],[3,1440,2330],[4,2330,2810],[5,2810,4720],[6,4720,5620],[7,5620,6480],[8,6480,7410],[9,7410,7760],[10,7760,8930],[11,8930,11299],[12,11299,12499],[13,12499,12899],[14,12899,13819],[15,13819,15609],[16,15609,15939],[17,15939,16969],[18,16969,18489],[19,18489,19659],[20,19659,21049],[21,21049,21479],[22,21479,24119],[23,24119,26438],[24,26438,27468],[25,27468,30753]]}},{"name":"42:52","price":"اور اسی طرح ہم نے آپ کی طرف اپنے حکم سے روح کو اتارا ہے(1) ، آپ اس سے پہلے یہ بھی نہیں جانتے تھے کہ کتاب اور ایمان کیا چیز ہے(2)؟ لیکن ہم نے اسے نور بنایا، اس کے ذریعہ سے اپنے بندوں میں سے جسے چاہتے ہیں، ہدایت دیتے ہیں(3)، بیشک آپ راه راست کی رہنمائی کر رہے ہیں.","arabic":"وَكَذَٰلِكَ أَوۡحَيۡنَآ إِلَيۡكَ رُوحٗا مِّنۡ أَمۡرِنَاۚ مَا كُنتَ تَدۡرِي مَا ٱلۡكِتَٰبُ وَلَا ٱلۡإِيمَٰنُ وَلَٰكِن جَعَلۡنَٰهُ نُورٗا نَّهۡدِي بِهِۦ مَن نَّشَآءُ مِنۡ عِبَادِنَاۚ وَإِنَّكَ لَتَهۡدِيٓ إِلَىٰ صِرَٰطٖ مُّسۡتَقِيمٖ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura"],"ayahNumber":4324,"juzNumber":25,"footnotes":"(1) رُوحٌ سے مراد قرآن ہے۔ یعنی جس طرح آپ سے پہلے اور رسولوں پر ہم وحی کرتے رہے، اسی طرح ہم نے آپ پر قرآن کی وحی کی ہے۔ قرآن کو روح سے اس لیے تعبیر کیا ہے کہ قرآن سے دلوں کو زندگی حاصل ہوتی ہے جیسے روح میں انسانی زندگی کا راز مضمر ہے۔\n(2) کتاب سے مراد قرآن ہے، یعنی نبوت سے پہلے قرآن کا بھی کوئی علم آپ کو نہیں تھا اور اسی طرح ایمان کی ان تفصیلات سے بھی بے خبر تھے جو شریعت میں مطلوب ہیں۔\n(3) یعنی قرآن کو نور بنایا، اس کے ذریعے سے اپنے بندوں میں سے ہم جسے چاہتے ہیں، ہدایت سے نواز دیتے ہیں۔ مطلب یہ ہے کہ قرآن سے ہدایت و رہنمائی انہی کو ملتی ہے جن میں ایمان کی طلب اور تڑپ ہوتی ہے وہ اسے طلب ہدایت کی نیت سے پڑھتے، سنتے اور غور وفکر کرتے ہیں، چنانچہ اللہ ان کی مدد فرماتا ہے اور ہدایت کا راستہ ان کے لیے ہموار کر دیتا ہے جس پر وہ چل پڑتے ہیں ورنہ جو اپنی آنکھوں کو ہی بند کرلیں، کانوں میں ڈاٹ لگالیں اور عقل و فہم کو ہی بروئے کار نہ لائیں تو انہیں ہدایت کیوں کر نصیب ہوسکتی ہے، جیسے فرمایا۔ «قُلْ هُوَ لِلَّذِينَ آمَنُوا هُدًى وَشِفَاءٌ وَالَّذِينَ لا يُؤْمِنُونَ فِي آذَانِهِمْ وَقْرٌ وَهُوَ عَلَيْهِمْ عَمًى أُولَئِكَ يُنَادَوْنَ مِنْ مَكَانٍ بَعِيدٍ» (سورۃ حمٰ السجدۃ: 44)","lang":"ur","meta":{"transliteration":"wakadhālika awḥaynā ilayka rūḥan min amrinā mā kunta tadrī mā al-kitābu walā al-īmānu walākin jaʿalnāhu nūran nahdī bihi man nashāu min ʿibādinā wa-innaka latahdī ilā ṣirāṭin mus'taqīmin ","translations":["And thus","We have revealed","to you","an inspiration","by","Our Command","Not","(did) you","know","what","the Book (is)","and not","the faith","But","We have made it","a light","We guide","with it","whom","We will","of","Our slaves","And indeed, you","surely guide","to","(the) Path","Straight","(52)"],"transliterationArr":["wakadhālika","awḥaynā","ilayka","rūḥan","min","amrinā","mā","kunta","tadrī","mā","al-kitābu","walā","al-īmānu","walākin","jaʿalnāhu","nūran","nahdī","bihi","man","nashāu","min","ʿibādinā","wa-innaka","latahdī","ilā","ṣirāṭin","mus'taqīmin",null],"verseTiming":[[1,0,1430],[2,1430,4160],[3,4160,4990],[4,4990,5660],[5,5660,7130],[6,7130,8310],[7,8310,9320],[8,9320,10780],[9,10780,11640],[10,11640,11800],[11,11800,12900],[12,12900,13330],[13,13330,14810],[14,14810,16450],[15,16450,17750],[16,17750,18440],[17,18440,20220],[18,20220,20870],[19,20870,21150],[20,21150,24060],[21,24060,24450],[22,24450,25920],[23,25920,28000],[24,28000,30580],[25,30580,31120],[26,31120,32160],[27,32160,36495]]}},{"name":"42:53","price":"اس اللہ کی راه کی(1) جس کی ملکیت میں آسمانوں اور زمین کی ہر چیز ہے۔ آگاه رہو سب کام اللہ تعالیٰ ہی کی طرف لوٹتے ہیں.(2)","arabic":"صِرَٰطِ ٱللَّهِ ٱلَّذِي لَهُۥ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۗ أَلَآ إِلَى ٱللَّهِ تَصِيرُ ٱلۡأُمُورُ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura"],"ayahNumber":4325,"juzNumber":25,"footnotes":"(1) یہ صراط مستقیم، اسلام ہے۔ اس کی اضافت اللہ نے اپنی طرف فرمائی ہے جس سے اس راستے کی عظمت وفخامت شان واضح ہوتی ہے اور اس کے واحد راہ نجات ہونے کی طرف اشارہ بھی۔\n(2) یعنی قیامت والے دن تمام معاملات کا فیصلہ اللہ ہی کے ہاتھ میں ہوگا، اس میں سخت وعید ہے، جو مجازات (جزا وسزا) کو مستلزم ہے۔","lang":"ur","meta":{"transliteration":"ṣirāṭi al-lahi alladhī lahu mā fī al-samāwāti wamā fī al-arḍi alā ilā al-lahi taṣīru al-umūru ","translations":["(The) path","(of) Allah","the One","to Whom","(belongs) whatever","(is) in","the heavens","and whatever","(is) in","the earth","Unquestionably","To","Allah","reach","all affairs","(53)"],"transliterationArr":["ṣirāṭi","al-lahi","alladhī","lahu","mā","fī","al-samāwāti","wamā","fī","al-arḍi","alā","ilā","al-lahi","taṣīru","al-umūru",null],"verseTiming":[[1,0,1160],[2,1160,1990],[3,1990,2870],[4,2870,3460],[5,3460,3880],[6,3880,4100],[7,4100,5680],[8,5680,6330],[9,6330,6590],[10,6590,8090],[11,8090,10509],[12,10509,10959],[13,10959,11969],[14,11969,12909],[15,12909,16664]]}}],"chapter":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura","Chapter Ash-Shura","Shura","Surah Shura","Chapter Shura","Ash Shura","Surah Ash Shura","Chapter Ash Shura","Surah 42","Chapter 42","The Consultation","الشُّورىٰ"],"version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."}}