{"data":[{"name":"46:1","price":"حٰم.(1)","arabic":"حمٓ","category":["46 (Al-Ahqaf)","Al-Ahqaf","Surah Al-Ahqaf"],"ayahNumber":4511,"juzNumber":26,"footnotes":"(1) یہ فَوَاتِحُ سُوَرٌ، ان متشابہات میں سے ہیں جن کا علم صرف اللہ کو ہے، اس لئے ان کے معانی ومطالب میں پڑنے کی ضرورت نہیں ہے۔ تاہم ان کے دو فائدے بعض مفسرین نے بیان کیے ہیں، جنہیں ہم سورۂ لقمان کے شروع میں بیان کر آئے ہیں۔","lang":"ur","meta":{"transliteration":"hha-meem ","translations":["Ha Meem","(1)"],"transliterationArr":["hha-meem",null],"verseTiming":[[1,0,4805]]}},{"name":"46:2","price":"اس کتاب کا اتارنا اللہ تعالیٰ غالب حکمت والے کی طرف سے ہے.","arabic":"تَنزِيلُ ٱلۡكِتَٰبِ مِنَ ٱللَّهِ ٱلۡعَزِيزِ ٱلۡحَكِيمِ","category":["46 (Al-Ahqaf)","Al-Ahqaf","Surah Al-Ahqaf"],"ayahNumber":4512,"juzNumber":26,"footnotes":"","lang":"ur","meta":{"transliteration":"tanzīlu al-kitābi mina al-lahi al-ʿazīzi al-ḥakīmi ","translations":["(The) revelation","(of) the Book","(is) from","Allah","the All-Mighty","the All-Wise","(2)"],"transliterationArr":["tanzīlu","al-kitābi","mina","al-lahi","al-ʿazīzi","al-ḥakīmi",null],"verseTiming":[[1,0,1900],[2,1900,2970],[3,2970,3380],[4,3380,4300],[5,4300,5500],[6,5500,8515]]}},{"name":"46:3","price":"ہم نے آسمانوں اور زمین اور ان دونوں کے درمیان کی تمام چیزوں کو بہترین تدبیر کے ساتھ ہی ایک مدت معین کے لئے پیدا کیا ہے(1) ، اور کافر لوگ جس چیز سے ڈرائے جاتے ہیں منھ موڑ لیتے ہیں.(2)","arabic":"مَا خَلَقۡنَا ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ وَمَا بَيۡنَهُمَآ إِلَّا بِٱلۡحَقِّ وَأَجَلٖ مُّسَمّٗىۚ وَٱلَّذِينَ كَفَرُواْ عَمَّآ أُنذِرُواْ مُعۡرِضُونَ","category":["46 (Al-Ahqaf)","Al-Ahqaf","Surah Al-Ahqaf"],"ayahNumber":4513,"juzNumber":26,"footnotes":"(1) یعنی آسمان وزمین کی پیدائش کا ایک خاص مقصد بھی ہے اور وہ ہے انسانوں کی آزمائش۔ دوسرا، اس کے لئے ایک وقت بھی مقرر ہے۔ جب وہ وقت موعود آجائے گا تو آسمان وزمین کا یہ موجودہ نظام سارا بکھر جائے گا۔ نہ آسمان، یہ آسمان ہوگا، نہ زمین، یہ زمین ہوگی۔«يَوْمَ تُبَدَّلُ الأَرْضُ غَيْرَ الأَرْضِ وَالسَّمَاوَاتُ» (سورة إبراهيم: 48)\n(2) یعنی عدم ایمان کی صورت میں بعث، حساب اور جزا سے جو انہیں ڈرایا جاتا ہے، وہ اس کی پرواہی نہیں کرتے، اس پر ایمان لاتے ہیں، نہ عذاب اخروی سے بچنے کی تیاری کرتے ہیں۔","lang":"ur","meta":{"transliteration":"mā khalaqnā al-samāwāti wal-arḍa wamā baynahumā illā bil-ḥaqi wa-ajalin musamman wa-alladhīna kafarū ʿammā undhirū muʿ'riḍūna ","translations":["Not","We created","the heavens","and the earth","and what","(is) between both of them","except","in truth","and (for) a term","appointed","But those who","disbelieve","from what","they are warned","(are) turning away","(3)"],"transliterationArr":["mā","khalaqnā","al-samāwāti","wal-arḍa","wamā","baynahumā","illā","bil-ḥaqi","wa-ajalin","musamman","wa-alladhīna","kafarū","ʿammā","undhirū","muʿ'riḍūna",null],"verseTiming":[[1,0,470],[2,470,1360],[3,1360,2980],[4,2980,4210],[5,4210,4530],[6,4530,7420],[7,7420,8270],[8,8270,9420],[9,9420,10260],[10,10260,13250],[11,13250,14960],[12,14960,15890],[13,15890,19290],[14,19290,21070],[15,21070,22615]]}},{"name":"46:4","price":"آپ کہہ دیجئے! بھلا دیکھو تو جنہیں تم اللہ کے سوا پکارتے ہو مجھے بھی تو دکھاؤ کہ انہوں نے زمین کا کون سا ٹکڑا بنایا ہے یا آسمانوں میں ان کا کون سا حصہ ہے(1) ؟ اگر تم سچے ہو تو اس سے پہلے ہی کی کوئی کتاب یا کوئی علم ہی جو نقل کیا جاتا ہو، میرے پاس ﻻؤ.(2)","arabic":"قُلۡ أَرَءَيۡتُم مَّا تَدۡعُونَ مِن دُونِ ٱللَّهِ أَرُونِي مَاذَا خَلَقُواْ مِنَ ٱلۡأَرۡضِ أَمۡ لَهُمۡ شِرۡكٞ فِي ٱلسَّمَٰوَٰتِۖ ٱئۡتُونِي بِكِتَٰبٖ مِّن قَبۡلِ هَٰذَآ أَوۡ أَثَٰرَةٖ مِّنۡ عِلۡمٍ إِن كُنتُمۡ صَٰدِقِينَ","category":["46 (Al-Ahqaf)","Al-Ahqaf","Surah Al-Ahqaf"],"ayahNumber":4514,"juzNumber":26,"footnotes":"(1) أَرَأَيْتُمْ بمعنی أَخْبِرُونِي یا أَرُونِي یعنی اللہ کو چھوڑ کر جن بتوں یا شخصیات کی تم عبادت کرتے ہو، مجھے بتلاؤ یا دکھلاؤ کہ انہوں نے زمین وآسمان کی پیدائش میں کیا حصہ لیا ہے؟ مطلب یہ ہے کہ جب آسمان وزمین کی پیدائش میں بھی ان کا کوئی حصہ نہیں ہے بلکہ مکمل طور پر ان سب کا خالق صرف ایک اللہ ہے تو پھر تم ان غیر حق معبودوں کو اللہ کی عبادت میں کیوں شریک کرتے ہو؟\n(2) یعنی کسی نبی پر نازل شدہ کتاب میں یا کسی منقول روایت میں یہ بات لکھی ہو تو وہ لاکر دکھاؤ تاکہ تمہاری صداقت واضح ہو سکے۔ بعض نے أَثَارَةٍ مِنْ عِلْمٍ کے معنی واضح علمی دلیل کے کئے ہیں، اس صورت میں کتاب سے نقلی دلیل اور أَثَارَةٍ مِنْ عِلْمٍ سے عقلی دلیل مراد ہوگی۔ یعنی کوئی عقلی اور نقلی دلیل پیش کرو۔ پہلے معنی اس کے اثر سے ماخوذ ہونے کی بنیاد پر روایت کے کیے گئے ہیں یا بَقِيَّةٍ مِنْ عِلْمٍ پہلے انبیاء علیہم السلام کی تعلیمات کا باقی ماندہ حصہ جو قابل اعتماد ذریعے سے نقل ہوتا آیا ہو، اس میں یہ بات ہو۔","lang":"ur","meta":{"transliteration":"qul ara-aytum mā tadʿūna min dūni al-lahi arūnī mādhā khalaqū mina al-arḍi am lahum shir'kun fī al-samāwāti i'tūnī bikitābin min qabli hādhā aw athāratin min ʿil'min in kuntum ṣādiqīna ","translations":["Say","Do you see","what","you call","besides","besides","Allah","Show me","what","they have created","of","the earth","or","for them","(is) any share","in","the heavens","Bring me","a book","from","before","this","or","a trace","of","knowledge","if","you are","truthful","(4)"],"transliterationArr":["qul","ara-aytum","mā","tadʿūna","min","dūni","al-lahi","arūnī","mādhā","khalaqū","mina","al-arḍi","am","lahum","shir'kun","fī","al-samāwāti","i'tūnī","bikitābin","min","qabli","hādhā","aw","athāratin","min","ʿil'min","in","kuntum","ṣādiqīna",null],"verseTiming":[[1,0,530],[2,530,2230],[3,2230,2860],[4,2860,4020],[5,4020,4940],[6,4940,5650],[7,5650,6510],[8,6510,7590],[9,7590,8430],[10,8430,9380],[11,9380,9770],[12,9770,10750],[13,10750,11090],[14,11090,11760],[15,11760,13320],[16,13320,13560],[17,13560,16680],[18,16680,17120],[19,17120,18030],[20,18030,19180],[21,19180,21140],[22,21140,21790],[23,21790,23830],[24,23830,24290],[25,24290,25490],[26,25490,26710],[27,26710,27640],[28,27640,28990],[29,28990,30580],[30,30580,33955]]}},{"name":"46:5","price":"اور اس سے بڑھ کر گمراه اور کون ہوگا؟ جو اللہ کے سوا ایسوں کو پکارتا ہے جو قیامت تک اس کی دعا قبول نہ کر سکیں بلکہ ان کے پکارنے سے محض بےخبر ہوں.(1)","arabic":"وَمَنۡ أَضَلُّ مِمَّن يَدۡعُواْ مِن دُونِ ٱللَّهِ مَن لَّا يَسۡتَجِيبُ لَهُۥٓ إِلَىٰ يَوۡمِ ٱلۡقِيَٰمَةِ وَهُمۡ عَن دُعَآئِهِمۡ غَٰفِلُونَ","category":["46 (Al-Ahqaf)","Al-Ahqaf","Surah Al-Ahqaf"],"ayahNumber":4515,"juzNumber":26,"footnotes":"(1) یعنی یہی سب سے بڑے گمراہ ہیں جو پتھر کی مورتیوں کو یا فوت شدہ اشخاص کو مدد کے لئے پکارﺗے ہیں جو قیامت تک جواب دینے سے قاصر ہیں۔ اور قاصر ہی نہیں، بلکہ بالکل بےخبر ہیں۔","lang":"ur","meta":{"transliteration":"waman aḍallu mimman yadʿū min dūni al-lahi man lā yastajību lahu ilā yawmi al-qiyāmati wahum ʿan duʿāihim ghāfilūna ","translations":["And who","(is) more astray","than (he) who","calls","besides","besides","Allah","who","will not respond","will not respond","to him","until","(the) Day","(of) Resurrection","and they","of","their calls","(are) unaware","(5)"],"transliterationArr":["waman","aḍallu","mimman","yadʿū","min","dūni","al-lahi","man","lā","yastajību","lahu","ilā","yawmi","al-qiyāmati","wahum","ʿan","duʿāihim","ghāfilūna",null],"verseTiming":[[1,0,840],[2,840,1730],[3,1730,2990],[4,2990,4170],[5,4170,4740],[6,4740,5880],[7,5880,6490],[8,6490,7400],[9,7400,7630],[10,7630,8360],[11,8360,9570],[12,9570,11650],[13,11650,12270],[14,12270,12940],[15,12940,14400],[16,14400,14940],[17,14940,15980],[18,15980,18590],[19,18590,21645]]}},{"name":"46:6","price":"اور جب لوگوں کو جمع کیا جائے گا تو یہ ان کے دشمن ہو جائیں گے اور ان کی پرستش سے صاف انکار کر جائیں گے.(1)","arabic":"وَإِذَا حُشِرَ ٱلنَّاسُ كَانُواْ لَهُمۡ أَعۡدَآءٗ وَكَانُواْ بِعِبَادَتِهِمۡ كَٰفِرِينَ","category":["46 (Al-Ahqaf)","Al-Ahqaf","Surah Al-Ahqaf"],"ayahNumber":4516,"juzNumber":26,"footnotes":"(1) یہ مضمون قرآن کریم میں متعدد مقامات پر بیان کیا گیا ہے۔ مثلاً سورۂ یونس: 29۔ سورۂ مریم: 81۔ 82۔ سورۂ عنکبوت: ،25 وغیرھا من الآیات۔ دنیا میں ان معبودوں کی دو قسمیں ہیں۔ ایک تو غیر ذی روح جمادات ونباتات اور مظاہر قدرت (سورج، آگ وغیرہ) ہیں، اللہ تعالیٰ ان کو زندگی اور قوت گویائی عطا فرمائے گا، اور یہ چیزیں بول کر بتلائیں گی کہ ہمیں قطعاً اس بات کا علم نہیں ہے کہ یہ ہماری عبادت کرتے اور ہمیں تیری خدائی میں شریک گردانتے تھے۔ بعض کہتے ہیں کہ زبان قال سے نہیں، زبان حال سے وہ اپنے جذبات کا اظہار کریں گی۔ واللہ اعلم۔ معبودوں کی دوسری قسم وہ ہے جو انبیا علیہم السلام، ملائکہ اور صالحین میں سے ہیں۔ جیسے عیسیٰ، حضرت عزیر علیہما السلام اور دیگر عباد اللہ الصالحین ہیں، یہ اللہ کی بارگاہ میں اسی طرح کا جواب دیں گے جیسے حضرت عیسیٰ (عليه السلام) کا جواب قرآن کریم میں منقول ہے۔ علاوہ ازیں شیطان بھی انکار کریں گے۔ جیسے قرآن میں ان کا قول نقل کیا گیا ہے۔ «تَبَرَّأْنَا إِلَيْكَ مَا كَانُوا إِيَّانَا يَعْبُدُونَ» (القصص: 63) ”ہم تیرے سامنے (اپنے عابدین سے) اظہار براء ت کرتے ہیں، یہ ہماری عبادت نہیں کرتے تھے“۔","lang":"ur","meta":{"transliteration":"wa-idhā ḥushira al-nāsu kānū lahum aʿdāan wakānū biʿibādatihim kāfirīna ","translations":["And when","are gathered","the people","they will be","for them","enemies","and they will be","of their worship","deniers","(6)"],"transliterationArr":["wa-idhā","ḥushira","al-nāsu","kānū","lahum","aʿdāan","wakānū","biʿibādatihim","kāfirīna",null],"verseTiming":[[1,0,1010],[2,1010,1670],[3,1670,3280],[4,3280,4200],[5,4200,4900],[6,4900,8259],[7,8259,9309],[8,9309,11089],[9,11089,14424]]}},{"name":"46:7","price":"اور انہیں جب ہماری واضح آیتیں پڑھ کر سنائی جاتی ہیں تو منکر لوگ سچی بات کو جب کہ ان کے پاس آچکی، کہہ دیتے ہیں کہ یہ تو صریح جادو ہے.","arabic":"وَإِذَا تُتۡلَىٰ عَلَيۡهِمۡ ءَايَٰتُنَا بَيِّنَٰتٖ قَالَ ٱلَّذِينَ كَفَرُواْ لِلۡحَقِّ لَمَّا جَآءَهُمۡ هَٰذَا سِحۡرٞ مُّبِينٌ","category":["46 (Al-Ahqaf)","Al-Ahqaf","Surah Al-Ahqaf"],"ayahNumber":4517,"juzNumber":26,"footnotes":"","lang":"ur","meta":{"transliteration":"wa-idhā tut'lā ʿalayhim āyātunā bayyinātin qāla alladhīna kafarū lil'ḥaqqi lammā jāahum hādhā siḥ'run mubīnun ","translations":["And when","are recited","to them","Our Verses","clear","say","those who","disbelieve","of the truth","when","it comes to them","This","(is) a magic","clear","(7)"],"transliterationArr":["wa-idhā","tut'lā","ʿalayhim","āyātunā","bayyinātin","qāla","alladhīna","kafarū","lil'ḥaqqi","lammā","jāahum","hādhā","siḥ'run","mubīnun",null],"verseTiming":[[1,0,910],[2,910,1800],[3,1800,2930],[4,2930,4520],[5,4520,5910],[6,5910,6820],[7,6820,7440],[8,7440,8610],[9,8610,9590],[10,9590,10730],[11,10730,11860],[12,11860,12830],[13,12830,13910],[14,13910,15360],[15,15360,18050],[16,18050,19010],[17,19010,19690],[18,19690,23875]]}},{"name":"46:8","price":"کیا وه کہتے ہیں کہ اسے تو اس نے خود گھڑ لیا(1) ہے آپ کہہ دیجئے! کہ اگر میں ہی اسے بنا ﻻیا ہوں تو تم میرے لئے اللہ کی طرف سے کسی چیز کا اختیار نہیں رکھتے(2)، تم اس (قرآن) کے بارے میں جو کچھ کہہ سن رہے ہو اسے اللہ خوب جانتا ہے(3)، میرے اور تمہارے درمیان گواہی کے لئے وہی کافی ہے(4)، اور وه بخشنے واﻻ مہربان ہے.(5)","arabic":"أَمۡ يَقُولُونَ ٱفۡتَرَىٰهُۖ قُلۡ إِنِ ٱفۡتَرَيۡتُهُۥ فَلَا تَمۡلِكُونَ لِي مِنَ ٱللَّهِ شَيۡـًٔاۖ هُوَ أَعۡلَمُ بِمَا تُفِيضُونَ فِيهِۚ كَفَىٰ بِهِۦ شَهِيدَۢا بَيۡنِي وَبَيۡنَكُمۡۖ وَهُوَ ٱلۡغَفُورُ ٱلرَّحِيمُ","category":["46 (Al-Ahqaf)","Al-Ahqaf","Surah Al-Ahqaf"],"ayahNumber":4518,"juzNumber":26,"footnotes":"(1) اس حق سے مراد، جو ان کےپاس آیا، قرآن کریم ہے، اس کے اعجاز اور قوت تاثیر کو دیکھ کر وہ اسے جادو سے تعبیر کرتے، پھر اس سے بھی انحراف کرکے یا اس سے بھی بات نہ بنتی تو کہتے کہ یہ تو محمد ( (صلى الله عليه وسلم) ) کااپنا گھڑا ہوا کلام ہے۔\n(2) یعنی اگر تمہاری یہ بات صحیح ہو کہ میں اللہ کا بنایا ہوا رسول نہیں ہوں اور یہ کلام بھی میرا اپنا گھڑا ہوا ہے، پھر تو یقیناً میں بڑا مجرم ہوں، اللہ تعالیٰ اتنے بڑے جھوٹ پر مجھے پکڑے بغیر تو نہیں چھوڑے گا۔ اور اگر ایسی کوئی گرفت ہوئی تو پھر سمجھ لینا کہ میں جھوٹا ہوں اور میری کوئی مدد بھی مت کرنا۔ بلکہ ایسی حالت میں مجھے مواخذہ الٰہی سے بچانے کا تمہیں کوئی اختیار ہی نہیں ہوگا۔ اسی مضمون کو دوسرے مقام پر اس طرح بیان فرمایا گیا ہے «وَلَوْ تَقَوَّلَ عَلَيْنَا بَعْضَ الأَقَاوِيلِ ، لأَخَذْنَا مِنْهُ بِالْيَمِينِ ، ثُمَّ لَقَطَعْنَا مِنْهُ الْوَتِينَ ،فَمَا مِنْكُمْ مِنْ أَحَدٍ عَنْهُ حَاجِزِينَ» (الحاقة ،44۔ 47)۔\n(3) یعنی جس جس انداز سے بھی تم قرآن کی تکذیب کرتے ہو، کبھی اسے جادو، کبھی کہانت اور کبھی گھڑا ہوا کہتے ہو، اللہ اسے خوب جانتا ہے۔ یعنی وہی تمہاری ان مزموم حرکتوں کا تمہیں بدلہ دے گا۔\n(4) وہ اس بات کی گواہی کے لئے کافی ہے کہ یہ قرآن اسی کی طرف سے نازل ہوا ہے اور وہی تمہاری تکذیب ومخالفت کا بھی گواہ ہے۔ اس میں بھی ان کے لئے سخت وعید ہے۔\n(5) اس کے لئے جو توبہ کرلے، ایمان لے آئے اور قرآن کو اللہ تعالیٰ کا سچا کلام مان لے۔ مطلب ہے کہ ابھی بھی وقت ہے کہ توبہ کرکے اللہ کی مغفرت ورحمت کے مستحق بن جاؤ۔","lang":"ur","meta":{"transliteration":"am yaqūlūna if'tarāhu qul ini if'taraytuhu falā tamlikūna lī mina al-lahi shayan huwa aʿlamu bimā tufīḍūna fīhi kafā bihi shahīdan baynī wabaynakum wahuwa al-ghafūru al-raḥīmu ","translations":["Or","they say","He has invented it","Say","If","I have invented it","then not","you have power","for me","against","Allah","anything","He","knows best","of what","you utter","concerning it","Sufficient is He","Sufficient is He","(as) a Witness","between me","and between you","and He","(is) the Oft-Forgiving","the Most Merciful","(8)"],"transliterationArr":["am","yaqūlūna","if'tarāhu","qul","ini","if'taraytuhu","falā","tamlikūna","lī","mina","al-lahi","shayan","huwa","aʿlamu","bimā","tufīḍūna","fīhi","kafā","bihi","shahīdan","baynī","wabaynakum","wahuwa","al-ghafūru","al-raḥīmu",null],"verseTiming":[[1,0,500],[2,500,1800],[3,1800,4330],[4,4330,5409],[5,5409,5829],[6,5829,7319],[7,7319,7989],[8,7989,9359],[9,9359,9819],[10,9819,10179],[11,10179,11139],[12,11139,12219],[13,12219,13229],[14,13229,14209],[15,14209,14819],[16,14819,16209],[17,16209,18789],[18,18789,19419],[19,19419,20059],[20,20059,21989],[21,21989,22859],[22,22859,24769],[23,24769,25379],[24,25379,26549],[25,26549,29794]]}},{"name":"46:9","price":"آپ کہہ دیجئے! کہ میں کوئی بالکل انوکھا پیغمبر تو نہیں(1) نہ مجھے یہ معلوم ہے کہ میرے ساتھ اور تمہارے ساتھ کیا کیا جائے گا(2)۔ میں تو صرف اسی کی پیروی کرتا ہوں جو میری طرف وحی بھیجی جاتی ہے اور میں تو صرف علیاﻻعلان آگاه کر دینے واﻻ ہوں.","arabic":"قُلۡ مَا كُنتُ بِدۡعٗا مِّنَ ٱلرُّسُلِ وَمَآ أَدۡرِي مَا يُفۡعَلُ بِي وَلَا بِكُمۡۖ إِنۡ أَتَّبِعُ إِلَّا مَا يُوحَىٰٓ إِلَيَّ وَمَآ أَنَا۠ إِلَّا نَذِيرٞ مُّبِينٞ","category":["46 (Al-Ahqaf)","Al-Ahqaf","Surah Al-Ahqaf"],"ayahNumber":4519,"juzNumber":26,"footnotes":"(1) یعنی پہلا اور انوکھا رسول تو نہیں ہوں، بلکہ مجھ سے پہلے بھی متعدد رسول آچکے ہیں۔\n(2) یعنی دنیا میں۔ میں مکے میں ہی رہوں گا یا یہاں سے نکلنے پر مجھے مجبور ہونا پڑے گا۔ مجھے موت طبعی آئے گی یا تمہارے ہاتھوں میرا قتل ہوگا؟ تم جلد ہی سزا سے دوچار ہو گے یا لمبی مہلت تمہیں دی جائے گی؟ ان تمام باتوں کا علم صرف اللہ کو ہے، مجھے نہیں معلوم کہ میرے ساتھ یا تمہارے ساتھ کل کیا ہوگا؟ تاہم آخرت کے بارے میں یقینی علم ہے کہ اہل ایمان جنت میں اور کافر جہنم میں جائیں گے۔ اور حدیث میں جو آتا ہے کہ نبی (صلى الله عليه وسلم) نے بعض صحابہ (رضي الله عنهم) کی وفات پر، جب ان کے بارے میں حسن ظن کا اظہار کیا گیا، تو فرمایا ”وَاللهِ مَا أَدْرِي -وَأَنَا رَسُولُ اللهِ- مَا يُفْعَلُ بِي وَلا بِكُمْ“ (صحيح بخاري، مناقب الأنصار ، باب مقدم النبي وأصحابه إلى المدينة) اللہ کی قسم، مجھے اللہ کا رسول ہونے کے باوجود علم نہیں کہ قیامت کو میرے اور تمہارے ساتھ کیا کیا جائے گا؟ اس سے کسی ایک معین شخص کے قطعی انجام کے علم کی نفی ہے۔ الا یہ کہ ان کی بابت بھی نص موجود ہو۔ جیسے عشرہ مبشرہ اور اصحاب بدر وغیرہ۔","lang":"ur","meta":{"transliteration":"qul mā kuntu bid'ʿan mina al-rusuli wamā adrī mā yuf'ʿalu bī walā bikum in attabiʿu illā mā yūḥā ilayya wamā anā illā nadhīrun mubīnun ","translations":["Say","Not","I am","a new (one)","among","the Messengers","and not","I know","what","will be done","with me","and not","with you","Not","I follow","but","what","is revealed","to me","and not","I am","but","a warner","clear","(9)"],"transliterationArr":["qul","mā","kuntu","bid'ʿan","mina","al-rusuli","wamā","adrī","mā","yuf'ʿalu","bī","walā","bikum","in","attabiʿu","illā","mā","yūḥā","ilayya","wamā","anā","illā","nadhīrun","mubīnun",null],"verseTiming":[[1,0,490],[2,490,890],[3,890,2360],[4,2360,3060],[5,3060,4380],[6,4380,5300],[7,5300,7070],[8,7070,7990],[9,7990,8410],[10,8410,9260],[11,9260,9780],[12,9780,10410],[13,10410,11860],[14,11860,12240],[15,12240,13290],[16,13290,14200],[17,14200,14630],[18,14630,17070],[19,17070,17970],[20,17970,19880],[21,19880,20340],[22,20340,21210],[23,21210,22130],[24,22130,26155]]}},{"name":"46:10","price":"آپ کہہ دیجئے! اگر یہ (قرآن) اللہ ہی کی طرف سے ہو اور تم نے اسے نہ مانا ہو اور بنی اسرائیل کا ایک گواه اس جیسی کی گواہی بھی دے چکا ہو اور وه ایمان بھی ﻻچکا ہو اور تم نے سرکشی کی ہو(1) ، تو بیشک اللہ تعالیٰ ﻇالموں کو راه نہیں دکھاتا.","arabic":"قُلۡ أَرَءَيۡتُمۡ إِن كَانَ مِنۡ عِندِ ٱللَّهِ وَكَفَرۡتُم بِهِۦ وَشَهِدَ شَاهِدٞ مِّنۢ بَنِيٓ إِسۡرَٰٓءِيلَ عَلَىٰ مِثۡلِهِۦ فَـَٔامَنَ وَٱسۡتَكۡبَرۡتُمۡۚ إِنَّ ٱللَّهَ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلظَّٰلِمِينَ","category":["46 (Al-Ahqaf)","Al-Ahqaf","Surah Al-Ahqaf"],"ayahNumber":4520,"juzNumber":26,"footnotes":"(1) اس شاہد بنی اسرائیل سے کون مراد ہے؟ بعض کہتے ہیں کہ یہ بطور جنس کے ہے۔ بنی اسرائیل میں سے ہر ایمان لانے والا اس کا مصداق ہے۔ بعض کہتے ہیں کہ مکے میں رہنے والا کوئی بنی اسرائیلی مراد ہے، کیونکہ یہ سورت مکی ہے۔ بعض کے نزدیک اس سے مراد عبداللہ بن سلام ہیں اور وہ اس آیت کو مدنی قرار دیتے ہیں۔ صحیحین کی روایت سے بھی اس کی تائید ہوتی ہے (صحيح بخاري، مناقب الأنصار ، باب مناقب عبد الله بن سلام - مسلم ، فضائل الصحابة) اسی لئے امام شوکانی نے اسی رائے کو ترجیح دی ہے۔ عَلَى مِثْلِهِ(اسی جیسی کتاب کی گواہی) کا مطلب ہے تورات کی گواہی جو قرآن کے منزل من اللہ ہونے کو مستلزم ہے۔ کیونکہ قرآن بھی توحید ومعاد کے اثبات میں تورات ہی کی مثل ہے۔ مطلب یہ ہے کہ اہل کتاب کی گواہی اور ان کے ایمان لانے کے بعد اس کے منزل من اللہ ہونے میں کوئی شک نہیں رہ جاتا ہے۔ اس لئے اس کے بعد تمہارے انکار واستکبار کا بھی کوئی جواز نہیں ہے۔ تمہیں اپنے اس رویے کا انجام سوچ لینا چاہئے۔","lang":"ur","meta":{"transliteration":"qul ara-aytum in kāna min ʿindi al-lahi wakafartum bihi washahida shāhidun min banī is'rāīla ʿalā mith'lihi faāmana wa-is'takbartum inna al-laha lā yahdī al-qawma al-ẓālimīna ","translations":["Say","Do you see","if","it is","from Allah","from Allah","from Allah","and you disbelieve","in it","and testifies","a witness","from","(the) Children of Israel","(the) Children of Israel","to","(the) like thereof","then he believed","while you are arrogant","Indeed","Allah","(does) not","guide","the people","the wrongdoers","(10)"],"transliterationArr":["qul","ara-aytum","in","kāna","min","ʿindi","al-lahi","wakafartum","bihi","washahida","shāhidun","min","banī","is'rāīla","ʿalā","mith'lihi","faāmana","wa-is'takbartum","inna","al-laha","lā","yahdī","al-qawma","al-ẓālimīna",null],"verseTiming":[[1,0,530],[2,530,1920],[3,1920,2990],[4,2990,3730],[5,3730,4100],[6,4100,5460],[7,5460,6310],[8,6310,7770],[9,7770,8460],[10,8460,9020],[11,9020,9900],[12,9900,10830],[13,10830,12050],[14,12050,12960],[15,12960,14950],[16,14950,17930],[17,17930,18610],[18,18610,19650],[19,19650,20860],[20,20860,23220],[21,23220,24550],[22,24550,25470],[23,25470,25970],[24,25970,26690],[25,26690,27550],[26,27550,31565]]}},{"name":"46:11","price":"اور کافروں نے ایمان داروں کی نسبت کہا کہ اگر یہ (دین) بہتر ہوتا تو یہ لوگ اس کی طرف ہم سے سبقت کرنے نہ پاتے، اور چونکہ انہوں نے قرآن سے ہدایت نہیں پائی پس یہ کہہ دیں گے کہ قدیمی جھوٹ ہے.(1)","arabic":"وَقَالَ ٱلَّذِينَ كَفَرُواْ لِلَّذِينَ ءَامَنُواْ لَوۡ كَانَ خَيۡرٗا مَّا سَبَقُونَآ إِلَيۡهِۚ وَإِذۡ لَمۡ يَهۡتَدُواْ بِهِۦ فَسَيَقُولُونَ هَٰذَآ إِفۡكٞ قَدِيمٞ","category":["46 (Al-Ahqaf)","Al-Ahqaf","Surah Al-Ahqaf"],"ayahNumber":4521,"juzNumber":26,"footnotes":"(1) کفار مکہ، حضرت بلال، عمار، صہیب اور خباب (رضي الله عنهم) جیسے مسلمانوں کو، جو غریب وقلاش قسم کے لوگ تھے، لیکن اسلام قبول کرنے سے انہیں سابقیت کا شرف حاصل ہوا، دیکھ کر کہتے کہ اگر اس دین میں بہترین ہوتی تو ہم جیسے ذی عزت وذی مرتبہ لوگ سب سے پہلے اسے قبول کرتے نہ کہ یہ لوگ پہلے ایمان لاتے۔ یعنی اپنے طور پر انہوں نے اپنی بابت یہ فرض کر لیا کہ اللہ کے ہاں ان کا بڑا مقام ہے، اس لئے اگر یہ دین بھی اللہ کی طرف سے ہوتا تو اللہ تعالیٰ ہمیں اس کے قبول کرنے میں پیچھے نہ چھوڑتا، اور جب ہم نے اسے نہیں اپنایا تو اس کا مطلب یہ ہے کہ یہ ایک پرانا جھوٹ ہے۔ یعنی قرآن کو انہوں نے پرانا جھوٹ قرار دیا ہے۔ جیسے وہ اسے أَسَاِطِيرُ الأوَّلِينَ بھی کہتے تھے، حالانکہ دنیوی مال ودولت میں ممتاز ہونا، عند اللہ مقبولیت کی دلیل نہیں۔ ”جیسے ان کو مغالطہٰ ہوا یا شیطان نے مغالطے میں ڈالا“ عند اللہ مقبولیت کے لئے تو ایمان واخلاص کی ضرورت ہے۔ اور اس دولت ایمان واخلاص سے وہ جس کو چاہتا ہے، نوازتا ہے، جیسے وہ مال ودولت آزمائش کے طور پر جس کو چاہتا ہے، دیتا ہے۔","lang":"ur","meta":{"transliteration":"waqāla alladhīna kafarū lilladhīna āmanū law kāna khayran mā sabaqūnā ilayhi wa-idh lam yahtadū bihi fasayaqūlūna hādhā if'kun qadīmun ","translations":["And say","those who","disbelieve","of those who","believe","If","it had been","good","not","they (would) have preceded us","to it","And when","not","they (are) guided","by it","they say","This","(is) a lie","ancient","(11)"],"transliterationArr":["waqāla","alladhīna","kafarū","lilladhīna","āmanū","law","kāna","khayran","mā","sabaqūnā","ilayhi","wa-idh","lam","yahtadū","bihi","fasayaqūlūna","hādhā","if'kun","qadīmun",null],"verseTiming":[[1,0,910],[2,910,1970],[3,1970,2950],[4,2950,4250],[5,4250,5410],[6,5410,5810],[7,5810,6470],[8,6470,7230],[9,7230,8510],[10,8510,10210],[11,10210,14010],[12,14010,14650],[13,14650,15060],[14,15060,16160],[15,16160,16860],[16,16860,19210],[17,19210,21070],[18,21070,22820],[19,22820,25535]]}},{"name":"46:12","price":"اور اس سے پہلے موسیٰ کی کتاب پیشوا اور رحمت تھی۔ اور یہ کتاب ہے تصدیق کرنے والی عربی زبان میں تاکہ ﻇالموں کو ڈرائے اور نیک کاروں کو بشارت ہو.","arabic":"وَمِن قَبۡلِهِۦ كِتَٰبُ مُوسَىٰٓ إِمَامٗا وَرَحۡمَةٗۚ وَهَٰذَا كِتَٰبٞ مُّصَدِّقٞ لِّسَانًا عَرَبِيّٗا لِّيُنذِرَ ٱلَّذِينَ ظَلَمُواْ وَبُشۡرَىٰ لِلۡمُحۡسِنِينَ","category":["46 (Al-Ahqaf)","Al-Ahqaf","Surah Al-Ahqaf"],"ayahNumber":4522,"juzNumber":26,"footnotes":"","lang":"ur","meta":{"transliteration":"wamin qablihi kitābu mūsā imāman waraḥmatan wahādhā kitābun muṣaddiqun lisānan ʿarabiyyan liyundhira alladhīna ẓalamū wabush'rā lil'muḥ'sinīna ","translations":["And before it","And before it","(was the) Scripture","(of) Musa","(as) a guide","and a mercy","And this","(is) a Book","confirming","(in) language","Arabic","to warn","those who","do wrong","and (as) glad tidings","for the good-doers","(12)"],"transliterationArr":["wamin","qablihi","kitābu","mūsā","imāman","waraḥmatan","wahādhā","kitābun","muṣaddiqun","lisānan","ʿarabiyyan","liyundhira","alladhīna","ẓalamū","wabush'rā","lil'muḥ'sinīna",null],"verseTiming":[[1,0,1580],[2,1580,2640],[3,2640,3480],[4,3480,5960],[5,5960,7900],[6,7900,9370],[7,9370,10450],[8,10450,11560],[9,11560,13220],[10,13220,14590],[11,14590,15880],[12,15880,17550],[13,17550,18660],[14,18660,19700],[15,19700,20700],[16,20700,24635]]}},{"name":"46:13","price":"بیشک جن لوگوں نے کہا کہ ہمارا رب اللہ ہے پھر اس پر جمے رہے تو ان پر نہ تو کوئی خوف ہوگا اور نہ غمگین ہوں گے.","arabic":"إِنَّ ٱلَّذِينَ قَالُواْ رَبُّنَا ٱللَّهُ ثُمَّ ٱسۡتَقَٰمُواْ فَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُونَ","category":["46 (Al-Ahqaf)","Al-Ahqaf","Surah Al-Ahqaf"],"ayahNumber":4523,"juzNumber":26,"footnotes":"","lang":"ur","meta":{"transliteration":"inna alladhīna qālū rabbunā al-lahu thumma is'taqāmū falā khawfun ʿalayhim walā hum yaḥzanūna ","translations":["Indeed","those who","say","Our Lord","(is) Allah","then","remain firm","then no","fear","on them","and not","they","will grieve","(13)"],"transliterationArr":["inna","alladhīna","qālū","rabbunā","al-lahu","thumma","is'taqāmū","falā","khawfun","ʿalayhim","walā","hum","yaḥzanūna",null],"verseTiming":[[1,0,1280],[2,1280,2450],[3,2450,3370],[4,3370,4170],[5,4170,5100],[6,5100,6670],[7,6670,8090],[8,8090,8710],[9,8710,9620],[10,9620,10780],[11,10780,11440],[12,11440,11860],[13,11860,15795]]}},{"name":"46:14","price":"یہ تو اہل جنت ہیں جو سدا اسی میں رہیں گے، ان اعمال کے بدلے جو وه کیا کرتے تھے.","arabic":"أُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلۡجَنَّةِ خَٰلِدِينَ فِيهَا جَزَآءَۢ بِمَا كَانُواْ يَعۡمَلُونَ","category":["46 (Al-Ahqaf)","Al-Ahqaf","Surah Al-Ahqaf"],"ayahNumber":4524,"juzNumber":26,"footnotes":"","lang":"ur","meta":{"transliteration":"ulāika aṣḥābu al-janati khālidīna fīhā jazāan bimā kānū yaʿmalūna ","translations":["Those","(are the) companions","(of) Paradise","abiding forever","therein","a reward","for what","they used to","do","(14)"],"transliterationArr":["ulāika","aṣḥābu","al-janati","khālidīna","fīhā","jazāan","bimā","kānū","yaʿmalūna",null],"verseTiming":[[1,0,2989],[2,2989,3999],[3,3999,5809],[4,5809,7139],[5,7139,8039],[6,8039,11589],[7,11589,12179],[8,12179,13239],[9,13239,17714]]}},{"name":"46:15","price":"اور ہم نے انسان کو اپنے ماں باپ کے ساتھ حسن سلوک کرنے کا حکم دیا ہے، اس کی ماں نے اسے تکلیف جھیل کر پیٹ میں رکھا اور تکلیف برداشت کرکے اسے جنا(1) ۔ اس کے حمل کا اور اس کے دودھ چھڑانے کا زمانہ تیس مہینے کا ہے(2)۔ یہاں تک کہ جب وه پختگی اور چالیس سال کی عمر کو پہنچا(3) تو کہنے لگا اے میرے پروردگار! مجھے توفیق دے(4) کہ میں تیری اس نعمت کا شکر بجا ﻻؤں جو تو نے مجھ پر اور میرے ماں باپ پر انعام کی ہے اور یہ کہ میں ایسے نیک عمل کروں جن سے تو خوش ہو جائے اور تو میری اوﻻد بھی صالح بنا، میں تیری طرف رجوع کرتا ہوں اور میں مسلمانوں میں سے ہوں.","arabic":"وَوَصَّيۡنَا ٱلۡإِنسَٰنَ بِوَٰلِدَيۡهِ إِحۡسَٰنًاۖ حَمَلَتۡهُ أُمُّهُۥ كُرۡهٗا وَوَضَعَتۡهُ كُرۡهٗاۖ وَحَمۡلُهُۥ وَفِصَٰلُهُۥ ثَلَٰثُونَ شَهۡرًاۚ حَتَّىٰٓ إِذَا بَلَغَ أَشُدَّهُۥ وَبَلَغَ أَرۡبَعِينَ سَنَةٗ قَالَ رَبِّ أَوۡزِعۡنِيٓ أَنۡ أَشۡكُرَ نِعۡمَتَكَ ٱلَّتِيٓ أَنۡعَمۡتَ عَلَيَّ وَعَلَىٰ وَٰلِدَيَّ وَأَنۡ أَعۡمَلَ صَٰلِحٗا تَرۡضَىٰهُ وَأَصۡلِحۡ لِي فِي ذُرِّيَّتِيٓۖ إِنِّي تُبۡتُ إِلَيۡكَ وَإِنِّي مِنَ ٱلۡمُسۡلِمِينَ","category":["46 (Al-Ahqaf)","Al-Ahqaf","Surah Al-Ahqaf"],"ayahNumber":4525,"juzNumber":26,"footnotes":"(1) اس مشقت وتکلیف کا ذکر، والدین کے ساتھ حسن سلوک کے حکم میں مزید تاکید کے لئے ہے۔ جس سے یہ بھی معلوم ہوتا ہے کہ ماں، اس حکم احسان میں، باپ سے مقدم ہے، کیونکہ نوماہ تک مسلسل حمل کی تکلیف اور پھر زچگی (وضح حمل) کی تکلیف، صرف تنہا ماں ہی اٹھاتی ہے، باپ کی اس میں شرکت نہیں، اسی لئے حدیث میں بھی ماں کے ساتھ حسن سلوک کو اولیت دی گئی ہے اور باپ کا درجہ اس کے بعد بتلایا گیا ہے۔ ایک صحابی (رضي الله عنه) نے نبی (صلى الله عليه وسلم) سے پوچھا میرے حسن سلوک کا سب سے زیادہ مستحق کون ہے؟ آپ (صلى الله عليه وسلم) نے فرمایا تمہاری ماں، اس نے پھر یہی پوچھا، آپ (صلى الله عليه وسلم) نے یہی جواب دیا، تیسری مرتبہ بھی یہی جواب دیا۔ چوتھی مرتبہ پوچھنے پر آپ (صلى الله عليه وسلم) نے فرمایا، پھر تمہارا باپ (صحيح مسلم، كتاب البر والصلة، باب أول)۔\n(2) فِصَالٌ کے معنی، دودھ چھڑانا ہیں۔ اس سے بعض صحابہ (رضي الله عنهم) نے استدلال کیا ہے کہ کم از کم مدت حمل چھ مہینے یعنی چھ مہینے کے بعد اگر کسی عورت کے ہاں بچہ پیدا ہو جائے تو وہ بچہ حلال ہی کا ہوگا، حرام کا نہیں۔ اس لئے کہ قرآن نے مدت رضاعت دو سال (24 مہینے) بتلائی ہے (سورۂ لقمان: 14، سورۂ بقرۃ: 233) اس حساب سے مدت حمل صرف چھ مہینے ہی باقی رہ جاتی ہے۔\n(3) کمال قدرت (أَشُدَّهُ) کے زمانے سے مراد جوانی ہے، بعض نے اسے 18 سال سے تعبیر کیا ہے، حتیٰ کہ پھر بڑھتے بڑھتے چالیس سال کی عمر کو پہنچ گیا۔ یہ عمر قوائے عقلی کے مکمل بلوغ کی عمر ہے۔ اسی لئے مفسرین کی رائے ہے کہ ہر نبی کو چالیس سال کے بعد ہی نبوت سے سرفراز کیا گیا (فتح القدیر)۔\n(4) أَوْزِعْنِي بمعنی أَلْهِمْنِي ہے ، مجھے توفیق دے، اس سے استدلال کرتے ہوئے علما نے کہا ہے کہ اس عمر کے بعد انسان کو یہ دعا کثرت سے پڑھتے رہنا چاہئے۔ یعنی رَبِّ أَوْزِعْنِي سے مِنَ الْمُسْلِمِينَ تک۔","lang":"ur","meta":{"transliteration":"wawaṣṣaynā al-insāna biwālidayhi iḥ'sānan ḥamalathu ummuhu kur'han wawaḍaʿathu kur'han waḥamluhu wafiṣāluhu thalāthūna shahran ḥattā idhā balagha ashuddahu wabalagha arbaʿīna sanatan qāla rabbi awziʿ'nī an ashkura niʿ'mataka allatī anʿamta ʿalayya waʿalā wālidayya wa-an aʿmala ṣāliḥan tarḍāhu wa-aṣliḥ lī fī dhurriyyatī innī tub'tu ilayka wa-innī mina al-mus'limīna ","translations":["And We have enjoined","(on) man","to his parents","kindness","Carried him","his mother","(with) hardship","and gave birth to him","(with) hardship","And (the) bearing of him","and (the) weaning of him","(is) thirty","month(s)","until","when","he reaches","his maturity","and reaches","forty","year(s)","he says","My Lord","grant me (the) power","that","I may be grateful","(for) Your favor","which","You have bestowed","upon me","and upon","my parents","and that","I do","righteous (deeds)","which please You","and make righteous","for me","among","my offspring","indeed","I turn","to You","and indeed, I am","of","those who submit","(15)"],"transliterationArr":["wawaṣṣaynā","al-insāna","biwālidayhi","iḥ'sānan","ḥamalathu","ummuhu","kur'han","wawaḍaʿathu","kur'han","waḥamluhu","wafiṣāluhu","thalāthūna","shahran","ḥattā","idhā","balagha","ashuddahu","wabalagha","arbaʿīna","sanatan","qāla","rabbi","awziʿ'nī","an","ashkura","niʿ'mataka","allatī","anʿamta","ʿalayya","waʿalā","wālidayya","wa-an","aʿmala","ṣāliḥan","tarḍāhu","wa-aṣliḥ","lī","fī","dhurriyyatī","innī","tub'tu","ilayka","wa-innī","mina","al-mus'limīna",null],"verseTiming":[[1,0,1330],[2,1330,3520],[3,3520,5130],[4,5130,6600],[5,6600,8260],[6,8260,10030],[7,10030,11110],[8,11110,13010],[9,13010,14130],[10,14130,16070],[11,16070,17580],[12,17580,18970],[13,18970,20780],[14,20780,23360],[15,23360,24040],[16,24040,24780],[17,24780,26150],[18,26150,27090],[19,27090,28320],[20,28320,30090],[21,30090,30820],[22,30820,31480],[23,31480,33460],[24,33460,34190],[25,34190,34820],[26,34820,38300],[27,38300,38740],[28,38740,39670],[29,39670,40780],[30,40780,41990],[31,41990,42130],[32,42130,43180],[33,43180,44210],[34,44210,45250],[35,45250,46120],[36,46120,47540],[37,47540,48160],[38,48160,49000],[39,49000,50890],[40,50890,52150],[41,52150,53180],[42,53180,53660],[43,53660,54150],[44,54150,55920],[45,55920,58350],[46,58350,59070],[47,59070,60010],[48,60010,62130],[49,62130,62510],[50,62510,65625]]}},{"name":"46:16","price":"یہی وه لوگ ہیں جن کے نیک اعمال تو ہم قبول فرما لیتے ہیں اور جن کے بداعمال سے درگزر کر لیتے ہیں، (یہ) جنتی لوگوں میں ہیں۔ اس سچے وعدے کے مطابق جو ان سے کیا جاتا تھا.","arabic":"أُوْلَٰٓئِكَ ٱلَّذِينَ نَتَقَبَّلُ عَنۡهُمۡ أَحۡسَنَ مَا عَمِلُواْ وَنَتَجَاوَزُ عَن سَيِّـَٔاتِهِمۡ فِيٓ أَصۡحَٰبِ ٱلۡجَنَّةِۖ وَعۡدَ ٱلصِّدۡقِ ٱلَّذِي كَانُواْ يُوعَدُونَ","category":["46 (Al-Ahqaf)","Al-Ahqaf","Surah Al-Ahqaf"],"ayahNumber":4526,"juzNumber":26,"footnotes":"","lang":"ur","meta":{"transliteration":"ulāika alladhīna nataqabbalu ʿanhum aḥsana mā ʿamilū wanatajāwazu ʿan sayyiātihim fī aṣḥābi al-janati waʿda al-ṣid'qi alladhī kānū yūʿadūna ","translations":["Those","(are) the ones","We will accept","from them","(the) best","(of) what","they did","and We will overlook","[from]","their evil deeds","among","(the) companions","(of) Paradise","A promise","true","which","they were","promised","(16)"],"transliterationArr":["ulāika","alladhīna","nataqabbalu","ʿanhum","aḥsana","mā","ʿamilū","wanatajāwazu","ʿan","sayyiātihim","fī","aṣḥābi","al-janati","waʿda","al-ṣid'qi","alladhī","kānū","yūʿadūna",null],"verseTiming":[[1,0,3400],[2,3400,4580],[3,4580,5890],[4,5890,6780],[5,6780,7650],[6,7650,8070],[7,8070,9040],[8,9040,10520],[9,10520,11610],[10,11610,13400],[11,13400,15420],[12,15420,16500],[13,16500,19270],[14,19270,19910],[15,19910,20830],[16,20830,21690],[17,21690,22610],[18,22610,26285]]}},{"name":"46:17","price":"اور جس نے اپنے ماں باپ سے کہا کہ تم سے میں تنگ آگیا(1) ، تم مجھ سے یہی کہتے رہو گے کہ میں مرنے کے بعد پھر زنده کیا جاؤں گا مجھ سے پہلے بھی امتیں گزر چکی ہیں(2)، وه دونوں جناب باری میں فریادیں کرتے ہیں اور کہتے ہیں تجھے خرابی ہو تو ایمان لے آ، بیشک اللہ کا وعده حق ہے، وه جواب دیتا ہے کہ یہ تو صرف اگلوں کے افسانے ہیں.(3)","arabic":"وَٱلَّذِي قَالَ لِوَٰلِدَيۡهِ أُفّٖ لَّكُمَآ أَتَعِدَانِنِيٓ أَنۡ أُخۡرَجَ وَقَدۡ خَلَتِ ٱلۡقُرُونُ مِن قَبۡلِي وَهُمَا يَسۡتَغِيثَانِ ٱللَّهَ وَيۡلَكَ ءَامِنۡ إِنَّ وَعۡدَ ٱللَّهِ حَقّٞ فَيَقُولُ مَا هَٰذَآ إِلَّآ أَسَٰطِيرُ ٱلۡأَوَّلِينَ","category":["46 (Al-Ahqaf)","Al-Ahqaf","Surah Al-Ahqaf"],"ayahNumber":4527,"juzNumber":26,"footnotes":"(1) مذکورہ آیت میں سعادت مند اولاد کا تذکرہ تھا، جو ماں باپ کے ساتھ حسن سلوک بھی کرتی ہے اور ان کے حق میں دعائے خیر بھی۔ اب اس کے مقابلے میں بدبخت اور نافرمان او لاد کا ذکر کیا جا رہا ہے جو ماں باپ کے ساتھ گستاخی سے پیش آتی ہے۔ أُفٍّ لَكُمَا افسوس ہے تم پر ، اف کا کلمہ، ناگواری کے اظہار کے لئے استعمال ہوتا ہے۔ یعنی نافرمان اولاد، باپ کی ناصحانہ باتوں پر یا دعوت ایمان وعمل صالح پر ناگواری اور شدت غیظ کا اظہار کرتی ہے جس کی اولاد کو قطعاً اجازت نہیں ہے۔ یہ آیت عام ہے، ہر نافرمان اولاد اس کی مصداق ہے۔\n(2) مطلب ہے کہ وہ تودوبارہ زندہ ہو کر دنیا میں نہیں آئے۔ حالانکہ دوبارہ زندہ ہونے کا مطلب قیامت والے دن زندہ ہونا ہے جس کے بعد حساب ہوگا۔\n(3) ماں باپ مسلمان ہوں اور اولاد کافر، تو وہاں اولاد اور والدین کے درمیان اسی طرح تکرار اور بحث ہوتی ہے جس کا ایک نمونہ اس آیت میں ذکر کیا گیا ہے۔","lang":"ur","meta":{"transliteration":"wa-alladhī qāla liwālidayhi uffin lakumā ataʿidāninī an ukh'raja waqad khalati al-qurūnu min qablī wahumā yastaghīthāni al-laha waylaka āmin inna waʿda al-lahi ḥaqqun fayaqūlu mā hādhā illā asāṭīru al-awalīna ","translations":["But the one who","says","to his parents","Uff","to both of you","Do you promise me","that","I will be brought forth","and have already passed away","and have already passed away","the generations","before me","before me","And they both","seek help","(of) Allah","Woe to you","Believe","Indeed","(the) Promise","(of) Allah","(is) true","But he says","Not","(is) this","but","(the) stories","(of) the former (people)","(17)"],"transliterationArr":["wa-alladhī","qāla","liwālidayhi","uffin","lakumā","ataʿidāninī","an","ukh'raja","waqad","khalati","al-qurūnu","min","qablī","wahumā","yastaghīthāni","al-laha","waylaka","āmin","inna","waʿda","al-lahi","ḥaqqun","fayaqūlu","mā","hādhā","illā","asāṭīru","al-awalīna",null],"verseTiming":[[1,0,1170],[2,1170,1940],[3,1940,3540],[4,3540,4200],[5,4200,6970],[6,6970,10190],[7,10190,10570],[8,10570,11490],[9,11490,12100],[10,12100,12800],[11,12800,13970],[12,13970,15460],[13,15460,16330],[14,16330,20290],[15,20290,20720],[16,20720,21630],[17,21630,22180],[18,22180,22910],[19,22910,24080],[20,24080,25320],[21,25320,26260],[22,26260,27150],[23,27150,28870],[24,28870,29880],[25,29880,30690],[26,30690,31580],[27,31580,32990],[28,32990,33940],[29,33940,35490],[30,35490,36040],[31,36040,36980],[32,36980,38660],[33,38660,39880],[34,39880,40370],[35,40370,42940],[36,42940,45480],[37,45480,46810],[38,46810,50225]]}},{"name":"46:18","price":"وه لوگ ہیں جن پر (اللہ کے عذاب کا) وعده صادق آگیا(1) ، ان جنات اور انسانوں کے گروہوں کے ساتھ جو ان سے پہلے گزر چکے ہیں(2)، یقیناً یہ نقصان پانے والے .تھے.","arabic":"أُوْلَٰٓئِكَ ٱلَّذِينَ حَقَّ عَلَيۡهِمُ ٱلۡقَوۡلُ فِيٓ أُمَمٖ قَدۡ خَلَتۡ مِن قَبۡلِهِم مِّنَ ٱلۡجِنِّ وَٱلۡإِنسِۖ إِنَّهُمۡ كَانُواْ خَٰسِرِينَ","category":["46 (Al-Ahqaf)","Al-Ahqaf","Surah Al-Ahqaf"],"ayahNumber":4528,"juzNumber":26,"footnotes":"(1) جو پہلے ہی اللہ کے علم میں تھا، یا شیطان کے جواب میں جو اللہ نے فرمایا تھا «لأَمْلأَنَّ جَهَنَّمَ مِنْكَ وَمِمَّنْ تَبِعَكَ مِنْهُمْ أَجْمَعِينَ» (سورۃ ص:85)\n(2) یعنی یہ بھی ان کافروں میں شامل ہوگئے جو انسانوں اور جنوں میں سے قیامت والے دن نقصان اٹھانے والے ہوں گے۔","lang":"ur","meta":{"transliteration":"ulāika alladhīna ḥaqqa ʿalayhimu al-qawlu fī umamin qad khalat min qablihim mina al-jini wal-insi innahum kānū khāsirīna ","translations":["Those ","(are) the ones","(has) proved true","against them","the word","among","nations","(that) already passed away","(that) already passed away","before them","before them","of","(the) jinn","and the men","Indeed, they","are","(the) losers","(18)"],"transliterationArr":["ulāika","alladhīna","ḥaqqa","ʿalayhimu","al-qawlu","fī","umamin","qad","khalat","min","qablihim","mina","al-jini","wal-insi","innahum","kānū","khāsirīna",null],"verseTiming":[[1,0,2569],[2,2569,3659],[3,3659,4329],[4,4329,5389],[5,5389,6339],[6,6339,8009],[7,8009,9519],[8,9519,9859],[9,9859,10579],[10,10579,11759],[11,11759,12589],[12,12589,13619],[13,13619,15259],[14,15259,17329],[15,17329,19399],[16,19399,20339],[17,20339,23144]]}},{"name":"46:19","price":"اور ہر ایک کو اپنے اپنے اعمال کے مطابق درجے ملیں گے(1) تاکہ انہیں ان کے اعمال کے پورے بدلے دے اور ان پر ﻇلم نہ کیا جائے گا.(2)","arabic":"وَلِكُلّٖ دَرَجَٰتٞ مِّمَّا عَمِلُواْۖ وَلِيُوَفِّيَهُمۡ أَعۡمَٰلَهُمۡ وَهُمۡ لَا يُظۡلَمُونَ","category":["46 (Al-Ahqaf)","Al-Ahqaf","Surah Al-Ahqaf"],"ayahNumber":4529,"juzNumber":26,"footnotes":"(1) مومن اور کافر، دونوں کا، ان کے عملوں کے مطابق اللہ کے ہاں مرتبہ ہوگا۔ مومن مراتب عالیہ سے سرفراز ہوں گے اور کافر جہنم کےپست ترین درجوں میں ہوں گے۔\n(2) گناہ گار کو اس کے جرم سےزیادہ سزا دی جائے گی اور نیکو کار کے صلے میں کمی نہیں ہوگی۔ بلکہ ہر ایک کو خیر یا شر میں سے وہی کچھ ملے گا جس کا وہ مستحق ہوگا۔","lang":"ur","meta":{"transliteration":"walikullin darajātun mimmā ʿamilū waliyuwaffiyahum aʿmālahum wahum lā yuẓ'lamūna ","translations":["And for all","(are) degrees","for what","they did","and that He may fully compensate them","(for) their deeds","and they","will not be wronged","will not be wronged","(19)"],"transliterationArr":["walikullin","darajātun","mimmā","ʿamilū","waliyuwaffiyahum","aʿmālahum","wahum","lā","yuẓ'lamūna",null],"verseTiming":[[1,0,1390],[2,1390,3350],[3,3350,5930],[4,5930,6970],[5,6970,9340],[6,9340,10930],[7,10930,11490],[8,11490,11990],[9,11990,16065]]}},{"name":"46:20","price":"اور جس دن کافر جہنم کے سرے پر ﻻئے جائیں گے(1) (کہا جائے گا) تم نے اپنی نیکیاں دنیا کی زندگی میں ہی برباد کر دیں اور ان سے فائدے اٹھا چکے، پس آج تمہیں ذلت کے عذاب کی سزا دی جائے گی(2)، اس باعﺚ کہ تم زمین میں ناحق تکبر کیا کرتے تھے اور اس باعﺚ بھی کہ تم حکم عدولی کیا کرتے تھے.(3)","arabic":"وَيَوۡمَ يُعۡرَضُ ٱلَّذِينَ كَفَرُواْ عَلَى ٱلنَّارِ أَذۡهَبۡتُمۡ طَيِّبَٰتِكُمۡ فِي حَيَاتِكُمُ ٱلدُّنۡيَا وَٱسۡتَمۡتَعۡتُم بِهَا فَٱلۡيَوۡمَ تُجۡزَوۡنَ عَذَابَ ٱلۡهُونِ بِمَا كُنتُمۡ تَسۡتَكۡبِرُونَ فِي ٱلۡأَرۡضِ بِغَيۡرِ ٱلۡحَقِّ وَبِمَا كُنتُمۡ تَفۡسُقُونَ","category":["46 (Al-Ahqaf)","Al-Ahqaf","Surah Al-Ahqaf"],"ayahNumber":4530,"juzNumber":26,"footnotes":"(1) یعنی اس وقت کو یاد کرو، جب کافروں کی آنکھوں سے پردے ہٹا دیئے جائیں گے اور وہ جہنم کی آگ دیکھ رہے یا اس کے قریب ہوں گے۔ بعض نے يُعْرَضُونَ کے معنی يُعَذَّبُونَ کے کیے ہیں۔ اور بعض کہتے ہیں کلام میں قلب ہے۔ مطلب ہے جب آگ ان پر پیش کی جائے گی تُعْرَضُ النَّارُ عَلَيْهِمْ (فتح القدير)۔\n(2) طَيِّبَاتٌ سے مراد وہ نعمتیں ہیں جو انسان ذوق وشوق سے کھاتے پیتے اور استعمال کرتے اور لذت وفرحت محسوس کرتے ہیں۔ لیکن آخرت کی فکر کے ساتھ ان کا استعمال ہو تو بات اور ہے، جیسے مومن کرتا ہے۔ وہ اس کے ساتھ ساتھ احکام الٰہی کی اطاعت کرکے شکر الٰہی کا بھی اہتمام کرتا رہتا ہے۔ لیکن فکر آخرت سے بے نیازی کےساتھ ان کا استعمال انسان کو سرکش اور باغی بنا دیتا ہے جیسے کافر کرتا ہے اور یوں وہ اللہ کی ناشکری کرتا ہے۔ چنانچہ مومن کو تو اس کے شکر واطاعت کی وجہ سے یہ نعمتیں بلکہ اس سے بدر جہا بہتر نعمتیں آخرت میں پھر مل جائیں گی۔ جب کہ کافروں کو وہی کچھ کہا جائے گا جو یہاں آیت میں مذکور ہے۔ أَذْهَبْتُمْ طَيِّبَاتِكُمْ . . . . کا دوسرا ترجمہ ہے دنیا کی زندگی میں تم نے اپنے مزے اڑا لیے اور خوب فائدہ اٹھا لیا۔\n(3) ان کے عذاب کے دو سبب بیان فرمائے، ناحق تکبر، جس کی بنیاد پر انسان حق کا اتباع کرنے سے گریز کرتا ہے اور دوسرا فسق۔ بے خوفی کے ساتھ معاصی کا ارتکاب۔ یہ دونوں باتیں تمام کافروں میں مشترکہ ہوتی ہیں۔ اہل ایمان کو ان دونوں باتوں سے اپنا دامن بچانا چاہئے۔ ملحوظة۔ بعض صحابہ کرام (رضي الله عنهم) کےبارے میں آتا ہے کہ ان کے سامنے عمدہ وغیرہ آتی تو یہ آیت انہیں یاد آجاتی اور وہ اسے ڈر سےاسے ترک کر دیتے کہ کہیں آخرت میں ہمیں بھی یہ نہ کہہ دیا جائے کہ تم نے اپنے مزے دنیا میں لوٹ لیے۔ تو یہ ا ن کی وہ کیفیت ہے جو غایت ورع اور زہد وتقویٰ کی مظہر ہے، اس کا یہ مطلب نہیں ہے کہ اچھی نعمتوں کا استعمال وہ جائز نہیں سمجھتے تھے۔","lang":"ur","meta":{"transliteration":"wayawma yuʿ'raḍu alladhīna kafarū ʿalā al-nāri adhhabtum ṭayyibātikum fī ḥayātikumu al-dun'yā wa-is'tamtaʿtum bihā fal-yawma tuj'zawna ʿadhāba al-hūni bimā kuntum tastakbirūna fī al-arḍi bighayri al-ḥaqi wabimā kuntum tafsuqūna ","translations":["And (the) Day","will be exposed","those who","disbelieved","to","the Fire","You exhausted","your good things","in","your life","(of) the world","and you took your pleasures","therein","So today","you will be recompensed","(with) a punishment","humiliating","because","you were","arrogant","in","the earth","without","[the] right","and because","you were","defiantly disobedient","(20)"],"transliterationArr":["wayawma","yuʿ'raḍu","alladhīna","kafarū","ʿalā","al-nāri","adhhabtum","ṭayyibātikum","fī","ḥayātikumu","al-dun'yā","wa-is'tamtaʿtum","bihā","fal-yawma","tuj'zawna","ʿadhāba","al-hūni","bimā","kuntum","tastakbirūna","fī","al-arḍi","bighayri","al-ḥaqi","wabimā","kuntum","tafsuqūna",null],"verseTiming":[[1,0,1030],[2,1030,1950],[3,1950,3040],[4,3040,3960],[5,3960,4360],[6,4360,6040],[7,6040,7430],[8,7430,9700],[9,9700,11240],[10,11240,13060],[11,13060,13490],[12,13490,14820],[13,14820,16020],[14,16020,17820],[15,17820,19020],[16,19020,20120],[17,20120,21280],[18,21280,22170],[19,22170,25540],[20,25540,26660],[21,26660,27740],[22,27740,28620],[23,28620,29610],[24,29610,30190],[25,30190,31810],[26,31810,33510],[27,33510,33840],[28,33840,34730],[29,34730,35590],[30,35590,36450],[31,36450,37270],[32,37270,38950],[33,38950,42115]]}},{"name":"46:21","price":"اور عاد کے بھائی کو یاد کرو، جبکہ اس نے اپنی قوم کو احقاف میں ڈرایا(1) اور یقیناً اس سے پہلے بھی ڈرانے والے گزر چکے ہیں اور اس کے بعد بھی یہ کہ تم سوائے اللہ تعالیٰ کے اور کسی کی عبادت نہ کرو، بیشک میں تم پر بڑے دن کے عذاب سے خوف کھاتا ہوں.(2)","arabic":"۞ وَٱذۡكُرۡ أَخَا عَادٍ إِذۡ أَنذَرَ قَوۡمَهُۥ بِٱلۡأَحۡقَافِ وَقَدۡ خَلَتِ ٱلنُّذُرُ مِنۢ بَيۡنِ يَدَيۡهِ وَمِنۡ خَلۡفِهِۦٓ أَلَّا تَعۡبُدُوٓاْ إِلَّا ٱللَّهَ إِنِّيٓ أَخَافُ عَلَيۡكُمۡ عَذَابَ يَوۡمٍ عَظِيمٖ","category":["46 (Al-Ahqaf)","Al-Ahqaf","Surah Al-Ahqaf"],"ayahNumber":4531,"juzNumber":26,"footnotes":"(1) أَحْقَافٌ، حِقْفٌ کی جمع ہے۔ ریت کا بلند مستطیل ٹیلہ، بعض نے اس کے معنی پہاڑ اور غار کےکیے ہیں۔ یہ حضرت ہود (عليه السلام) کی قوم عاد اولیٰ۔ کے علاقے کا نام ہے، جو حضر موت (یمن) کے قریب تھا۔ کفار مکہ کی تکذیب کے پیش نظر نبی (صلى الله عليه وسلم) کی تسلی کے لئے گزشتہ انبیا علیہم السلام کے واقعات کا تذکرہ کیا جا رہا ہے۔\n(2) یوم عظیم سےمراد قیامت کا دن ہے، جسےاس کی ہولناکی کی وجہ سے بجا طور پر بڑا دن کہا گیا ہے۔","lang":"ur","meta":{"transliteration":"wa-udh'kur akhā ʿādin idh andhara qawmahu bil-aḥqāfi waqad khalati al-nudhuru min bayni yadayhi wamin khalfihi allā taʿbudū illā al-laha innī akhāfu ʿalaykum ʿadhāba yawmin ʿaẓīmin ","translations":["And mention","(the) brother","(of) Aad","when","he warned","his people","in the Al-Ahqaf ","and had already passed away","and had already passed away","[the] warners","before him","before him","before him","and after him","and after him","That not","you worship","except","Allah","Indeed, I","[I] fear","for you","a punishment","(of) a Day","Great","(21)"],"transliterationArr":["wa-udh'kur","akhā","ʿādin","idh","andhara","qawmahu","bil-aḥqāfi","waqad","khalati","al-nudhuru","min","bayni","yadayhi","wamin","khalfihi","allā","taʿbudū","illā","al-laha","innī","akhāfu","ʿalaykum","ʿadhāba","yawmin","ʿaẓīmin",null],"verseTiming":[[1,0,920],[2,920,1690],[3,1690,2380],[4,2380,3030],[5,3030,4910],[6,4910,5930],[7,5930,7660],[8,7660,8320],[9,8320,9030],[10,9030,10500],[11,10500,11560],[12,11560,12170],[13,12170,13150],[14,13150,13710],[15,13710,16649],[16,16649,17529],[17,17529,20378],[18,20378,20998],[19,20998,23938],[20,23938,24768],[21,24768,27368],[22,27368,27998],[23,27998,28928],[24,28928,31908],[25,31908,32728],[26,32728,33878],[27,33878,34828],[28,34828,35688],[29,35688,39343]]}},{"name":"46:22","price":"قوم نے جواب دیا، کیا آپ ہمارے پاس اس لئے آئے ہیں کہ ہمیں اپنے معبودوں (کی پرستش) سے باز رکھیں(1) ؟ پس اگر آپ سچے ہیں تو جس عذاب کا آپ وعده کرتے ہیں اسے ہم پر ﻻ ڈالیں.","arabic":"قَالُوٓاْ أَجِئۡتَنَا لِتَأۡفِكَنَا عَنۡ ءَالِهَتِنَا فَأۡتِنَا بِمَا تَعِدُنَآ إِن كُنتَ مِنَ ٱلصَّٰدِقِينَ","category":["46 (Al-Ahqaf)","Al-Ahqaf","Surah Al-Ahqaf"],"ayahNumber":4532,"juzNumber":26,"footnotes":"(1) لِتَأْفِكَنَا لِتَصْرِفَنَا یا لِتَمْنَعَنَا یا لِتُزِلَنَا، سب متقارب المعنی ہیں۔ تاکہ تو ہمیں ہمارے معبودوں کی پرستش سےپھیر دے، روک دے، ہٹا دے۔","lang":"ur","meta":{"transliteration":"qālū aji'tanā litafikanā ʿan ālihatinā fatinā bimā taʿidunā in kunta mina al-ṣādiqīna ","translations":["They said","Have you come to us","to turn us away","from","our gods","Then bring us","what","you threaten us","if","you are","of","the truthful","(22)"],"transliterationArr":["qālū","aji'tanā","litafikanā","ʿan","ālihatinā","fatinā","bimā","taʿidunā","in","kunta","mina","al-ṣādiqīna",null],"verseTiming":[[1,0,2230],[2,2230,3400],[3,3400,5140],[4,5140,5610],[5,5610,7130],[6,7130,8270],[7,8270,8860],[8,8860,11360],[9,11360,12500],[10,12500,14060],[11,14060,14430],[12,14430,18075]]}},{"name":"46:23","price":"(حضرت ہود نے) کہا (اس کا) علم تو اللہ ہی کے پاس ہے، میں تو جو پیغام دے کر بھیجا گیا تھا وه تمہیں پہنچا رہا ہوں(1) لیکن میں دیکھتا ہوں کہ تم لوگ نادانی کر رہے ہو.(2)","arabic":"قَالَ إِنَّمَا ٱلۡعِلۡمُ عِندَ ٱللَّهِ وَأُبَلِّغُكُم مَّآ أُرۡسِلۡتُ بِهِۦ وَلَٰكِنِّيٓ أَرَىٰكُمۡ قَوۡمٗا تَجۡهَلُونَ","category":["46 (Al-Ahqaf)","Al-Ahqaf","Surah Al-Ahqaf"],"ayahNumber":4533,"juzNumber":26,"footnotes":"(1) یعنی عذاب کب آئے گا؟ یا دنیا میں نہیں آئے گا، بلکہ آخرت میں تمہیں عذاب دیا جائے گا، اس کا علم صرف اللہ کو ہے، وہی اپنی مشیت کے مطابق فیصلہ فرماتا ہے، میرا کام تو صرف پیغام پہنچانا ہے۔\n(2) کہ ایک تو کفر پر اصرار کر رہےہو، دوسرے، مجھ سے ایسی چیز کا مطالبہ کر رہے ہو جو میرے اختیار میں نہیں ہے۔","lang":"ur","meta":{"transliteration":"qāla innamā al-ʿil'mu ʿinda al-lahi wa-uballighukum mā ur'sil'tu bihi walākinnī arākum qawman tajhalūna ","translations":["He said","Only","the knowledge","(is) with Allah","(is) with Allah","and I convey to you","what","I am sent","with it","but","I see you","a people","ignorant","(23)"],"transliterationArr":["qāla","innamā","al-ʿil'mu","ʿinda","al-lahi","wa-uballighukum","mā","ur'sil'tu","bihi","walākinnī","arākum","qawman","tajhalūna",null],"verseTiming":[[1,0,860],[2,860,2330],[3,2330,3160],[4,3160,4620],[5,4620,5500],[6,5500,7240],[7,7240,9970],[8,9970,11050],[9,11050,11680],[10,11680,15260],[11,15260,16370],[12,16370,18050],[13,18050,21175]]}},{"name":"46:24","price":"پھر جب انہوں نے عذاب کو بصورت بادل دیکھا اپنی وادیوں کی طرف آتے ہوئے تو کہنے لگے، یہ ابر ہم پر برسنے واﻻ ہے(1) ، (نہیں) بلکہ دراصل یہ ابر وه (عذاب) ہے جس کی تم جلدی کر رہے تھے(2)، ہوا ہے جس میں دردناک عذاب ہے.(3)","arabic":"فَلَمَّا رَأَوۡهُ عَارِضٗا مُّسۡتَقۡبِلَ أَوۡدِيَتِهِمۡ قَالُواْ هَٰذَا عَارِضٞ مُّمۡطِرُنَاۚ بَلۡ هُوَ مَا ٱسۡتَعۡجَلۡتُم بِهِۦۖ رِيحٞ فِيهَا عَذَابٌ أَلِيمٞ","category":["46 (Al-Ahqaf)","Al-Ahqaf","Surah Al-Ahqaf"],"ayahNumber":4534,"juzNumber":26,"footnotes":"(1) عرصہ دراز سے ان کے ہاں بارش نہیں ہوئی تھی، امنڈتے بادل دیکھ کر خوش ہوئے کہ اب بارش ہوگی۔ بادل کو عارض اس لئے کہا ہے کہ بادل عرض آسمان پر ظاہر ہوتا ہے۔\n(2) یہ حضرت ہود (عليه السلام) نے انہیں کہا کہ یہ محض بادل نہیں ہے، جیسے تم سمجھ رہے ہو۔ بلکہ یہ وہ عذاب ہے۔ جسے تم جلد لانے کا مطالبہ کر رہے تھے۔\n(3) یعنی وہ ہوا ، جس سے اس قوم کی ہلاکت ہوئی، ان بادلوں سے ہی اٹھی اور نکلی اور اللہ کی مشیت سے ان کو اور ان کی ہر چیز کو تباہ کر گئی۔ اسی لئے حدیث میں آتا ہے، حضرت عائشہ (رضی الله عنها) نے رسول اللہ (صلى الله عليه وسلم) سےپوچھا کہ لوگ تو بادل دیکھ کر خوش ہوتے ہیں کہ بارش ہوگی، لیکن آپ (صلى الله عليه وسلم) کے چہرے پر اس کے برعکس تشویش کے آثار نظر آتے ہیں؟ آپ (صلى الله عليه وسلم) نےفرمایا : عائشہ (رضی الله عنها) اس بات کی کیا ضمانت ہے کہ اس بادل میں عذاب نہیں ہوگا، جب کہ ایک قوم ہوا کے عذاب سے ہی ہلاک کر دی گئی، اس قوم نے بھی بادل دیکھ کر کہا تھا یہ بادل ہےجو ہم پر بارش برسائے گا۔ (البخاري، تفسير سورة الأحقاف، مسلم، كتاب صلاة الاستسقاء باب التعوذ عند رؤية الريح والغيم والفرح بالمطر) ایک دوسری روایت میں ہے کہ جب باد تند چلتی تو آپ (صلى الله عليه وسلم) یہ دعا پڑھتے «اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَهَا، وَخَيْرَ مَا فِيهَا، وَخَيْرَ مَا أُرْسِلَتْ بِهِ، وَأَعُوذُ بِكَ مِنْ شَرِّهَا، وَشَرِّ مَا أُرْسِلَتْ بِهِ» اور جب آسمان پر بادل گہرے ہو جاتے تو آپ (صلى الله عليه وسلم) کا رنگ متغیر ہو جاتا اور خوف کی سی ایک کیفیت آپ (صلى الله عليه وسلم) پر طاری ہو جاتی جس سے آپ (صلى الله عليه وسلم) بے چین رہتے، کبھی باہر نکلتے، کبھی اندر داخل ہوتے، کبھی آگے ہوتے اور کبھی پیچھے پھر بارش ہو جاتی تو آپ (صلى الله عليه وسلم) اطمینان کا سانس لیتے۔ (صحیح مسلم، باب مذکور)۔","lang":"ur","meta":{"transliteration":"falammā ra-awhu ʿāriḍan mus'taqbila awdiyatihim qālū hādhā ʿāriḍun mum'ṭirunā bal huwa mā is'taʿjaltum bihi rīḥun fīhā ʿadhābun alīmun ","translations":["Then when","they saw it","(as) a cloud","approaching","their valleys","they said","This","(is) a cloud","bringing us rain","Nay","it","(is) what","you were asking it to be hastened","you were asking it to be hastened","a wind","in it","(is) a punishment","painful","(24)"],"transliterationArr":["falammā","ra-awhu","ʿāriḍan","mus'taqbila","awdiyatihim","qālū","hādhā","ʿāriḍun","mum'ṭirunā","bal","huwa","mā","is'taʿjaltum","bihi","rīḥun","fīhā","ʿadhābun","alīmun",null],"verseTiming":[[1,0,1760],[2,1760,2720],[3,2720,3750],[4,3750,6010],[5,6010,7570],[6,7570,8520],[7,8520,9460],[8,9460,10340],[9,10340,12890],[10,12890,13840],[11,13840,14230],[12,14230,14450],[13,14450,17260],[14,17260,17890],[15,17890,19530],[16,19530,20490],[17,20490,21630],[18,21630,24335]]}},{"name":"46:25","price":"جو اپنے رب کے حکم سے ہر چیز کو ہلاک کر دے گی، پس وه ایسے ہوگئے کہ بجر ان کے مکانات کے اور کچھ دکھائی نہ دیتا(1) تھا۔ گنہگاروں کے گروه کو ہم یوں ہی سزا دیتے ہیں.","arabic":"تُدَمِّرُ كُلَّ شَيۡءِۭ بِأَمۡرِ رَبِّهَا فَأَصۡبَحُواْ لَا يُرَىٰٓ إِلَّا مَسَٰكِنُهُمۡۚ كَذَٰلِكَ نَجۡزِي ٱلۡقَوۡمَ ٱلۡمُجۡرِمِينَ","category":["46 (Al-Ahqaf)","Al-Ahqaf","Surah Al-Ahqaf"],"ayahNumber":4535,"juzNumber":26,"footnotes":"(1) یعنی مکین (گھر والے) سب تباہ ہوگئے اور صرف مکانات (گھر) نشان عبرت کے طور پر باقی رہ گئے۔","lang":"ur","meta":{"transliteration":"tudammiru kulla shayin bi-amri rabbihā fa-aṣbaḥū lā yurā illā masākinuhum kadhālika najzī al-qawma al-muj'rimīna ","translations":["Destroying","every","thing","by (the) command","(of) its Lord","Then they became (such)","not","is seen","except","their dwellings","Thus","We recompense","the people","[the] criminals","(25)"],"transliterationArr":["tudammiru","kulla","shayin","bi-amri","rabbihā","fa-aṣbaḥū","lā","yurā","illā","masākinuhum","kadhālika","najzī","al-qawma","al-muj'rimīna",null],"verseTiming":[[1,0,2200],[2,2200,2800],[3,2800,3940],[4,3940,5380],[5,5380,6530],[6,6530,7920],[7,7920,8360],[8,8360,10940],[9,10940,11830],[10,11830,14030],[11,14030,15170],[12,15170,15820],[13,15820,16640],[14,16640,20265]]}},{"name":"46:26","price":"اور بالیقین ہم نے (قوم عاد) کو وه مقدور دیئے تھے جو تمہیں تو دیئے بھی نہیں اور ہم نے انہیں کان آنکھیں اور دل بھی دے رکھے تھے۔ لیکن ان کے کانوں اور آنکھوں اور دلوں نے انہیں کچھ بھی نفع نہ پہنچایا(1) جبکہ وه اللہ تعالیٰ کی آیتوں کا انکار کرنے لگے اور جس چیز کا وه مذاق اڑایا کرتے تھے وہی ان پر الٹ پڑی.(2)","arabic":"وَلَقَدۡ مَكَّنَّٰهُمۡ فِيمَآ إِن مَّكَّنَّٰكُمۡ فِيهِ وَجَعَلۡنَا لَهُمۡ سَمۡعٗا وَأَبۡصَٰرٗا وَأَفۡـِٔدَةٗ فَمَآ أَغۡنَىٰ عَنۡهُمۡ سَمۡعُهُمۡ وَلَآ أَبۡصَٰرُهُمۡ وَلَآ أَفۡـِٔدَتُهُم مِّن شَيۡءٍ إِذۡ كَانُواْ يَجۡحَدُونَ بِـَٔايَٰتِ ٱللَّهِ وَحَاقَ بِهِم مَّا كَانُواْ بِهِۦ يَسۡتَهۡزِءُونَ","category":["46 (Al-Ahqaf)","Al-Ahqaf","Surah Al-Ahqaf"],"ayahNumber":4536,"juzNumber":26,"footnotes":"(1) یہ اہل مکہ کو خطاب کرکے کہا جا رہا ہے کہ تم کیا چیز ہو؟ تم سے پہلی قومیں، جنہیں ہم نے ہلاک کیا، قوت وشوکت میں تم سے کہیں زیادہ تھیں،لیکن جب انہوں نے اللہ کی دی ہوئی صلاحیتوں (آنکھ، کان اور دل) کو حق کے سننے، دیکھنے اور اسے سمجھنے کے لئے استعمال نہیں کیا، تو بالآخر ہم نے انہیں تباہ کر دیا اور یہ چیزیں ان کے کچھ کام نہ آسکیں۔\n(2) یعنی جس عذاب کو وہ انہونا سمجھ کر بطور استہزا کہا کرتے تھے کہ لے آ اپنا عذاب ! جس سے تو ہمیں ڈراتا رہتا ہے، وہ عذاب آیا اور اس نے انہیں گھیرا کہ پھر اس سے نکل نہ سکے۔","lang":"ur","meta":{"transliteration":"walaqad makkannāhum fīmā in makkannākum fīhi wajaʿalnā lahum samʿan wa-abṣāran wa-afidatan famā aghnā ʿanhum samʿuhum walā abṣāruhum walā afidatuhum min shayin idh kānū yajḥadūna biāyāti al-lahi waḥāqa bihim mā kānū bihi yastahziūna ","translations":["And certainly","We had established them","in what","not","We have established you","in it","and We made","for them","hearing","and vision","and hearts","But not","availed","them","their hearing","and not","their vision","and not","their hearts","any","thing","when","they were","rejecting","(the) Signs","(of) Allah","and enveloped","them","what","they used to","[at it]","ridicule","(26)"],"transliterationArr":["walaqad","makkannāhum","fīmā","in","makkannākum","fīhi","wajaʿalnā","lahum","samʿan","wa-abṣāran","wa-afidatan","famā","aghnā","ʿanhum","samʿuhum","walā","abṣāruhum","walā","afidatuhum","min","shayin","idh","kānū","yajḥadūna","biāyāti","al-lahi","waḥāqa","bihim","mā","kānū","bihi","yastahziūna",null],"verseTiming":[[1,0,960],[2,960,3330],[3,3330,5680],[4,5680,5930],[5,5930,8830],[6,8830,9680],[7,9680,11040],[8,11040,12910],[9,12910,13430],[10,13430,15020],[11,15020,17060],[12,17060,19120],[13,19120,21160],[14,21160,21890],[15,21890,23390],[16,23390,25950],[17,25950,26750],[18,26750,27620],[19,27620,28720],[20,28720,30790],[21,30790,32380],[22,32380,34580],[23,34580,35970],[24,35970,37720],[25,37720,38700],[26,38700,39140],[27,39140,40080],[28,40080,40960],[29,40960,41830],[30,41830,43160],[31,43160,44520],[32,44520,45380],[33,45380,46350],[34,46350,47490],[35,47490,48250],[36,48250,49170],[37,49170,49920],[38,49920,54045]]}},{"name":"46:27","price":"اور یقیناً ہم نے تمہارے آس پاس کی بستیاں تباه کر دیں اور طرح طرح کی ہم نے اپنی نشانیاں بیان کر دیں(1) تاکہ وه رجوع کر لیں.(2)","arabic":"وَلَقَدۡ أَهۡلَكۡنَا مَا حَوۡلَكُم مِّنَ ٱلۡقُرَىٰ وَصَرَّفۡنَا ٱلۡأٓيَٰتِ لَعَلَّهُمۡ يَرۡجِعُونَ","category":["46 (Al-Ahqaf)","Al-Ahqaf","Surah Al-Ahqaf"],"ayahNumber":4537,"juzNumber":26,"footnotes":"(1) آس پاس سے عاد، ثمود اور لوط کی وہ بستیاں مراد ہیں جو حجاز کےقریب ہی تھیں اور یمن اور شام وفلسطین کی طرف آتے جاتے ان سے ان کا گزر ہوتا تھا۔\n(2) یعنی ہم نے مختلف انداز سے اور مختلف نوع کے دلائل ان کے سامنے پیش کیے کہ شاید وہ توبہ کر لیں۔ لیکن وہ ٹس سے مس نہیں ہوئے۔","lang":"ur","meta":{"transliteration":"walaqad ahlaknā mā ḥawlakum mina al-qurā waṣarrafnā al-āyāti laʿallahum yarjiʿūna ","translations":["And certainly","We destroyed","what","surrounds you","of","the towns","and We have diversified","the Signs","that they may","return","(27)"],"transliterationArr":["walaqad","ahlaknā","mā","ḥawlakum","mina","al-qurā","waṣarrafnā","al-āyāti","laʿallahum","yarjiʿūna",null],"verseTiming":[[1,0,930],[2,930,2340],[3,2340,2710],[4,2710,3780],[5,3780,4830],[6,4830,5900],[7,5900,7100],[8,7100,8560],[9,8560,9900],[10,9900,13045]]}},{"name":"46:28","price":"پس قرب الٰہی حاصل کرنے کے لئے انہوں نے اللہ کے سوا جن جن کو اپنا معبود بنا رکھا تھا انہوں نے ان کی مدد کیوں نہ کی؟ بلکہ وه تو ان سے کھو گئے، (بلکہ دراصل) یہ ان کا محض جھوٹ اور (بالکل) بہتان تھا.(1)","arabic":"فَلَوۡلَا نَصَرَهُمُ ٱلَّذِينَ ٱتَّخَذُواْ مِن دُونِ ٱللَّهِ قُرۡبَانًا ءَالِهَةَۢۖ بَلۡ ضَلُّواْ عَنۡهُمۡۚ وَذَٰلِكَ إِفۡكُهُمۡ وَمَا كَانُواْ يَفۡتَرُونَ","category":["46 (Al-Ahqaf)","Al-Ahqaf","Surah Al-Ahqaf"],"ayahNumber":4538,"juzNumber":26,"footnotes":"(1) یعنی جن معبودوں کو وہ تقرب الٰہی کا ذریعہ سمجھتے تھے، انہوں نے ان کی کوئی مدد نہیں کی، بلکہ وہ اس موقعےپر آئے ہی نہیں، بلکہ گم رہے۔ اس سے بھی معلوم ہوا کہ مشرکین مکہ بتوں کو الہٰ نہیں سمجھتےبلکہ انہیں بارگاہ الٰہی میں قرب کا ذریعہ اور وسیلہ سمجھتے تھے۔ اللہ نے اس وسیلےکو یہاں افک (جھوٹ) اور افترا (بہتان) قرار دے کر واضح فرما دیا کہ یہ ناجائز اور حرام ہے۔","lang":"ur","meta":{"transliteration":"falawlā naṣarahumu alladhīna ittakhadhū min dūni al-lahi qur'bānan ālihatan bal ḍallū ʿanhum wadhālika if'kuhum wamā kānū yaftarūna ","translations":["Then why (did) not","help them","those whom","they had taken","besides","besides","Allah","gods as a way of approach","gods as a way of approach","Nay","they were lost","from them","And that","(was) their falsehood","and what","they were","inventing","(28)"],"transliterationArr":["falawlā","naṣarahumu","alladhīna","ittakhadhū","min","dūni","al-lahi","qur'bānan","ālihatan","bal","ḍallū","ʿanhum","wadhālika","if'kuhum","wamā","kānū","yaftarūna",null],"verseTiming":[[1,0,1150],[2,1150,2170],[3,2170,3250],[4,3250,4430],[5,4430,5970],[6,5970,6610],[7,6610,7570],[8,7570,8860],[9,8860,10440],[10,10440,10830],[11,10830,11770],[12,11770,13060],[13,13060,14130],[14,14130,15260],[15,15260,15880],[16,15880,16810],[17,16810,19855]]}},{"name":"46:29","price":"اور یاد کرو! جبکہ ہم نے جنوں کی ایک جماعت کو تیری طرف متوجہ کیا کہ وه قرآن سنیں، پس جب (نبی کے) پاس پہنچ گئے تو (ایک دوسرے سے) کہنے لگے خاموش ہو جاؤ(1) ، پھر جب پڑھ کر ختم ہوگیا(2) تو اپنی قوم کو خبردار کرنے کے لئے واپس لوٹ گئے.","arabic":"وَإِذۡ صَرَفۡنَآ إِلَيۡكَ نَفَرٗا مِّنَ ٱلۡجِنِّ يَسۡتَمِعُونَ ٱلۡقُرۡءَانَ فَلَمَّا حَضَرُوهُ قَالُوٓاْ أَنصِتُواْۖ فَلَمَّا قُضِيَ وَلَّوۡاْ إِلَىٰ قَوۡمِهِم مُّنذِرِينَ","category":["46 (Al-Ahqaf)","Al-Ahqaf","Surah Al-Ahqaf"],"ayahNumber":4539,"juzNumber":26,"footnotes":"(1) صحیح مسلم کی روایت سے معلوم ہوتا ہے کہ یہ واقعہ مکہ کے قریب نخلہ وادی میں پیش آیا، جہاں آپ (صلى الله عليه وسلم) صحابہ کرام (رضي الله عنهم) کو فجر کی نماز پڑھا رہے تھے۔ جنوں کو تجسس تھا کہ آسمان پر بہت زیادہ سختی کر دی گئی ہے اور اب ہمارا وہاں جانا تقریباً ناممکن بنا دیا گیا ہے، کوئی بہت ہی اہم واقعہ رونما ہوا ہے جس کے نتیجے میں ایسا ہوا ہے۔ چنانچہ مشرق ومغرب کے مختلف اطراف میں جنوں کی ٹولیاں واقعے کا سراغ لگانے کے لئے پھیل گئیں۔ ان ہی میں سے ایک ٹولی نے یہ قرآن سنا اور بات سمجھ لی کہ نبی (صلى الله عليه وسلم) کی بعثت کا یہ واقعہ ہی ہم پر آسمان کی بندش کا سبب ہے۔ اور جنوں کی یہ ٹولی آپ پر ایمان لے آئی اور جاکر اپنی قوم کو بھی بتلایا (مسلم، كتاب الصلاة، باب الجهر بالقراءة في الصبح والقراءة على الجن - صحيح بخاري میں بھی بعض باتوں کا تذکرہ ہے۔ كتاب مناقب الأنصار، باب ذكر الجن) بعض دیگر روایات سے معلوم ہوتا ہے کہ اس کے بعد آپ (صلى الله عليه وسلم) جنوں کی دعوت پر ان کے ہاں بھی تشریف لے گئے اور انہیں جاکر اللہ کا پیغام سنایا، اور متعدد مرتبہ جنوں کا وفد آپ کی خدمت میں بھی حاضر ہوا۔ (فتح الباری، تفسیر ابن کثیر وغیرہ)۔\n(2) یعنی آپ (صلى الله عليه وسلم) کی طرف سے تلاوت قرآن ختم ہوگئی۔","lang":"ur","meta":{"transliteration":"wa-idh ṣarafnā ilayka nafaran mina al-jini yastamiʿūna al-qur'āna falammā ḥaḍarūhu qālū anṣitū falammā quḍiya wallaw ilā qawmihim mundhirīna ","translations":["And when","We directed","to you","a party","of","the jinn","listening","(to) the Quran","And when","they attended it","they said","Listen quietly","And when","it was concluded","they turned back","to","their people","(as) warners","(29)"],"transliterationArr":["wa-idh","ṣarafnā","ilayka","nafaran","mina","al-jini","yastamiʿūna","al-qur'āna","falammā","ḥaḍarūhu","qālū","anṣitū","falammā","quḍiya","wallaw","ilā","qawmihim","mundhirīna",null],"verseTiming":[[1,0,710],[2,710,3590],[3,3590,4490],[4,4490,5170],[5,5170,6320],[6,6320,7640],[7,7640,9240],[8,9240,10650],[9,10650,12160],[10,12160,13390],[11,13390,15660],[12,15660,17720],[13,17720,19920],[14,19920,20710],[15,20710,21550],[16,21550,22140],[17,22140,23160],[18,23160,28865]]}},{"name":"46:30","price":"کہنے لگے اے ہماری قوم! ہم نے یقیناً وه کتاب سنی ہے جو موسیٰ (علیہ السلام) کے بعد نازل کی گئی ہے جو اپنے سے پہلی کتابوں کی تصدیق کرنے والی ہے جو سچے دین کی اور راه راست کی طرف رہنمائی کرتی ہے.","arabic":"قَالُواْ يَٰقَوۡمَنَآ إِنَّا سَمِعۡنَا كِتَٰبًا أُنزِلَ مِنۢ بَعۡدِ مُوسَىٰ مُصَدِّقٗا لِّمَا بَيۡنَ يَدَيۡهِ يَهۡدِيٓ إِلَى ٱلۡحَقِّ وَإِلَىٰ طَرِيقٖ مُّسۡتَقِيمٖ","category":["46 (Al-Ahqaf)","Al-Ahqaf","Surah Al-Ahqaf"],"ayahNumber":4540,"juzNumber":26,"footnotes":"","lang":"ur","meta":{"transliteration":"qālū yāqawmanā innā samiʿ'nā kitāban unzila min baʿdi mūsā muṣaddiqan limā bayna yadayhi yahdī ilā al-ḥaqi wa-ilā ṭarīqin mus'taqīmin ","translations":["They said","O our people","Indeed, we","[we] have heard","a Book","revealed","after","after","Musa","confirming","what","(was) before it","(was) before it","guiding","to","the truth","and to","a Path","Straight","(30)"],"transliterationArr":["qālū","yāqawmanā","innā","samiʿ'nā","kitāban","unzila","min","baʿdi","mūsā","muṣaddiqan","limā","bayna","yadayhi","yahdī","ilā","al-ḥaqi","wa-ilā","ṭarīqin","mus'taqīmin",null],"verseTiming":[[1,0,990],[2,990,4270],[3,4270,5630],[4,5630,6810],[5,6810,7990],[6,7990,9800],[7,9800,10890],[8,10890,11600],[9,11600,12540],[10,12540,14710],[11,14710,15860],[12,15860,17600],[13,17600,19500],[14,19500,19570],[15,19570,20190],[16,20190,21050],[17,21050,22250],[18,22250,23070],[19,23070,23680],[20,23680,24670],[21,24670,27360],[22,27360,27730],[23,27730,29300],[24,29300,32110],[25,32110,32480],[26,32480,33390],[27,33390,34180],[28,34180,35140],[29,35140,39725]]}},{"name":"46:31","price":"اے ہماری قوم! اللہ کے بلانے والے کا کہا مانو، اس پر ایمان ﻻؤ(1) ، تو اللہ تمہارے گناه بخش دے گا اور تمہیں المناک عذاب سے پناه دےگا.(2)","arabic":"يَٰقَوۡمَنَآ أَجِيبُواْ دَاعِيَ ٱللَّهِ وَءَامِنُواْ بِهِۦ يَغۡفِرۡ لَكُم مِّن ذُنُوبِكُمۡ وَيُجِرۡكُم مِّنۡ عَذَابٍ أَلِيمٖ","category":["46 (Al-Ahqaf)","Al-Ahqaf","Surah Al-Ahqaf"],"ayahNumber":4541,"juzNumber":26,"footnotes":"(1) یہ جنوں نے اپنی قوم کو نبی (صلى الله عليه وسلم) کی رسالت پر ایمان لانے کی دعوت دی۔ اس سے قبل قرآن کریم کے متعلق بتلایا کہ یہ تورات کے بعد ایک اور آسمانی کتاب ہے جو سچے دین اور صراط مستقیم کی طرف رہنمائی کرتی ہے۔\n(2) یہ ایمان لانے کے وہ فائدے بتلائے جو آخرت میں انہیں حاصل ہوں گے۔ مِنْ ذُنُوبِكُمْ میں مِنْ تبعیض کے لئے ہے یعنی بعض گناہ معاف فرما دے گا اور یہ وہ گناہ ہوں گے جن کا تعلق حقوق اللہ سے ہوگا۔ کیوں کہ حقوق العباد معاف نہیں ہوں گے۔ یہ آیت اس بات کی دلیل ہے کہ ثواب وعقاب اور اوامر ونواہی میں جنات کے لئے بھی وہی حکم ہے جو انسانوں کے لئے ہے۔ اس امر میں اہل علم کے درمیان اختلاف ہے کہ اللہ تعالیٰ نے جنات میں جنوں میں سے رسول بھیجے یا نہیں؟ ظاہر آیات قرآنیہ سے یہی معلوم ہوتا ہے کہ جنات میں کوئی رسول نہیں ہوا، تمام انبیاء ورسل علیہم السلام انسان ہی ہوئے ہیں:«وَمَا أَرْسَلْنَا مِنْ قَبْلِكَ إِلا رِجَالا نُوحِي إِلَيْهِمْ» (النحل: 43) «وَمَا أَرْسَلْنَا قَبْلَكَ مِنَ الْمُرْسَلِينَ إِلا إِنَّهُمْ لَيَأْكُلُونَ الطَّعَامَ وَيَمْشُونَ فِي الأَسْوَاقِ» (سورة الفرقان: 20) ان آیات قرآنیہ سے واضح ہے کہ جتنے بھی رسول ہوئے، وہ انسان تھے۔ اسی لئے رسول اللہ (صلى الله عليه وسلم) جس طرح انسانوں کے لئے رسول تھے اور ہیں، اسی طرح جنات کے رسول بھی آپ (صلى الله عليه وسلم) ہی ہیں اور آپ (صلى الله عليه وسلم) کے پیغام کو بھی جنات تک پہنچانے کا انتظام کیا گیا ہے جیسا کہ قرآن کریم کے اس مقام سے ظاہر ہے۔","lang":"ur","meta":{"transliteration":"yāqawmanā ajībū dāʿiya al-lahi waāminū bihi yaghfir lakum min dhunūbikum wayujir'kum min ʿadhābin alīmin ","translations":["O our people","Respond","(to the) caller","(of) Allah","and believe","in him","He will forgive","for you","of","your sins","and will protect you","from","a punishment","painful","(31)"],"transliterationArr":["yāqawmanā","ajībū","dāʿiya","al-lahi","waāminū","bihi","yaghfir","lakum","min","dhunūbikum","wayujir'kum","min","ʿadhābin","alīmin",null],"verseTiming":[[1,0,3570],[2,3570,4590],[3,4590,5450],[4,5450,9070],[5,9070,10100],[6,10100,10950],[7,10950,11950],[8,11950,13280],[9,13280,14050],[10,14050,14850],[11,14850,15480],[12,15480,17230],[13,17230,19130],[14,19130,19940],[15,19940,20580],[16,20580,21670],[17,21670,22480],[18,22480,23730],[19,23730,24960],[20,24960,26390],[21,26390,27610],[22,27610,31105]]}},{"name":"46:32","price":"اور جو شخص اللہ کے بلانے والے کا کہا نہ مانے گا پس وه زمین میں کہیں (بھاگ کر اللہ کو) عاجز نہیں کر سکتا(1) ، نہ اللہ کے سوا اور کوئی اس کے مدد گار ہوں گے(2)، یہ لوگ کھلی گمراہی میں ہیں.","arabic":"وَمَن لَّا يُجِبۡ دَاعِيَ ٱللَّهِ فَلَيۡسَ بِمُعۡجِزٖ فِي ٱلۡأَرۡضِ وَلَيۡسَ لَهُۥ مِن دُونِهِۦٓ أَوۡلِيَآءُۚ أُوْلَٰٓئِكَ فِي ضَلَٰلٖ مُّبِينٍ","category":["46 (Al-Ahqaf)","Al-Ahqaf","Surah Al-Ahqaf"],"ayahNumber":4542,"juzNumber":26,"footnotes":"(1) یعنی ایسا نہیں ہو سکتا کہ وہ زمین کی وسعتوں میں اس طرح گم ہو جائے کہ اللہ کی گرفت میں نہ آسکے۔\n(2) جو اسے اللہ کے عذاب سے بچالیں۔ مطلب یہ ہوا کہ نہ وہ خود اللہ کی گرفت سے بچنے پر قادر ہے نہ کسی دوسرے کی مدد سے ایسا ممکن ہے۔","lang":"ur","meta":{"transliteration":"waman lā yujib dāʿiya al-lahi falaysa bimuʿ'jizin fī al-arḍi walaysa lahu min dūnihi awliyāu ulāika fī ḍalālin mubīnin ","translations":["And whoever","(does) not","respond","(to the) caller","(of) Allah","then not","he can escape","in","the earth","and not","for him","besides Him","besides Him","protectors","Those","(are) in","error","clear","(32)"],"transliterationArr":["waman","lā","yujib","dāʿiya","al-lahi","falaysa","bimuʿ'jizin","fī","al-arḍi","walaysa","lahu","min","dūnihi","awliyāu","ulāika","fī","ḍalālin","mubīnin",null],"verseTiming":[[1,0,550],[2,550,1170],[3,1170,1830],[4,1830,2630],[5,2630,3620],[6,3620,4560],[7,4560,6480],[8,6480,6740],[9,6740,7650],[10,7650,8560],[11,8560,9080],[12,9080,10240],[13,10240,12900],[14,12900,13800],[15,13800,16189],[16,16189,19149],[17,19149,20009],[18,20009,20989],[19,20989,25264]]}},{"name":"46:33","price":"کیا وه نہیں دیکھتے کہ جس اللہ نے آسمانوں اور زمین کو پیدا کیا اور ان کے پیدا کرنے سے وه نہ تھکا، وه یقیناً مُردوں کو زنده کرنے پر قادر ہے؟ کیوں نہ ہو؟ وه یقیناً ہر چیز پر قادر ہے.(1)","arabic":"أَوَلَمۡ يَرَوۡاْ أَنَّ ٱللَّهَ ٱلَّذِي خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ وَلَمۡ يَعۡيَ بِخَلۡقِهِنَّ بِقَٰدِرٍ عَلَىٰٓ أَن يُحۡـِۧيَ ٱلۡمَوۡتَىٰۚ بَلَىٰٓۚ إِنَّهُۥ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ","category":["46 (Al-Ahqaf)","Al-Ahqaf","Surah Al-Ahqaf"],"ayahNumber":4543,"juzNumber":26,"footnotes":"(1) رأی سے، رؤیت قلبی مراد ہے، یعنی کیا انہوں نے نہیں جانا۔ أَلَمْ يَعْلَمُوا یا أَلَمْ يَتَفَكَّرُوا، کہ جو اللہ آسمان وزمین کو پیدا کرنے والا ہے، جن کی وسعت و بے کرانی کی انتہا نہیں ہے اور وہ ان کو بنا کر تھکا بھی نہیں۔ کیا وہ مردوں کودوبارہ زندہ نہیں کر سکتا؟ یقیناً کر سکتا ہے، اس لئے کہ وہ عَلَى كُلِّ شَيْءٍ قَدِيرٌ کی صفت سے متصف ہے۔","lang":"ur","meta":{"transliteration":"awalam yaraw anna al-laha alladhī khalaqa al-samāwāti wal-arḍa walam yaʿya bikhalqihinna biqādirin ʿalā an yuḥ'yiya al-mawtā balā innahu ʿalā kulli shayin qadīrun ","translations":["Do not","they see","that","Allah","(is) the One Who","created","the heavens","and the earth","and (was) not","tired","by their creation","(is) able","to give life","to give life","to give life","(to) the dead","Yes","indeed He","(is) on","every","thing","All-Powerful","(33)"],"transliterationArr":["awalam","yaraw","anna","al-laha","alladhī","khalaqa","al-samāwāti","wal-arḍa","walam","yaʿya","bikhalqihinna","biqādirin","ʿalā","an","yuḥ'yiya","al-mawtā","balā","innahu","ʿalā","kulli","shayin","qadīrun",null],"verseTiming":[[1,0,1010],[2,1010,1720],[3,1720,3030],[4,3030,3990],[5,3990,4900],[6,4900,5550],[7,5550,7210],[8,7210,8390],[9,8390,8940],[10,8940,9640],[11,9640,11980],[12,11980,13120],[13,13120,15470],[14,15470,15790],[15,15790,17580],[16,17580,18930],[17,18930,22090],[18,22090,23650],[19,23650,24330],[20,24330,24970],[21,24970,27090],[22,27090,29975]]}},{"name":"46:34","price":"وه لوگ جنہوں نے کفر کیا جس دن جہنم کے سامنے ﻻئے جائیں گے (اور ان سے کہا جائے گا کہ) کیا یہ حق نہیں ہے؟ تو جواب دیں گے کہ ہاں قسم ہے ہمارے رب کی(1) (حق ہے) (اللہ) فرمائے گا، اب اپنے کفر کے بدلے عذاب کا مزه چکھو.(2)","arabic":"وَيَوۡمَ يُعۡرَضُ ٱلَّذِينَ كَفَرُواْ عَلَى ٱلنَّارِ أَلَيۡسَ هَٰذَا بِٱلۡحَقِّۖ قَالُواْ بَلَىٰ وَرَبِّنَاۚ قَالَ فَذُوقُواْ ٱلۡعَذَابَ بِمَا كُنتُمۡ تَكۡفُرُونَ","category":["46 (Al-Ahqaf)","Al-Ahqaf","Surah Al-Ahqaf"],"ayahNumber":4544,"juzNumber":26,"footnotes":"(1) وہاں اعتراف ہی نہیں کریں گے بلکہ اپنے اس اعتراف پر قسم کھا کر اسے موکد کریں گے۔ لیکن اس وقت کا یہ اعتراف بے فائدہ ہے، کیونکہ مشاہدے کے بعد اعتراف کی کیا حیثیت ہو سکتی ہے؟ آنکھوں سے دیکھ لینے کے بعد اعتراف نہیں تو، کیا انکار کریں گے؟\n(2) اس لئے کہ جب ماننے کا وقت تھا، اس وقت مانا نہیں، یہ عذاب اسی کفر اور انکار کا بدلہ ہے، جو اب تمہیں بھگتنا ہی بھگتنا ہے۔","lang":"ur","meta":{"transliteration":"wayawma yuʿ'raḍu alladhīna kafarū ʿalā al-nāri alaysa hādhā bil-ḥaqi qālū balā warabbinā qāla fadhūqū al-ʿadhāba bimā kuntum takfurūna ","translations":["And (the) Day","are exposed","those who","disbelieved","to","the Fire","Is not","this","the truth","They will say","Yes","by our Lord","He will say","Then taste","the punishment","because","you used to","disbelieve","(34)"],"transliterationArr":["wayawma","yuʿ'raḍu","alladhīna","kafarū","ʿalā","al-nāri","alaysa","hādhā","bil-ḥaqi","qālū","balā","warabbinā","qāla","fadhūqū","al-ʿadhāba","bimā","kuntum","takfurūna",null],"verseTiming":[[1,0,1080],[2,1080,1940],[3,1940,3010],[4,3010,3950],[5,3950,4410],[6,4410,6220],[7,6220,7130],[8,7130,7970],[9,7970,9620],[10,9620,10470],[11,10470,11210],[12,11210,12620],[13,12620,13770],[14,13770,14590],[15,14590,15830],[16,15830,16460],[17,16460,18170],[18,18170,21785]]}},{"name":"46:35","price":"پس (اے پیغمبر!) تم ایسا صبر کرو جیسا صبر عالی ہمت رسولوں نے کیا اور ان کے لئے (عذاب طلب کرنے میں) جلدی نہ کرو(1) ، یہ جس دن اس عذاب کو دیکھ لیں گے جس کا وعده دیئے جاتے ہیں تو (یہ معلوم ہونے لگے گا کہ) دن کی ایک گھڑی ہی (دنیا میں) ٹھہرے(2) تھے، یہ ہے پیغام پہنچا(3) دینا، پس بدکاروں کے سوا کوئی ہلاک نہ کیا جائے گا.(4)","arabic":"فَٱصۡبِرۡ كَمَا صَبَرَ أُوْلُواْ ٱلۡعَزۡمِ مِنَ ٱلرُّسُلِ وَلَا تَسۡتَعۡجِل لَّهُمۡۚ كَأَنَّهُمۡ يَوۡمَ يَرَوۡنَ مَا يُوعَدُونَ لَمۡ يَلۡبَثُوٓاْ إِلَّا سَاعَةٗ مِّن نَّهَارِۭۚ بَلَٰغٞۚ فَهَلۡ يُهۡلَكُ إِلَّا ٱلۡقَوۡمُ ٱلۡفَٰسِقُونَ","category":["46 (Al-Ahqaf)","Al-Ahqaf","Surah Al-Ahqaf"],"ayahNumber":4545,"juzNumber":26,"footnotes":"(1) یہ کفار مکہ کے رویے کے مقابلے میں نبی (صلى الله عليه وسلم) کو تسلی دی جا رہی ہے اور صبر کرنے کی تلقین کی جا رہی ہے۔\n(2) قیامت کاہولناک عذاب دیکھنے کے بعد انہیں دنیا کی زندگی ایسے معلوم ہوگی جیسے دن کی صرف ایک گھڑی یہاں گزار کر گئے ہیں۔\n(3) یہ متبدا محذوف کی خبرہے۔ أَيْ : هَذَا الَّذِي وَعَظْتَهَمْ بِهِ بَلاغٌ یہ وہ نصیحت یا پیغام ہے جس کا پہنچانا تیرا کام ہے۔\n(4) اس آیت میں بھی اہل ایمان کے لئے خوش خبری اور حوصلہ افزائی ہے کہ ہلاکت اخروی صرف ان لوگوں کا حصہ ہے جو اللہ کےنافرمان اور اس کی حدود پامال کرنے والے ہیں۔","lang":"ur","meta":{"transliteration":"fa-iṣ'bir kamā ṣabara ulū al-ʿazmi mina al-rusuli walā tastaʿjil lahum ka-annahum yawma yarawna mā yūʿadūna lam yalbathū illā sāʿatan min nahārin balāghun fahal yuh'laku illā al-qawmu al-fāsiqūna ","translations":["So be patient","as","had patience","those of determination","those of determination","of","the Messengers","and (do) not","seek to hasten","for them","As if they had","(the) Day","they see","what","they were promised","not","remained","except","an hour","of","a day","A notification","But will","(any) be destroyed","except","the people ","the defiantly disobedient","(35)"],"transliterationArr":["fa-iṣ'bir","kamā","ṣabara","ulū","al-ʿazmi","mina","al-rusuli","walā","tastaʿjil","lahum","ka-annahum","yawma","yarawna","mā","yūʿadūna","lam","yalbathū","illā","sāʿatan","min","nahārin","balāghun","fahal","yuh'laku","illā","al-qawmu","al-fāsiqūna",null],"verseTiming":[[1,0,960],[2,960,1570],[3,1570,2370],[4,2370,2740],[5,2740,3670],[6,3670,4090],[7,4090,4970],[8,4970,5620],[9,5620,7010],[10,7010,8170],[11,8170,9990],[12,9990,10630],[13,10630,11500],[14,11500,11980],[15,11980,13300],[16,13300,13620],[17,13620,16840],[18,16840,17630],[19,17630,18650],[20,18650,19930],[21,19930,24110],[22,24110,26770],[23,26770,27910],[24,27910,28870],[25,28870,29480],[26,29480,30590],[27,30590,35535]]}}],"chapter":["46 (Al-Ahqaf)","Al-Ahqaf","Surah Al-Ahqaf","Chapter Al-Ahqaf","Ahqaf","Surah Ahqaf","Chapter Ahqaf","Al Ahqaf","Surah Al Ahqaf","Chapter Al Ahqaf","Surah 46","Chapter 46","The Dunes","الأحقاف"],"version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."}}