{"data":[{"name":"58:1","price":"یقیناً اللہ تعالیٰ نے اس عورت کی بات سنی جو تجھ سے اپنے شوہر کے بارے میں تکرار کر رہی تھی اور اللہ کے آگے شکایت کر رہی تھی، اللہ تعالیٰ تم دونوں کے سوال وجواب سن رہا تھا(1) ، بیشک اللہ تعالیٰ سننے دیکھنے واﻻ ہے.","arabic":"قَدۡ سَمِعَ ٱللَّهُ قَوۡلَ ٱلَّتِي تُجَٰدِلُكَ فِي زَوۡجِهَا وَتَشۡتَكِيٓ إِلَى ٱللَّهِ وَٱللَّهُ يَسۡمَعُ تَحَاوُرَكُمَآۚ إِنَّ ٱللَّهَ سَمِيعُۢ بَصِيرٌ","category":["58 (Al-Mujadila)","Al-Mujadila","Surah Al-Mujadila"],"ayahNumber":5105,"juzNumber":28,"footnotes":"(1) یہ اشارہ ہے حضرت خولہ بنت مالک بن ثعلبہ (رضی الله عنها) کے واقعہ کی طرف، جن کے خاوند حضرت اوس بن صامت (رضي الله عنه) نے ان سے ظہار کر لیا تھا، ظہار کا مطلب ہے، بیوی کو یہ کہہ دینا أَنْتِ عَلَيَّ كَظَهْرِ أُمِّي (تو مجھ پر میری ماں کی پیٹھ کی طرح ہے) زمانۂ جاہلیت میں ظہار کو طلاق سمجھا جاتا تھا۔ حضرت خولہ (رضی الله عنها) سخت پریشان ہوئیں اس وقت تک اس کی بابت کوئی حکم نازل نہیں ہوا تھا۔ اس لیے وہ نبی (صلى الله عليه وسلم) کے پاس آئیں تو آپ (صلى الله عليه وسلم) نے بھی کچھ توقف فرمایا اور وہ آپ سے بحث وتکرار کرتی رہیں۔ جس پر یہ آیات نازل ہوئیں ، جن میں مسئلہ ظہار اور اس کا حکم وکفارہ بیان فرما دیا گیا۔ (أبو داود، كتاب الطلاق، باب في الظهار) حضرت عائشہ (رضی الله عنها) فرماتی ہیں کہ اللہ تعالیٰ کس طرح لوگوں کی باتیں سننے والا ہے کہ یہ عورت گھر کے ایک کونے میں نبی (صلى الله عليه وسلم) سے مجادلہ کرتی اور اپنے خاوند کی شکایﺖ کرتی رہی، مگر میں اس کی باتیں نہیں سنتی تھی۔ لیکن اللہ نے آسمانوں پر سے اس کی بات سن لی، (سنن ابن ماجه ، المقدمة ، باب فيما أنكرت الجهمية - صحيح بخاري میں بھی تعلیقاً اس کا مختصر ذکر ہے۔ كتاب التوحيد ، باب قول الله تعالى وكان الله سمعا بصيرا)۔","lang":"ur","meta":{"transliteration":"qad samiʿa al-lahu qawla allatī tujādiluka fī zawjihā watashtakī ilā al-lahi wal-lahu yasmaʿu taḥāwurakumā inna al-laha samīʿun baṣīrun ","translations":["Indeed","Allah has heard","Allah has heard","(the) speech","(of one) who","disputes with you","concerning","her husband","and she directs her complaint","to","Allah","And Allah","hears","(the) dialogue of both of you","Indeed","Allah","(is) All-Hearer","All-Seer","(1)"],"transliterationArr":["qad","samiʿa","al-lahu","qawla","allatī","tujādiluka","fī","zawjihā","watashtakī","ilā","al-lahi","wal-lahu","yasmaʿu","taḥāwurakumā","inna","al-laha","samīʿun","baṣīrun",null],"verseTiming":[[1,0,370],[2,370,900],[3,900,1770],[4,1770,2310],[5,2310,3020],[6,3020,4120],[7,4120,4470],[8,4470,5450],[9,5450,7680],[10,7680,8000],[11,8000,8700],[12,8700,9690],[13,9690,10450],[14,10450,12120],[15,12120,13850],[16,13850,14610],[17,14610,16120],[18,16120,18735]]}},{"name":"58:2","price":"تم میں سے جو لوگ اپنی بیویوں سے ﻇہار کرتے ہیں (یعنی انہیں ماں کہہ بیٹھتے ہیں) وه دراصل ان کی مائیں نہیں بن جاتیں، ان کی مائیں تو وہی ہیں جن کے بطن سے وه پیدا ہوئے(1) ، یقیناً یہ لوگ ایک نامعقول اور جھوٹی بات کہتے ہیں۔ بیشک اللہ تعالیٰ معاف کرنے واﻻ اور بخشنے واﻻ ہے.(2)","arabic":"ٱلَّذِينَ يُظَٰهِرُونَ مِنكُم مِّن نِّسَآئِهِم مَّا هُنَّ أُمَّهَٰتِهِمۡۖ إِنۡ أُمَّهَٰتُهُمۡ إِلَّا ٱلَّٰٓـِٔي وَلَدۡنَهُمۡۚ وَإِنَّهُمۡ لَيَقُولُونَ مُنكَرٗا مِّنَ ٱلۡقَوۡلِ وَزُورٗاۚ وَإِنَّ ٱللَّهَ لَعَفُوٌّ غَفُورٞ","category":["58 (Al-Mujadila)","Al-Mujadila","Surah Al-Mujadila"],"ayahNumber":5106,"juzNumber":28,"footnotes":"(1) یہ ظہار کا حکم بیان فرمایا کہ تمہارے کہہ دینے سے تمہاری بیوی تمہاری ماں نہیں بن جائے گی۔ اگر ماں کے بجائے کوئی شخص اپنی بیٹی یا بہن وغیرہ کی پیٹھ کی طرح اپنی بیوی کو کہہ دے تو یہ ظہار ہے یا نہیں؟ امام مالک اور امام ابو حنیفہ رحمہما اللہ اسے بھی ظہار قرار دیتے ہیں، جب کہ دوسرے علما اسے ظہار تسلیم نہیں کرتے۔ (پہلا قول ہی صحیح معلوم ہوتا ہے) اسی طرح اس میں بھی اختلاف ہے کہ پیٹھ کی جگہ اگر کوئی یہ کہے کہ تو میری ماں کی طرح ہے، پیٹھ کا نام نہ لے۔ تو علما کہتے ہیں کہ اگر ظہار کی نیت سے وہ مذکورہ الفاظ کہے گا تو ظہار ہوگا، بصورت دیگر نہیں۔ امام ابو حنیفہ رحمہ اللہ کہتے ہیں کہ اگر ایسے عضو کے ساتھ تشبیہ دے گا جس کا دیکھنا جائز ہے تو یہ ظہار نہیں ہوگا، امام شافعی رحمہ اللہ بھی کہتے ہیں کہ ظہار صرف پیٹھ کی طرح کہنے سے ہی ہوگا۔ (فتح القدیر)۔\n(2) اسی لیے اس نے کفارے کو اس قول منکر اور جھوٹ کی معافی کا ذریعہ بنا دیا۔","lang":"ur","meta":{"transliteration":"alladhīna yuẓāhirūna minkum min nisāihim mā hunna ummahātihim in ummahātuhum illā allāī waladnahum wa-innahum layaqūlūna munkaran mina al-qawli wazūran wa-inna al-laha laʿafuwwun ghafūrun ","translations":["Those who","pronounce zihar","among you","[from]","(to) their wives","not","they","(are) their mothers","Not","(are) their mothers","except","those who","gave them birth","And indeed, they","surely say","an evil","[of]","[the] word","and a lie","But indeed","Allah","(is) surely, Oft-Pardoning","Oft-Forgiving","(2)"],"transliterationArr":["alladhīna","yuẓāhirūna","minkum","min","nisāihim","mā","hunna","ummahātihim","in","ummahātuhum","illā","allāī","waladnahum","wa-innahum","layaqūlūna","munkaran","mina","al-qawli","wazūran","wa-inna","al-laha","laʿafuwwun","ghafūrun",null],"verseTiming":[[1,0,1030],[2,1030,2420],[3,2420,3790],[4,3790,4930],[5,4930,7889],[6,7889,8599],[7,8599,9989],[8,9989,12049],[9,12049,12959],[10,12959,15309],[11,15309,15789],[12,15789,18139],[13,18139,19959],[14,19959,21639],[15,21639,23039],[16,23039,24439],[17,24439,25409],[18,25409,26239],[19,26239,27839],[20,27839,29189],[21,29189,30079],[22,30079,31049],[23,31049,33604]]}},{"name":"58:3","price":"جو لوگ اپنی بیویوں سے ﻇہار کریں پھر اپنی کہی ہوئی بات سے رجوع کرلیں(1) تو ان کے ذمہ آپس میں ایک دوسرے کو ہاتھ لگانے سے پہلے(2) ایک غلام آزاد کرنا ہے، اس کے ذریعہ تم نصیحت کیے جاتے ہو۔ اور اللہ تعالیٰ تمہارے تمام اعمال سے باخبر ہے.","arabic":"وَٱلَّذِينَ يُظَٰهِرُونَ مِن نِّسَآئِهِمۡ ثُمَّ يَعُودُونَ لِمَا قَالُواْ فَتَحۡرِيرُ رَقَبَةٖ مِّن قَبۡلِ أَن يَتَمَآسَّاۚ ذَٰلِكُمۡ تُوعَظُونَ بِهِۦۚ وَٱللَّهُ بِمَا تَعۡمَلُونَ خَبِيرٞ","category":["58 (Al-Mujadila)","Al-Mujadila","Surah Al-Mujadila"],"ayahNumber":5107,"juzNumber":28,"footnotes":"(1) اب اس حکم کی تفصیل بیان کی جارہی ہے۔ رجوع کا مطلب ہے، بیوی سے ہم بستری کرنا چاہیں۔\n(2) یعنی ہم بستری سے پہلے وہ کفارہ ادا کریں۔ 1۔ ایک غلام آزاد کرنا۔ 2۔ اس کی طاقت نہ ہو تو پے درپے بلاناغہ دو مہینے کے روزے۔ اگر درمیان میں بغیر عذر شرعی کے روزہ چھوڑ دیا تو نئے سرے سے پورے دو مہینے کے روزے رکھنے پڑیں گے۔ عذر شرعی سے مراد بیماری یا سفر ہے۔ امام ابو حنیفہ رحمہ اللہ کہتے ہیں کہ بیماری وغیرہ کی وجہ سے بھی روزہ چھوڑے گا تو نئے سرے سے روزے رکھنے ہوں گے۔ 3۔ اگر پے درپے دومہینے کے روزے رکھنے کی طاقت نہ ہو تو ساٹھ مساکین کو کھانا کھلائے۔ بعض کہتے ہیں کہ ہر مسکین کو دو مد (نصف صاع یعنی سوا کلو) اور بعض کہتے ہیں ایک مد کافی ہے۔ لیکن قرآن کے الفاظ سے معلوم ہوتا ہے کہ کھانا اس طرح کھلایا جائے کہ وہ شکم سیر ہو جائیں یا اتنی ہی مقدار میں ان کو کھانا دیا جائے۔ ایک مرتبہ ہی سب کو کھلانا بھی ضروری نہیں بلکہ متعدد اقساط میں یہ تعداد پوری کی جاسکتی ہے۔(فتح القدیر) تاہم یہ ضروری ہے جب تک یہ تعداد پوری نہ ہوجائے، اس وقت تک بیوی سے ہم بستری جائز نہیں۔","lang":"ur","meta":{"transliteration":"wa-alladhīna yuẓāhirūna min nisāihim thumma yaʿūdūna limā qālū fataḥrīru raqabatin min qabli an yatamāssā dhālikum tūʿaẓūna bihi wal-lahu bimā taʿmalūna khabīrun ","translations":["And those who","pronounce zihar","[from]","(to) their wives","then","go back","on what","they said","then freeing","(of) a slave","before","before","[that]","they touch each other","That","you are admonished","to it","And Allah","of what","you do","(is) All-Aware","(3)"],"transliterationArr":["wa-alladhīna","yuẓāhirūna","min","nisāihim","thumma","yaʿūdūna","limā","qālū","fataḥrīru","raqabatin","min","qabli","an","yatamāssā","dhālikum","tūʿaẓūna","bihi","wal-lahu","bimā","taʿmalūna","khabīrun",null],"verseTiming":[[1,0,1539],[2,1539,2704],[3,2704,3546],[4,3546,6237],[5,6237,7339],[6,7339,8468],[7,8468,8992],[8,8992,9908],[9,9908,10848],[10,10848,11941],[11,11941,13158],[12,13158,14440],[13,14440,15777],[14,15777,16562],[15,16562,17725],[16,17725,21755],[17,21755,23138],[18,23138,24407],[19,24407,24969],[20,24969,26226],[21,26226,26885],[22,26885,28004],[23,28004,30273]]}},{"name":"58:4","price":"ہاں جو شخص نہ پائے اس کے ذمہ دو مہینوں کے لگاتار روزے ہیں اس سے پہلے کہ ایک دوسرے کو ہاتھ لگائیں اور جس شخص کو یہ طاقت بھی نہ ہو اس پر ساٹھ مسکینوں کا کھانا کھلانا ہے۔ یہ اس لیے کہ تم اللہ کی اور اس کے رسول کی حکم برداری کرو، یہ اللہ تعالیٰ کی مقرر کرده حدیں ہیں اور کفار ہی کے لیے درد ناک عذاب ہے.","arabic":"فَمَن لَّمۡ يَجِدۡ فَصِيَامُ شَهۡرَيۡنِ مُتَتَابِعَيۡنِ مِن قَبۡلِ أَن يَتَمَآسَّاۖ فَمَن لَّمۡ يَسۡتَطِعۡ فَإِطۡعَامُ سِتِّينَ مِسۡكِينٗاۚ ذَٰلِكَ لِتُؤۡمِنُواْ بِٱللَّهِ وَرَسُولِهِۦۚ وَتِلۡكَ حُدُودُ ٱللَّهِۗ وَلِلۡكَٰفِرِينَ عَذَابٌ أَلِيمٌ","category":["58 (Al-Mujadila)","Al-Mujadila","Surah Al-Mujadila"],"ayahNumber":5108,"juzNumber":28,"footnotes":"","lang":"ur","meta":{"transliteration":"faman lam yajid faṣiyāmu shahrayni mutatābiʿayni min qabli an yatamāssā faman lam yastaṭiʿ fa-iṭ'ʿāmu sittīna mis'kīnan dhālika litu'minū bil-lahi warasūlihi watil'ka ḥudūdu al-lahi walil'kāfirīna ʿadhābun alīmun ","translations":["Then whoever","(does) not","find","then fasting","(for) two months","consecutively","before","before","[that]","they both touch each other","But (he) who","not","is able","then (the) feeding","(of) sixty","needy one(s)","That ","so that you may believe","in Allah","and His Messenger","and these","(are the) limits","(of) Allah","and for the disbelievers","(is) a punishment","painful","(4)"],"transliterationArr":["faman","lam","yajid","faṣiyāmu","shahrayni","mutatābiʿayni","min","qabli","an","yatamāssā","faman","lam","yastaṭiʿ","fa-iṭ'ʿāmu","sittīna","mis'kīnan","dhālika","litu'minū","bil-lahi","warasūlihi","watil'ka","ḥudūdu","al-lahi","walil'kāfirīna","ʿadhābun","alīmun",null],"verseTiming":[[1,0,380],[2,380,940],[3,940,1540],[4,1540,2480],[5,2480,3440],[6,3440,5010],[7,5010,5930],[8,5930,6580],[9,6580,7620],[10,7620,11895],[11,11895,12639],[12,12639,13114],[13,13114,14000],[14,14000,15224],[15,15224,16105],[16,16105,17710],[17,17710,18320],[18,18320,19460],[19,19460,20430],[20,20430,21980],[21,21980,22720],[22,22720,23550],[23,23550,25640],[24,25640,27290],[25,27290,28290],[26,28290,30665]]}},{"name":"58:5","price":"بیشک جو لوگ اللہ اور اس کے رسول کی مخالفت کرتے ہیں وه ذلیل کیے جائیں(1) گے جیسے ان سے پہلے کے لوگ ذلیل کیے گئے تھے(2)، اور بیشک ہم واضح آیتیں اتار چکے ہیں اور کافروں کے لیے تو ذلت واﻻ عذاب ہے.","arabic":"إِنَّ ٱلَّذِينَ يُحَآدُّونَ ٱللَّهَ وَرَسُولَهُۥ كُبِتُواْ كَمَا كُبِتَ ٱلَّذِينَ مِن قَبۡلِهِمۡۚ وَقَدۡ أَنزَلۡنَآ ءَايَٰتِۭ بَيِّنَٰتٖۚ وَلِلۡكَٰفِرِينَ عَذَابٞ مُّهِينٞ","category":["58 (Al-Mujadila)","Al-Mujadila","Surah Al-Mujadila"],"ayahNumber":5109,"juzNumber":28,"footnotes":"(1) كُبِتُوا ، ماضی مجہول کا صیغہ ہے، مستقبل میں ہونے والے واقعے کو ماضی سے تعبیر کرکے واضح کر دیا کہ اس کا وقوع اور تحقق اسی طرح یقینی ہے جیسے کہ وہ ہوچکا ہے۔ چنانچہ ایسا ہی ہوا کہ یہ مشرکین مکہ بدر والے دن ذلیل کیے گئے، کچھ مارے گئے، کچھ قیدی ہوگئے اور مسلمان ان پر غالب رہے۔ مسلمانوں کا غلبہ بھی ان کے حق میں نہایت ذلت تھا۔\n(2) اس سے مراد گزشتہ امتیں ہیں جو اسی مخالفت کی وجہ سے ہلاک ہوئیں۔","lang":"ur","meta":{"transliteration":"inna alladhīna yuḥāddūna al-laha warasūlahu kubitū kamā kubita alladhīna min qablihim waqad anzalnā āyātin bayyinātin walil'kāfirīna ʿadhābun muhīnun ","translations":["Indeed","those who","oppose","Allah","and His Messenger","(will) be disgraced","as","were disgraced","those","before them","before them","And certainly","We have sent down","Verses","clear","And for the disbelievers","(is) a punishment","humiliating","(5)"],"transliterationArr":["inna","alladhīna","yuḥāddūna","al-laha","warasūlahu","kubitū","kamā","kubita","alladhīna","min","qablihim","waqad","anzalnā","āyātin","bayyinātin","walil'kāfirīna","ʿadhābun","muhīnun",null],"verseTiming":[[1,0,1320],[2,1320,2240],[3,2240,6500],[4,6500,7380],[5,7380,8610],[6,8610,9380],[7,9380,9950],[8,9950,10530],[9,10530,11500],[10,11500,12640],[11,12640,14050],[12,14050,14570],[13,14570,17760],[14,17760,19240],[15,19240,21340],[16,21340,22960],[17,22960,23720],[18,23720,26995]]}},{"name":"58:6","price":"جس دن اللہ تعالیٰ ان سب کو اٹھائے گا پھر انہیں ان کے کیے ہوئے عمل سے آگاه کرے گا، جسے اللہ نے شمار رکھا ہے اور جسے یہ بھول گئے تھے(1) ، اور اللہ تعالیٰ ہر چیز سے واقف ہے.(2)","arabic":"يَوۡمَ يَبۡعَثُهُمُ ٱللَّهُ جَمِيعٗا فَيُنَبِّئُهُم بِمَا عَمِلُوٓاْۚ أَحۡصَىٰهُ ٱللَّهُ وَنَسُوهُۚ وَٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ شَهِيدٌ","category":["58 (Al-Mujadila)","Al-Mujadila","Surah Al-Mujadila"],"ayahNumber":5110,"juzNumber":28,"footnotes":"(1) یہ ذہنوں میں پیدا ہونے والے اشکال کا جواب ہے کہ گناہوں کی اتنی کثرت اور ان کا اتنا تنوع ہے کہ ان کا احصا بظاہر ناممکن ہے۔ اللہ تعالیٰ نے فرمایا تمہارے لیے یقیناً ناممکن ہے بلکہ تمہیں تو خود اپنے کئے ہوئے سارے کام بھی یاد نہیں ہوں گے لیکن اللہ کے لیے یہ کوئی مشکل نہیں، اس نے ایک ایک کا عمل محفوظ کیا ہوا ہے۔\n(2) اس پر کوئی چیز مخفی نہیں۔ آگے اس کی مزید تاکید ہے کہ وہ ہر چیز کو جانتا ہے۔","lang":"ur","meta":{"transliteration":"yawma yabʿathuhumu al-lahu jamīʿan fayunabbi-uhum bimā ʿamilū aḥṣāhu al-lahu wanasūhu wal-lahu ʿalā kulli shayin shahīdun ","translations":["(On the) Day","(when) Allah will raise them","(when) Allah will raise them","all","and inform them","of what","they did","Allah has recorded it","Allah has recorded it","while they forgot it","And Allah","(is) over","all","things","a Witness","(6)"],"transliterationArr":["yawma","yabʿathuhumu","al-lahu","jamīʿan","fayunabbi-uhum","bimā","ʿamilū","aḥṣāhu","al-lahu","wanasūhu","wal-lahu","ʿalā","kulli","shayin","shahīdun",null],"verseTiming":[[1,0,630],[2,630,1770],[3,1770,2590],[4,2590,4490],[5,4490,6780],[6,6780,7370],[7,7370,8390],[8,8390,9850],[9,9850,10700],[10,10700,13370],[11,13370,14280],[12,14280,14860],[13,14860,15440],[14,15440,16880],[15,16880,19585]]}},{"name":"58:7","price":"کیا تو نے نہیں دیکھا کہ اللہ آسمانوں کی اور زمین کی ہر چیز سے واقف ہے۔ تین آدمیوں کی سرگوشی نہیں ہوتی مگر اللہ ان کا چوتھا ہوتا ہے اور نہ پانچ کی مگر ان کا چھٹا وه ہوتا ہے اور نہ اس سے کم کی اور نہ زیاده کی مگر وه ساتھ ہی ہوتا ہے(1) جہاں بھی وه ہوں(2)، پھر قیامت کے دن انہیں ان کے اعمال سے آگاه کرے گا(3) بیشک اللہ تعالیٰ ہر چیز سے واقف ہے.","arabic":"أَلَمۡ تَرَ أَنَّ ٱللَّهَ يَعۡلَمُ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۖ مَا يَكُونُ مِن نَّجۡوَىٰ ثَلَٰثَةٍ إِلَّا هُوَ رَابِعُهُمۡ وَلَا خَمۡسَةٍ إِلَّا هُوَ سَادِسُهُمۡ وَلَآ أَدۡنَىٰ مِن ذَٰلِكَ وَلَآ أَكۡثَرَ إِلَّا هُوَ مَعَهُمۡ أَيۡنَ مَا كَانُواْۖ ثُمَّ يُنَبِّئُهُم بِمَا عَمِلُواْ يَوۡمَ ٱلۡقِيَٰمَةِۚ إِنَّ ٱللَّهَ بِكُلِّ شَيۡءٍ عَلِيمٌ","category":["58 (Al-Mujadila)","Al-Mujadila","Surah Al-Mujadila"],"ayahNumber":5111,"juzNumber":28,"footnotes":"(1) یعنی مذکورہ تعداد کا خصوصی طور پر ذکر اس لیے نہیں ہے کہ وہ اس سے کم یا اس سے زیادہ تعداد کے درمیان ہونے والی گفتگو سے بےخبر رہتا ہے بلکہ یہ تعداد بطور مثال ہے، مقصد یہ بتلانا ہے کہ تعداد تھوڑی ہو یا زیادہ۔ وہ ہر ایک کےساتھ ہے اور ہر ظاہر اور پوشیدہ بات کو جانتا ہے۔\n(2) خلوت میں ہوں یا جلوت میں، شہروں میں ہوں یا جنگل صحراؤں میں، آبادیوں میں ہوں یا بےآباد پہاڑوں بیابانوں اور غاروں میں، جہاں بھی وہ ہوں، اس سے چھپے نہیں رہ سکتے۔\n(3) یعنی اس کے مطابق ہر ایک کو جزا دے گا۔ نیک کو اس کی نیکیوں کی جزا اور بد کو اس کی بدیوں کی سزا۔","lang":"ur","meta":{"transliteration":"alam tara anna al-laha yaʿlamu mā fī al-samāwāti wamā fī al-arḍi mā yakūnu min najwā thalāthatin illā huwa rābiʿuhum walā khamsatin illā huwa sādisuhum walā adnā min dhālika walā akthara illā huwa maʿahum ayna mā kānū thumma yunabbi-uhum bimā ʿamilū yawma al-qiyāmati inna al-laha bikulli shayin ʿalīmun ","translations":["Do not","you see","that","Allah","knows","whatever","(is) in","the heavens","and whatever","(is) in","the earth","Not","there is","any","secret counsel","(of) three","but","He (is)","(the) fourth of them","and not","five","but","He (is)","(the) sixth of them","and not","less","than","that","and not","more","but","He","(is) with them","wherever","wherever","they are","Then","He will inform them","of what","they did","(on the) Day","(of) the Resurrection","Indeed","Allah","of every","thing","(is) All-Knower","(7)"],"transliterationArr":["alam","tara","anna","al-laha","yaʿlamu","mā","fī","al-samāwāti","wamā","fī","al-arḍi","mā","yakūnu","min","najwā","thalāthatin","illā","huwa","rābiʿuhum","walā","khamsatin","illā","huwa","sādisuhum","walā","adnā","min","dhālika","walā","akthara","illā","huwa","maʿahum","ayna","mā","kānū","thumma","yunabbi-uhum","bimā","ʿamilū","yawma","al-qiyāmati","inna","al-laha","bikulli","shayin","ʿalīmun",null],"verseTiming":[[1,0,590],[2,590,1040],[3,1040,2260],[4,2260,3110],[5,3110,3920],[6,3920,4280],[7,4280,4490],[8,4490,5920],[9,5920,6520],[10,6520,6740],[11,6740,7480],[12,7480,8130],[13,8130,9150],[14,9150,9470],[15,9470,10870],[16,10870,12180],[17,12180,12960],[18,12960,13200],[19,13200,14610],[20,14610,15140],[21,15140,16220],[22,16220,17070],[23,17070,17390],[24,17390,18710],[25,18710,20880],[26,20880,21680],[27,21680,22860],[28,22860,23680],[29,23680,25410],[30,25410,26200],[31,26200,27020],[32,27020,27390],[33,27390,28210],[34,28210,28840],[35,28840,28970],[36,28970,29690],[37,29690,31850],[38,31850,33920],[39,33920,34440],[40,34440,35220],[41,35220,35820],[42,35820,37600],[43,37600,38680],[44,38680,39580],[45,39580,40340],[46,40340,41270],[47,41270,43525]]}},{"name":"58:8","price":"کیا تو نے ان لوگوں کو نہیں دیکھا؟ جنہیں کانا پھوسی سے روک دیا گیا تھا وه پھر بھی اس روکے ہوئے کام کو دوباره کرتے ہیں(1) اور آپس میں گناه کی اور ﻇلم وزیادتی کی اور نافرمانیٴ پیغمبر کی سرگوشیاں کرتے ہیں(2)، اور جب تیرے پاس آتے ہیں تو تجھے ان لفظوں میں سلام کرتے ہیں جن لفظوں میں اللہ تعالیٰ نے نہیں کہا(3) اور اپنے دل میں کہتے ہیں کہ اللہ تعالیٰ ہمیں اس پر جو ہم کہتے ہیں سزا کیوں نہیں دیتا(4)، ان کے لیے جہنم کافی (سزا) ہے جس میں یہ جائیں گے(5)، سو وه برا ٹھکانا ہے.","arabic":"أَلَمۡ تَرَ إِلَى ٱلَّذِينَ نُهُواْ عَنِ ٱلنَّجۡوَىٰ ثُمَّ يَعُودُونَ لِمَا نُهُواْ عَنۡهُ وَيَتَنَٰجَوۡنَ بِٱلۡإِثۡمِ وَٱلۡعُدۡوَٰنِ وَمَعۡصِيَتِ ٱلرَّسُولِۖ وَإِذَا جَآءُوكَ حَيَّوۡكَ بِمَا لَمۡ يُحَيِّكَ بِهِ ٱللَّهُ وَيَقُولُونَ فِيٓ أَنفُسِهِمۡ لَوۡلَا يُعَذِّبُنَا ٱللَّهُ بِمَا نَقُولُۚ حَسۡبُهُمۡ جَهَنَّمُ يَصۡلَوۡنَهَاۖ فَبِئۡسَ ٱلۡمَصِيرُ","category":["58 (Al-Mujadila)","Al-Mujadila","Surah Al-Mujadila"],"ayahNumber":5112,"juzNumber":28,"footnotes":"(1) اس سے مدینے کے یہودی اور منافقین مراد ہیں۔ جب مسلمان ان کے پاس سے گزرتے تو یہ باہم سر جوڑ کر اس طرح سرگوشیاں اور کانا پھوسی کرتے کہ مسلمان یہ سمجھتے کہ شاید ان کے خلاف یہ کوئی سازش کررہے ہیں، یا مسلمانوں کے کسی لشکر پر دشمن نے حملہ کرکے انہیں نقصان پہنچایا ہے، جس کی خبر ان کے پاس پہنچ گئی ہے۔ مسلمان ان چیزوں سے خوف زدہ ہو جاتے۔ چنانچہ نبی (صلى الله عليه وسلم) نے اس طرح سرگوشیاں کرنے سے منع فرما دیا۔ لیکن کچھ ہی عرصے کے بعد انہوں نے پھر یہ مذموم سلسلہ شروع کر دیا۔ آیت میں ان کے اسی کردار کو بیان کیا جارہا ہے۔\n(2) یعنی ان کی سرگوشیاں نیکی اور تقویٰ کی باتوں میں نہیں ہوتیں، بلکہ گناہ، زیادتی اور معصیت رسول (صلى الله عليه وسلم) پر مبنی ہوتی ہیں مثلاً کسی کی غیبت ، الزام تراشی ، بے ہودہ گوئی ، ایک دوسرے کو رسول (صلى الله عليه وسلم) کی نافرمانی پر اکسانا وغیرہ۔\n(3) یعنی اللہ نے تو سلام کا طریقہ یہ بتلایا کہ تم السَّلامُ عَلَيْكُمْ وَرَحْمَةُ اللهِ ، کہو لیکن یہ یہودی نبی (صلى الله عليه وسلم) کی خدمت میں حاضر ہوتے تو اس کے بجائے کہتے السَّامُ عَلَيْكُمْ یا عَلَيْكَ (تم پر موت وارد ہو) اس لیے رسول اللہ (صلى الله عليه وسلم) ان کے جواب میں صرف یہ فرمایا کرتے تھے۔ وَعَلَيْكُمْ یا وَعَلَيْكَ (اور تم پر ہی ہو) اور مسلمانوں کو بھی آپ (صلى الله عليه وسلم) نے تاکید فرمائی کہ جب کوئی اہل کتاب تمہیں سلام کرے تو تم جواب میں ”عَلَيْكَ“ کہا کرو یعنی عَلَيْكَ مَا قُلْتَ (تو نے جو کہا ہے ، وہ تجھ پر ہی وارد ہو) (صحيح بخاري ومسلم ، كتاب الأدب ، باب لم يكن النبي صلى الله عليه وسلم فاحشا ولا متفحشا)۔\n(4) یعنی وہ آپس میں یا اپنے دلوں میں کہتے کہ اگر یہ سچا نبی ہوتا تو اللہ تعالیٰ یقیناً ہماری اس قبیح حرکت پر ہماری گرفت ضرور فرماتا۔\n(5) اللہ نے فرمایا کہ اگر اللہ نے اپنی مشیت اور حکمت بالغہ کے تحت دنیا میں ان کو فوری گرفت نہیں فرمائی تو کیا وہ آخرت میں جہنم کے عذاب سے بھی بچ جائیں گے؟ نہیں یقیناً نہیں۔ جہنم ان کی منتظر ہے جس میں وہ داخل ہوں گے۔","lang":"ur","meta":{"transliteration":"alam tara ilā alladhīna nuhū ʿani al-najwā thumma yaʿūdūna limā nuhū ʿanhu wayatanājawna bil-ith'mi wal-ʿud'wāni wamaʿṣiyati al-rasūli wa-idhā jāūka ḥayyawka bimā lam yuḥayyika bihi al-lahu wayaqūlūna fī anfusihim lawlā yuʿadhibunā al-lahu bimā naqūlu ḥasbuhum jahannamu yaṣlawnahā fabi'sa al-maṣīru ","translations":["Do not","you see","[to]","those who","were forbidden","from","secret counsels","then","they return","to what","they were forbidden","from [it]","and they hold secret counsels","for sin","and aggression","and disobedience","(to) the Messenger","And when","they come to you","they greet you","with what","not","greets you","therewith","Allah","and they say","among","themselves","Why (does) not","Allah punish us","Allah punish us","for what","we say","Sufficient (for) them","(is) Hell","they will burn in it","and worst is","the destination","(8)"],"transliterationArr":["alam","tara","ilā","alladhīna","nuhū","ʿani","al-najwā","thumma","yaʿūdūna","limā","nuhū","ʿanhu","wayatanājawna","bil-ith'mi","wal-ʿud'wāni","wamaʿṣiyati","al-rasūli","wa-idhā","jāūka","ḥayyawka","bimā","lam","yuḥayyika","bihi","al-lahu","wayaqūlūna","fī","anfusihim","lawlā","yuʿadhibunā","al-lahu","bimā","naqūlu","ḥasbuhum","jahannamu","yaṣlawnahā","fabi'sa","al-maṣīru",null],"verseTiming":[[1,0,610],[2,610,1040],[3,1040,1380],[4,1380,2370],[5,2370,2970],[6,2970,3390],[7,3390,4940],[8,4940,6030],[9,6030,7320],[10,7320,7960],[11,7960,8570],[12,8570,9300],[13,9300,10820],[14,10820,11920],[15,11920,13280],[16,13280,14500],[17,14500,15560],[18,15560,16380],[19,16380,18819],[20,18819,19859],[21,19859,20519],[22,20519,20899],[23,20899,21929],[24,21929,22409],[25,22409,23249],[26,23249,26149],[27,26149,27549],[28,27549,29389],[29,29389,31289],[30,31289,32089],[31,32089,33319],[32,33319,34219],[33,34219,34799],[34,34799,36999],[35,36999,38469],[36,38469,40169],[37,40169,41609],[38,41609,42409],[39,42409,43394]]}},{"name":"58:9","price":"اے ایمان والو! تم جب سرگوشی کرو تو یہ سرگوشیاں گناه اور ﻇلم (زیادتی) اور نافرمانیٴ پیغمبر کی نہ ہوں(1) ، بلکہ نیکی اور پرہیزگاری کی باتوں پر سرگوشی کرو(2) اور اس اللہ سے ڈرتے رہو جس کے پاس تم سب جمع کیے جاؤ گے.","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا تَنَٰجَيۡتُمۡ فَلَا تَتَنَٰجَوۡاْ بِٱلۡإِثۡمِ وَٱلۡعُدۡوَٰنِ وَمَعۡصِيَتِ ٱلرَّسُولِ وَتَنَٰجَوۡاْ بِٱلۡبِرِّ وَٱلتَّقۡوَىٰۖ وَٱتَّقُواْ ٱللَّهَ ٱلَّذِيٓ إِلَيۡهِ تُحۡشَرُونَ","category":["58 (Al-Mujadila)","Al-Mujadila","Surah Al-Mujadila"],"ayahNumber":5113,"juzNumber":28,"footnotes":"(1) جس طرح یہود اور منافقین کا شیوہ ہے۔ یہ گویا اہل ایمان کو تربیت اور کردار سازی کے لیے کہا جارہا ہے۔ کہ اگر تم اپنے دعوائے ایمان میں سچے ہو تو تمہاری سرگوشیاں یہود اور اہل نفاق کی طرح اثم وعدوان پر نہیں ہونی چاہیں۔\n(2) یعنی جس میں خیر ہی خیر ہو اور جو اللہ اور اس کے رسول (صلى الله عليه وسلم) کی اطاعت پر مبنی ہو۔ کیونکہ یہی نیکی اور تقویٰ ہے۔","lang":"ur","meta":{"transliteration":"yāayyuhā alladhīna āmanū idhā tanājaytum falā tatanājaw bil-ith'mi wal-ʿud'wāni wamaʿṣiyati al-rasūli watanājaw bil-biri wal-taqwā wa-ittaqū al-laha alladhī ilayhi tuḥ'sharūna ","translations":["O you who believe","O you who believe","O you who believe","When","you hold secret counsel","then (do) not","hold secret counsel","for sin","and aggression","and disobedience","(to) the Messenger","but hold secret counsel","for righteousness","and piety","And fear","Allah","the One Who","to Him","you will be gathered","(9)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","idhā","tanājaytum","falā","tatanājaw","bil-ith'mi","wal-ʿud'wāni","wamaʿṣiyati","al-rasūli","watanājaw","bil-biri","wal-taqwā","wa-ittaqū","al-laha","alladhī","ilayhi","tuḥ'sharūna",null],"verseTiming":[[1,0,4352],[2,4352,5448],[3,5448,7790],[4,7790,8295],[5,8295,9543],[6,9543,10276],[7,10276,11473],[8,11473,12521],[9,12521,13863],[10,13863,14984],[11,14984,16066],[12,16066,17304],[13,17304,18366],[14,18366,19764],[15,19764,20950],[16,20950,21400],[17,21400,23318],[18,23318,23862],[19,23862,26415]]}},{"name":"58:10","price":"(بری) سرگوشیاں، پس شیطانی کام ہے جس سے ایمان داروں کو رنج پہنچے(1) ۔ گو اللہ تعالیٰ کی اجازت کے بغیر وه انہیں کوئی نقصان نہیں پہنچا سکتا۔ اور ایمان والوں کو چاہئے کہ اللہ ہی پر بھروسہ رکھیں.(2)","arabic":"إِنَّمَا ٱلنَّجۡوَىٰ مِنَ ٱلشَّيۡطَٰنِ لِيَحۡزُنَ ٱلَّذِينَ ءَامَنُواْ وَلَيۡسَ بِضَآرِّهِمۡ شَيۡـًٔا إِلَّا بِإِذۡنِ ٱللَّهِۚ وَعَلَى ٱللَّهِ فَلۡيَتَوَكَّلِ ٱلۡمُؤۡمِنُونَ","category":["58 (Al-Mujadila)","Al-Mujadila","Surah Al-Mujadila"],"ayahNumber":5114,"juzNumber":28,"footnotes":"- یعنی اثم وعدوان اور معصیت رسول (صلى الله عليه وسلم) پر مبنی سرگوشیاں یہ شیطانی کام ہیں، کیونکہ شیطان ہی ان پر آمادہ کرتا ہے، تاکہ وہ اس کے ذریعے سے مومنوں کو غم وحزن میں مبتلا کرے۔\n(2) لیکن یہ سرگوشیاں اور شیطانی حرکتیں، مومنوں کو کچھ نقصان نہیں پہنچا سکتیں الایہ کہ اللہ کی مشیت ہو اس لیے تم اپنے دشمنوں کی ان اوچھی حرکتوں سے پریشان نہ ہوا کرو۔ بلکہ اللہ پر بھروسہ رکھو، اس لیے کہ تمام معاملات کا اختیار اسی کے ہاتھ میں ہے اور وہی ہر چیز پر قادر ہے، نہ کہ یہود اور منافقین، جو تمہیں تباہ وبرباد کرنا چاہتے ہیں۔ سرگوشی کے سلسلے میں ہی مسلمانوں کو ایک اخلاقی ہدایت یہ دی گئی ہے کہ جب تم تین آدمی اکٹھے ہو، تو اپنے میں سے ایک کو چھوڑ کر دو آدمی آپس میں سرگوشی نہ کریں، کیونکہ یہ طریقہ اس ایک آدمی کو غم میں ڈال دے گا۔ (صحيح بخاري ، كتاب الاستئذان ، باب إذا كانوا أكثر من ثلاثة فلا بأس بالمسارة والمناجاة ، وصحيح مسلم كتاب السلام ، باب تحريم مناجاة الاثنين دون الثالث بغير رضاه) البتہ اس کی رضامندی اور اجازت سے ایسا کرنا جائز ہے۔ کیونکہ اس صورت میں دو آدمیوں کا سرگوشی کرنا، کسی کے لیے تشویش کا باعث نہیں ہوگا۔","lang":"ur","meta":{"transliteration":"innamā al-najwā mina al-shayṭāni liyaḥzuna alladhīna āmanū walaysa biḍārrihim shayan illā bi-idh'ni al-lahi waʿalā al-lahi falyatawakkali al-mu'minūna ","translations":["Only","the secret counsels","(are) from","the Shaitaan","that he may grieve","those who","believe","but not","he (can) harm them","(in) anything","except","by Allah's permission","by Allah's permission","And upon","Allah","let put (their) trust","the believers","(10)"],"transliterationArr":["innamā","al-najwā","mina","al-shayṭāni","liyaḥzuna","alladhīna","āmanū","walaysa","biḍārrihim","shayan","illā","bi-idh'ni","al-lahi","waʿalā","al-lahi","falyatawakkali","al-mu'minūna",null],"verseTiming":[[1,0,1410],[2,1410,3010],[3,3010,3330],[4,3330,4610],[5,4610,5480],[6,5480,6540],[7,6540,7660],[8,7660,8410],[9,8410,12390],[10,12390,13220],[11,13220,13960],[12,13960,14810],[13,14810,16770],[14,16770,17830],[15,17830,18620],[16,18620,20170],[17,20170,23175]]}},{"name":"58:11","price":"اے مسلمانو! جب تم سے کہا جائے کہ مجلسوں میں ذرا کشادگی پیدا کرو تو تم جگہ کشاده کر دو(1) اللہ تمہیں کشادگی دے گا(2)، اور جب کہا جائے کہ اٹھ کھڑے ہو جاؤ(3) تو تم اٹھ کھڑے ہو جاؤ اللہ تعالیٰ تم میں سے ان لوگوں کے جو ایمان ﻻئے ہیں اور جو علم دیئے گئے ہیں درجے بلند کر دے گا(4)، اور اللہ تعالیٰ (ہر اس کام سے) جو تم کر رہے ہو (خوب) خبردار ہے.","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا قِيلَ لَكُمۡ تَفَسَّحُواْ فِي ٱلۡمَجَٰلِسِ فَٱفۡسَحُواْ يَفۡسَحِ ٱللَّهُ لَكُمۡۖ وَإِذَا قِيلَ ٱنشُزُواْ فَٱنشُزُواْ يَرۡفَعِ ٱللَّهُ ٱلَّذِينَ ءَامَنُواْ مِنكُمۡ وَٱلَّذِينَ أُوتُواْ ٱلۡعِلۡمَ دَرَجَٰتٖۚ وَٱللَّهُ بِمَا تَعۡمَلُونَ خَبِيرٞ","category":["58 (Al-Mujadila)","Al-Mujadila","Surah Al-Mujadila"],"ayahNumber":5115,"juzNumber":28,"footnotes":"(1) اس میں مسلمانوں کو مجلس کے آداب بتلائے جارہے ہیں۔ مجلس کا لفظ عام ہے، جو ہر اس مجلس کو شامل ہے، جس میں مسلمان خیر اور اجر کے حصول کے لیے جمع ہوں، وعظ ونصیحت کی مجلس ہو یا جمعہ کی مجلس ہو۔ (تفسیر القرطبی) (کھل کر بیٹھو) کا مطلب ہے کہ مجلس کا دائرہ وسیع رکھو تاکہ بعد میں آنے والوں کے لیے بیٹھنے کی جگہ رہے۔ دائرہ تنگ مت رکھو کہ بعد میں آنے والے کو کھڑا رہنا پڑے یا کسی بیٹھے ہوئے کو اٹھاکر اس کی جگہ وہ بیٹھے کہ یہ دونوں باتیں ناشائستہ ہیں۔ چنانچہ نبی (صلى الله عليه وسلم) نے بھی فرمایا ”کوئی شخص، کسی دوسرے شخص کو اس کی جگہ سے اٹھا کر خود نہ بیٹھے، اس لیے مجلس کے دائرے کو فراخ اور وسیع کر لو“۔ (صحيح بخاري، كتاب الجمعة ، باب لا يقيم الرجل أخاه يوم الجمعة ويقعد في مكانه ، وصحيح مسلم ، كتاب السلام ، باب تحريم إقامة الإنسان من موضعه المباح الذي سبق إليه)۔\n(2) یعنی اس کے صلے میں اللہ تعالیٰ تمہیں جنت میں وسعت وفراخی عطا فرمائے گا یا جہاں بھی تم وسعت وفراخی کے طالب ہوگے ، مثلاً مکان میں، رزق میں، قبر میں۔ ہر جگہ تمہیں فراخی عطا فرمائے گا۔\n(3) یعنی جہاد کے لیے، نماز کے لیے یا کسی بھی عمل خیر کے لیے۔ یا مطلب ہے کہ جب مجلس سے اٹھ کر جانے کو کہا جائے، تو فوراً چلے جاؤ۔ مسلمانوں کو یہ حکم اس لیے دیا گیا کہ صحابہ کرام (رضي الله عنهم) نبی (صلى الله عليه وسلم) کی مجلس سے اٹھ کر جانا پسند نہیں کرتے تھے لیکن اس طرح بعض دفعہ ان لوگوں کو تکلیف ہوتی تھی جو نبی (صلى الله عليه وسلم) سے خلوت میں کوئی گفتگو کرنا چاہتے تھے۔\n(4) یعنی اہل ایمان کے درجے، غیر اہل ایمان پر اور اہل علم کے درجے اہل ایمان پر بلند فرمائے گا۔ جس کا مطلب یہ ہوا کہ ایمان کے ساتھ علوم دین سے واقفیت مزید رفع درجات کا باعث ہے۔","lang":"ur","meta":{"transliteration":"yāayyuhā alladhīna āmanū idhā qīla lakum tafassaḥū fī al-majālisi fa-if'saḥū yafsaḥi al-lahu lakum wa-idhā qīla unshuzū fa-unshuzū yarfaʿi al-lahu alladhīna āmanū minkum wa-alladhīna ūtū al-ʿil'ma darajātin wal-lahu bimā taʿmalūna khabīrun ","translations":["O you who believe","O you who believe","O you who believe","When","it is said","to you","Make room","in","the assemblies","then make room","Allah will make room","Allah will make room","for you","And when","it is said","Rise up","then rise up","Allah will raise","Allah will raise","those who","believe","among you","and those who","were given","the knowledge","(in) degrees","And Allah","of what","you do","(is) All-Aware","(11)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","idhā","qīla","lakum","tafassaḥū","fī","al-majālisi","fa-if'saḥū","yafsaḥi","al-lahu","lakum","wa-idhā","qīla","unshuzū","fa-unshuzū","yarfaʿi","al-lahu","alladhīna","āmanū","minkum","wa-alladhīna","ūtū","al-ʿil'ma","darajātin","wal-lahu","bimā","taʿmalūna","khabīrun",null],"verseTiming":[[1,0,2770],[2,2770,3760],[3,3760,6100],[4,6100,6670],[5,6670,7310],[6,7310,7870],[7,7870,9020],[8,9020,9270],[9,9270,10430],[10,10430,11390],[11,11390,12200],[12,12200,12940],[13,12940,14080],[14,14080,14770],[15,14770,15370],[16,15370,16710],[17,16710,18220],[18,18220,19050],[19,19050,19820],[20,19820,20870],[21,20870,21820],[22,21820,23130],[23,23130,24330],[24,24330,24850],[25,24850,25580],[26,25580,28710],[27,28710,29710],[28,29710,30240],[29,30240,31430],[30,31430,34525]]}},{"name":"58:12","price":"اے مسلمانو! جب تم رسول ﴿صلی اللہ علیہ وسلم﴾ سے سرگوشی کرنا چاہو تو اپنی سرگوشی سے پہلے کچھ صدقہ دے دیا کرو(1) یہ تمہارے حق میں بہتر اور پاکیزه تر ہے(2)، ہاں اگر نہ پاؤ تو بیشک اللہ تعالیٰ بخشنے واﻻ مہربان ہے.","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا نَٰجَيۡتُمُ ٱلرَّسُولَ فَقَدِّمُواْ بَيۡنَ يَدَيۡ نَجۡوَىٰكُمۡ صَدَقَةٗۚ ذَٰلِكَ خَيۡرٞ لَّكُمۡ وَأَطۡهَرُۚ فَإِن لَّمۡ تَجِدُواْ فَإِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٌ","category":["58 (Al-Mujadila)","Al-Mujadila","Surah Al-Mujadila"],"ayahNumber":5116,"juzNumber":28,"footnotes":"(1) ہر مسلمان نبی سے مناجات اور خلوت میں گفتگو کرنے کی خواہش رکھتا تھا، جس سے نبی (صلى الله عليه وسلم) کو خاصی تکلیف ہوتی۔ بعض کہتے ہیں کہ منافقین یوں ہی بلا وجہ نبی (صلى الله عليه وسلم) سے مناجات میں مصروف رہتے تھے، جس سے مسلمان تکلیف محسوس کرتے تھے ، اس لیے اللہ نے یہ حکم نازل فرما دیا، تاکہ آپ (صلى الله عليه وسلم) سے گفتگو کرنے کے رجحان عام کی حوصلہ شکنی ہو۔\n(2) بہتر اس لیے کہ صدقے سے تمہارے ہی دوسرے غریب مسلمان بھائیوں کو فائدہ ہوگا اور پاکیزہ تر اس لیے کہ یہ ایک عمل صالح اور اطاعت الٰہی ہے جس سے نفوس انسانی کی تطہیر ہوتی ہے۔ اس سے یہ بھی معلوم ہوا کہ یہ امر بطور استحباب کے تھا، وجوب کے لیے نہیں۔","lang":"ur","meta":{"transliteration":"yāayyuhā alladhīna āmanū idhā nājaytumu al-rasūla faqaddimū bayna yaday najwākum ṣadaqatan dhālika khayrun lakum wa-aṭharu fa-in lam tajidū fa-inna al-laha ghafūrun raḥīmun ","translations":["O you who believe","O you who believe","O you who believe","When","you privately consult","the Messenger","then offer","before","before","your private consultation","charity","That","(is) better","for you","and purer","But if","not","you find","then indeed","Allah","(is) Oft-Forgiving","Most Merciful","(12)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","idhā","nājaytumu","al-rasūla","faqaddimū","bayna","yaday","najwākum","ṣadaqatan","dhālika","khayrun","lakum","wa-aṭharu","fa-in","lam","tajidū","fa-inna","al-laha","ghafūrun","raḥīmun",null],"verseTiming":[[1,0,3200],[2,3200,4140],[3,4140,7050],[4,7050,7630],[5,7630,8850],[6,8850,9860],[7,9860,11000],[8,11000,11530],[9,11530,11950],[10,11950,13310],[11,13310,14630],[12,14630,15440],[13,15440,16120],[14,16120,16860],[15,16860,18240],[16,18240,18730],[17,18730,19200],[18,19200,19960],[19,19960,21350],[20,21350,22230],[21,22230,23280],[22,23280,25585]]}},{"name":"58:13","price":"کیا تم اپنی سرگوشی سے پہلے صدقہ نکالنے سے ڈر گئے؟ پس جب تم نے یہ نہ کیا اور اللہ تعالیٰ نے بھی تمہیں معاف فرما دیا(1) تو اب (بخوبی) نمازوں کو قائم رکھو زکوٰة دیتے رہا کرو اور اللہ تعالیٰ کی اور اس کے رسول کی تابعداری کرتے رہو(2)۔ تم جو کچھ کرتے ہو اس (سب) سے اللہ (خوب) خبردار ہے.","arabic":"ءَأَشۡفَقۡتُمۡ أَن تُقَدِّمُواْ بَيۡنَ يَدَيۡ نَجۡوَىٰكُمۡ صَدَقَٰتٖۚ فَإِذۡ لَمۡ تَفۡعَلُواْ وَتَابَ ٱللَّهُ عَلَيۡكُمۡ فَأَقِيمُواْ ٱلصَّلَوٰةَ وَءَاتُواْ ٱلزَّكَوٰةَ وَأَطِيعُواْ ٱللَّهَ وَرَسُولَهُۥۚ وَٱللَّهُ خَبِيرُۢ بِمَا تَعۡمَلُونَ","category":["58 (Al-Mujadila)","Al-Mujadila","Surah Al-Mujadila"],"ayahNumber":5117,"juzNumber":28,"footnotes":"(1) یہ امر گو استحباباً تھا، پھر بھی مسلمانوں کے لیے شاق تھا، اس لیے اللہ تعالیٰ نے جلد ہی اسے منسوخ فرما دیا۔\n(2) یعنی فرائض واحکام کی پابندی، اس صدقے کا بدل بن جائے گی، جسے اللہ نے تمہاری تکلیف کے لیے معاف فرما دیا ہے۔","lang":"ur","meta":{"transliteration":"a-ashfaqtum an tuqaddimū bayna yaday najwākum ṣadaqātin fa-idh lam tafʿalū watāba al-lahu ʿalaykum fa-aqīmū al-ṣalata waātū al-zakata wa-aṭīʿū al-laha warasūlahu wal-lahu khabīrun bimā taʿmalūna ","translations":["Are you afraid","to","offer","before","before","your private consultation","charities","Then when","you do not","you do not","and Allah has forgiven","and Allah has forgiven","you","then establish","the prayer","and give","the zakah","and obey","Allah","and His Messenger","And Allah","(is) All-Aware","of what","you do","(13)"],"transliterationArr":["a-ashfaqtum","an","tuqaddimū","bayna","yaday","najwākum","ṣadaqātin","fa-idh","lam","tafʿalū","watāba","al-lahu","ʿalaykum","fa-aqīmū","al-ṣalata","waātū","al-zakata","wa-aṭīʿū","al-laha","warasūlahu","wal-lahu","khabīrun","bimā","taʿmalūna",null],"verseTiming":[[1,0,1390],[2,1390,2410],[3,2410,3650],[4,3650,4200],[5,4200,4640],[6,4640,5990],[7,5990,8890],[8,8890,9460],[9,9460,9840],[10,9840,10890],[11,10890,11600],[12,11600,12410],[13,12410,13400],[14,13400,14390],[15,14390,15470],[16,15470,16240],[17,16240,17270],[18,17270,18300],[19,18300,19100],[20,19100,20790],[21,20790,21740],[22,21740,23470],[23,23470,24120],[24,24120,26725]]}},{"name":"58:14","price":"کیا تو نے ان لوگوں کو نہیں دیکھا؟ جنہوں نے اس قوم سے دوستی کی جن پر اللہ غضبناک ہوچکا ہے(1) ، نہ یہ (منافق) تمہارے ہی ہیں نہ ان کے ہیں(2) باوجود علم کے پھر بھی جھوٹ پر قسمیں کھا رہے ہیں.(3)","arabic":"۞ أَلَمۡ تَرَ إِلَى ٱلَّذِينَ تَوَلَّوۡاْ قَوۡمًا غَضِبَ ٱللَّهُ عَلَيۡهِم مَّا هُم مِّنكُمۡ وَلَا مِنۡهُمۡ وَيَحۡلِفُونَ عَلَى ٱلۡكَذِبِ وَهُمۡ يَعۡلَمُونَ","category":["58 (Al-Mujadila)","Al-Mujadila","Surah Al-Mujadila"],"ayahNumber":5118,"juzNumber":28,"footnotes":"(1) جن پر اللہ کا غضب نازل ہوا، وہ قرآن کریم کی صراحت کے مطابق یہود ہیں۔ اور ان سے دوستی کرنے والے منافقین ہیں۔ یہ آیات اس وقت نازل ہوئیں، جب مدینے میں منافقین کا بھی زور تھا اور یہودیوں کی سازشیں بھی عروج پر تھیں۔ ابھی یہود کو جلا وطن نہیں کیا گیا تھا۔\n(2) یعنی یہ منافقین مسلمان ہیں اور نہ دین کے لحاظ سے یہودی ہی ہیں۔ پھر یہ کیوں یہودیوں سے دوستی کرتے ہیں؟ صرف اس لیے کہ ان کے اور یہود کے درمیان نبی (صلى الله عليه وسلم) اور اسلام کی عداوت قدر مشترک ہے۔\n(3) یعنی قسمیں کھا کر مسلمانوں کو باور کراتے ہیں کہ ہم بھی تمہاری طرح مسلمان ہیں یا یہودیوں سے ان کے رابطے نہیں ہیں۔","lang":"ur","meta":{"transliteration":"alam tara ilā alladhīna tawallaw qawman ghaḍiba al-lahu ʿalayhim mā hum minkum walā min'hum wayaḥlifūna ʿalā al-kadhibi wahum yaʿlamūna ","translations":["Do not","you see","[to]","those who","take as allies","a people","wrath","(of) Allah","(is) upon them","They (are) not","They (are) not","of you","and not","of them","and they swear","to","the lie","while they","know","(14)"],"transliterationArr":["alam","tara","ilā","alladhīna","tawallaw","qawman","ghaḍiba","al-lahu","ʿalayhim","mā","hum","minkum","walā","min'hum","wayaḥlifūna","ʿalā","al-kadhibi","wahum","yaʿlamūna",null],"verseTiming":[[1,0,630],[2,630,1080],[3,1080,1410],[4,1410,2400],[5,2400,3410],[6,3410,4200],[7,4200,4780],[8,4780,5640],[9,5640,6560],[10,6560,7830],[11,7830,8330],[12,8330,10300],[13,10300,10880],[14,10880,11680],[15,11680,13050],[16,13050,13420],[17,13420,14290],[18,14290,14890],[19,14890,17585]]}},{"name":"58:15","price":"اللہ تعالیٰ نے ان کے لیے سخت عذاب تیار کر رکھا ہے، تحقیق جو کچھ یہ کر رہے ہیں برا کر رہے ہیں.(1)","arabic":"أَعَدَّ ٱللَّهُ لَهُمۡ عَذَابٗا شَدِيدًاۖ إِنَّهُمۡ سَآءَ مَا كَانُواْ يَعۡمَلُونَ","category":["58 (Al-Mujadila)","Al-Mujadila","Surah Al-Mujadila"],"ayahNumber":5119,"juzNumber":28,"footnotes":"(1) یعنی یہودیوں سے دوستانہ تعلق رکھنے اور جھوٹی قسمیں کھانے کی وجہ سے۔","lang":"ur","meta":{"transliteration":"aʿadda al-lahu lahum ʿadhāban shadīdan innahum sāa mā kānū yaʿmalūna ","translations":["Allah has prepared","Allah has prepared","for them","a punishment","severe","Indeed, [they]","evil is","what","they used to","do","(15)"],"transliterationArr":["aʿadda","al-lahu","lahum","ʿadhāban","shadīdan","innahum","sāa","mā","kānū","yaʿmalūna",null],"verseTiming":[[1,0,780],[2,780,1660],[3,1660,2200],[4,2200,3940],[5,3940,5190],[6,5190,7020],[7,7020,9120],[8,9120,9390],[9,9390,10330],[10,10330,12965]]}},{"name":"58:16","price":"ان لوگوں نے تو اپنی قسموں کو ڈھال بنا رکھا ہے(1) اور لوگوں کو اللہ کی راه سے روکتے ہیں(2) ان کے لیے رسوا کرنے واﻻ عذاب ہے.","arabic":"ٱتَّخَذُوٓاْ أَيۡمَٰنَهُمۡ جُنَّةٗ فَصَدُّواْ عَن سَبِيلِ ٱللَّهِ فَلَهُمۡ عَذَابٞ مُّهِينٞ","category":["58 (Al-Mujadila)","Al-Mujadila","Surah Al-Mujadila"],"ayahNumber":5120,"juzNumber":28,"footnotes":"(1) أَيْمَانٌ ، يَمِينٌ کی جمع ہے۔ بمعنی قسم۔ یعنی جس طرح ڈھال سے دشمن کے وار کو روک کر اپنا بچاؤ کر لیا جاتا ہے۔ اسی طرح انہوں نے اپنی قسموں کو مسلمانوں کی تلواروں سے بچنے کے لیے ڈھال بنا رکھا ہے۔\n(2) یعنی جھوٹی قسمیں کھا کر یہ اپنے کو مسلمان ظاہر کرتے ہیں، جس کی وجہ سے بہت سے لوگوں کو ان کے بارے میں حقیقت واقعیہ کا علم نہیں ہوتا اور وہ ان کے غرے میں آکر قبول اسلام سے محروم رہتے ہیں۔ اور یوں یہ لوگوں کو اللہ کے راستے سے روکنے کا جرم بھی کرتے ہیں۔","lang":"ur","meta":{"transliteration":"ittakhadhū aymānahum junnatan faṣaddū ʿan sabīli al-lahi falahum ʿadhābun muhīnun ","translations":["They have taken","their oaths","(as) a cover","so they hinder","from","(the) way of Allah","(the) way of Allah","so for them","(is) a punishment","humiliating","(16)"],"transliterationArr":["ittakhadhū","aymānahum","junnatan","faṣaddū","ʿan","sabīli","al-lahi","falahum","ʿadhābun","muhīnun",null],"verseTiming":[[1,0,2620],[2,2620,4050],[3,4050,6290],[4,6290,7290],[5,7290,8260],[6,8260,9480],[7,9480,10020],[8,10020,10840],[9,10840,11690],[10,11690,14665]]}},{"name":"58:17","price":"ان کے مال اور ان کی اوﻻد اللہ کے ہاں کچھ کام نہ آئیں گی۔ یہ تو جہنمی ہیں ہمیشہ ہی اس میں رہیں گے.","arabic":"لَّن تُغۡنِيَ عَنۡهُمۡ أَمۡوَٰلُهُمۡ وَلَآ أَوۡلَٰدُهُم مِّنَ ٱللَّهِ شَيۡـًٔاۚ أُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلنَّارِۖ هُمۡ فِيهَا خَٰلِدُونَ","category":["58 (Al-Mujadila)","Al-Mujadila","Surah Al-Mujadila"],"ayahNumber":5121,"juzNumber":28,"footnotes":"","lang":"ur","meta":{"transliteration":"lan tugh'niya ʿanhum amwāluhum walā awlāduhum mina al-lahi shayan ulāika aṣḥābu al-nāri hum fīhā khālidūna ","translations":["Never","will avail","them","their wealth","and not","their children","against","Allah","(in) anything","Those","(will be) companions","(of) the Fire","they","in it","will abide forever","(17)"],"transliterationArr":["lan","tugh'niya","ʿanhum","amwāluhum","walā","awlāduhum","mina","al-lahi","shayan","ulāika","aṣḥābu","al-nāri","hum","fīhā","khālidūna",null],"verseTiming":[[1,0,1290],[2,1290,2040],[3,2040,2880],[4,2880,4280],[5,4280,6160],[6,6160,7450],[7,7450,8560],[8,8560,9380],[9,9380,10800],[10,10800,13100],[11,13100,13990],[12,13990,15480],[13,15480,15860],[14,15860,16620],[15,16620,20215]]}},{"name":"58:18","price":"جس دن اللہ تعالیٰ ان سب کو اٹھا کھڑا کرے گا تو یہ جس طرح تمہارے سامنے قسمیں کھاتے ہیں (اللہ تعالیٰ) کے سامنے بھی قسمیں کھانے لگیں گے(1) اور سمجھیں گے کہ وه بھی کسی (دلیل) پر ہیں(2)، یقین مانو کہ بیشک وہی جھوٹے ہیں.","arabic":"يَوۡمَ يَبۡعَثُهُمُ ٱللَّهُ جَمِيعٗا فَيَحۡلِفُونَ لَهُۥ كَمَا يَحۡلِفُونَ لَكُمۡ وَيَحۡسَبُونَ أَنَّهُمۡ عَلَىٰ شَيۡءٍۚ أَلَآ إِنَّهُمۡ هُمُ ٱلۡكَٰذِبُونَ","category":["58 (Al-Mujadila)","Al-Mujadila","Surah Al-Mujadila"],"ayahNumber":5122,"juzNumber":28,"footnotes":"(1) یعنی ان کی بدبختی اور سنگ دلی کی انتہا ہے کہ قیامت والے دن، جہاں کوئی چیز مخفی نہیں رہے گی، وہاں بھی اللہ کے سامنے جھوٹی قسمیں کھانے کی شوخ چشمانہ جسارت کریں گے۔\n(2) یعنی جس طرح دنیا میں وہ وقتی طور پر جھوٹی قسمیں کھا کر کچھ فائدے اٹھا لیتے تھے، وہاں بھی سمجھیں گے کہ یہ جھوٹی قسمیں ان کے لیے مفید رہیں گی۔","lang":"ur","meta":{"transliteration":"yawma yabʿathuhumu al-lahu jamīʿan fayaḥlifūna lahu kamā yaḥlifūna lakum wayaḥsabūna annahum ʿalā shayin alā innahum humu al-kādhibūna ","translations":["(On the) Day","Allah will raise them","Allah will raise them","all","then they will swear","to Him","as","they swear","to you","And they think","that they","(are) on","something","No doubt","Indeed, they","[they]","(are) the liars","(18)"],"transliterationArr":["yawma","yabʿathuhumu","al-lahu","jamīʿan","fayaḥlifūna","lahu","kamā","yaḥlifūna","lakum","wayaḥsabūna","annahum","ʿalā","shayin","alā","innahum","humu","al-kādhibūna",null],"verseTiming":[[1,0,660],[2,660,1860],[3,1860,2670],[4,2670,4290],[5,4290,5690],[6,5690,6280],[7,6280,6950],[8,6950,8090],[9,8090,9340],[10,9340,10610],[11,10610,12450],[12,12450,13090],[13,13090,15360],[14,15360,17790],[15,17790,19350],[16,19350,19770],[17,19770,22855]]}},{"name":"58:19","price":"ان پر شیطان نے غلبہ حاصل کرلیا ہے(1) ، اور انہیں اللہ کا ذکر بھلا دیا ہے(2) یہ شیطانی لشکر ہے۔ کوئی شک نہیں کہ شیطانی لشکر ہی خسارے واﻻ ہے.(3)","arabic":"ٱسۡتَحۡوَذَ عَلَيۡهِمُ ٱلشَّيۡطَٰنُ فَأَنسَىٰهُمۡ ذِكۡرَ ٱللَّهِۚ أُوْلَٰٓئِكَ حِزۡبُ ٱلشَّيۡطَٰنِۚ أَلَآ إِنَّ حِزۡبَ ٱلشَّيۡطَٰنِ هُمُ ٱلۡخَٰسِرُونَ","category":["58 (Al-Mujadila)","Al-Mujadila","Surah Al-Mujadila"],"ayahNumber":5123,"juzNumber":28,"footnotes":"(1) اسْتَحْوَذَ کے معنی ہیں گھیر لیا، احاطہ کر لیا، جمع کر لیا، اسی لیے اس کا ترجمہ غلبہ حاصل کرلیا، کیا جاتا ہے کہ غلبے میں یہ سارے مفہوم آجاتے ہیں۔\n(2) یعنی اس نے جن چیزوں کے کرنے کا حکم دیا ہے، ان سے شیطان نے ان کو غافل کر دیا ہے اور جن چیزوں سے اس نے منع کیا ہے، ان کا وہ ان سے ارتکاب کرواتا ہے، انہیں خوب صورت دکھلا کر، یا مغالطوں میں ڈال کر یا تمناؤں اور آرزوؤں میں مبتلا کرکے۔\n(3) یعنی مکمل خسارہ انہی کے حصے میں آئے گا۔ گویا دوسرے ان کی بہ نسبت خسارے میں ہی نہیں ہیں۔ اس لیے کہ انہوں نے جنت کا سودا گمراہی لے کر کر لیا، اللہ پر جھوٹ بولا اور دنیا وآخرت میں جھوٹی قسمیں کھاتے رہے۔","lang":"ur","meta":{"transliteration":"is'taḥwadha ʿalayhimu al-shayṭānu fa-ansāhum dhik'ra al-lahi ulāika ḥiz'bu al-shayṭāni alā inna ḥiz'ba al-shayṭāni humu al-khāsirūna ","translations":["Has overcome","them","the Shaitaan","so he made them forget","(the) remembrance","(of) Allah","Those","(are the) party","(of) the Shaitaan","No doubt","Indeed","(the) party","(of) the Shaitaan","they","(will be) the losers","(19)"],"transliterationArr":["is'taḥwadha","ʿalayhimu","al-shayṭānu","fa-ansāhum","dhik'ra","al-lahi","ulāika","ḥiz'bu","al-shayṭāni","alā","inna","ḥiz'ba","al-shayṭāni","humu","al-khāsirūna",null],"verseTiming":[[1,0,1180],[2,1180,2180],[3,2180,3440],[4,3440,5690],[5,5690,6170],[6,6170,9080],[7,9080,11920],[8,11920,12500],[9,12500,16190],[10,16190,18119],[11,18119,19189],[12,19189,19789],[13,19789,21019],[14,21019,21409],[15,21409,24604]]}},{"name":"58:20","price":"بیشک اللہ تعالیٰ کی اور اس کے رسول کی جو لوگ مخالفت کرتے ہیں(1) وہی لوگ سب سے زیاده ذلیلوں میں ہیں.(2)","arabic":"إِنَّ ٱلَّذِينَ يُحَآدُّونَ ٱللَّهَ وَرَسُولَهُۥٓ أُوْلَٰٓئِكَ فِي ٱلۡأَذَلِّينَ","category":["58 (Al-Mujadila)","Al-Mujadila","Surah Al-Mujadila"],"ayahNumber":5124,"juzNumber":28,"footnotes":"(1) مُحَادَّةٌ، ایسی شدید مخالفت ، عناد اور جھگڑے کو کہتے ہیں کہ فریقین کا باہم ملنا نہایت مشکل ہو، گویا دونوں دو کناروں (حد) پر ہیں جو ایک دوسرےکے مخالف ہیں۔ اسی سے یہ ممانعت کے مفہوم میں بھی استعمال ہوتا ہے۔ اور اسی لیے دربان اور پہرے دار کو بھی حداد کہا جاتا ہے (فتح القدیر)۔\n(2) یعنی جس طرح گزشتہ امتوں میں سے اللہ اور رسول (صلى الله عليه وسلم) کے مخالفوں کو ذلیل اور تباہ کیا گیا، ان کا شمار بھی انہیں اہل ذلت میں ہوگا اور ان کے حصے میں بھی دنیا وآخرت کی ذلت ورسوائی کے سوا کچھ نہیں آئے گا۔","lang":"ur","meta":{"transliteration":"inna alladhīna yuḥāddūna al-laha warasūlahu ulāika fī al-adhalīna ","translations":["Indeed","those who","oppose","Allah","and His Messenger","those","(will be) among","the most humiliated","(20)"],"transliterationArr":["inna","alladhīna","yuḥāddūna","al-laha","warasūlahu","ulāika","fī","al-adhalīna",null],"verseTiming":[[1,0,1470],[2,1470,2550],[3,2550,6330],[4,6330,7230],[5,7230,10120],[6,10120,12739],[7,12739,12959],[8,12959,16194]]}},{"name":"58:21","price":"اللہ تعالیٰ لکھ چکا ہے(1) کہ بیشک میں اور میرے پیغمبر غالب رہیں گے۔ یقیناً اللہ تعالیٰ زور آور اور غالب ہے.(2)","arabic":"كَتَبَ ٱللَّهُ لَأَغۡلِبَنَّ أَنَا۠ وَرُسُلِيٓۚ إِنَّ ٱللَّهَ قَوِيٌّ عَزِيزٞ","category":["58 (Al-Mujadila)","Al-Mujadila","Surah Al-Mujadila"],"ayahNumber":5125,"juzNumber":28,"footnotes":"(1) یعنی تقدیر اور لوح محفوظ میں، جس میں کوئی تبدیلی نہیں ہوسکتی۔ یہ مضمون سورہ مومن: 51 -52 میں بھی بیان کیا گیا ہے۔\n(2) جب یہ بات لکھنے والا، سب پر غالب اور نہایت زور آور رہے، تو پھر اور کون ہے جو اس فیصلے میں تبدیلی کرسکے؟ مطلب یہ ہوا کہ یہ فیصلہ قدر محکم اور امر مبرم ہے۔","lang":"ur","meta":{"transliteration":"kataba al-lahu la-aghlibanna anā warusulī inna al-laha qawiyyun ʿazīzun ","translations":["Allah has decreed","Allah has decreed","Surely, I will overcome","I","and My Messengers","Indeed","Allah","(is) All-Strong","All-Mighty","(21)"],"transliterationArr":["kataba","al-lahu","la-aghlibanna","anā","warusulī","inna","al-laha","qawiyyun","ʿazīzun",null],"verseTiming":[[1,0,550],[2,550,1500],[3,1500,3630],[4,3630,4100],[5,4100,5540],[6,5540,6690],[7,6690,7610],[8,7610,8560],[9,8560,11095]]}},{"name":"58:22","price":"اللہ تعالیٰ پر اور قیامت کے دن پر ایمان رکھنے والوں کو آپ اللہ اور اس کے رسول کی مخالفت کرنے والوں سے محبت رکھتے ہوئے ہرگز نہ پائیں گے(1) گو وه ان کے باپ یا ان کے بیٹے یا ان کے بھائی یا ان کے کنبہ (قبیلے) کے (عزیز) ہی کیوں نہ ہوں(2)۔ یہی لوگ ہیں جن کے دلوں میں اللہ تعالیٰ نے ایمان کو لکھ دیا ہے(3) اور جن کی تائید اپنی روح سے کی(4) ہے اور جنہیں ان جنتوں میں داخل کرے گا جن کے نیچے نہریں بہہ رہی ہیں جہاں یہ ہمیشہ رہیں گے، اللہ ان سے راضی ہے اور یہ اللہ سے خوش ہیں(5) یہی لوگ اللہ کا گروہ ہیں،آگاه رہو! بے شک الله کا گروہ ہی کامیاب ہونے والا ہے .(6)","arabic":"لَّا تَجِدُ قَوۡمٗا يُؤۡمِنُونَ بِٱللَّهِ وَٱلۡيَوۡمِ ٱلۡأٓخِرِ يُوَآدُّونَ مَنۡ حَآدَّ ٱللَّهَ وَرَسُولَهُۥ وَلَوۡ كَانُوٓاْ ءَابَآءَهُمۡ أَوۡ أَبۡنَآءَهُمۡ أَوۡ إِخۡوَٰنَهُمۡ أَوۡ عَشِيرَتَهُمۡۚ أُوْلَٰٓئِكَ كَتَبَ فِي قُلُوبِهِمُ ٱلۡإِيمَٰنَ وَأَيَّدَهُم بِرُوحٖ مِّنۡهُۖ وَيُدۡخِلُهُمۡ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَاۚ رَضِيَ ٱللَّهُ عَنۡهُمۡ وَرَضُواْ عَنۡهُۚ أُوْلَٰٓئِكَ حِزۡبُ ٱللَّهِۚ أَلَآ إِنَّ حِزۡبَ ٱللَّهِ هُمُ ٱلۡمُفۡلِحُونَ","category":["58 (Al-Mujadila)","Al-Mujadila","Surah Al-Mujadila"],"ayahNumber":5126,"juzNumber":28,"footnotes":"(1) اس آیت میں اللہ تعالیٰ نے وضاحت فرمائی کہ جو ایمان باللہ اور ایمان بالآخرت میں کامل ہوتے ہیں، وہ اللہ اور رسول (صلى الله عليه وسلم) کے دشمنوں سے محبت اور تعلق خاطر نہیں رکھتے۔ گویا ایمان اور اللہ اور رسول (صلى الله عليه وسلم) کے دشمنوں کی محبت ونصرت ایک دل میں جمع نہیں ہوسکتے۔ یہ مضمون قرآن مجید میں اور بھی کئی مقامات پر بیان کیا گیا ہے ، مثلاً آل عمران: 28۔ سورۂ توبہ: 24 وغیرہ۔\n(2) اس لیے کہ ان کا ایمان ان کو ان کی محبت سے روکتا ہے اور ایمان کی رعایت ، ابوت، بنوت ، اخوت اور خاندان وبرادری کی محبت ورعایت سے زیادہ اہم اور ضروری ہے۔ چنانچہ صحابہ کرام (رضي الله عنهم) نے عملاً ایسا کرکے دکھایا۔ ایک مسلمان صحابی نے اپنے باپ، اپنے بیٹے، اپنے بھائی اور اپنے چچا، ماموں اور دیگر رشتے داروں کو قتل کرنے سے گریز نہیں کیا، اگر وہ کفر کی حمایت میں کافروں کے ساتھ لڑنے والوں میں شامل ہوتے۔ سیر وتواریخ کی کتابوں میں یہ مثالیں درج ہیں۔ اسی ضمن میں جنگ بدر کا واقعہ بھی قابل ذکر ہے، جب اسیران بدر کے بارے میں مشورہ ہوا کہ ان کو فدیہ لے کر چھوڑ دیا جائے یا قتل کر دیا جائے۔ تو حضرت عمر (رضي الله عنه)، نے مشورہ دیا تھا کہ ان کافر قیدیوں میں سے ہر قیدی کو اس کے رشتے دار کے سپرد کر دیا جائے جسے وہ خود اپنے ہاتھوں سے قتل کرے۔ اور اللہ تعالیٰ کو حضرت عمر (رضي الله عنه)، کا یہی مشورہ پسند آیا تھا۔ (تفصیل کے لیے دیکھئے سورۂ انفال آیت 67 کا حاشیہ)۔\n(3) یعنی راسخ اور مضبوط کر دیا ہے۔\n(4) روح سے مراد اپنی نصرت خاص، یا نور ایمان ہے جو انہیں ان کی مذکورہ خوبی کی وجہ سے حاصل ہوا۔\n(5) یعنی جب یہ اولین مسلمان، صحابہ کرام (رضي الله عنهم) ، ایمان کی بنیاد پر اپنے عزیز واقارب سے ناراض ہوگئے، حتیٰ کہ انہیں اپنے ہاتھوں سے قتل تک کرنے میں تامل نہیں کیا تو اس کے بدلے میں اللہ نے ان کو اپنی رضامندی سے نواز دیا۔ اور ان پر اس طرح اپنے انعامات کی بارش فرمائی کہ وہ بھی اللہ سے راضی ہوگئے۔ اس لیے آیت میں بیان کردہ اعزاز۔ ”رضي الله عنهم ورضوا عنہ“ اگرچہ خاص صحابہ کرام کے بارے میں نازل نہیں ہوا ہے، تاہم وہ اس کا مصداق اولین اور مصداق اتم ہیں۔ اسی لیے اس کے لغوی مفہوم کو سامنے رکھتے ہوئے مذکورہ صفات سے متصف ہر مسلمان ”رضي الله عنه“ کا مستحق بن سکتا ہے، جیسے لغوی معنی کے لحاظ سے ہر مسلمان شخص پر علیہ الصلوٰۃ والسلام کا (دعائیہ جملے کے طور پر) اطلاق کیا جاسکتا ہے۔ لیکن اہل سنت نے ان کے مفہوم لغوی سے ہٹ کر، ان کو صحابہ کرام (رضي الله عنهم) اور انبیاء علیہم السلام کے علاوہ کسی اور کے لیے بولنا، لکھنا جائز قرار نہیں دیا ہے۔ یہ گویا شعار ہیں۔ (رضي الله عنهم) ، صحابہ کے لیے اور علیہم الصلوٰۃ والسلام انبیائے کرام کے لیے۔ یہ ایسے ہی ہے، جیسے رحمتہ اللہ علیہ (اللہ کی رحمت اس پر ہو، یا اللہ اس پر رحم فرمائے) کا اطلاق لغوی مفہوم کی رو سے زندہ اور مردہ دونوں پر ہوسکتا ہے۔ کیونکہ یہ ایک دعائیہ کلمہ ہے جس کے ضرورت مند زندہ اور مردہ دونوں ہی ہیں۔ لیکن ان کا استعمال مردوں کے لیے خاص ہوچکا ہے۔ اس لیے اسے زندہ کے لیے استعمال نہیں کیا جاتا۔\n(6) یعنی یہی گروہ مومنین فلاح سے ہمکنار ہوگا، دوسرے ان کی بہ نسبت ایسے ہی ہوں گے ، جیسے وہ فلاح سے بالکل محروم ہیں، جیسا کہ واقعی وہ آخرت میں محروم ہوں گے۔","lang":"ur","meta":{"transliteration":"lā tajidu qawman yu'minūna bil-lahi wal-yawmi al-ākhiri yuwāddūna man ḥādda al-laha warasūlahu walaw kānū ābāahum aw abnāahum aw ikh'wānahum aw ʿashīratahum ulāika kataba fī qulūbihimu al-īmāna wa-ayyadahum birūḥin min'hu wayud'khiluhum jannātin tajrī min taḥtihā al-anhāru khālidīna fīhā raḍiya al-lahu ʿanhum waraḍū ʿanhu ulāika ḥiz'bu al-lahi alā inna ḥiz'ba al-lahi humu al-muf'liḥūna ","translations":["You will not find","You will not find","a people","who believe","in Allah","and the Day","the Last","loving","(those) who","oppose","Allah","and His Messenger","even if","they were","their fathers","or","their sons","or","their brothers","or","their kindred","Those ","He has decreed","within","their hearts","faith","and supported them","with a spirit","from Him","And He will admit them","(to) Gardens","flow","from","underneath it","the rivers","will abide forever","in it","Allah is pleased","Allah is pleased","with them","and they are pleased","with Him","Those","(are the) party","(of) Allah","No doubt","Indeed","(the) party","(of) Allah","they","(are) the successful ones","(22)"],"transliterationArr":["lā","tajidu","qawman","yu'minūna","bil-lahi","wal-yawmi","al-ākhiri","yuwāddūna","man","ḥādda","al-laha","warasūlahu","walaw","kānū","ābāahum","aw","abnāahum","aw","ikh'wānahum","aw","ʿashīratahum","ulāika","kataba","fī","qulūbihimu","al-īmāna","wa-ayyadahum","birūḥin","min'hu","wayud'khiluhum","jannātin","tajrī","min","taḥtihā","al-anhāru","khālidīna","fīhā","raḍiya","al-lahu","ʿanhum","waraḍū","ʿanhu","ulāika","ḥiz'bu","al-lahi","alā","inna","ḥiz'ba","al-lahi","humu","al-muf'liḥūna",null],"verseTiming":[[1,0,450],[2,450,1120],[3,1120,2500],[4,2500,3940],[5,3940,4880],[6,4880,5880],[7,5880,6900],[8,6900,10840],[9,10840,11150],[10,11150,14669],[11,14669,15849],[12,15849,17299],[13,17299,17779],[14,17779,18849],[15,18849,19849],[16,19849,21959],[17,21959,24939],[18,24939,25329],[19,25329,28109],[20,28109,28489],[21,28489,29859],[22,29859,30209],[23,30209,32109],[24,32109,34618],[25,34618,35228],[26,35228,35558],[27,35558,36798],[28,36798,37978],[29,37978,39918],[30,39918,40778],[31,40778,41948],[32,41948,43998],[33,43998,46518],[34,46518,47318],[35,47318,47898],[36,47898,49118],[37,49118,50298],[38,50298,51518],[39,51518,52548],[40,52548,53678],[41,53678,54488],[42,54488,55328],[43,55328,56018],[44,56018,56558],[45,56558,59678],[46,59678,60238],[47,60238,63598],[48,63598,65697],[49,65697,66837],[50,66837,67527],[51,67527,68447],[52,68447,68887],[53,68887,73012]]}}],"chapter":["58 (Al-Mujadila)","Al-Mujadila","Surah Al-Mujadila","Chapter Al-Mujadila","Mujadila","Surah Mujadila","Chapter Mujadila","Al Mujadila","Surah Al Mujadila","Chapter Al Mujadila","Surah 58","Chapter 58","The Pleading Woman","المجادلة"],"version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."}}