{"data":[{"name":"60:1","price":"اے وه لوگو جو ایمان ﻻئے ہو! میرے اور (خود) اپنے دشمنوں کو اپنا دوست نہ بناؤ(1) تم تو دوستی سے ان کی طرف پیغام بھیجتے(2) ہو اور وه اس حق کے ساتھ جو تمہارے پاس آچکا ہے کفر کرتے ہیں، پیغمبر کو اور خود تمہیں بھی محض اس وجہ سے جلاوطن کرتے ہیں کہ تم اپنے رب پر ایمان رکھتے ہو(3)، اگر تم میری راه میں جہاد کے لیے اور میری رضا مندی کی طلب میں نکلتے ہو (تو ان سے دوستیاں نہ کرو(4))، تم ان کے پاس محبت کا پیغام پوشیده پوشیده بھیجتے ہو اور مجھے خوب معلوم ہے جو تم نے چھپایا اور وه بھی جو تم نے ﻇاہر کیا، تم میں سے جو بھی اس کام کو کرے گا وه یقیناً راه راست سے بہک جائے گا.(5)","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَتَّخِذُواْ عَدُوِّي وَعَدُوَّكُمۡ أَوۡلِيَآءَ تُلۡقُونَ إِلَيۡهِم بِٱلۡمَوَدَّةِ وَقَدۡ كَفَرُواْ بِمَا جَآءَكُم مِّنَ ٱلۡحَقِّ يُخۡرِجُونَ ٱلرَّسُولَ وَإِيَّاكُمۡ أَن تُؤۡمِنُواْ بِٱللَّهِ رَبِّكُمۡ إِن كُنتُمۡ خَرَجۡتُمۡ جِهَٰدٗا فِي سَبِيلِي وَٱبۡتِغَآءَ مَرۡضَاتِيۚ تُسِرُّونَ إِلَيۡهِم بِٱلۡمَوَدَّةِ وَأَنَا۠ أَعۡلَمُ بِمَآ أَخۡفَيۡتُمۡ وَمَآ أَعۡلَنتُمۡۚ وَمَن يَفۡعَلۡهُ مِنكُمۡ فَقَدۡ ضَلَّ سَوَآءَ ٱلسَّبِيلِ","category":["60 (Al-Mumtahanah)","Al-Mumtahanah","Surah Al-Mumtahanah"],"ayahNumber":5151,"juzNumber":28,"footnotes":"(1) کفار مکہ اور نبی (صلى الله عليه وسلم) کے درمیان حدیبیہ میں جو معاہدہ ہوا تھا، اہل مکہ نے اس کی خلاف ورزی کی۔ اس لیے رسول اللہ (صلى الله عليه وسلم) نے بھی مسلمانوں کو خفیہ طور پر لڑائی کی تیاری کا حکم دے دیا۔ حضرت حاطب بن ابی بلتعہ (رضي الله عنه) ، ایک مہاجر بدری صحابی تھے، جن کی قریش کے ساتھ کوئی رشتے داری نہیں تھی، لیکن ان کے بیوی بچے مکے میں ہی تھے۔ انہوں نے سوچا کہ میں قریش مکہ کو آپ (صلى الله عليه وسلم) کی تیاری کی اطلاع کر دوں تاکہ اس احسان کے بدلے وہ میرے بال بچوں کا خیال رکھیں۔ چنانچہ انہوں نے ایک عورت کے ذریعے سے یہ پیغام تحریری طور پر اہل مکہ کی طرف روانہ کر دیا، جس کے اطلاع بذریعہ وحی نبی (صلى الله عليه وسلم) کو کر دی گئی چنانچہ آپ (صلى الله عليه وسلم) نے حضرت علی ، حضرت مقداد اور حضرت زبیر (رضي الله عنهم) کو فرمایا کہ جاؤ روضئہ خاخ پر ایک عورت ہوگی جو مکہ جا رہی ہوگی، اس کے پاس ایک رقعہ ہے، وہ لے آؤ، چنانچہ وہ حضرات گئے اور اس سے یہ رقعہ لے آئے جو اس نے سر کے بالوں میں چھپا رکھا تھا۔ آپ (صلى الله عليه وسلم) نے حضرت حاطب (رضي الله عنه)، سے پوچھا۔ یہ تم نے کیا کیا؟ انہوں نے فرمایا کہ میں نے یہ کام کفر وارتداد کی بنا پر نہیں کیا بلکہ اس کی وجہ صرف یہ ہے کہ دیگر مہاجرین کے رشتے دار مکے میں موجود ہیں جو ان کے بال بچوں کی حفاظت کرتے ہیں۔ میرا وہاں کوئی رشتے دار نہیں ہے تو میں نے یہ سوچا کہ میں اہل مکہ کو کچھ اطلاع کر دوں تاکہ وہ میرے احسان مند رہیں اور میرے بچوں کی حفاظت کریں۔ آپ (صلى الله عليه وسلم) نے ان کی سچائی کی وجہ سے انہیں کچھ نہیں کہا۔ تاہم اللہ نے تنبیہ کے طور پر یہ آیات نازل فرما دیں، تاکہ آئندہ کوئی مومن کسی کافر کے ساتھ اس طرح کا تعلق مودت قائم نہ کرے۔ (صحيح بخاري، تفسير سورة الممتحنة ، وصحيح مسلم، كتاب فضائل الصحابة)۔\n(2) مطلب ہے نبی (صلى الله عليه وسلم) کی خبریں ان تک پہنچا کر ان سے دوستانہ تعلق قائم کرنا چاہتے ہو؟\n(3) جب ان کا تمہارے ساتھ اور حق کے ساتھ یہ معاملہ ہے تو تمہارے لیے کیا یہ مناسب ہے کہ تم ان سے محبت اور ہمدردی کا رویہ اختیار کرو؟\n(4) یہ جواب شرط، جو محذوف ہے، کا ترجمہ ہے۔\n(5) یعنی میرے اور اپنے دشمنوں سے محبت کا تعلق جوڑنا اور انہیں خفیہ نامہ وپیام بھیجنا، یہ گمراہی کا راستہ ہے، جو کسی مسلمان کے شایان شان نہیں۔","lang":"ur","meta":{"transliteration":"yāayyuhā alladhīna āmanū lā tattakhidhū ʿaduwwī waʿaduwwakum awliyāa tul'qūna ilayhim bil-mawadati waqad kafarū bimā jāakum mina al-ḥaqi yukh'rijūna al-rasūla wa-iyyākum an tu'minū bil-lahi rabbikum in kuntum kharajtum jihādan fī sabīlī wa-ib'tighāa marḍātī tusirrūna ilayhim bil-mawadati wa-anā aʿlamu bimā akhfaytum wamā aʿlantum waman yafʿalhu minkum faqad ḍalla sawāa al-sabīli ","translations":["O you","who","believe","(Do) not","take","My enemies","and your enemies","(as) allies","offering","them","love","while","they have disbelieved","in what","came to you","of","the truth","driving out","the Messenger","and yourselves","because","you believe","in Allah","your Lord","If","you","come forth","(to) strive","in","My way","and (to) seek","My Pleasure","You confide","to them","love","but I Am","most knowing","of what","you conceal","and what","you declare","And whoever","does it","among you","then certainly","he has strayed","(from the) straight","path","(1)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","lā","tattakhidhū","ʿaduwwī","waʿaduwwakum","awliyāa","tul'qūna","ilayhim","bil-mawadati","waqad","kafarū","bimā","jāakum","mina","al-ḥaqi","yukh'rijūna","al-rasūla","wa-iyyākum","an","tu'minū","bil-lahi","rabbikum","in","kuntum","kharajtum","jihādan","fī","sabīlī","wa-ib'tighāa","marḍātī","tusirrūna","ilayhim","bil-mawadati","wa-anā","aʿlamu","bimā","akhfaytum","wamā","aʿlantum","waman","yafʿalhu","minkum","faqad","ḍalla","sawāa","al-sabīli",null],"verseTiming":[[1,0,2870],[2,2870,3700],[3,3700,4660],[4,4660,4970],[5,4970,6060],[6,6060,6960],[7,6960,8320],[8,8320,10740],[9,10740,11610],[10,11610,13080],[11,13080,14380],[12,14380,14840],[13,14840,15620],[14,15620,16190],[15,16190,18570],[16,18570,19510],[17,19510,20340],[18,20340,21440],[19,21440,22440],[20,22440,23790],[21,23790,24700],[22,24700,25720],[23,25720,26680],[24,26680,27750],[25,27750,28860],[26,28860,30300],[27,30300,31300],[28,31300,32620],[29,32620,33020],[30,33020,34110],[31,34110,36590],[32,36590,37540],[33,37540,39450],[34,39450,40930],[35,40930,42260],[36,42260,42830],[37,42830,43620],[38,43620,45430],[39,45430,46560],[40,46560,48620],[41,48620,51100],[42,51100,52160],[43,52160,53220],[44,53220,54540],[45,54540,55080],[46,55080,55690],[47,55690,57760],[48,57760,59755]]}},{"name":"60:2","price":"اگر وه تم پر کہیں قابو پالیں تو وه تمہارے (کھلے) دشمن ہو جائیں اور برائی کے ساتھ تم پر دست درازی اور زبان درازی کرنے لگیں اور (دل سے) چاہنے لگیں کہ تم بھی کفر کرنے لگ جاؤ.(1)","arabic":"إِن يَثۡقَفُوكُمۡ يَكُونُواْ لَكُمۡ أَعۡدَآءٗ وَيَبۡسُطُوٓاْ إِلَيۡكُمۡ أَيۡدِيَهُمۡ وَأَلۡسِنَتَهُم بِٱلسُّوٓءِ وَوَدُّواْ لَوۡ تَكۡفُرُونَ","category":["60 (Al-Mumtahanah)","Al-Mumtahanah","Surah Al-Mumtahanah"],"ayahNumber":5152,"juzNumber":28,"footnotes":"(1) یعنی تمہارے خلاف ان کے دلوں میں تو اس طرح بغض وعناد ہے اور تم ہو کہ ان کے ساتھ محبت کی پینگیں بڑھا رہے ہو؟","lang":"ur","meta":{"transliteration":"in yathqafūkum yakūnū lakum aʿdāan wayabsuṭū ilaykum aydiyahum wa-alsinatahum bil-sūi wawaddū law takfurūna ","translations":["If","they gain dominance over you","they would be","to you","enemies","and extend","against you","their hands","and their tongues","with evil","and they desire","that","you would disbelieve","(2)"],"transliterationArr":["in","yathqafūkum","yakūnū","lakum","aʿdāan","wayabsuṭū","ilaykum","aydiyahum","wa-alsinatahum","bil-sūi","wawaddū","law","takfurūna",null],"verseTiming":[[1,0,1030],[2,1030,2260],[3,2260,3270],[4,3270,3860],[5,3860,6960],[6,6960,9370],[7,9370,10290],[8,10290,11480],[9,11480,13610],[10,13610,15710],[11,15710,16670],[12,16670,17000],[13,17000,19595]]}},{"name":"60:3","price":"تمہاری قرابتیں، رشتہداریاں، اور اوﻻد تمہیں قیامت کے دن کام نہ آئیں گی(1) ، اللہ تعالیٰ تمہارے درمیان فیصلہ کر دے گا(2) اور جو کچھ تم کر رہے ہو اسے اللہ خوب دیکھ رہا ہے.","arabic":"لَن تَنفَعَكُمۡ أَرۡحَامُكُمۡ وَلَآ أَوۡلَٰدُكُمۡۚ يَوۡمَ ٱلۡقِيَٰمَةِ يَفۡصِلُ بَيۡنَكُمۡۚ وَٱللَّهُ بِمَا تَعۡمَلُونَ بَصِيرٞ","category":["60 (Al-Mumtahanah)","Al-Mumtahanah","Surah Al-Mumtahanah"],"ayahNumber":5153,"juzNumber":28,"footnotes":"(1) یعنی جس اولاد کے لیے تم کفار کے ساتھ محبت کا اظہار کر رہے ہو، یہ تمہارے کچھ کام نہیں آئے گی، پھر اس کی وجہ سے تم کافروں سے دوستی کرکے کیوں اللہ کو ناراض کرتے ہو۔ قیامت والے دن جو چیز کام آئے گی وہ تو اللہ اور رسول (صلى الله عليه وسلم) کی اطاعت ہے، اس کا اہتمام کرو۔\n(2) دوسرے معنی ہیں تمہارے درمیان جدائی ڈال دے گا یعنی اہل طاعت کو جنت میں اور اہل معصیت کو جہنم میں داخل کرے گا۔ بعض کہتے ہیں آپس میں جدائی کا مطلب ہے کہ ایک دوسرے سے بھاگیں گے۔ جیسے فرمایا يَوْمَ يَفِرُّ الْمَرْءُ مِنْ أَخِيهِ (سورۂ عبس: 34) یعنی شدت ہول سے بھائی ، بھائی سے بھاگے گا۔","lang":"ur","meta":{"transliteration":"lan tanfaʿakum arḥāmukum walā awlādukum yawma al-qiyāmati yafṣilu baynakum wal-lahu bimā taʿmalūna baṣīrun ","translations":["Never","will benefit you","your relatives","and not","your children","(on the) Day","(of) the Resurrection","He will judge","between you","And Allah","of what","you do","(is) All-Seer","(3)"],"transliterationArr":["lan","tanfaʿakum","arḥāmukum","walā","awlādukum","yawma","al-qiyāmati","yafṣilu","baynakum","wal-lahu","bimā","taʿmalūna","baṣīrun",null],"verseTiming":[[1,0,810],[2,810,3290],[3,3290,4600],[4,4600,6270],[5,6270,8200],[6,8200,8740],[7,8740,9960],[8,9960,10710],[9,10710,12060],[10,12060,13020],[11,13020,13570],[12,13570,14750],[13,14750,16025]]}},{"name":"60:4","price":"(مسلمانو!) تمہارے لیے حضرت ابراہیم میں اور ان کے ساتھیوں میں بہترین نمونہ ہے(1) ، جبکہ ان سب نے اپنی قوم سے برملا کہہ دیا کہ ہم تم سے اور جن جن کی تم اللہ کے سوا عبادت کرتے ہو ان سب سے بالکل بیزار ہیں(2)۔ ہم تمہارے (عقائد کے) منکر ہیں جب تک تم اللہ کی وحدانیت پر ایمان نہ ﻻؤ ہم میں تم میں ہمیشہ کے لیے بغض وعداوت ﻇاہر ہوگئی(3) لیکن ابراہیم کی اتنی بات تو اپنے باپ سے ہوئی تھی(4) کہ میں تمہارے لیے استغفار ضرور کروں گا اور تمہارے لیے مجھے اللہ کے سامنے کسی چیز کا اختیار کچھ بھی نہیں۔ اے ہمارے پروردگار تجھی پر ہم نے بھروسہ کیا ہے(5) اور تیری ہی طرف رجوع کرتے ہیں اور تیری ہی طرف لوٹنا ہے.","arabic":"قَدۡ كَانَتۡ لَكُمۡ أُسۡوَةٌ حَسَنَةٞ فِيٓ إِبۡرَٰهِيمَ وَٱلَّذِينَ مَعَهُۥٓ إِذۡ قَالُواْ لِقَوۡمِهِمۡ إِنَّا بُرَءَٰٓؤُاْ مِنكُمۡ وَمِمَّا تَعۡبُدُونَ مِن دُونِ ٱللَّهِ كَفَرۡنَا بِكُمۡ وَبَدَا بَيۡنَنَا وَبَيۡنَكُمُ ٱلۡعَدَٰوَةُ وَٱلۡبَغۡضَآءُ أَبَدًا حَتَّىٰ تُؤۡمِنُواْ بِٱللَّهِ وَحۡدَهُۥٓ إِلَّا قَوۡلَ إِبۡرَٰهِيمَ لِأَبِيهِ لَأَسۡتَغۡفِرَنَّ لَكَ وَمَآ أَمۡلِكُ لَكَ مِنَ ٱللَّهِ مِن شَيۡءٖۖ رَّبَّنَا عَلَيۡكَ تَوَكَّلۡنَا وَإِلَيۡكَ أَنَبۡنَا وَإِلَيۡكَ ٱلۡمَصِيرُ","category":["60 (Al-Mumtahanah)","Al-Mumtahanah","Surah Al-Mumtahanah"],"ayahNumber":5154,"juzNumber":28,"footnotes":"(1) کفار سے عدم موالات کے مسئلے کی توضیح کے لیے حضرت ابراہیم (عليه السلام) کی مثال دی جارہی ہے أُسْوَةٌ کے معنی ہوتے ہیں، ایسا نمونہ جس کی اقتدا کی جائے۔\n(2) یعنی شرک کی وجہ سے ہمارا اور تمہارا کوئی تعلق نہیں، اللہ کے پرستاروں کا بھلا غیر اللہ کے پجاریوں سے کیا تعلق؟\n(3) یعنی یہ علیحدگی اور بیزاری اس وقت تک رہے گی جب تک تم کفروشرک چھوڑ کر توحید کو نہیں اپنالو گے۔ ہاں جب تم ایک اللہ کو ماننے والے بن جاؤ گے تو پھر یہ عداوت موالات میں اور یہ بغض محبت میں بدل جائے گا۔\n(4) یہ ایک استثنا ہے جو فی ابراہیم میں مقدر محذوف مضاف سے ہے۔ یعنی «قَدْ كَانَتْ لَكُمْ أُسْوَةٌ حَسَنَةٌ فِي مَقَالاتِ إِبْرَاهيِمَ إِلا قَوْلَهُ لأبِيهِ یا أُسْوَةٌ حَسَنَةٌ» سے استثنا ہے، اس لیے کہ قول بھی منجملہ اسوہ ہے۔ گویا کہا جارہا ہے۔ «قَدْ كَانَتْ لَكُمْ أُسْوَةٌ حَسَنَةٌ فِي إِبْرَاهِيمَ فِي جَمِيعِ أَقْوَالِهِ وَأَفْعَالِهِ إِلا قَوْلَهُ لأبِيهِ»(فتح القدير) مطلب یہ ہے کہ حضرت ابراہیم (عليه السلام) کی پوری زندگی ایک قابل تقلید نمونہ ہے، البتہ ان کا اپنے باپ کے لیے مغفرت کی دعا کرنا ایک ایسا عمل ہے جس میں ان کی پیروی نہیں کرنی چاہیے، کیونکہ ان کا یہ فعل اس وقت کا ہے جب ان کو اپنے باپ کی بابت علم نہیں تھا، چنانچہ جب ان پر یہ واضح ہوگیا کہ ان کا باپ اللہ کا دشمن ہے تو انہوں نے اپنے باپ سے بھی اظہار براءت کر دیا، جیسا کہ سورۂ براءت آیت 114 میں ہے۔ (سورۂ براءت سورۂ توبہ کو کہا جاتا ہے)۔\n(5) توکل کا مطلب ہے۔ امکانی حد تک ظاہری اسباب ووسائل اختیار کرنے کے بعد معاملہ اللہ کے سپرد کر دیا جائے۔ یہ مطلب نہیں کہ ظاہری وسائل اختیار کیے بغیر ہی اللہ پر اعتماد اور توکل کا اظہار کیا جائے، اس سے ہمیں منع کیا گیا ہے، اس لیے توکل کا یہ مفہوم بھی غلط ہوگا۔ نبی (صلى الله عليه وسلم) کی خدمت میں ایک شخص حاضر ہوا اور اونٹ کو باہر کھڑا کرکے اندر آگیا ، آپ (صلى الله عليه وسلم) نے پوچھا تو کہا میں اونٹ اللہ کے سپرد کر آیا ہوں، آپ (صلى الله عليه وسلم) نے فرمایا۔ یہ توکل نہیں ہے۔ ”اعْقِلْ وَتَوَكَّلْ“ پہلے اسے کسی چیز سے باندھ ، پھر اللہ پر بھروسہ کر۔ (ترمذی) انابت کا مطلب ہے، اللہ کی طرف رجوع کرنا۔","lang":"ur","meta":{"transliteration":"qad kānat lakum us'watun ḥasanatun fī ib'rāhīma wa-alladhīna maʿahu idh qālū liqawmihim innā buraāu minkum wamimmā taʿbudūna min dūni al-lahi kafarnā bikum wabadā baynanā wabaynakumu al-ʿadāwatu wal-baghḍāu abadan ḥattā tu'minū bil-lahi waḥdahu illā qawla ib'rāhīma li-abīhi la-astaghfiranna laka wamā amliku laka mina al-lahi min shayin rabbanā ʿalayka tawakkalnā wa-ilayka anabnā wa-ilayka al-maṣīru ","translations":["Indeed","(there) is","for you","an example","good","in","Ibrahim","and those","with him","when","they said","to their people","Indeed, we","(are) disassociated","from you","and from what","you worship","from","besides","Allah","We have denied","you","and has appeared","between us","and between you","enmity","and hatred","forever","until","you believe","in Allah","Alone","Except","(the) saying","(of) Ibrahim","to his father","Surely I ask forgiveness","for you","but not","I have power","for you","from","Allah","of","anything","Our Lord","upon You","we put our trust","and to You","we turn","and to You","(is) the final return","(4)"],"transliterationArr":["qad","kānat","lakum","us'watun","ḥasanatun","fī","ib'rāhīma","wa-alladhīna","maʿahu","idh","qālū","liqawmihim","innā","buraāu","minkum","wamimmā","taʿbudūna","min","dūni","al-lahi","kafarnā","bikum","wabadā","baynanā","wabaynakumu","al-ʿadāwatu","wal-baghḍāu","abadan","ḥattā","tu'minū","bil-lahi","waḥdahu","illā","qawla","ib'rāhīma","li-abīhi","la-astaghfiranna","laka","wamā","amliku","laka","mina","al-lahi","min","shayin","rabbanā","ʿalayka","tawakkalnā","wa-ilayka","anabnā","wa-ilayka","al-maṣīru",null],"verseTiming":[[1,0,1613],[2,1613,2269],[3,2269,2992],[4,2992,3851],[5,3851,5187],[6,5187,6793],[7,6793,8536],[8,8536,9595],[9,9595,11355],[10,11355,12360],[11,12360,13114],[12,13114,14124],[13,14124,15734],[14,15734,17978],[15,17978,19368],[16,19368,20877],[17,20877,21981],[18,21981,23003],[19,23003,23536],[20,23536,24238],[21,24238,25306],[22,25306,26056],[23,26056,26726],[24,26726,27561],[25,27561,28722],[26,28722,29872],[27,29872,32681],[28,32681,33459],[29,33459,34309],[30,34309,35287],[31,35287,36178],[32,36178,38184],[33,38184,39179],[34,39179,39888],[35,39888,41038],[36,41038,42022],[37,42022,44357],[38,44357,44961],[39,44961,46816],[40,46816,47445],[41,47445,47910],[42,47910,48456],[43,48456,49058],[44,49058,50308],[45,50308,52287],[46,52287,53808],[47,53808,54555],[48,54555,55865],[49,55865,56885],[50,56885,57718],[51,57718,58860],[52,58860,61645]]}},{"name":"60:5","price":"اے ہمارے رب! تو ہمیں کافروں کی آزمائش میں نہ ڈال(1) اور اے ہمارے پالنے والے ہماری خطاؤں کو بخش دے، بیشک تو ہی غالب، حکمت واﻻ ہے.","arabic":"رَبَّنَا لَا تَجۡعَلۡنَا فِتۡنَةٗ لِّلَّذِينَ كَفَرُواْ وَٱغۡفِرۡ لَنَا رَبَّنَآۖ إِنَّكَ أَنتَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ","category":["60 (Al-Mumtahanah)","Al-Mumtahanah","Surah Al-Mumtahanah"],"ayahNumber":5155,"juzNumber":28,"footnotes":"(1) یعنی کافروں کو ہم پر غلبہ وتسلط عطا نہ فرما، اس طرح وہ سمجھیں گے کہ وہ حق پر ہیں، اور یوں ہم ان کے لیے فتنے کا باعث بن جائیں گے یا یہ مطلب ہے کہ ان کے ہاتھوں یا اپنی طرف سے ہمیں کسی سزا سے دو چار نہ کرنا، اس طرح بھی ہمارا وجود ان کے لیے فتنہ بن جائے گا، وہ کہیں گے کہ اگر یہ حق پر ہوتے تو ان کو یہ تکلیف کیوں پہنچتی؟","lang":"ur","meta":{"transliteration":"rabbanā lā tajʿalnā fit'natan lilladhīna kafarū wa-igh'fir lanā rabbanā innaka anta al-ʿazīzu al-ḥakīmu ","translations":["Our Lord","(do) not","make us","a trial","for those who","disbelieve","and forgive","us","our Lord","Indeed You","[You]","(are) the All-Mighty","the All-Wise","(5)"],"transliterationArr":["rabbanā","lā","tajʿalnā","fit'natan","lilladhīna","kafarū","wa-igh'fir","lanā","rabbanā","innaka","anta","al-ʿazīzu","al-ḥakīmu",null],"verseTiming":[[1,0,1180],[2,1180,1490],[3,1490,2680],[4,2680,3450],[5,3450,4700],[6,4700,5630],[7,5630,6360],[8,6360,6800],[9,6800,7880],[10,7880,9870],[11,9870,11330],[12,11330,12480],[13,12480,15695]]}},{"name":"60:6","price":"یقیناً تمہارے لیے ان میں(1) اچھا نمونہ (اور عمده پیروی ہے خاص کر) ہر اس شخص کے لیے جو اللہ کی اور قیامت کے دن کی ملاقات کی امید رکھتا ہو(2)، اور اگر کوئی روگردانی کرے(3) تو اللہ تعالیٰ بالکل بےنیاز ہے اور سزا وار حمد وﺛنا ہے.","arabic":"لَقَدۡ كَانَ لَكُمۡ فِيهِمۡ أُسۡوَةٌ حَسَنَةٞ لِّمَن كَانَ يَرۡجُواْ ٱللَّهَ وَٱلۡيَوۡمَ ٱلۡأٓخِرَۚ وَمَن يَتَوَلَّ فَإِنَّ ٱللَّهَ هُوَ ٱلۡغَنِيُّ ٱلۡحَمِيدُ","category":["60 (Al-Mumtahanah)","Al-Mumtahanah","Surah Al-Mumtahanah"],"ayahNumber":5156,"juzNumber":28,"footnotes":"(1) یعنی ابراہیم (عليه السلام) کے اور ان کے ساتھی اہل ایمان میں۔ یہ تکرار تاکید کے لیے ہے۔\n(2) کیونکہ ایسے ہی لوگ اللہ سے اور عذاب آخرت سے ڈرتے ہیں، یہی لوگ حالات وواقعات سے عبرت پکڑتے اور نصیحت حاصل کرتے ہیں۔\n(3) یعنی حضرت ابراہیم (عليه السلام) کے اسوے کو اپنانے سے گریز کرے۔","lang":"ur","meta":{"transliteration":"laqad kāna lakum fīhim us'watun ḥasanatun liman kāna yarjū al-laha wal-yawma al-ākhira waman yatawalla fa-inna al-laha huwa al-ghaniyu al-ḥamīdu ","translations":["Certainly","(there) is","for you","in them","an example","good","for (he) who","is","hopeful","(in) Allah","and the Day","the Last","And whoever","turns away","then indeed","Allah","He","(is) Free of need","the Praiseworthy","(6)"],"transliterationArr":["laqad","kāna","lakum","fīhim","us'watun","ḥasanatun","liman","kāna","yarjū","al-laha","wal-yawma","al-ākhira","waman","yatawalla","fa-inna","al-laha","huwa","al-ghaniyu","al-ḥamīdu",null],"verseTiming":[[1,0,660],[2,660,1180],[3,1180,1760],[4,1760,2560],[5,2560,3440],[6,3440,4270],[7,4270,5610],[8,5610,6200],[9,6200,7040],[10,7040,7640],[11,7640,8500],[12,8500,9430],[13,9430,10260],[14,10260,12060],[15,12060,13190],[16,13190,13990],[17,13990,14320],[18,14320,15320],[19,15320,17985]]}},{"name":"60:7","price":"کیا عجب کہ عنقریب ہی اللہ تعالیٰ تم میں اور تمہارے دشمنوں میں محبت پیدا کر دے(1) ۔ اللہ کو سب قدرتیں ہیں اور اللہ (بڑا) غفور رحیم ہے.","arabic":"۞ عَسَى ٱللَّهُ أَن يَجۡعَلَ بَيۡنَكُمۡ وَبَيۡنَ ٱلَّذِينَ عَادَيۡتُم مِّنۡهُم مَّوَدَّةٗۚ وَٱللَّهُ قَدِيرٞۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ","category":["60 (Al-Mumtahanah)","Al-Mumtahanah","Surah Al-Mumtahanah"],"ayahNumber":5157,"juzNumber":28,"footnotes":"(1) یعنی ان کو مسلمان کرکے تمہارا بھائی اور ساتھی بنا دے، جس سے تمہارے مابین عداوت، دوستی اور محبت میں تبدیل ہو جائے گی۔ چنانچہ ایسا ہی ہوا، فتح مکہ کے بعد لوگ فوج در فوج مسلمان ہونا شروع ہوگئے اور ان کے مسلمان ہوتے ہی نفرتیں، محبت میں تبدیل ہوگئیں، جو مسلمانوں کے خون کے پیاسے تھے، وہ دست وبازو بن گئے۔","lang":"ur","meta":{"transliteration":"ʿasā al-lahu an yajʿala baynakum wabayna alladhīna ʿādaytum min'hum mawaddatan wal-lahu qadīrun wal-lahu ghafūrun raḥīmun ","translations":["Perhaps","Allah","[that]","will put","between you","and between","those (to) whom","you have been enemies","among them","love","And Allah","(is) All-Powerful","And Allah","(is) Oft-Forgiving","Most Merciful","(7)"],"transliterationArr":["ʿasā","al-lahu","an","yajʿala","baynakum","wabayna","alladhīna","ʿādaytum","min'hum","mawaddatan","wal-lahu","qadīrun","wal-lahu","ghafūrun","raḥīmun",null],"verseTiming":[[1,0,560],[2,560,1390],[3,1390,1650],[4,1650,3100],[5,3100,4010],[6,4010,4750],[7,4750,5700],[8,5700,6990],[9,6990,8320],[10,8320,10570],[11,10570,11520],[12,11520,14010],[13,14010,14970],[14,14970,15700],[15,15700,18325]]}},{"name":"60:8","price":"جن لوگوں نے تم سے دین کے بارے میں لڑائی نہیں لڑی(1) اور تمہیں جلاوطن نہیں کیا(2) ان کے ساتھ سلوک واحسان کرنے اور منصفانہ بھلے برتاؤ کرنے سے اللہ تعالیٰ تمہیں نہیں روکتا(3)، بلکہ اللہ تعالیٰ تو انصاف کرنے والوں سے محبت کرتا ہے.(4)","arabic":"لَّا يَنۡهَىٰكُمُ ٱللَّهُ عَنِ ٱلَّذِينَ لَمۡ يُقَٰتِلُوكُمۡ فِي ٱلدِّينِ وَلَمۡ يُخۡرِجُوكُم مِّن دِيَٰرِكُمۡ أَن تَبَرُّوهُمۡ وَتُقۡسِطُوٓاْ إِلَيۡهِمۡۚ إِنَّ ٱللَّهَ يُحِبُّ ٱلۡمُقۡسِطِينَ","category":["60 (Al-Mumtahanah)","Al-Mumtahanah","Surah Al-Mumtahanah"],"ayahNumber":5158,"juzNumber":28,"footnotes":"(1) یہ ان کافروں کے بارے میں ہدایات دی جارہی ہیں جو مسلمانوں سے محض دین اسلام کی وجہ سے بغض وعداوت نہیں رکھتے اور اس بنیاد پر مسلمانوں سے نہیں لڑتے، یہ پہلی شرط ہے۔\n(2) یعنی تمہارے ساتھ ایسا رویہ بھی اختیار نہیں کیا کہ تم ہجرت پر مجبور ہو جاؤ۔ یہ دوسری شرط ہے۔ ایک تیسری شرط یہ ہے جو اگلی آیت سے واضح ہوتی ہے، کہ وہ مسلمانوں کے خلاف دوسرے کافروں کو کسی قسم کی مدد بھی نہ پہنچائیں۔ مشورے اور رائے سے اور نہ ہتھیاروں وغیرہ کے ذریعے سے۔\n(3) یعنی ایسے کافروں سے احسان اور انصاف کا معاملہ کرنا ممنوع نہیں ہے۔ جیسے حضرت اسماء بنت ابی بکر صدیق (رضي الله عنه) ما نے رسول اللہ (صلى الله عليه وسلم) سے اپنی مشرکہ ماں کی بابت صلہ رحمی یعنی حسن سلوک کرنے کا پوچھا، آپ (صلى الله عليه وسلم) نے فرمایا : صِلِي أُمَّكِ (صحيح مسلم ، كتاب الزكاة ، باب فضل النفقة والصدقة على الأقربين .... بخاري كتاب الأدب ، باب صلة الوالد المشرك) ”اپنی ماں کے ساتھ صلہ رحمی کرو“۔\n(4) اس میں انصاف کرنے کی ترغیب ہے حتیٰ کہ کافروں کے ساتھ بھی۔ حدیث میں انصاف کرنے والوں کی فضیلت یوں بیان ہوئی ہے «إَنَّ الْمُقْسِطِينَ عِنْدَ اللهِ عَلَى مَنَابِرَ مِنْ نُورٍ ، عَنْ يَمِينِ الرَّحْمَنِ عَزَّ وَجَلَّ - وَكِلْتَا يَدَيْهِ يَمِينٌ - الَّذِينَ يَعْدِلُونَ فِي حُكْمِهِمْ وَأَهْلِيهِمْ، وَمَا وَلُوا»(صحيح مسلم ، كتاب الإمارة ، باب فضيلة الإمام العادل ) ”انصا ف کرنے والے نور کے منبروں پر ہوں گے جو رحمٰن کے دائیں جانب ہوں گے اور رحمٰن کے دونوں ہاتھ دائیں ہیں، جو اپنے فیصلوں میں، اپنے اہل میں اور اپنی رعایا میں انصاف کا اہتمام کرتے ہیں“۔","lang":"ur","meta":{"transliteration":"lā yanhākumu al-lahu ʿani alladhīna lam yuqātilūkum fī al-dīni walam yukh'rijūkum min diyārikum an tabarrūhum watuq'siṭū ilayhim inna al-laha yuḥibbu al-muq'siṭīna ","translations":["Not","(does) forbid you","Allah","from","those who","(do) not","fight you","in","the religion","and (do) not","drive you out","of","your homes","that","you deal kindly","and deal justly","with them","Indeed","Allah","loves","those who act justly","(8)"],"transliterationArr":["lā","yanhākumu","al-lahu","ʿani","alladhīna","lam","yuqātilūkum","fī","al-dīni","walam","yukh'rijūkum","min","diyārikum","an","tabarrūhum","watuq'siṭū","ilayhim","inna","al-laha","yuḥibbu","al-muq'siṭīna",null],"verseTiming":[[1,0,550],[2,550,1610],[3,1610,2500],[4,2500,2880],[5,2880,3920],[6,3920,4250],[7,4250,5780],[8,5780,6050],[9,6050,6780],[10,6780,7350],[11,7350,8640],[12,8640,10280],[13,10280,11800],[14,11800,12960],[15,12960,14280],[16,14280,16750],[17,16750,18220],[18,18220,19440],[19,19440,20280],[20,20280,21080],[21,21080,24075]]}},{"name":"60:9","price":"اللہ تعالیٰ تمہیں صرف ان لوگوں کی محبت سے روکتا ہے جنہوں نے تم سے دین کے بارے میں لڑائیاں لڑیں اور تمہیں شہر سے نکال دیئے اور شہر سے نکالنے والوں کی مدد کی جو لوگ ایسے کفار سے محبت کریں(1) وه (قطعاً) ﻇالم ہیں.(2)","arabic":"إِنَّمَا يَنۡهَىٰكُمُ ٱللَّهُ عَنِ ٱلَّذِينَ قَٰتَلُوكُمۡ فِي ٱلدِّينِ وَأَخۡرَجُوكُم مِّن دِيَٰرِكُمۡ وَظَٰهَرُواْ عَلَىٰٓ إِخۡرَاجِكُمۡ أَن تَوَلَّوۡهُمۡۚ وَمَن يَتَوَلَّهُمۡ فَأُوْلَٰٓئِكَ هُمُ ٱلظَّٰلِمُونَ","category":["60 (Al-Mumtahanah)","Al-Mumtahanah","Surah Al-Mumtahanah"],"ayahNumber":5159,"juzNumber":28,"footnotes":"(1) یعنی ارشاد الٰہی اور امر ربانی سے اعراض کرتے ہوئے۔\n(2) کیوں کہ انہوں نے ایسے لوگوں سے محبت کی ہے جو محبت کے اہل نہیں تھے، اور یوں انہوں نے اپنے نفسوں پر ظلم کیا کہ انہیں اللہ کے عذاب کے لیے پیش کر دیا۔ دوسرے مقام پر فرمایا۔ «لا تَتَّخِذُوا الْيَهُودَ وَالنَّصَارَى أَوْلِيَاءَ بَعْضُهُمْ أَوْلِيَاءُ بَعْضٍ وَمَنْ يَتَوَلَّهُمْ مِنْكُمْ فَإِنَّهُ مِنْهُمْ إِنَّ اللَّهَ لا يَهْدِي الْقَوْمَ الظَّالِمِينَ» (المائدة: 51)۔","lang":"ur","meta":{"transliteration":"innamā yanhākumu al-lahu ʿani alladhīna qātalūkum fī al-dīni wa-akhrajūkum min diyārikum waẓāharū ʿalā ikh'rājikum an tawallawhum waman yatawallahum fa-ulāika humu al-ẓālimūna ","translations":["Only","forbids you","Allah","from","those who","fight you","in","the religion","and drive you out","of","your homes","and support","in","your expulsion","that","you make them allies","And whoever","makes them allies","then those","[they]","(are) the wrongdoers","(9)"],"transliterationArr":["innamā","yanhākumu","al-lahu","ʿani","alladhīna","qātalūkum","fī","al-dīni","wa-akhrajūkum","min","diyārikum","waẓāharū","ʿalā","ikh'rājikum","an","tawallawhum","waman","yatawallahum","fa-ulāika","humu","al-ẓālimūna",null],"verseTiming":[[1,0,1850],[2,1850,2910],[3,2910,3730],[4,3730,4110],[5,4110,5080],[6,5080,6450],[7,6450,6740],[8,6740,7460],[9,7460,8910],[10,8910,10500],[11,10500,11690],[12,11690,12790],[13,12790,14530],[14,14530,15910],[15,15910,17130],[16,17130,19030],[17,19030,19460],[18,19460,20440],[19,20440,21640],[20,21640,24250],[21,24250,24670],[22,24670,27435]]}},{"name":"60:10","price":"اے ایمان والو! جب تمہارے پاس مومن عورتیں ہجرت کرکے آئیں تو تم ان کا امتحان لو(1) ۔ دراصل ان کے ایمان کو بخوبی جاننے واﻻ تو اللہ ہی ہے لیکن اگر وه تمہیں ایمان والیاں معلوم ہوں(2) تو اب تم انہیں کافروں کی طرف واپس نہ کرو، یہ ان کے لیے حلال نہیں اور نہ وه ان کے لیے حلال ہیں(3)، اور جو خرچ ان کافروں کا ہوا ہو وه انہیں ادا کردو(4)، ان عورتوں کو ان کے مہر دے کر ان سے نکاح کر لینے میں تم پر کوئی گناه نہیں(5) اور کافر عورتوں کی ناموس اپنے قبضہ میں نہ رکھو(6) اور جو کچھ تم نے خرچ کیا ہو(7)، مانگ لو اور جو کچھ ان کافروں نے خرچ کیا ہو(8) وه بھی مانگ لیں یہ اللہ کا فیصلہ ہے جو تمہارے درمیان کر رہا ہے(9)، اللہ تعالیٰ بڑے علم (اور) حکمت واﻻ ہے.","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا جَآءَكُمُ ٱلۡمُؤۡمِنَٰتُ مُهَٰجِرَٰتٖ فَٱمۡتَحِنُوهُنَّۖ ٱللَّهُ أَعۡلَمُ بِإِيمَٰنِهِنَّۖ فَإِنۡ عَلِمۡتُمُوهُنَّ مُؤۡمِنَٰتٖ فَلَا تَرۡجِعُوهُنَّ إِلَى ٱلۡكُفَّارِۖ لَا هُنَّ حِلّٞ لَّهُمۡ وَلَا هُمۡ يَحِلُّونَ لَهُنَّۖ وَءَاتُوهُم مَّآ أَنفَقُواْۚ وَلَا جُنَاحَ عَلَيۡكُمۡ أَن تَنكِحُوهُنَّ إِذَآ ءَاتَيۡتُمُوهُنَّ أُجُورَهُنَّۚ وَلَا تُمۡسِكُواْ بِعِصَمِ ٱلۡكَوَافِرِ وَسۡـَٔلُواْ مَآ أَنفَقۡتُمۡ وَلۡيَسۡـَٔلُواْ مَآ أَنفَقُواْۚ ذَٰلِكُمۡ حُكۡمُ ٱللَّهِ يَحۡكُمُ بَيۡنَكُمۡۖ وَٱللَّهُ عَلِيمٌ حَكِيمٞ","category":["60 (Al-Mumtahanah)","Al-Mumtahanah","Surah Al-Mumtahanah"],"ayahNumber":5160,"juzNumber":28,"footnotes":"(1) معاہدۂ حدیبیہ میں ایک شق یہ تھی کہ مکے سے کوئی مسلمانوں کے پاس چلا جائے گا، تو اس کو واپس کرنا پڑے گا۔ لیکن اس میں مرد وعورت کی صراحت نہیں تھی۔ بظاہر کوئی (احد) میں دونوں ہی شامل تھے۔ چنانچہ بعد میں بعض عورتیں مکے سے ہجرت کرکے مسلمانوں کے پاس چلی گئیں تو کفار نے ان کی واپسی کا مطالبہ کیا، جس پر اللہ نے اس آیت میں مسلمانوں کی رہنمائی فرمائی اور یہ حکم دیا۔ امتحان لینے کا مطلب ہے اس امر کی تحقیق کرو کہ ہجرت کرکے آنے والی عورت جو ایمان کا اظہار کر رہی ہے، اپنے کافر خاوند سے ناراض ہوکر یا کسی مسلمان کے عشق میں یا کسی اور غرض سے تو نہیں آئی ہے اور صرف یہاں پناہ لینے کی خاطر ایمان کا دعویٰ کر رہی ہے۔\n(2) یعنی تم اپنی تحقیق سے اس نتیجے پر پہنچو اور تمہیں گمان غالب حاصل ہو جائے کہ یہ واقعی مومنہ ہیں۔\n(3) یہ انہیں ان کے کافر خاوندوں کے پاس واپس نہ کرنے کی علت ہے کہ اب کوئی مومن عورت کسی کافر کے لیے حلال نہیں۔ جیسا کہ ابتدائے اسلام میں یہ جائز تھا، چنانچہ نبی (صلى الله عليه وسلم) کی صاحبزادی حضرت زینب (رضی الله عنها) کا نکاح ابو العاص ابن ربیع کے ساتھ ہوا تھا، جب کہ وہ مسلمان نہیں تھے۔ لیکن اس آیت نے آئندہ کے لیے ایسا کرنے سے منع کر دیا، اسی لیے یہاں فرمایا گیا کہ وہ ایک دوسرے کے لیے حلال نہیں، اس لیے انہیں کافروں کے پاس مت لوٹاؤ۔ ہاں اگر شوہر بھی مسلمان ہو جائے تو پھر ان کا نکاح برقرار رہ سکتا ہے۔ چاہے خاوند عورت کے بعد ہجرت کرکے آئے۔\n(4) یعنی ان کے کافر خاوندوں نے ان کو جو مہر ادا کیا ہے ، وہ تم انہیں ادا کر دو۔\n(5) یہ مسلمانوں کو کہا جارہا ہے کہ یہ عورتیں، جو ایمان کی خاطر اپنے کافر خاوندوں کو چھوڑ کر تمہارے پاس آگئی ہیں ، تم ان سے نکاح کر سکتے ہو، بشرطیکہ ان کا حق مہر تم ادا کرو۔ تاہم یہ نکاح مسنون طریقے سے ہی ہوگا۔ یعنی ایک تو انقضائے عدت (استبراء رحم) کے بعد ہوگا۔ دوسرے، اس میں ولی کی اجازت اور دو عادل گواہوں کی موجودگی بھی ضروری ہے۔ البتہ عورت مدخول بہا نہیں ہے تو پھر بلاعدت فوری نکاح جائز ہے۔\n(6) عِصَمٌ، عِصْمَةٌ کی جمع ہے، یہاں اس سے مراد عصمت عقد نکاح ہے۔ مطلب یہ ہے کہ اگر خاوند مسلمان ہو جائے اور بیوی بدستور کافر اور مشرک رہے تو ایسی مشرک عورت کو اپنے نکاح میں رکھنا جائز نہیں ہے۔ اسے فوراً طلاق دے کر اپنے سے علیحدہ کر دیا جائے۔ چنانچہ اس حکم کے بعد حضرت عمر (رضي الله عنه) نے اپنی دو مشرک بیویوں کو اور حضرت طلحہ ابن عبید اللہ (رضي الله عنه) نے اپنی بیوی کو طلاق دے دی۔ (ابن کثیر) البتہ اگر بیوی کتابیہ (یہودی یا عیسائی) ہو تو اسے طلاق دینا ضروری نہیں ہے۔ کیونکہ ان سے نکاح جائز ہے، اس لیے اگر وہ پہلے سے ہی بیوی کی حیثیت سے تمہارے پاس موجود ہے تو قبول اسلام کے بعد اسے علیحدہ کرنے کی ضرورت نہیں ہے۔\n(7) یعنی ان عورتوں پر جو کفر پر برقرار رہنے کی وجہ سے کافروں کے پاس چلی گئی ہیں۔\n(8) یعنی ان عورتوں پر جو مسلمان ہوکر ہجرت کرکے مدینے آگئی ہیں۔\n(9) یعنی یہ حکم مذکور کہ دونوں ایک دوسرے کو حق مہر ادا کریں بلکہ مانگ کرلیں، اللہ کا حکم ہے۔ امام قرطبی فرماتے ہیں کہ یہ حکم اس دور کے ساتھ ہی خاص تھا۔ اس پر مسلمانوں کا اجماع ہے۔ (فتح القدیر) اس کی وجہ وہ معاہدہ ہے جو اس وقت فریقین کے درمیان تھا۔ اس قسم کے معاہدے کی صورت میں آئندہ بھی اس پر عمل کرنا ضروری ہوگا۔ بصورت دیگر نہیں۔","lang":"ur","meta":{"transliteration":"yāayyuhā alladhīna āmanū idhā jāakumu al-mu'minātu muhājirātin fa-im'taḥinūhunna al-lahu aʿlamu biīmānihinna fa-in ʿalim'tumūhunna mu'minātin falā tarjiʿūhunna ilā al-kufāri lā hunna ḥillun lahum walā hum yaḥillūna lahunna waātūhum mā anfaqū walā junāḥa ʿalaykum an tankiḥūhunna idhā ātaytumūhunna ujūrahunna walā tum'sikū biʿiṣami al-kawāfiri wasalū mā anfaqtum walyasalū mā anfaqū dhālikum ḥuk'mu al-lahi yaḥkumu baynakum wal-lahu ʿalīmun ḥakīmun ","translations":["O you","who","believe","When","come to you","the believing women","(as) emigrants","then examine them","Allah","(is) most knowing","of their faith","And if","you know them","(to be) believers","then (do) not","return them","to","the disbelievers","Not","they","(are) lawful","for them","and not","they","are lawful","for them","But give them","what","they have spent","And not","any blame","upon you","if","you marry them","when","you have given them","their (bridal) dues","And (do) not","hold","to marriage bonds","(with) disbelieving women","but ask (for)","what","you have spent","and let them ask","what","they have spent","That","(is the) Judgment","(of) Allah","He judges","between you","And Allah","(is) All-Knowing","All-Wise","(10)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","idhā","jāakumu","al-mu'minātu","muhājirātin","fa-im'taḥinūhunna","al-lahu","aʿlamu","biīmānihinna","fa-in","ʿalim'tumūhunna","mu'minātin","falā","tarjiʿūhunna","ilā","al-kufāri","lā","hunna","ḥillun","lahum","walā","hum","yaḥillūna","lahunna","waātūhum","mā","anfaqū","walā","junāḥa","ʿalaykum","an","tankiḥūhunna","idhā","ātaytumūhunna","ujūrahunna","walā","tum'sikū","biʿiṣami","al-kawāfiri","wasalū","mā","anfaqtum","walyasalū","mā","anfaqū","dhālikum","ḥuk'mu","al-lahi","yaḥkumu","baynakum","wal-lahu","ʿalīmun","ḥakīmun",null],"verseTiming":[[1,0,2880],[2,2880,3840],[3,3840,6470],[4,6470,7040],[5,7040,9530],[6,9530,10890],[7,10890,12970],[8,12970,15600],[9,15600,16870],[10,16870,17640],[11,17640,19880],[12,19880,20880],[13,20880,23260],[14,23260,24610],[15,24610,25600],[16,25600,25940],[17,25940,28040],[18,28040,28430],[19,28430,29260],[20,29260,31360],[21,31360,33440],[22,33440,34140],[23,34140,34910],[24,34910,35430],[25,35430,35790],[26,35790,36980],[27,36980,38340],[28,38340,40190],[29,40190,42800],[30,42800,44600],[31,44600,45630],[32,45630,46430],[33,46430,47440],[34,47440,48390],[35,48390,51300],[36,51300,53330],[37,53330,56010],[38,56010,58180],[39,58180,59180],[40,59180,60210],[41,60210,61050],[42,61050,62190],[43,62190,63150],[44,63150,64810],[45,64810,66700],[46,66700,68020],[47,68020,70140],[48,70140,71810],[49,71810,73330],[50,73330,73930],[51,73930,74740],[52,74740,75520],[53,75520,76850],[54,76850,77790],[55,77790,78740],[56,78740,81225]]}},{"name":"60:11","price":"اور اگر تمہاری کوئی بیوی تمہارے ہاتھ سے نکل جائے اور کافروں کے پاس چلی جائے پھر تمہیں اس کے بدلے کا وقت مل جائے(1) تو جن کی بیویاں چلی گئی ہیں انہیں ان کے اخراجات کے برابر ادا کر دو، اور اس اللہ تعالیٰ سے ڈرتے رہو جس پر تم ایمان رکھتے ہو.","arabic":"وَإِن فَاتَكُمۡ شَيۡءٞ مِّنۡ أَزۡوَٰجِكُمۡ إِلَى ٱلۡكُفَّارِ فَعَاقَبۡتُمۡ فَـَٔاتُواْ ٱلَّذِينَ ذَهَبَتۡ أَزۡوَٰجُهُم مِّثۡلَ مَآ أَنفَقُواْۚ وَٱتَّقُواْ ٱللَّهَ ٱلَّذِيٓ أَنتُم بِهِۦ مُؤۡمِنُونَ","category":["60 (Al-Mumtahanah)","Al-Mumtahanah","Surah Al-Mumtahanah"],"ayahNumber":5161,"juzNumber":28,"footnotes":"(1) فَعَاقَبْتُمْ (پس تم سزا دو یا بدلہ لو) کا ایک مفہوم تو یہ ہے کہ مسلمان ہوکر آنے والی عورتوں کے حق مہر، جو تمہیں ان کے کافر شوہروں کو ادا کرنے تھے، وہ تم ان مسلمانوں کو دے دو، جن کی عورتیں کافر ہونے کی وجہ سے کافروں کے پاس چلی گئی ہیں۔ اور انہوں نے مسلمانوں کو مہر ادا نہیں کیا۔ (یعنی یہ بھی سزا کی ایک صورت ہے) دوسرا مفہوم یہ ہے کہ تم کافروں سے جہاد کرو اور جو مال غنیمت حاصل ہو، اس میں تقسیم سے پہلے ان مسلمانوں کو، جن کی بیویاں دار الکفر چلی گئی ہیں، ان کے خرچ کے بقدر ادا کر دو۔ گویا مال غنیمت سے مسلمانوں کے نقصان کا جبر (ازالہ) یہ بھی سزا ہے (ایسرالتفاسیر وابن کثیر) اگر مال غنیمت سے بھی ازالہ کی صورت نہ ہو تو بیت المال سے تعاون کیا جائے۔ (ایسرالتفاسیر)۔","lang":"ur","meta":{"transliteration":"wa-in fātakum shayon min azwājikum ilā al-kufāri faʿāqabtum faātū alladhīna dhahabat azwājuhum mith'la mā anfaqū wa-ittaqū al-laha alladhī antum bihi mu'minūna ","translations":["And if","have gone from you","any","of","your wives","to","the disbelievers","then your turn comes","then give","(to) those who","have gone","their wives","(the) like","(of) what","they had spent","And fear","Allah","(in) Whom","you","[in Him]","(are) believers","(11)"],"transliterationArr":["wa-in","fātakum","shayon","min","azwājikum","ilā","al-kufāri","faʿāqabtum","faātū","alladhīna","dhahabat","azwājuhum","mith'la","mā","anfaqū","wa-ittaqū","al-laha","alladhī","antum","bihi","mu'minūna",null],"verseTiming":[[1,0,1430],[2,1430,2390],[3,2390,3090],[4,3090,4120],[5,4120,5550],[6,5550,5900],[7,5900,7050],[8,7050,8380],[9,8380,9160],[10,9160,10070],[11,10070,10900],[12,10900,12130],[13,12130,13530],[14,13530,15170],[15,15170,16900],[16,16900,18030],[17,18030,18740],[18,18740,21130],[19,21130,23390],[20,23390,23890],[21,23890,26815]]}},{"name":"60:12","price":"اے پیغمبر! جب مسلمان عورتیں آپ سے ان باتوں پر بیعت کرنے آئیں کہ وه اللہ کے ساتھ کسی کو شریک نہ کریں گی، چوری نہ کریں گی، زنا کاری نہ کریں گی، اپنی اوﻻد کو نہ مار ڈالیں گی اور کوئی ایسا بہتان نہ باندھیں گی جو خود اپنے ہاتھوں پیروں کے سامنے گھڑ لیں اور کسی نیک کام میں تیری بےحکمی نہ کریں گی تو آپ ان سے بیعت کر لیا کریں(1) ، اور ان کے لیے اللہ سے مغفرت طلب کریں بیشک اللہ تعالیٰ بخشنے اور معاف کرنے واﻻ ہے.","arabic":"يَٰٓأَيُّهَا ٱلنَّبِيُّ إِذَا جَآءَكَ ٱلۡمُؤۡمِنَٰتُ يُبَايِعۡنَكَ عَلَىٰٓ أَن لَّا يُشۡرِكۡنَ بِٱللَّهِ شَيۡـٔٗا وَلَا يَسۡرِقۡنَ وَلَا يَزۡنِينَ وَلَا يَقۡتُلۡنَ أَوۡلَٰدَهُنَّ وَلَا يَأۡتِينَ بِبُهۡتَٰنٖ يَفۡتَرِينَهُۥ بَيۡنَ أَيۡدِيهِنَّ وَأَرۡجُلِهِنَّ وَلَا يَعۡصِينَكَ فِي مَعۡرُوفٖ فَبَايِعۡهُنَّ وَٱسۡتَغۡفِرۡ لَهُنَّ ٱللَّهَۚ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ","category":["60 (Al-Mumtahanah)","Al-Mumtahanah","Surah Al-Mumtahanah"],"ayahNumber":5162,"juzNumber":28,"footnotes":"(1) یہ بیعت اس وقت لیتے جب عورتیں ہجرت کرکے آ تیں، جیسا کہ صحیح بخاری تفسیر سورۂ ممتحنہ میں ہے۔ علاوہ ازیں فتح مکہ والے دن بھی آپ (صلى الله عليه وسلم) نے قریش کی عورتوں سے بیعت لی۔ بیعت لیتے وقت آپ (صلى الله عليه وسلم) صرف زبان سے عہد لیتے۔ کسی عورت کے ہاتھ کو آپ (صلى الله عليه وسلم) نہیں چھوتے تھے۔ حضرت عائشہ (رضی الله عنها) فرماتی ہیں (اللہ کی قسم بیعت میں نبی (صلى الله عليه وسلم) کے ہاتھ نے کبھی کسی عورت کے ہاتھ کو نہیں چھوا۔ بیعت کرتے وقت آپ (صلى الله عليه وسلم) صرف یہ فرماتے ، کہ میں نے ان باتوں پر تجھ سے بیعت لے لی)۔ (صحيح البخاري، تفسير سورة الممتحنة) بیعت میں آپ (صلى الله عليه وسلم) یہ عہد بھی عورتوں سے لیتے تھے کہ وہ نوحہ نہیں کریں گی، گریبان چاک نہیں کریں گی، سر کے بال نہیں نوچیں گی اور جاہلیت کی طرح بین نہیں کریں گی۔ (صحيح بخاري وصحيح مسلم وغيرهما) اس بیعت میں نماز، روزہ، حج اور زکٰوۃ وغیرہ کا ذکر نہیں ہے، اس لیے کہ یہ ارکان دین اور شعائر اسلام ہونے کے اعتبار سے محتاج وضاحت نہیں۔ آپ (صلى الله عليه وسلم) نے بطور خاص ان چیزوں کی بیعت لی جن کا عام ارتکاب عورتوں سے ہوتا تھا، تاکہ وہ ارکان دین کی پابندی کے ساتھ، ان چیزوں سے بھی اجتناب کریں۔ اس سے یہ بات معلوم ہوئی کہ علما ودعاۃ اور واعظین حضرات اپنا زور خطابت ارکان دین کے بیان کرنے میں ہی صرف نہ کریں جو پہلے ہی واضح ہیں، بلکہ ان خرابیوں اور رسموں کی بھی پر زور انداز میں تردید کیا کریں جو معاشرے میں عام ہیں اور نماز روزے کے پابند حضرات بھی ان سے اجتناب نہیں کرتے۔","lang":"ur","meta":{"transliteration":"yāayyuhā al-nabiyu idhā jāaka al-mu'minātu yubāyiʿ'naka ʿalā an lā yush'rik'na bil-lahi shayan walā yasriq'na walā yaznīna walā yaqtul'na awlādahunna walā yatīna bibuh'tānin yaftarīnahu bayna aydīhinna wa-arjulihinna walā yaʿṣīnaka fī maʿrūfin fabāyiʿ'hunna wa-is'taghfir lahunna al-laha inna al-laha ghafūrun raḥīmun ","translations":["O","Prophet","When","come to you","the believing women","pledging to you","[on]","that","not","they will associate","with Allah","anything","and not","they will steal","and not","they will commit adultery","and not","they will kill","their children","and not","they bring","slander","they invent it","between","their hands","and their feet","and not","they will disobey you","in","(the) right","then accept their pledge","and ask forgiveness","for them","(from) Allah","Indeed","Allah","(is) Oft-Forgiving","Most Merciful","(12)"],"transliterationArr":["yāayyuhā","al-nabiyu","idhā","jāaka","al-mu'minātu","yubāyiʿ'naka","ʿalā","an","lā","yush'rik'na","bil-lahi","shayan","walā","yasriq'na","walā","yaznīna","walā","yaqtul'na","awlādahunna","walā","yatīna","bibuh'tānin","yaftarīnahu","bayna","aydīhinna","wa-arjulihinna","walā","yaʿṣīnaka","fī","maʿrūfin","fabāyiʿ'hunna","wa-is'taghfir","lahunna","al-laha","inna","al-laha","ghafūrun","raḥīmun",null],"verseTiming":[[1,0,2740],[2,2740,4280],[3,4280,4820],[4,4820,7380],[5,7380,8640],[6,8640,10000],[7,10000,10290],[8,10290,11980],[9,11980,12520],[10,12520,13520],[11,13520,14440],[12,14440,15040],[13,15040,16450],[14,16450,17480],[15,17480,18010],[16,18010,19050],[17,19050,19550],[18,19550,20600],[19,20600,22690],[20,22690,23200],[21,23200,24180],[22,24180,26100],[23,26100,27550],[24,27550,28120],[25,28120,30070],[26,30070,32300],[27,32300,32830],[28,32830,34030],[29,34030,34460],[30,34460,36300],[31,36300,38650],[32,38650,39730],[33,39730,41460],[34,41460,43640],[35,43640,44520],[36,44520,45320],[37,45320,46370],[38,46370,49390]]}},{"name":"60:13","price":"اے مسلمانو! تم اس قوم سے دوستی نہ رکھو جن پر اللہ کا غضب نازل ہوچکا ہے(1) جو آخرت سے اس طرح مایوس ہوچکے ہیں جیسے کہ مرده اہل قبر سے کافر ناامید ہیں.(2)","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَتَوَلَّوۡاْ قَوۡمًا غَضِبَ ٱللَّهُ عَلَيۡهِمۡ قَدۡ يَئِسُواْ مِنَ ٱلۡأٓخِرَةِ كَمَا يَئِسَ ٱلۡكُفَّارُ مِنۡ أَصۡحَٰبِ ٱلۡقُبُورِ","category":["60 (Al-Mumtahanah)","Al-Mumtahanah","Surah Al-Mumtahanah"],"ayahNumber":5163,"juzNumber":28,"footnotes":"(1) اس سے بعض نے یہود، بعض نے منافقین اور بعض نے تمام کافر مراد لیے ہیں۔ یہ آخری قول ہی زیادہ صحیح ہے، کیونکہ اس میں یہود ومنافقین بھی آجاتے ہیں، علاوہ ازیں سارے کفار ہی غضب الٰہی کے مستحق ہیں، اس لیے مطلب یہ ہوگا کہ کسی بھی کافر سے دوستانہ تعلق مت رکھو، جیسا کہ یہ مضمون قرآن میں کئی جگہ بیان کیا گیا ہے۔\n(2) آخرت سے مایوس ہونے کا مطلب، قیامت کے برپا ہونے سے انکار ہے۔ اصحاب القبور (قبروں میں مدفون لوگوں) سے مایوس ہونے کا مطلب بھی یہی ہے کہ وہ آخرت میں دوبارہ نہیں اٹھائے جائیں گے۔ ایک دوسرے معنی اس کے یہ کیے گئے ہیں کہ قبروں میں مدفون کافر، ہر قسم کی خیر سے مایوس ہوگئے۔ کیونکہ مرکر انہوں نے اپنے کفر کا انجام دیکھ لیا، اب وہ خیر کی کیا توقع کرسکتے ہیں؟ (ابن جریر طبری)۔","lang":"ur","meta":{"transliteration":"yāayyuhā alladhīna āmanū lā tatawallaw qawman ghaḍiba al-lahu ʿalayhim qad ya-isū mina al-ākhirati kamā ya-isa al-kufāru min aṣḥābi al-qubūri ","translations":["O you","who","believe","(Do) not","make allies","(of) a people","(The) wrath","(of) Allah","(is) upon them","Indeed","they despair","of","the Hereafter","as","despair","the disbelievers","of","(the) companions","(of) the graves","(13)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","lā","tatawallaw","qawman","ghaḍiba","al-lahu","ʿalayhim","qad","ya-isū","mina","al-ākhirati","kamā","ya-isa","al-kufāru","min","aṣḥābi","al-qubūri",null],"verseTiming":[[1,0,2780],[2,2780,3690],[3,3690,4750],[4,4750,5130],[5,5130,6440],[6,6440,7220],[7,7220,7730],[8,7730,8620],[9,8620,9620],[10,9620,9960],[11,9960,10850],[12,10850,11200],[13,11200,12960],[14,12960,13230],[15,13230,14160],[16,14160,14480],[17,14480,15810],[18,15810,16440],[19,16440,17110],[20,17110,18470],[21,18470,18920],[22,18920,19950],[23,19950,25615]]}}],"chapter":["60 (Al-Mumtahanah)","Al-Mumtahanah","Surah Al-Mumtahanah","Chapter Al-Mumtahanah","Mumtahanah","Surah Mumtahanah","Chapter Mumtahanah","Al Mumtahanah","Surah Al Mumtahanah","Chapter Al Mumtahanah","Surah 60","Chapter 60","She that is to be Examined","الممتحنة"],"version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."}}