{"data":[{"name":"66:1","price":"اے نبی! جس چیز کو اللہ نے آپ کے لیے حلال کر دیا ہے اسے آپ کیوں حرام کرتے ہیں(1) ؟ (کیا) آپ اپنی بیویوں کی رضامندی حاصل کرنا چاہتے ہیں اور اللہ بخشنے واﻻ رحم کرنے واﻻ ہے.","arabic":"يَٰٓأَيُّهَا ٱلنَّبِيُّ لِمَ تُحَرِّمُ مَآ أَحَلَّ ٱللَّهُ لَكَۖ تَبۡتَغِي مَرۡضَاتَ أَزۡوَٰجِكَۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ","category":["66 (At-Tahrim)","At-Tahrim","Surah At-Tahrim"],"ayahNumber":5230,"juzNumber":28,"footnotes":"(1) نبی (صلى الله عليه وسلم) نے جس چیز کو اپنے لئے حرام کرلیا تھا، وہ کیا تھی؟ جس پر اللہ نے ناپسندیدگی کا اظہار فرمایا۔ اس سلسلے میں ایک تو وہ مشہور واقعہ ہے جو صحیح بخاری و مسلم وغیرہ میں نقل ہوا ہے کہ آپ (صلى الله عليه وسلم) حضرت زینب بنت جحش (رضی الله عنها) کے پاس کچھ دیر ٹھہرتے اور وہاں شہد پیتے، حضرت حفصہ اور حضرت عائشہ ب دونوں نے وہاں معمول سے زیادہ دیر تک آپ (صلى الله عليه وسلم)کو ٹھہرنے سے روکنے کے لئے یہ سکیم تیار کی کہ ان میں سے جس کے پاس بھی آپ (صلى الله عليه وسلم) تشریف لائیں تو وہ ان سے کہے کہ اللہ کے رسول! آپ (صلى الله عليه وسلم) کے منہ سے مغافیر (ایک قسم کا پھول جس میں بساند ہوتی ہے) کی بو آرہی ہے۔ چنانچہ انہوں نے ایسا ہی کیا آپ (صلى الله عليه وسلم) نے فرمایا، میں نے تو زینب (رضی الله عنها)کے گھر صرف شہد پیا ہے۔ اب میں قسم کھاتا ہوں کہ یہ نہیں پیوں گا، لیکن یہ بات تم کسی کو مت بتلانا۔ صحیح بخاری۔ سنن نسائی میں بیان کیا گیا ہے کہ وہ ایک لونڈی تھی جس کو آپ (صلى الله عليه وسلم)نے اپنے اوپر حرام کرلیا تھا (سنن نسائی) جب کہ کچھ دوسرے علماء اسے ضعیف قرار دیتے ہیں اس کی تفصیل دوسری کتابوں میں اس طرح بیان کی گئی ہے کہ یہ حضرت ماریہ قبطیہ (رضی الله عنها)تھیں جن سے نبی (صلى الله عليه وسلم) کے صاحبزادے ابراہیم (عليه السلام)تولد ہوئے تھے، یہ ایک مرتبہ حضرت حفصہ (رضی الله عنها)کے گھر آگئی تھیں جب کہ حضرت حفصہ (رضی الله عنها) موجود نہیں تھیں اتفاق سے انہی کی موجودگی میں حضرت حفصہ (رضی الله عنها) آگئیں انہیں نبی (صلى الله عليه وسلم) کے ساتھ اپنے گھر میں خلوت میں دیکھنا ناگوار گزرا۔ جسے نبی (صلى الله عليه وسلم) نے بھی محسوس فرمایا جس پر آپ (صلى الله عليه وسلم) نے حضرت حفصہ (رضی الله عنها) کو راضی کرنے کے لیے قسم کھا کر ماریہ ر(رضی الله عنها) کو اپنے اوپر حرام کرلیا اور حفصہ (رضی الله عنها)کو تاکید کی کہ وہ یہ بات کسی کو نہ بتلائے امام ابن حجر ایک تو یہ فرماتے ہیں کہ یہ واقعہ مختلف طرق سے نقل ہوا ہے جو ایک دوسرے کو تقویت پہنچاتے ہیں دوسری بات وہ یہ فرماتے ہیں کہ ممکن ہے بیک وقت دونوں ہی واقعات اس آیت کے نزول کا سبب بنے ہوں۔ فتح الباری۔ امام شوکانی نے بھی اسی رائے کا اظہار کیا ہے اور دونوں کو صحیح قرار دیا ہے اس سے یہ بات واضح ہوئی کہ اللہ کی حلال کردہ چیز کو حرام کرنے کا اختیار کسی کے پاس بھی نہیں ہے حتی کہ رسول اللہ (صلى الله عليه وسلم) بھی یہ اختیار نہیں رکھتے۔","lang":"ur","meta":{"transliteration":"yāayyuhā al-nabiyu lima tuḥarrimu mā aḥalla al-lahu laka tabtaghī marḍāta azwājika wal-lahu ghafūrun raḥīmun ","translations":["O","Prophet","Why (do)","you prohibit","what","has made lawful","Allah","for you","seeking","(to) please","your wives","And Allah","(is) Oft-Forgiving","Most Merciful","(1)"],"transliterationArr":["yāayyuhā","al-nabiyu","lima","tuḥarrimu","mā","aḥalla","al-lahu","laka","tabtaghī","marḍāta","azwājika","wal-lahu","ghafūrun","raḥīmun",null],"verseTiming":[[1,0,2770],[2,2770,4410],[3,4410,4760],[4,4760,5780],[5,5780,7830],[6,7830,8580],[7,8580,9500],[8,9500,10350],[9,10350,11280],[10,11280,12270],[11,12270,13780],[12,13780,14720],[13,14720,15750],[14,15750,18305]]}},{"name":"66:2","price":"تحقیق کہ اللہ تعالیٰ نے تمہارے لیے قسموں کو کھول ڈالنا مقرر کر دیا ہے(1) اور اللہ تمہارا کارساز ہے اور وہی (پورے) علم واﻻ، حکمت واﻻ ہے.","arabic":"قَدۡ فَرَضَ ٱللَّهُ لَكُمۡ تَحِلَّةَ أَيۡمَٰنِكُمۡۚ وَٱللَّهُ مَوۡلَىٰكُمۡۖ وَهُوَ ٱلۡعَلِيمُ ٱلۡحَكِيمُ","category":["66 (At-Tahrim)","At-Tahrim","Surah At-Tahrim"],"ayahNumber":5231,"juzNumber":28,"footnotes":"(1) یعنی کفارہ ادا کرکے اس کام کو کرنے کی، جس کی نہ کرنے کی قسم کھائی ہو، اجازت دے دی، قسم کا یہ کفارہ سورۃ مائد ۃ۔ 89 میں بیان کیا گیا ہے۔ چنانچہ نبی (صلى الله عليه وسلم) نے بھی کفارہ ادا کیا (فتح القدیر) اس امر میں علماء کے مابین اختلاف ہے کہ اگر کوئی شخص کسی چیز کو اپنے اوپر حرام کرلے تو اس کا یہ حکم ہے؟ جمہور علماء کے نزدیک بیوی کے علاوہ کسی چیز کو حرام کرنے سے وہ چیز حرام ہوگی اور نہ اس پر کفارہ ہے، اگر بیوی کو اپنے اوپر حرام کرے گا تو اس سے اس کا مقصد اگر طلاق ہے تو طلاق ہو جائے گی اور اگر طلاق کی نیت نہیں ہے تو راجح قول کے مطابق یہ قسم ہے، اس کے لئے کفارہ کی ادائیگی ضروری ہے۔ (ایسر التفاسیر)۔","lang":"ur","meta":{"transliteration":"qad faraḍa al-lahu lakum taḥillata aymānikum wal-lahu mawlākum wahuwa al-ʿalīmu al-ḥakīmu ","translations":["Indeed","has ordained","Allah","for you","(the) dissolution","(of) your oaths","And Allah","(is) your Protector","and He","(is) the All-Knower","the All-Wise","(2)"],"transliterationArr":["qad","faraḍa","al-lahu","lakum","taḥillata","aymānikum","wal-lahu","mawlākum","wahuwa","al-ʿalīmu","al-ḥakīmu",null],"verseTiming":[[1,0,360],[2,360,1020],[3,1020,1780],[4,1780,2360],[5,2360,3430],[6,3430,5220],[7,5220,6150],[8,6150,7790],[9,7790,8300],[10,8300,9290],[11,9290,12115]]}},{"name":"66:3","price":"اور یاد کر جب نبی نے اپنی بعض عورتوں سے ایک پوشیده بات کہی(1) ، پس جب اس نے اس بات کی خبر کر دی(2) اور اللہ نے اپنے نبی کو اس پر آگاه کر دیا تو نبی نے تھوڑی سی بات تو بتا دی اور تھوڑی سی ٹال گئے(3)، پھر جب نبی نے اپنی اس بیوی کو یہ بات بتائی تو وه کہنے لگی اس کی خبر آپ کو کس نے دی(4)۔ کہا سب جاننے والے پوری خبر رکھنے والے اللہ نے مجھے یہ بتلایا ہے.(5)","arabic":"وَإِذۡ أَسَرَّ ٱلنَّبِيُّ إِلَىٰ بَعۡضِ أَزۡوَٰجِهِۦ حَدِيثٗا فَلَمَّا نَبَّأَتۡ بِهِۦ وَأَظۡهَرَهُ ٱللَّهُ عَلَيۡهِ عَرَّفَ بَعۡضَهُۥ وَأَعۡرَضَ عَنۢ بَعۡضٖۖ فَلَمَّا نَبَّأَهَا بِهِۦ قَالَتۡ مَنۡ أَنۢبَأَكَ هَٰذَاۖ قَالَ نَبَّأَنِيَ ٱلۡعَلِيمُ ٱلۡخَبِيرُ","category":["66 (At-Tahrim)","At-Tahrim","Surah At-Tahrim"],"ayahNumber":5232,"juzNumber":28,"footnotes":"(1) وہ پوشیدہ بات شہد کو یا ماریہ (رضی الله عنها)کو حرام کرنے والی بات تھی جو آپ (صلى الله عليه وسلم) نے حضرت حفصہ (رضی الله عنها)سے کی تھی۔\n(2) یعنی حفصہ (رضی الله عنها)نے وہ بات حضرت عائشہ (رضی الله عنها) کو جاکر بتلا دی۔\n(3) یعنی حفصہ (رضی الله عنها)کو بتلا دیا کہ تم نے میرا راز فاش کر دیا ہے۔ تاہم اپنی تکریم و عظمت کے پیش نظر ساری بات بتانے سے اعراض فرمایا۔\n(4) جب نبی (صلى الله عليه وسلم) نے حفصہ (رضی الله عنها) کو بتلایا کہ تم نے میرا راز ظاہر کر دیا ہے تو وہ حیران ہوئیں کیونکہ انہوں نے حضرت عائشہ (رضی الله عنها) کے علاوہ کسی کو یہ بات نہیں بتلائی تھی اور عائشہ (رضی الله عنها)سے انہیں یہ توقع نہیں تھی کہ وہ آپ(صلى الله عليه وسلم) کو بتلا دیں گی، کیونکہ وہ شریک معاملہ تھیں۔\n(5) اس سے معلوم ہوا کہ قرآن کے علاوہ بھی آپ (صلى الله عليه وسلم) پر وحی کا نزول ہوتا تھا۔","lang":"ur","meta":{"transliteration":"wa-idh asarra al-nabiyu ilā baʿḍi azwājihi ḥadīthan falammā nabba-at bihi wa-aẓharahu al-lahu ʿalayhi ʿarrafa baʿḍahu wa-aʿraḍa ʿan baʿḍin falammā nabba-ahā bihi qālat man anba-aka hādhā qāla nabba-aniya al-ʿalīmu al-khabīru ","translations":["And when","confided","the Prophet","to","one","(of) his wives","a statement","and when","she informed","about it","and made it apparent","Allah","to him","he made known","a part of it","and avoided","[of]","a part","Then when","he informed her","about it","she said","Who","informed you","this","He said","Has informed me","the All-Knower","the All-Aware","(3)"],"transliterationArr":["wa-idh","asarra","al-nabiyu","ilā","baʿḍi","azwājihi","ḥadīthan","falammā","nabba-at","bihi","wa-aẓharahu","al-lahu","ʿalayhi","ʿarrafa","baʿḍahu","wa-aʿraḍa","ʿan","baʿḍin","falammā","nabba-ahā","bihi","qālat","man","anba-aka","hādhā","qāla","nabba-aniya","al-ʿalīmu","al-khabīru",null],"verseTiming":[[1,0,560],[2,560,1340],[3,1340,2900],[4,2900,3450],[5,3450,4030],[6,4030,5320],[7,5320,6960],[8,6960,8600],[9,8600,9490],[10,9490,10100],[11,10100,11240],[12,11240,12030],[13,12030,12800],[14,12800,13660],[15,13660,14620],[16,14620,15590],[17,15590,15850],[18,15850,17130],[19,17130,19470],[20,19470,20560],[21,20560,21150],[22,21150,21900],[23,21900,22280],[24,22280,24040],[25,24040,24970],[26,24970,26040],[27,26040,27150],[28,27150,28060],[29,28060,30895]]}},{"name":"66:4","price":"(اے نبی کی دونوں بیویو!) اگر تم دونوں اللہ کے سامنے توبہ کرلو (تو بہت بہتر ہے(1) ) یقیناً تمہارے دل جھک پڑے ہیں(2) اور اگر تم نبی کے خلاف ایک دوسرے کی مدد کرو گی پس یقیناً اس کا کارساز اللہ ہے اور جبریل ہیں اور نیک اہل ایمان اور ان کے علاوه فرشتے بھی مدد کرنے والے ہیں.(3)","arabic":"إِن تَتُوبَآ إِلَى ٱللَّهِ فَقَدۡ صَغَتۡ قُلُوبُكُمَاۖ وَإِن تَظَٰهَرَا عَلَيۡهِ فَإِنَّ ٱللَّهَ هُوَ مَوۡلَىٰهُ وَجِبۡرِيلُ وَصَٰلِحُ ٱلۡمُؤۡمِنِينَۖ وَٱلۡمَلَٰٓئِكَةُ بَعۡدَ ذَٰلِكَ ظَهِيرٌ","category":["66 (At-Tahrim)","At-Tahrim","Surah At-Tahrim"],"ayahNumber":5233,"juzNumber":28,"footnotes":"(1) یا تمہاری توبہ قبول کر لی جائے گی یہ شرط ان تتوبا کا جواب محذوف ہے۔\n(2) یعنی حق سے ہٹ گئے ہیں اور وہ ہے ان کا ایسی چیز پسند کرنا جو نبی (صلى الله عليه وسلم) کے لئے ناگوار تھی (فتح القدیر)۔\n(3) یعنی نبی (صلى الله عليه وسلم) کے مقابلے میں تم جتھہ بندی کروگی تو نبی کا کچھ نہیں بگاڑ سکو گی، اس لئے کہ نبی کا مددگار تو اللہ بھی ہے اور مومنین اور ملائکہ بھی۔","lang":"ur","meta":{"transliteration":"in tatūbā ilā al-lahi faqad ṣaghat qulūbukumā wa-in taẓāharā ʿalayhi fa-inna al-laha huwa mawlāhu wajib'rīlu waṣāliḥu al-mu'minīna wal-malāikatu baʿda dhālika ẓahīrun ","translations":["If","you both turn","to","Allah","so indeed","(are) inclined","your hearts","but if","you backup each other","against him","then indeed","Allah","He","(is) his Protector","and Jibreel","and (the) righteous","believers","and the Angels","after","that","(are his) assistants","(4)"],"transliterationArr":["in","tatūbā","ilā","al-lahi","faqad","ṣaghat","qulūbukumā","wa-in","taẓāharā","ʿalayhi","fa-inna","al-laha","huwa","mawlāhu","wajib'rīlu","waṣāliḥu","al-mu'minīna","wal-malāikatu","baʿda","dhālika","ẓahīrun",null],"verseTiming":[[1,0,950],[2,950,3720],[3,3720,4140],[4,4140,4940],[5,4940,5430],[6,5430,6140],[7,6140,7670],[8,7670,9420],[9,9420,10580],[10,10580,11390],[11,11390,12540],[12,12540,13380],[13,13380,13700],[14,13700,14820],[15,14820,15890],[16,15890,16870],[17,16870,20020],[18,20020,23079],[19,23079,23599],[20,23599,24479],[21,24479,26824]]}},{"name":"66:5","price":"اگر وه (پیغمبر) تمہیں طلاق دے دیں تو بہت جلد انہیں ان کا رب! تمہارے بدلے تم سے بہتر بیویاں عنایت فرمائے گا(1) ، جو اسلام والیاں، ایمان والیاں اللہ کے حضور جھکنے والیاں توبہ کرنے والیاں، عبادت بجا ﻻنے والیاں روزے رکھنے والیاں ہوں گی بیوه اور کنواریاں.(2)","arabic":"عَسَىٰ رَبُّهُۥٓ إِن طَلَّقَكُنَّ أَن يُبۡدِلَهُۥٓ أَزۡوَٰجًا خَيۡرٗا مِّنكُنَّ مُسۡلِمَٰتٖ مُّؤۡمِنَٰتٖ قَٰنِتَٰتٖ تَٰٓئِبَٰتٍ عَٰبِدَٰتٖ سَٰٓئِحَٰتٖ ثَيِّبَٰتٖ وَأَبۡكَارٗا","category":["66 (At-Tahrim)","At-Tahrim","Surah At-Tahrim"],"ayahNumber":5234,"juzNumber":28,"footnotes":"(1) یہ تنبیہ کے طور پر ازواج مطہرات کو کہا جا رہا ہے کہ اللہ تعالٰی اپنے پیغمبر کو تم سے بھی بہتر بیویاں عطا کرسکتا ہے۔\n(2) ثیبات۔ثیب کی جمع ہے (لوٹ آنے والی) بیوہ عورت کو ثیب اس لیے کہا جاتا ہے کہ وہ خاوند سے واپس لوٹ آتی ہے اور پھر اس طرح بےخاوند رہ جاتی ہے جیسے پہلے تھی ابکار بکر کی جمع ہے کنواری عورت اسے بکر اسی لیے کہتے ہیں کہ یہ ابھی اپنی اسی پہلی حالت پر ہوتی ہے جس پر اس کی تخلیق ہوتی ہے فتح القدیر۔ بعض روایات میں آتا ہے کہ ثیب سے حضرت آسیہ فرعون کی بیوی اور بکر سے حضرت مریم حضرت عیسیٰ (عليه السلام) کی والدہ مراد ہیں یعنی جنت میں ان دونوں کو نبی (صلى الله عليه وسلم) کی بیویاں بنا دیا جائے گا ممکن ہے کہ ایسا ہو لیکن ان روایات کی بنیاد پر ایسا خیال رکھنا یا بیان کرنا صحیح نہیں ہے کیونکہ سندا یہ روایات پایہ اعتبار سے ساقط ہیں۔","lang":"ur","meta":{"transliteration":"ʿasā rabbuhu in ṭallaqakunna an yub'dilahu azwājan khayran minkunna mus'limātin mu'minātin qānitātin tāibātin ʿābidātin sāiḥātin thayyibātin wa-abkāran ","translations":["Perhaps","his Lord","if","he divorced you","[that]","He will substitute for him","wives","better","than you","submissive","faithful","obedient","repentant","who worship","who fast","previously married","and virgins","(5)"],"transliterationArr":["ʿasā","rabbuhu","in","ṭallaqakunna","an","yub'dilahu","azwājan","khayran","minkunna","mus'limātin","mu'minātin","qānitātin","tāibātin","ʿābidātin","sāiḥātin","thayyibātin","wa-abkāran",null],"verseTiming":[[1,0,760],[2,760,3240],[3,3240,4400],[4,4400,6430],[5,6430,6790],[6,6790,9700],[7,9700,10850],[8,10850,11530],[9,11530,14600],[10,14600,17700],[11,17700,19140],[12,19140,22080],[13,22080,23640],[14,23640,27300],[15,27300,29610],[16,29610,33330],[17,33330,35450],[18,35450,37405]]}},{"name":"66:6","price":"اے ایمان والو! تم اپنے آپ کو اور اپنے گھر والوں کو اس آگ سے بچاؤ(1) جس کا ایندھن انسان ہیں اور پتھر جس پر سخت دل مضبوط فرشتے مقرر ہیں جنہیں جو حکم اللہ تعالیٰ دیتا ہے اس کی نافرمانی نہیں کرتے بلکہ جو حکم دیا جائے بجا ﻻتے ہیں.","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ قُوٓاْ أَنفُسَكُمۡ وَأَهۡلِيكُمۡ نَارٗا وَقُودُهَا ٱلنَّاسُ وَٱلۡحِجَارَةُ عَلَيۡهَا مَلَٰٓئِكَةٌ غِلَاظٞ شِدَادٞ لَّا يَعۡصُونَ ٱللَّهَ مَآ أَمَرَهُمۡ وَيَفۡعَلُونَ مَا يُؤۡمَرُونَ","category":["66 (At-Tahrim)","At-Tahrim","Surah At-Tahrim"],"ayahNumber":5235,"juzNumber":28,"footnotes":"(1) اس میں اہل ایمان کو ان کی ایک نہایت اہم ذمے داری کی طرف توجہ دلائی گئی ہے اور وہ ہے اپنے ساتھ اپنے گھر والوں کی بھی اصلاح اور ان کی اسلامی تعلیم وتربیت کا اہتمام تاکہ یہ سب جہنم کا ایندھن بننے سے بچ جائیں اس لیے رسول اللہ صلی اللہ علہ وسلم نے فرمایا ہے کہ جب بچہ سات سال کی عمر کو پہنچ جائے تو اسے نماز کی تلقین کرو اور دس سال عمر کے بچوں میں نماز سے تساہل دیکھو تو انہیں سرزنش کرو سنن ابی داؤد۔ فقہا نے کہا ہے اسی طرح روزے ان سے رکھوائے جائیں اور دیگر احکام کے اتباع کی تلقین انہیں کی جائے تاکہ جب وہ شعور کی عمر کو پہنچیں تو اس دین حق کا شعور بھی انہیں حاصل ہو چکا ہو۔ ابن کثیر۔","lang":"ur","meta":{"transliteration":"yāayyuhā alladhīna āmanū qū anfusakum wa-ahlīkum nāran waqūduhā al-nāsu wal-ḥijāratu ʿalayhā malāikatun ghilāẓun shidādun lā yaʿṣūna al-laha mā amarahum wayafʿalūna mā yu'marūna ","translations":["O","(you) who","believe","Protect","yourselves","and your families","(from) a Fire","whose fuel","(is) people","and stones","over it","(are) Angels","stern","severe","not","they disobey","Allah","(in) what","He Commands them","but they do","what","they are commanded","(6)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","qū","anfusakum","wa-ahlīkum","nāran","waqūduhā","al-nāsu","wal-ḥijāratu","ʿalayhā","malāikatun","ghilāẓun","shidādun","lā","yaʿṣūna","al-laha","mā","amarahum","wayafʿalūna","mā","yu'marūna",null],"verseTiming":[[1,0,2780],[2,2780,3790],[3,3790,4750],[4,4750,6930],[5,6930,8820],[6,8820,10180],[7,10180,11460],[8,11460,12430],[9,12430,14110],[10,14110,15920],[11,15920,16930],[12,16930,18690],[13,18690,20060],[14,20060,21070],[15,21070,23760],[16,23760,24560],[17,24560,26400],[18,26400,26790],[19,26790,27770],[20,27770,31110],[21,31110,31550],[22,31550,32510],[23,32510,33370],[24,33370,35480],[25,35480,37670],[26,37670,38140],[27,38140,41205]]}},{"name":"66:7","price":"اے کافرو! آج تم عذر وبہانہ مت کرو۔ تمہیں صرف تمہارے کرتوت کا بدلہ دیا جارہا ہے.","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ كَفَرُواْ لَا تَعۡتَذِرُواْ ٱلۡيَوۡمَۖ إِنَّمَا تُجۡزَوۡنَ مَا كُنتُمۡ تَعۡمَلُونَ","category":["66 (At-Tahrim)","At-Tahrim","Surah At-Tahrim"],"ayahNumber":5236,"juzNumber":28,"footnotes":"","lang":"ur","meta":{"transliteration":"yāayyuhā alladhīna kafarū lā taʿtadhirū al-yawma innamā tuj'zawna mā kuntum taʿmalūna ","translations":["O","(you) who","disbelieve","(Do) not","make excuses","today","Only","you will be recompensed","(for) what","you used to","do","(7)"],"transliterationArr":["yāayyuhā","alladhīna","kafarū","lā","taʿtadhirū","al-yawma","innamā","tuj'zawna","mā","kuntum","taʿmalūna",null],"verseTiming":[[1,0,2860],[2,2860,3770],[3,3770,4700],[4,4700,4940],[5,4940,8010],[6,8010,10150],[7,10150,11170],[8,11170,11520],[9,11520,13150],[10,13150,16745]]}},{"name":"66:8","price":"اے ایمان والو! تم اللہ کے سامنے سچی خالص توبہ کرو(1) ۔ قریب ہے کہ تمہارا رب تمہارے گناه دور کر دے اور تمہیں ایسی جنتوں میں داخل کرے جن کے نیچے نہریں جاری ہیں۔ جس دن اللہ تعالیٰ نبی کو اور ایمان والوں کو جو ان کے ساتھ ہیں رسوا نہ کرے گا۔ ان کا نور ان کے سامنے اور ان کے دائیں دوڑ رہا ہوگا۔ یہ دعائیں کرتے ہوں گے اے ہمارے رب ہمیں کامل نور عطا فرما(2) اور ہمیں بخش دے یقیناً تو ہر چیز پر قادر ہے.","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ تُوبُوٓاْ إِلَى ٱللَّهِ تَوۡبَةٗ نَّصُوحًا عَسَىٰ رَبُّكُمۡ أَن يُكَفِّرَ عَنكُمۡ سَيِّـَٔاتِكُمۡ وَيُدۡخِلَكُمۡ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ يَوۡمَ لَا يُخۡزِي ٱللَّهُ ٱلنَّبِيَّ وَٱلَّذِينَ ءَامَنُواْ مَعَهُۥۖ نُورُهُمۡ يَسۡعَىٰ بَيۡنَ أَيۡدِيهِمۡ وَبِأَيۡمَٰنِهِمۡ يَقُولُونَ رَبَّنَآ أَتۡمِمۡ لَنَا نُورَنَا وَٱغۡفِرۡ لَنَآۖ إِنَّكَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ","category":["66 (At-Tahrim)","At-Tahrim","Surah At-Tahrim"],"ayahNumber":5237,"juzNumber":28,"footnotes":"(1) خالص توبہ یہ ہے کہ، 1- جس گناہ سے توبہ کر رہا ہے، اسے ترک کر دے۔ 2- اس پر اللہ کی بارگاہ میں ندامت کا اظہار کرے، 3- آئندہ اسے نہ کرنے کا عزم رکھے، 4- اگر اس کا تعلق حقوق العباد سے ہے تو جس کا حق غصب کیا ہے اس کا ازالہ کرے، جس کے ساتھ زیادتی کی ہے اس سے معافی مانگے، محض زبان سے توبہ توبہ کر لینا کوئی معنی نہیں رکھتا۔\n(2) یہ دعا اہل ایمان اس وقت کریں جب منافقین کا نور بجھا دیا جائے گا، جیسا سورہ حدید میں تفصیل گزری، اہل ایمان کہیں گے، جنت میں داخل ہونے تک ہمارے اس نور کو باقی رکھ اور اس کا اتمام فرما۔","lang":"ur","meta":{"transliteration":"yāayyuhā alladhīna āmanū tūbū ilā al-lahi tawbatan naṣūḥan ʿasā rabbukum an yukaffira ʿankum sayyiātikum wayud'khilakum jannātin tajrī min taḥtihā al-anhāru yawma lā yukh'zī al-lahu al-nabiya wa-alladhīna āmanū maʿahu nūruhum yasʿā bayna aydīhim wabi-aymānihim yaqūlūna rabbanā atmim lanā nūranā wa-igh'fir lanā innaka ʿalā kulli shayin qadīrun ","translations":["O","(you) who believe","believe","Turn","to","Allah","(in) repentance","sincere","Perhaps","your Lord","will","remove","from you","your evil deeds","and admit you","(into) Gardens","flow","from","underneath it","the rivers","(on the) Day","not","will be disgraced","(by) Allah","the Prophet","and those who","believed","with him","Their light","will run","before","their hands","and on their right","they will say","Our Lord","Perfect","for us","our light","and grant forgiveness","to us","Indeed, You","(are) over","every","thing","All-Powerful","(8)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","tūbū","ilā","al-lahi","tawbatan","naṣūḥan","ʿasā","rabbukum","an","yukaffira","ʿankum","sayyiātikum","wayud'khilakum","jannātin","tajrī","min","taḥtihā","al-anhāru","yawma","lā","yukh'zī","al-lahu","al-nabiya","wa-alladhīna","āmanū","maʿahu","nūruhum","yasʿā","bayna","aydīhim","wabi-aymānihim","yaqūlūna","rabbanā","atmim","lanā","nūranā","wa-igh'fir","lanā","innaka","ʿalā","kulli","shayin","qadīrun",null],"verseTiming":[[1,0,2610],[2,2610,3540],[3,3540,4560],[4,4560,6980],[5,6980,7320],[6,7320,10590],[7,10590,13110],[8,13110,13500],[9,13500,14320],[10,14320,15150],[11,15150,16960],[12,16960,17470],[13,17470,18660],[14,18660,19540],[15,19540,20400],[16,20400,21650],[17,21650,23770],[18,23770,24370],[19,24370,25390],[20,25390,26570],[21,26570,27430],[22,27430,28720],[23,28720,30350],[24,30350,31690],[25,31690,33380],[26,33380,34790],[27,34790,36620],[28,36620,39240],[29,39240,39980],[30,39980,40690],[31,40690,41640],[32,41640,42860],[33,42860,43380],[34,43380,43860],[35,43860,44450],[36,44450,45230],[37,45230,46740],[38,46740,47810],[39,47810,48930],[40,48930,49930],[41,49930,50830],[42,50830,51630],[43,51630,52140],[44,52140,53400],[45,53400,55110],[46,55110,58580],[47,58580,59750],[48,59750,60490],[49,60490,62830],[50,62830,63520],[51,63520,64110],[52,64110,65070],[53,65070,65820],[54,65820,66530],[55,66530,68410],[56,68410,69010],[57,69010,69600],[58,69600,71590],[59,71590,74165]]}},{"name":"66:9","price":"اے نبی! کافروں اور منافقوں سے جہاد کرو(1) اور ان پر سختی کرو(2) ان کا ٹھکانا جہنم ہے(3) اور وه بہت بری جگہ ہے.","arabic":"يَٰٓأَيُّهَا ٱلنَّبِيُّ جَٰهِدِ ٱلۡكُفَّارَ وَٱلۡمُنَٰفِقِينَ وَٱغۡلُظۡ عَلَيۡهِمۡۚ وَمَأۡوَىٰهُمۡ جَهَنَّمُۖ وَبِئۡسَ ٱلۡمَصِيرُ","category":["66 (At-Tahrim)","At-Tahrim","Surah At-Tahrim"],"ayahNumber":5238,"juzNumber":28,"footnotes":"(1) کفار کے ساتھ جہاد، و قتال کے ساتھ اور منافقین سے، ان پر حدود الٰہی قائم کرکے، جب وہ ایسے کام کریں جو موجب حد ہوں۔\n(2) یعنی دعوت وتبلیغ میں سختی اور احکام شریعت میں درشتی اختیار کریں کیونکہ یہ لاتوں کے بھوت ہیں جو باتوں سے ماننے والے نہیں ہیں اس کا مطلب ہے کہ حکمت تبلیغ کبھی نرمی کی متقاضی ہوتی ہے اور کبھی سختی کی ہر جگہ نرمی بھی مناسب نہیں اور ہر جگہ سختی بھی مفید نہیں رہتی تبلیغ ودعوت میں حالات وظروف اور اشخاص وافراد کے اعتبار سے نرمی یا سختی کرنے کی ضرورت ہے۔\n(3) یعنی کافروں اور منافقوں دونوں کا ٹھکانا جہنم ہے۔","lang":"ur","meta":{"transliteration":"yāayyuhā al-nabiyu jāhidi al-kufāra wal-munāfiqīna wa-ugh'luẓ ʿalayhim wamawāhum jahannamu wabi'sa al-maṣīru ","translations":["O","Prophet","Strive","(against) the disbelievers","and the hypocrites","and be stern","with them","And their abode","(is) Hell","and wretched is","the destination","(9)"],"transliterationArr":["yāayyuhā","al-nabiyu","jāhidi","al-kufāra","wal-munāfiqīna","wa-ugh'luẓ","ʿalayhim","wamawāhum","jahannamu","wabi'sa","al-maṣīru",null],"verseTiming":[[1,0,2680],[2,2680,4250],[3,4250,5110],[4,5110,6460],[5,6460,8180],[6,8180,8940],[7,8940,10410],[8,10410,11730],[9,11730,13390],[10,13390,14200],[11,14200,17235]]}},{"name":"66:10","price":"اللہ تعالیٰ نے کافروں کے لیے نوح کی اور لوط کی بیوی کی مثال بیان فرمائی(1) یہ دونوں ہمارے بندوں میں سے دو (شائستہ اور) نیک بندوں کے گھر میں تھیں، پھر ان کی انہوں نے خیانت کی(2) پس وه دونوں (نیک بندے) ان سے اللہ کے (کسی عذاب کو) نہ روک سکے(3) اور حکم دے دیا گیا (اے عورتوں) دوزخ میں جانے والوں کے ساتھ تم دونوں بھی چلی جاؤ.(4)","arabic":"ضَرَبَ ٱللَّهُ مَثَلٗا لِّلَّذِينَ كَفَرُواْ ٱمۡرَأَتَ نُوحٖ وَٱمۡرَأَتَ لُوطٖۖ كَانَتَا تَحۡتَ عَبۡدَيۡنِ مِنۡ عِبَادِنَا صَٰلِحَيۡنِ فَخَانَتَاهُمَا فَلَمۡ يُغۡنِيَا عَنۡهُمَا مِنَ ٱللَّهِ شَيۡـٔٗا وَقِيلَ ٱدۡخُلَا ٱلنَّارَ مَعَ ٱلدَّٰخِلِينَ","category":["66 (At-Tahrim)","At-Tahrim","Surah At-Tahrim"],"ayahNumber":5239,"juzNumber":28,"footnotes":"(1) مثل کا مطلب ہے کسی ایسی حالت کا بیان کرنا جس میں ندرت وغرابت ہوتا کہ اس کے ذریعے سے ایک دوسری حالت کا تعارف ہو جائے جو ندرت وغرابت میں اس کے مماثل ہو مطلب یہ ہوا کہ ان کافروں کے حال کے لیے اللہ نے ایک مثال بیان فرمائی ہے جو نوح اور لوط علیہما السلام کی بیوی کی ہے۔\n(2) یہاں خیانت سے مراد ہے کہ یہ اپنے خاوندوں پر ایمان نہیں لائیں نفاق میں مبتلا رہیں اور ان کی ہمدردیاں اپنی کافر قوموں کے ساتھ رہیں چنانچہ نوح (عليه السلام) کی بیوی، حضرت نوح (عليه السلام) کی بابت لوگوں سے کہتی کہ یہ مجنون ہے اور لوط (عليه السلام) کی بیوی اپنی قوم کو گھر میں آنے والے مہمانوں کی اطلاع پہنچاتی تھی بعض کہتے ہیں کہ یہ دونوں اپنی قوم کے لوگوں میں اپنے خاوندوں کی چغلیاں کھاتی تھیں۔\n(3) یعنی نوح اور لوط علیہما السلام دونوں، باوجود اس بات کے کہ وہ اللہ کے پیغمبر تھے، جو اللہ کے مقرب ترین بندوں میں سے ہوتے ہیں، اپنی بیویوں کو اللہ کے عذاب سے نہیں بچا سکے۔\n(4) یہ انہیں قیامت والے دن کہا جائے گا یا موت کے وقت انہیں کہا گیا کافروں کی یہ مثال بطور خاص یہاں ذکر کرنے سے مقصود ازواج مظہرات کو تنبیہ کرنا ہے کہ وہ بیشک اس رسول کے حرم کی زینت ہیں جو تمام مخلوق میں سب سے بہتر ہے لیکن انہیں یاد رکھنا چاہیے کہ اگر انہوں نے رسول کی مخالفت کی یا انہیں تکلیف پہنچائی تو وہ بھی اللہ کی گرفت میں آسکتی ہیں اور اگر ایسا ہوگیا تو پھر کوئی ان کو بچانے والا نہیں ہوگا۔","lang":"ur","meta":{"transliteration":"ḍaraba al-lahu mathalan lilladhīna kafarū im'ra-ata nūḥin wa-im'ra-ata lūṭin kānatā taḥta ʿabdayni min ʿibādinā ṣāliḥayni fakhānatāhumā falam yugh'niyā ʿanhumā mina al-lahi shayan waqīla ud'khulā al-nāra maʿa al-dākhilīna ","translations":["Presents","Allah","an example","for those who","disbelieved ","(the) wife","(of) Nuh","(and the) wife","(of) Lut","They were","under","two [slaves]","of","Our slaves","righteous","but they both betrayed them","so not","they availed","both of them","from","Allah","(in) anything","and it was said","Enter","the Fire","with","those who enter","(10)"],"transliterationArr":["ḍaraba","al-lahu","mathalan","lilladhīna","kafarū","im'ra-ata","nūḥin","wa-im'ra-ata","lūṭin","kānatā","taḥta","ʿabdayni","min","ʿibādinā","ṣāliḥayni","fakhānatāhumā","falam","yugh'niyā","ʿanhumā","mina","al-lahi","shayan","waqīla","ud'khulā","al-nāra","maʿa","al-dākhilīna",null],"verseTiming":[[1,0,660],[2,660,1510],[3,1510,2040],[4,2040,3310],[5,3310,3970],[6,3970,4750],[7,4750,6170],[8,6170,7060],[9,7060,9340],[10,9340,10620],[11,10620,11210],[12,11210,12180],[13,12180,12520],[14,12520,13680],[15,13680,14920],[16,14920,16650],[17,16650,17310],[18,17310,18260],[19,18260,19260],[20,19260,19570],[21,19570,20410],[22,20410,21210],[23,21210,22480],[24,22480,23020],[25,23020,24690],[26,24690,25030],[27,25030,28215]]}},{"name":"66:11","price":"اور اللہ تعالیٰ نے ایمان والوں کے لیے فرعون کی بیوی کی مثال بیان فرمائی(1) جبکہ اس نے دعا کی کہ اے میرے رب! میرے لیے اپنے پاس جنت میں مکان بنا اور مجھے فرعون سے اور اس کے عمل سے بچا اور مجھے ﻇالم لوگوں سے خلاصی دے.","arabic":"وَضَرَبَ ٱللَّهُ مَثَلٗا لِّلَّذِينَ ءَامَنُواْ ٱمۡرَأَتَ فِرۡعَوۡنَ إِذۡ قَالَتۡ رَبِّ ٱبۡنِ لِي عِندَكَ بَيۡتٗا فِي ٱلۡجَنَّةِ وَنَجِّنِي مِن فِرۡعَوۡنَ وَعَمَلِهِۦ وَنَجِّنِي مِنَ ٱلۡقَوۡمِ ٱلظَّٰلِمِينَ","category":["66 (At-Tahrim)","At-Tahrim","Surah At-Tahrim"],"ayahNumber":5240,"juzNumber":28,"footnotes":"(1) یعنی ان کی ترغیب ثبات قدمی، استقامت فی الدین اور شدائد میں صبر کے لئے۔ نیز یہ بتلانے کے لئے کہ کفر کی صولت و شوکت، ایمان والوں کا کچھ نہیں بگاڑ سکتی، جیسے فرعون کی بیوی ہے جو اپنے وقت کے سب سے بڑے کافر کے تحت تھی۔ لیکن وہ اپنی بیوی کو ایمان سے نہیں روک سکا۔","lang":"ur","meta":{"transliteration":"waḍaraba al-lahu mathalan lilladhīna āmanū im'ra-ata fir'ʿawna idh qālat rabbi ib'ni lī ʿindaka baytan fī al-janati wanajjinī min fir'ʿawna waʿamalihi wanajjinī mina al-qawmi al-ẓālimīna ","translations":["And presents","Allah","an example","for those who","believed ","(the) wife","(of) Firaun","when","she said","My Lord","Build","for me","near You","a house","in","Paradise","and save me","from","Firaun","and his deeds","and save me","from","the people","the wrongdoers","(11)"],"transliterationArr":["waḍaraba","al-lahu","mathalan","lilladhīna","āmanū","im'ra-ata","fir'ʿawna","idh","qālat","rabbi","ib'ni","lī","ʿindaka","baytan","fī","al-janati","wanajjinī","min","fir'ʿawna","waʿamalihi","wanajjinī","mina","al-qawmi","al-ẓālimīna",null],"verseTiming":[[1,0,910],[2,910,1710],[3,1710,2260],[4,2260,3590],[5,3590,4410],[6,4410,5140],[7,5140,6110],[8,6110,6480],[9,6480,7330],[10,7330,7930],[11,7930,8330],[12,8330,8670],[13,8670,10240],[14,10240,11910],[15,11910,12120],[16,12120,14060],[17,14060,14990],[18,14990,15620],[19,15620,16770],[20,16770,17790],[21,17790,18760],[22,18760,19890],[23,19890,21120],[24,21120,21430],[25,21430,22300],[26,22300,25895]]}},{"name":"66:12","price":"اور (مثال بیان فرمائی) مریم بنت عمران کی(1) جس نے اپنے ناموس کی حفاﻇت کی پھر ہم نے اپنی طرف سے اس میں جان پھونک دی اور (مریم) اس نے اپنے رب کی باتوں(2) اور اس کی کتابوں کی تصدیق کی اور عبادت گزاروں میں سے تھی.(3)","arabic":"وَمَرۡيَمَ ٱبۡنَتَ عِمۡرَٰنَ ٱلَّتِيٓ أَحۡصَنَتۡ فَرۡجَهَا فَنَفَخۡنَا فِيهِ مِن رُّوحِنَا وَصَدَّقَتۡ بِكَلِمَٰتِ رَبِّهَا وَكُتُبِهِۦ وَكَانَتۡ مِنَ ٱلۡقَٰنِتِينَ","category":["66 (At-Tahrim)","At-Tahrim","Surah At-Tahrim"],"ayahNumber":5241,"juzNumber":28,"footnotes":"(1) حضرت مریم علیہا السلام کے ذکر سے مقصود یہ بیان کرنا ہے کہ باوجود اس بات کے کہ وہ ایک بگڑی ہوئی قوم کے درمیان رہتی تھی، لیکن اللہ نے انہیں دنیا و آخرت میں شرف و کرامت سے سرفراز فرمایا اور تمام جہان کی عورتوں پر انہیں فضیلت عطا فرمائی۔\n(2) کلمات رب سے مراد شرائع الہی ہیں۔\n(3) یعنی ایسے لوگوں میں سے یا خاندان میں سے تھیں جو فرماں بردار عبادت گزار اور صلاح واطاعت میں ممتاز تھا حدیث میں ہے جنتی عورتوں میں سب سے افضل حضرت خدیجہ، حضرت فاطمہ، حضرت مریم اور فرعون کی بیوی آسیہ ہیں رضی اللہ عنھن۔(مسند احمد) ایک دوسری حدیث میں فرمایا مردوں میں تو کامل بہت ہوئے ہیں مگر عورتوں میں کامل صرف فرعون کی بیوی آسیہ مریم بنت عمران اور خدیجہ بنت خویلد رضی اللہ عنھن ہیں اور عائشہ (رضي الله عنه) ا کی فضلیت عورتوں پر ایسے ہے جیسے ثرید کو تمام کھانوں پر فضلیت حاصل ہے۔ صحیح بخاری۔","lang":"ur","meta":{"transliteration":"wamaryama ib'nata ʿim'rāna allatī aḥṣanat farjahā fanafakhnā fīhi min rūḥinā waṣaddaqat bikalimāti rabbihā wakutubihi wakānat mina al-qānitīna ","translations":["And Maryam","(the) daughter","(of) Imran","who","guarded","her chastity","so We breathed","into it","of","Our Spirit","And she believed","(in the) Words","(of) her Lord","and His Books","and she was","of","the devoutly obedient","(12)"],"transliterationArr":["wamaryama","ib'nata","ʿim'rāna","allatī","aḥṣanat","farjahā","fanafakhnā","fīhi","min","rūḥinā","waṣaddaqat","bikalimāti","rabbihā","wakutubihi","wakānat","mina","al-qānitīna",null],"verseTiming":[[1,0,960],[2,960,1610],[3,1610,2440],[4,2440,4860],[5,4860,5820],[6,5820,6790],[7,6790,8000],[8,8000,8630],[9,8630,8770],[10,8770,9980],[11,9980,12930],[12,12930,14100],[13,14100,14990],[14,14990,16240],[15,16240,17330],[16,17330,17660],[17,17660,22245]]}}],"chapter":["66 (At-Tahrim)","At-Tahrim","Surah At-Tahrim","Chapter At-Tahrim","Tahrim","Surah Tahrim","Chapter Tahrim","At Tahrim","Surah At Tahrim","Chapter At Tahrim","Surah 66","Chapter 66","The Prohibition","التحريم"],"version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."}}