{"data":[{"name":"2:186","price":" 186. And when My slaves ask you (O Muhammad صلى الله عليه وسلم) concerning Me, then (answer them), I am indeed near (to them by My Knowledge). I respond to the invocations of the supplicant when he calls on Me (without any mediator or intercessor). So let them obey Me and believe in Me, so that they may be led aright.[4]","arabic":"وَإِذَا سَأَلَكَ عِبَادِي عَنِّي فَإِنِّي قَرِيبٌۖ أُجِيبُ دَعۡوَةَ ٱلدَّاعِ إِذَا دَعَانِۖ فَلۡيَسۡتَجِيبُواْ لِي وَلۡيُؤۡمِنُواْ بِي لَعَلَّهُمۡ يَرۡشُدُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":193,"juzNumber":2,"footnotes":" (V.2:186) Narrated Abu Hurairah رضي الله عنه: Allâh’s Messenger صلى الله عليه وسلم said, \"Allâh said, ‘I will declare war against him who shows hostility to a pious worshipper of Mine. And the most beloved things with which My slave comes nearer to Me, is what I have enjoined upon him; and My slave keeps on coming closer to Me through performing Nawâfil (praying or doing extra deeds besides what is obligatory) till I love him. Then I become his sense of hearing with which he hears, and his sense of sight with which he sees, and his hand with which he grips, and his leg with which he walks; and if he asks Me, I will give him, and if he asks My protection (Refuge), I will protect him; (i.e. give him My Refuge), and I do not hesitate to do anything as I hesitate to take the soul of the believer, for he hates death, and I hate to disappoint him.\" (Sahih Al-Bukhâri, Vol.8, Hadîth No. 509).","lang":"en","meta":{"transliteration":"wa-idhā sa-alaka ʿibādī ʿannī fa-innī qarībun ujību daʿwata al-dāʿi idhā daʿāni falyastajībū lī walyu'minū bī laʿallahum yarshudūna ","translations":["And when","ask you","My servants","about Me","then indeed I am","near","I respond","(to the) invocation","(of) the supplicant","when","he calls Me","So let them respond","to Me","and let them believe","in Me","so that they may","(be) led aright","(186)"],"transliterationArr":["wa-idhā","sa-alaka","ʿibādī","ʿannī","fa-innī","qarībun","ujību","daʿwata","al-dāʿi","idhā","daʿāni","falyastajībū","lī","walyu'minū","bī","laʿallahum","yarshudūna",null],"verseTiming":[[1,0,910],[2,910,1730],[3,1730,2690],[4,2690,4130],[5,4130,5790],[6,5790,8670],[7,8670,9350],[8,9350,10130],[9,10130,10950],[10,10950,11500],[11,11500,14190],[12,14190,16260],[13,16260,16850],[14,16850,18250],[15,18250,18710],[16,18710,19870],[17,19870,23185]]}}],"dua":{"id":31,"name":"Dua for Divine Connection","arabicName":"دعاء الاتصال الإلهي","reference":"2:186","verseTitle":"The Intimate Supplication","significanceReason":"Emphasizes the direct and intimate connection between the believer and the Divine, highlighting that Allah is always near and responsive."},"version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"}}