{"data":[{"name":"20:114","price":"114. ¡Exaltado sea Al-lah, el verdadero Soberano! Y no te apresures a recitar las aleyas del Corán (por miedo a olvidarlas, oh, Muhammad) antes de que el ángel Gabriel haya terminado de revelártelas[590]. Y di: «¡Señor, aumenta mi conocimiento[591]!».","arabic":"فَتَعَٰلَى ٱللَّهُ ٱلۡمَلِكُ ٱلۡحَقُّۗ وَلَا تَعۡجَلۡ بِٱلۡقُرۡءَانِ مِن قَبۡلِ أَن يُقۡضَىٰٓ إِلَيۡكَ وَحۡيُهُۥۖ وَقُل رَّبِّ زِدۡنِي عِلۡمٗا","category":["20 (Ta-Ha)","Ta-Ha","Surah Ta-Ha"],"ayahNumber":2462,"juzNumber":16,"footnotes":"[590]  Cuando el ángel Gabriel le revelaba nuevas aleyas por orden de Al-lah, el profeta Muhammad —que Al-lah lo bendiga y le dé la paz— se apresuraba a repetirlas para no olvidarlas. Al-lah lo tranquiliza en esta aleya y le dice que a Él Le incumbe grabarlas en su mente y proteger la revelación. \n[591]  La búsqueda del conocimiento provechoso, en concreto sobre la religión, es de suma importancia en el islam, de hecho, uno de los dichos del Profeta —que Al-lah lo bendiga y le dé la paz— transmitido por Muslim, dice: « […]A quien emprenda un camino buscando en él conocimiento, Al-lah le facilitará un camino hacia el paraíso[…]». Asimismo, el Profeta —que Al-lah lo bendiga y le dé la paz— solía suplicar a Al-lah diciendo: «¡Oh, Al-lah!, busco refugio en Ti de un conocimiento que no sea beneficioso, de un corazón que no tiemble, de un ego no satisfecho y de una plegaria no aceptada».","lang":"es","meta":{"transliteration":"fataʿālā al-lahu al-maliku al-ḥaqu walā taʿjal bil-qur'āni min qabli an yuq'ḍā ilayka waḥyuhu waqul rabbi zid'nī ʿil'man ","translations":["So high (above all)","(is) Allah","the King","the True","And (do) not","hasten","with the Quran","before","before","[that]","is completed","to you","its revelation","and say","My Lord","Increase me","(in) knowledge","(114)"],"transliterationArr":["fataʿālā","al-lahu","al-maliku","al-ḥaqu","walā","taʿjal","bil-qur'āni","min","qabli","an","yuq'ḍā","ilayka","waḥyuhu","waqul","rabbi","zid'nī","ʿil'man",null],"verseTiming":[[1,0,1040],[2,1040,1900],[3,1900,2780],[4,2780,3930],[5,3930,4450],[6,4450,5390],[7,5390,6780],[8,6780,7560],[9,7560,8630],[10,8630,8820],[11,8820,11720],[12,11720,12580],[13,12580,13700],[14,13700,14080],[15,14080,15040],[16,15040,16080],[17,16080,17855]]}}],"dua":{"id":7,"name":"Dua for Knowledge and Wisdom","arabicName":"دعاء العلم والحكمة","reference":"20:114","verseTitle":"The Wisdom Increase Supplication","significanceReason":"Specifically requests increase in knowledge, extremely popular among students, scholars, and those seeking intellectual and spiritual enlightenment."},"version":{"key":"spanish_montada_eu","direction":"ltr","language_iso_code":"es","version":"1.0.0","last_update":1539032400,"title":"Spanish Translation - Noor International Center","description":"Translation of the Quran meanings into Spanish. published by Noor International Center - was printed in 2017."}}