{"data":[{"name":"3:173","price":"Waɗanda mutãne* suka ce musu: \"Lalle ne, mutãne sun tãra (rundunõni) sabõda ku, don haka ku ji tsõrnsu. Sai (wannan magana) ta ƙara musu ĩmãni, kuma suka ce: \"Mai isarmu Allah ne kuma mãdalla da wakili Shĩ.\"","arabic":"ٱلَّذِينَ قَالَ لَهُمُ ٱلنَّاسُ إِنَّ ٱلنَّاسَ قَدۡ جَمَعُواْ لَكُمۡ فَٱخۡشَوۡهُمۡ فَزَادَهُمۡ إِيمَٰنٗا وَقَالُواْ حَسۡبُنَا ٱللَّهُ وَنِعۡمَ ٱلۡوَكِيلُ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran"],"ayahNumber":466,"juzNumber":4,"footnotes":"* Yãƙin Badar na Uku, a cikin shekara ta huɗu yake, a watan Sha'aban. Badar kãsuwa ce babba ga ƙabĩlun Lãrabãwa a kõwace shekara. A bãyan Uhdu an yi alkawari da Abu Sufyãna, a kan a haɗu a Badr shekara mai zuwa. Sabõda haka sai Abu Sufyãna ya fita daga Makka har ya sauka Marriz zahrãn, sai Allah Ya sanya masa tsõro a cikin zũciyarsa sai ya gamu da Nu'aima bn Mas'ũd el Ashja'iy, ya ce masa: \"Ni nã yi alkawari da Muhammadu a kan mu haɗu a Kãsuwar Badar. Wannan kuwa shekar fari ce. Inã son sãɓãwar alkawarin ta zama daga gare shi, bã daga gare ni ba. Ka tafi Madĩna ka yi ƙõƙarin hana su fitõwa, zan bã ka rãƙuma gõma.\" Sai Nu'aimu ya tafi Madĩna ya iske Annabi da Sahabbansa suna shirin fita. Sai ya ce musu: \"Me kuke nufi?\" Suka ce; \" Alkawarin Abu Sufyãna.\" Sai ya ce: \"Bã zã ku iya ba, dõmin kuwa sun tãra rundunõni sabõda ku.\" Sai Annabi ya ce: \"Zan fita kõ da nĩ kaɗai ne.\" Sai Annabi ya fita da mutum dubu da ɗari biyar, suka tafi Badar bãbu Abu Sufyãna. Suka ci kãsuwa suka kõmo.","lang":"ha","meta":{"transliteration":"alladhīna qāla lahumu al-nāsu inna al-nāsa qad jamaʿū lakum fa-ikh'shawhum fazādahum īmānan waqālū ḥasbunā al-lahu waniʿ'ma al-wakīlu ","translations":["Those who","said","to them","[the people]","Indeed","the people","(have) certainly","gathered","against you","so fear them","But it increased them","(in) faith","and they said","Sufficient for us","(is) Allah","and (He is the) best","[the] Disposer of affairs","(173)"],"transliterationArr":["alladhīna","qāla","lahumu","al-nāsu","inna","al-nāsa","qad","jamaʿū","lakum","fa-ikh'shawhum","fazādahum","īmānan","waqālū","ḥasbunā","al-lahu","waniʿ'ma","al-wakīlu",null],"verseTiming":[[1,0,1320],[2,1320,2070],[3,2070,2720],[4,2720,4230],[5,4230,5660],[6,5660,7150],[7,7150,7590],[8,7590,8450],[9,8450,9120],[10,9120,10400],[11,10400,11830],[12,11830,13870],[13,13870,15260],[14,15260,17110],[15,17110,18200],[16,18200,19010],[17,19010,20060],[18,20060,20850],[19,20850,24105]]}}],"dua":{"id":12,"name":"Dua for Success and Victory","arabicName":"دعاء النجاح والنصر","reference":"3:173","verseTitle":"The Triumphant Supplication","significanceReason":"Invokes divine support and success in personal and collective endeavors. Popular among those facing challenges and seeking breakthrough."},"version":{"key":"hausa_gummi","direction":"ltr","language_iso_code":"ha","version":"1.2.1","last_update":1609966800,"title":"Hausa language - Abu Bakr Jomy","description":"Translation of the Quran meanings into Hausa by Abu Bakr Mahmoud Jomy. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."}}