{"data":[{"name":"110:1","price":"Itakapo kuja nusura ya Mwenyezi Mungu na ushindi,","arabic":"إِذَا جَآءَ نَصۡرُ ٱللَّهِ وَٱلۡفَتۡحُ","category":["110 (An-Nasr)","An-Nasr","Surah An-Nasr"],"ayahNumber":6214,"juzNumber":30,"footnotes":"Ikithibiti nusura ya Mwnyezi Mungu na ushindi kwako na kwa Waumini,","lang":"sw","meta":{"transliteration":"idhā jāa naṣru al-lahi wal-fatḥu ","translations":["When","comes","(the) Help","(of) Allah","and the Victory","(1)"],"transliterationArr":["idhā","jāa","naṣru","al-lahi","wal-fatḥu",null],"verseTiming":[[1,0,720],[2,720,3630],[3,3630,4190],[4,4190,5170],[5,5170,6795]]}},{"name":"110:2","price":"Na ukaona watu wanaingia katika Dini ya Mwenyezi Mungu kwa makundi,","arabic":"وَرَأَيۡتَ ٱلنَّاسَ يَدۡخُلُونَ فِي دِينِ ٱللَّهِ أَفۡوَاجٗا","category":["110 (An-Nasr)","An-Nasr","Surah An-Nasr"],"ayahNumber":6215,"juzNumber":30,"footnotes":"Na ukawaona watu wanaingia katika Dini ya Mwenyezi Mungu makundi kwa makundi,","lang":"sw","meta":{"transliteration":"wara-ayta al-nāsa yadkhulūna fī dīni al-lahi afwājan ","translations":["And you see","the people","entering","into","(the) religion","(of) Allah","(in) multitudes","(2)"],"transliterationArr":["wara-ayta","al-nāsa","yadkhulūna","fī","dīni","al-lahi","afwājan",null],"verseTiming":[[1,0,1030],[2,1030,2720],[3,2720,3930],[4,3930,4400],[5,4400,5340],[6,5340,5970],[7,5970,7485]]}},{"name":"110:3","price":"Zitakase sifa za Mola wako Mlezi, na umwombe msamaha; hakika Yeye ndiye anaye pokea toba.","arabic":"فَسَبِّحۡ بِحَمۡدِ رَبِّكَ وَٱسۡتَغۡفِرۡهُۚ إِنَّهُۥ كَانَ تَوَّابَۢا","category":["110 (An-Nasr)","An-Nasr","Surah An-Nasr"],"ayahNumber":6216,"juzNumber":30,"footnotes":"Basi mshukuru Mola wako Mlezi, na Sabbih' , Mtakase kwa sifa zake, na mtake akusamehe wewe na umma wako, kwani hakika Yeye ni Mwingi wa kupokea toba za waja wake. Maoni ya wataalamu juu ya Surat Annas'r:- Sura hii tukufu inaashiria kugomboka kwa Makka. Na sababu khasa iliyo pelekea kugomboka Makka ni Maqureshi walipo vunja mkataba wa amani wa Hudaibiya kwa kuwashambulia kabila ya Khuzaa', ambao walikuwa wana masikilizano na Mtume s.a.w., na wakawasaidia Bani Bakri katika hayo. Yalipo tokea hayo Mtume akaona waliyo yafanya Maqureshi kuvunja mapatano imembidi ende kuigomboa Makka. Basi akakusanya jeshi la nguvu lenye wapiganaji elfu kumi. Akenda mwezi wa Ramadhani katika mwaka wa nane wa Hijra (Desemba mwaka 630 B.K.) Akawazuia watu wake wasipigane ila wakilazimishwa. Na Mwenyezi Mungu alipenda aingie Nabii na jeshi lake Makka bila ya vita. Na kwa hivi akapata ushindi mkubwa kabisa katika taarikhi ya wito wa Kiislamu, bila ya vita. Na Mwenyezi Mungu akamwezesha kusimamisha dola ya kwanza duniani bila ya vita na bila ya kumwagwa damu. Na huo ugombozi wa Makka ulikuwa na athari za kufikia mbali kwa pande za Dini na siyasa, kwani ilikuwa ni kuung'oa upagani, kuabudu masanamu, katika ngome yake kubwa, kwa kuvunjwa masanamu yaliyo simamishwa katika Al-kaaba, na yakaondolewa mapicha na masanamu yaliyo kuwemo. Na kwa kuingia Makka kwenye boma la Uislamu Nabii s.a.w. aliweza kuzishinda kabila zote zilizo bakia katika Hijazi, ambazo zilizo kuwa zina kani za kijahiliya, kama Hawazan na Thaqif. Mwenyezi Mungu akamwezesha kusimamisha dola si juu ya kabila wala nchi bali juu ya Imani, nayo ni Imani ya Kiislamu, na bendera ya Kiislamu","lang":"sw","meta":{"transliteration":"fasabbiḥ biḥamdi rabbika wa-is'taghfir'hu innahu kāna tawwāban ","translations":["Then glorify","with (the) praises","(of) your Lord","and ask His forgiveness","Indeed, He","is","Oft-Returning","(3)"],"transliterationArr":["fasabbiḥ","biḥamdi","rabbika","wa-is'taghfir'hu","innahu","kāna","tawwāban",null],"verseTiming":[[1,0,1050],[2,1050,1850],[3,1850,2850],[4,2850,4610],[5,4610,6390],[6,6390,7140],[7,7140,8785]]}}],"chapter":["110 (An-Nasr)","An-Nasr","Surah An-Nasr","Chapter An-Nasr","Nasr","Surah Nasr","Chapter Nasr","An Nasr","Surah An Nasr","Chapter An Nasr","Surah 110","Chapter 110","The Divine Support","النصر"],"version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"}}