{"data":[{"name":"17:82","price":"We send down the Qur’an as a healing and mercy[74] for the believers, but it does not increase the wrongdoers except in loss.","arabic":"وَنُنَزِّلُ مِنَ ٱلۡقُرۡءَانِ مَا هُوَ شِفَآءٞ وَرَحۡمَةٞ لِّلۡمُؤۡمِنِينَ وَلَا يَزِيدُ ٱلظَّٰلِمِينَ إِلَّا خَسَارٗا","category":["17 (Al-Isra)","Al-Isra","Surah Al-Isra"],"ayahNumber":2111,"juzNumber":15,"footnotes":"[74] Abū Saʿīd al-Khudrī (رضي الله عنه) reported that: “Some of the Companions of the Messenger of Allah (ﷺ) set out on a journey and they passed by an Arabian tribe. The chief of that tribe was bitten by a snake. They went to them and sought their help. A person amongst us said: “I shall treat him with ruqyah (incantation). But I shall not treat him unless you reward us. We asked you for your hospitality and you refused!” They agreed to give us a herd of goats. So he went to him and recited Surat al-Fātihah and blew over him. The chief was invigorated and went on walking with no sign of ailment. They gave them the agreed reward. Some of the Companions said: “Let us divide it!” Others said: “Do not, until you reach the Messenger of Allah (ﷺ), tell him what has happened and see what he bids us do”. They went to the Messenger of Allah (ﷺ) and told him. He said: “How did you come to know that it can be used as ruqyah? You have done the right thing. Divide it and allocate a share for me” [al-Bukhārī: 5749; Muslim: 2201]. ‘Ā’ishah (رضي الله عنه) narrated that: “When ill, the Messenger of Allah (ﷺ) used to recite al-Mu‘awwidhāt (the Sheltering surahs, al-Falaq and al-Nās) and blow. When his sickness got worse, I used to recite them over him and rub his body with his own hand seeking its blessing” [Al-Bukhārī: 5016; Muslim: 2192].","lang":"en","meta":{"transliteration":"wanunazzilu mina al-qur'āni mā huwa shifāon waraḥmatun lil'mu'minīna walā yazīdu al-ẓālimīna illā khasāran ","translations":["And We reveal","from","the Quran","that","it","(is) a healing","and a mercy","for the believers","but not","it increases","the wrongdoers","except","(in) loss","(82)"],"transliterationArr":["wanunazzilu","mina","al-qur'āni","mā","huwa","shifāon","waraḥmatun","lil'mu'minīna","walā","yazīdu","al-ẓālimīna","illā","khasāran",null],"verseTiming":[[1,0,1270],[2,1270,1650],[3,1650,3010],[4,3010,3390],[5,3390,3770],[6,3770,7069],[7,7069,8299],[8,8299,10269],[9,10269,10909],[10,10909,11789],[11,11789,13289],[12,13289,14209],[13,14209,15974]]}}],"dua":{"id":3,"name":"Ayat al-Shifa","arabicName":"آية الشفاء","reference":"17:82","verseTitle":"The Healing Verse","significanceReason":"Describes the Qur'an as a source of healing and mercy for believers, often recited for spiritual, emotional, and physical healing."},"version":{"key":"english_rwwad","direction":"ltr","language_iso_code":"en","version":"1.0.15","last_update":1711763763,"title":"English Translation - Rowwad Translation Center","description":"Translation of the Quran meanings into Englsih by Rowwad Translation Center in cooperation with Islamhouse.com"}}