{"data":[{"name":"1:6","price":"Tuongoe njia iliyonyooka.","arabic":"ٱهۡدِنَا ٱلصِّرَٰطَ ٱلۡمُسۡتَقِيمَ","category":["1 (Al-Fatihah)","Al-Fatihah","Surah Al-Fatihah"],"ayahNumber":6,"juzNumber":1,"footnotes":"Tunakuomba utuwafikishe kuendea Njia ya haki, na kheri na mafanikio.","lang":"sw","meta":{"transliteration":"ih'dinā al-ṣirāṭa al-mus'taqīma ","translations":["Guide us","(to) the path","the straight","(6)"],"transliterationArr":["ih'dinā","al-ṣirāṭa","al-mus'taqīma",null],"verseTiming":[[1,0,740],[2,740,1640],[3,1640,5525]]}},{"name":"1:7","price":"Njia ya ulio waneemesha, siyo ya walio kasirikiwa, wala walio potea.","arabic":"صِرَٰطَ ٱلَّذِينَ أَنۡعَمۡتَ عَلَيۡهِمۡ غَيۡرِ ٱلۡمَغۡضُوبِ عَلَيۡهِمۡ وَلَا ٱلضَّآلِّينَ","category":["1 (Al-Fatihah)","Al-Fatihah","Surah Al-Fatihah"],"ayahNumber":7,"juzNumber":1,"footnotes":"Na njia hiyo ndiyo ya waja wako ulio wawezesha kukuamini Wewe, na ukawajaalia neema ya uwongofu na radhi, sio njia ya walio stahiki kupata ghadhabu zako na wakaiwacha njia ya haki na kheri, kwa sababu hao wameitupa imani kukuamini Wewe na kuelekea kwenye uwongofu wako. (Hapana katika Vitabu vyote vitakatifu, vya dini zote, dua inayo lingana na hii kwa uzuri wake, na utimilivu wake. Baada ya kumsifu Mwenyezi Mungu kwa Rehema yake isio na ukomo wala kipimo, na kumshukuru Mola Mwenye kuviumba na kuviangalia na kuvilea kwa huruma viumbe vyote, na kuhakikisha kuwa tunajua kuwa hapana Mungu ila Yeye tu wa kuabudiwa na kuombwa msaada, na kuwa hapana wa kumuingilia katika Ufalme wake na Uwezo wake wa kulipa hisabu kwa kila alitendalo mtu, hapo tena ndio tunaomba. Na tunaomba nini? Si mkate wa kula, wala riziki yoyote, wala jambo lolote la manufaa ya kimwili duniani, bali tunaomba Uwongofu kwenye Njia Iliyo Nyooka, Njia ya kumwendea Yeye Mwenyezi Mungu Mwingi wa Rehema. Tunaomba tusiendee njia waliyo ifuata wale walio kasirikiwa na Mwenyezi Mungu, kwa kuwa walifunzwa wakajua, lakini kwa chuki na jeuri wakakataa kuongoka, wala sio njia ya wale ambao labda kwa ujinga wamepotea. Hiyo kwa mukhtasari ndiyo Dua ambayo Waislamu, wanafunzwa waiombe, na wanaiomba mara kadhaa wa kadhaa katika Sala zao, na katika kila fursa inapo tokea.)","lang":"sw","meta":{"transliteration":"ṣirāṭa alladhīna anʿamta ʿalayhim ghayri al-maghḍūbi ʿalayhim walā al-ḍālīna ","translations":["(The) path","(of) those","You have bestowed (Your) Favors","on them","not (of)","those who earned (Your) wrath","on themselves","and not","(of) those who go astray","(7)"],"transliterationArr":["ṣirāṭa","alladhīna","anʿamta","ʿalayhim","ghayri","al-maghḍūbi","ʿalayhim","walā","al-ḍālīna",null],"verseTiming":[[1,0,750],[2,750,1670],[3,1670,2690],[4,2690,3620],[5,3620,4210],[6,4210,5380],[7,5380,6380],[8,6380,6670],[9,6670,13175]]}}],"dua":{"id":6,"name":"Dua of Right Guidance","arabicName":"دعاء الهداية","reference":"1:6-7","verseTitle":"The Guidance Supplication","significanceReason":"Most repeated dua in daily prayers, seeking divine guidance and protection from misguided paths. Muslims recite this in every prayer, making it universally recognized and spiritually powerful."},"version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"}}