{"data":[{"name":"1:1","price":"Ní orúkọ Allāhu, Àjọkẹ́-ayé, Àṣàkẹ́-ọ̀run.¹","arabic":"بِسۡمِ ٱللَّهِ ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ","category":["1 (Al-Fatihah)","Al-Fatihah","Surah Al-Fatihah"],"ayahNumber":1,"juzNumber":1,"footnotes":"1. Sūratun Mọkkiyyah túmọ̀ sí sūrah tí ó sọ̀kalẹ̀ ṣíwájú Hijrah. Bákan náà, sūratun Mọdaniyyah túmọ̀ sí sūrah tí ó sọ̀kalẹ̀ lẹ́yìn Hijrah. Ìyẹn ni pé, Hijrah tí àwọn mùsùlùmí ṣe láti ìlú Mọkkah Alápọ̀n-ọ́nlé sí ìlú Mọdīnah Onímọ̀ọ́lẹ̀ ni wọ́n fi pín gbogbo sūrah al-Ƙur’ān alápọ̀n-ọ́nlé sábẹ́ sūratun Mọkkiyyah àti sūratun Mọdaniyyah. Ìwọ̀nyí ni àwọn orúkọ sūrah yìí: (1) Fātihatul-kitāb “Sūrah Ìbẹ̀rẹ̀ Tírà (ìyẹn ní ti àkọsílẹ̀, kì í ṣe ní ti ìsọ̀kalẹ̀.” (2) ’Ummul-Ƙur’ān “Ìpìlẹ̀ al-Ƙur’ān”, (3) ’Ummul-kitāb “Ìpìlẹ̀ Tírà”, (4) as-Sab‘u al-mọthāniy “sūrah alāyah méje tí ó kún fún ẹyìn Allāhu” (Wọ́n ṣí “bismillāh ar-rahmọ̄n ar-rọhīm” mọ́ ọn.)“, (5) al-Ƙur’ān al-‘aṭḥīm “N̄ǹkan Kíkà ńlá”, (6) al-hamd “ẹyìn”, (7) as-sọlāt “ìrun”, (8) aṣ-ṣifā’ “ìwòsàn” àti (9) ar-ruƙyah “àdúà pàjáwìrì”.","lang":"yo","meta":{"transliteration":"bis'mi al-lahi al-raḥmāni al-raḥīmi ","translations":["In (the) name","(of) Allah","the Most Gracious","the Most Merciful","(1)"],"transliterationArr":["bis'mi","al-lahi","al-raḥmāni","al-raḥīmi",null],"verseTiming":[[1,0,580],[2,580,1409],[3,1409,2502],[4,2502,5840]]}},{"name":"1:2","price":"Gbogbo ẹyìn¹ ń jẹ́ ti Allāhu, Olúwa² gbogbo ẹ̀dá,","arabic":"ٱلۡحَمۡدُ لِلَّهِ رَبِّ ٱلۡعَٰلَمِينَ","category":["1 (Al-Fatihah)","Al-Fatihah","Surah Al-Fatihah"],"ayahNumber":2,"juzNumber":1,"footnotes":"1. Nínú èdè Lárúbáwá, “hamd” yàtọ̀ sí “ṣukr” àmọ́ ìtúmọ̀ ìkíní kejì fẹ́ súnmọ́ ara wọn. \n Ìtúmọ̀ “hamd” ni “ẹyìn” èyí tí a sọ jáde ní ẹnu pẹ̀lú ìfẹ́ àti gbígbé-títóbi fún ẹni tí ẹyìn tọ́ sí nítorí pé ẹni náà jẹ́ ẹni tí ó pé tán pátápátá tí kò kù sí ibì kan kan níbi pàápàá rẹ̀, àwọn ìròyìn rẹ̀ àti àwọn ìṣe rẹ̀. Kò sì sí ẹni tí ó pé tán pátápátá bí kò ṣe Allāhu - Ọba tó ga jùlọ -. Nítorí náà, Allāhu nìkan ṣoṣo ni a gbọ́dọ̀ máa yìn gẹ́gẹ́ bí ó ṣe jẹ́ pé, Òun nìkan náà ni a gbọ́dọ̀ máa jọ́sìn fún ní ọ̀nà òdodo. Nígbà tí a bá yin ẹ̀dá ẹgbẹ́ wa, “mọdh” ni wọ́n ń pe ìyẹn nínú èdè Lárúbáwá. Kò sì pọn dandan kí ẹyìn náà dénú, ó lè má kọjá orí ahọ́n, gẹ́gẹ́ bí ẹyìn àwọn eléwì. \n Ní ti “ṣukr”, ìtúmọ̀ rẹ̀ ni mímọ rírì oore àti sísọ ọ́ jáde. Ẹni tí ó bá mọ rírì oore kan, tí ó sì sọ ọ́ jáde ló dúpẹ́ oore náà fún ẹni tí ó ṣe oore náà fún un. Bí Allāhu bá ṣe oore kan fún mi, mo lè sọ pé, “’aṣkuru-llāh / ṣukrān lillāh” (mo dúpẹ́ fún Allāhu). Bí ìwọ bá ṣoore kan fún mi, mo lè sọ pé, “ ’aṣkuruk / ṣukrān lak (mo dúpẹ́ fún ọ). Paban̄barì rẹ̀ ni pé kí n̄g sọ fún ọ pé, “jazākumullāhu kọerā” (Allāhu á san yín ní ẹ̀san rere.). Kí ìwọ náà yára fọ èsì pé, “ wa ’antum fajazākumullāhu kọerā” (Àti ẹ̀yin náà, Allāhu á san yín ní ẹ̀san rere.) Èsì kọ́ ni “wa’iyyākum” \n Àmọ́ a kò gbọ́dọ̀ lo “hamd” fún ẹ̀dá kan lẹ́yìn Allāhu - Ọba Ẹlẹ́yìn. Ẹni tí ó bá wá sọ pé, “alhamdu lillāh” Ó ti kó ẹyìn àti ọpẹ́ sínú. Nítorí náà, kí ẹ̀dá máa ṣe “alhamdu lillāh” ní àsìkò tí a bá rí oore kan gbà láti ọ̀dọ̀ Allāhu àti ní àsìkò tí a kò ì rí oore náà gbá nítorí pé, oore Allāhu lọ́dọ̀ wa pọ̀ láì ní òǹkà. \n Ìdí nìyí tí ó fi jẹ́ pé, nígbà tí ìdùnnú kan bá ṣẹlẹ̀ sí Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a -, ó máa sọ pé “ alhamdu lillāh allathī bi ni‘mọtihi tatimmu-ssọ̄lihāt” (gbogbo ẹyìn ń jẹ́ ti Allāhu, ẹni tí àwọn ohun rere ń pé (ń kẹ́sẹjá) pẹ̀lú ìdẹ̀ra Rẹ̀. Tí ìdà kejì bá sì ṣẹlẹ̀, ó máa sọ pé, “alhamdu lillāhi ‘alā kulli hāl” (gbogbo ẹyìn ń jẹ́ ti Allāhu lórí gbogbo ipò (tí ẹ̀dá bá wà).\n 2. Ọ̀rọ̀ yìí “rọbb” (Olúwa), ó kó ọ̀rọ̀ mẹ́ta sínú. Dídá ẹ̀dá, ṣíṣe ìjọba lórí ẹ̀dá tàbí níni ẹ̀dá àti dídarí ọ̀rọ̀ ẹ̀dá. Nígbà tí a bá pe Allāhu ní “rọbb” (Olúwa), gbogbo ìwọ̀nyẹn ló kó sínú nítorí pé, Allāhu ni Ẹlẹ́dàá wa, tiRẹ̀ ni ìjọba lórí gbogbo ẹ̀dá, Òun sì ni Ó ń darí kádàrá ẹ̀dá. Nítorí náà, Allāhu ni Olúwa wa. \n Àmọ́ nígbà tí a bá pe ẹ̀dá kan ní “rọbb”, kò lè kó gbogbo ìròyìn mẹ́tẹ̀ẹ̀ta wọ̀nyẹn sínú. Bí àpẹ̀ẹrẹ, à ń pe onílé ní “rọbbul-baet” nítorí pé, ìtúmọ̀ kan nínú àwọn ìtúmọ̀ “rọbb” ni níni n̄ǹkan”","lang":"yo","meta":{"transliteration":"al-ḥamdu lillahi rabbi al-ʿālamīna ","translations":["All praises and thanks","(be) to Allah","the Lord","of the universe","(2)"],"transliterationArr":["al-ḥamdu","lillahi","rabbi","al-ʿālamīna",null],"verseTiming":[[1,0,1000],[2,1000,1860],[3,1860,2490],[4,2490,5525]]}},{"name":"1:3","price":"Àjọkẹ́-ayé, Àṣàkẹ́-ọ̀run,","arabic":"ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ","category":["1 (Al-Fatihah)","Al-Fatihah","Surah Al-Fatihah"],"ayahNumber":3,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"al-raḥmāni al-raḥīmi ","translations":["The Most Gracious","the Most Merciful","(3)"],"transliterationArr":["al-raḥmāni","al-raḥīmi",null],"verseTiming":[[1,0,1240],[3,1240,4565]]}},{"name":"1:4","price":"Olùkápá-ọjọ́-ẹ̀san.","arabic":"مَٰلِكِ يَوۡمِ ٱلدِّينِ","category":["1 (Al-Fatihah)","Al-Fatihah","Surah Al-Fatihah"],"ayahNumber":4,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"māliki yawmi al-dīni ","translations":["(The) Master","(of the) Day","(of the) Judgment","(4)"],"transliterationArr":["māliki","yawmi","al-dīni",null],"verseTiming":[[1,0,820],[2,820,1420],[3,1420,4585]]}},{"name":"1:5","price":"Ìwọ nìkan ni à ń jọ́sìn fún. Ọ̀dọ̀ Rẹ nìkan sì ni à ń wá oore sí.¹","arabic":"إِيَّاكَ نَعۡبُدُ وَإِيَّاكَ نَسۡتَعِينُ","category":["1 (Al-Fatihah)","Al-Fatihah","Surah Al-Fatihah"],"ayahNumber":5,"juzNumber":1,"footnotes":"1. Èyí ni àdéhùn ojoojúmọ́ tí à ń ṣe fún Allāhu, Ọlọ́hun tí a gbọ́dọ̀ máa jọ́sìn fún ní ọ̀nà òdodo. Nítorí náà, èèwọ̀ ẹ̀sìn ni fún mùsùlùmí láti yapa àdéhùn náà. Ẹnikẹ́ni tí ó bá yapa àdéhùn náà, ó ti di ẹlẹ́bọ pọ́nńbélé títí ó fi máa ronú pìwàdà.","lang":"yo","meta":{"transliteration":"iyyāka naʿbudu wa-iyyāka nastaʿīnu ","translations":["You Alone","we worship","and You Alone","we ask for help","(5)"],"transliterationArr":["iyyāka","naʿbudu","wa-iyyāka","nastaʿīnu",null],"verseTiming":[[1,0,990],[2,990,1760],[3,1760,2880],[4,2880,6635]]}},{"name":"1:6","price":"Fi ẹsẹ̀ wa rinlẹ̀ l’ójú ọ̀nà tààrà (’Islām),¹","arabic":"ٱهۡدِنَا ٱلصِّرَٰطَ ٱلۡمُسۡتَقِيمَ","category":["1 (Al-Fatihah)","Al-Fatihah","Surah Al-Fatihah"],"ayahNumber":6,"juzNumber":1,"footnotes":"1. Sirọ̄tun mustaƙīm “ọ̀nà tààrà” jẹyọ ní àyè 33 nínú al-Ƙur’ān alápọ̀n-ọ́nlé. Ó sì dúró fún ìwọ̀nyí: \n (1) Jíjìnnà sí ẹbọ ṣíṣe, jíjìnnà sí ìwà ìbàjẹ́, ṣíṣe rere àti lílo òfin Allāhu; ìtúmọ̀ yìí wà bẹ́ẹ̀ nínú sūrah al-’Ani-‘Ām; 6:151-153. \n (2) Jíjọ́sìn fún Allāhu níkan ṣoṣo àti dídúró ṣinṣin nínú ìjọ́sìn Rẹ̀; ìtúmọ̀ yìí wà bẹ́ẹ̀ nínú sūrah Āli ‘Imrọ̄n; 3:51&101. \n (3) Ẹ̀sìn kan ṣoṣo tí gbogbo àwọn Ànábì àti àwọn Òjíṣẹ́ Allāhu ṣe; ìtúmọ̀ yìí wà bẹ́ẹ̀ nínú sūrah al-’Ani-‘Ām; 6:83-90. \n (4) Ẹ̀sìn ’Islām; ìtúmọ̀ yìí wà bẹ́ẹ̀ nínú sūrah al-’Ani-‘Ām; 6:125-126. Nítorí náà, kò sí àyè kan nínú al-Ƙur’ān tí ọ̀nà tààrà ti dúró fún ẹ̀sìn nasọ̄rọ̄ tàbí ẹ̀sìn yẹhudi. \n Nígbà tí mùsùlùmí bá sì ń ṣàdúà ní gbogbo ìgbà pé “ihdina-ssirọ̄tọl-mustaƙīm” ìtúmọ̀ rẹ̀ ni pé, “Fi ẹsẹ̀ wa rinlẹ̀ l’ójú ọ̀nà tààrà.” Ìyẹn ni pé, “Fi ẹsẹ̀ wa rinlẹ̀ sínú ’Islām ọ̀nà tààrà.” Nítorí náà, àdúà ìfẹsẹ̀rinlẹ̀ sínú ẹ̀sìn ’Islām títí d’ọjọ́ ikú ni àdúà náà dúró fún. Àti pé, āyah 7 ti yanjú ọ̀rọ̀ náà pé, kì í ṣe ọ̀nà yẹhudi nítorí pé, wọ́n ti di ẹni ìbínú lọ́dọ̀ Allāhu. Kì í sì ṣe ọ̀nà nasọ̄rọ̄ nítorí pé, wọ́n ti di olùṣìnà. Ẹ tún wo ìtọsẹ̀-ọ̀rọ̀ sūrah Al-’a‘rọ̄f; 7:23. = \n Kíyè sí i! Ìdí tí àdúà yìí sì fi pàtàkì púpọ̀ ni pé, tí ènìyàn bá ṣe ẹ̀sìn ’Islām, kò lè jèrè rẹ̀ àyàfi kí ó kú sínú rẹ̀ nítorí sūrah Āli-‘Imrọ̄n; 3:102. Ẹ tún wo ìtọsẹ̀-ọ̀rọ̀ sūrah al-Ƙọsọs; 28:56.","lang":"yo","meta":{"transliteration":"ih'dinā al-ṣirāṭa al-mus'taqīma ","translations":["Guide us","(to) the path","the straight","(6)"],"transliterationArr":["ih'dinā","al-ṣirāṭa","al-mus'taqīma",null],"verseTiming":[[1,0,740],[2,740,1640],[3,1640,5525]]}},{"name":"1:7","price":"ọ̀nà àwọn tí O ṣe ìdẹ̀ra fún,¹ yàtọ̀ sí (ọ̀nà) àwọn ẹni-ìbínú (ìyẹn, àwọn yẹhudi) àti (ọ̀nà) àwọn olùṣìnà (ìyẹn, àwọn nasọ̄rọ̄).","arabic":"صِرَٰطَ ٱلَّذِينَ أَنۡعَمۡتَ عَلَيۡهِمۡ غَيۡرِ ٱلۡمَغۡضُوبِ عَلَيۡهِمۡ وَلَا ٱلضَّآلِّينَ","category":["1 (Al-Fatihah)","Al-Fatihah","Surah Al-Fatihah"],"ayahNumber":7,"juzNumber":1,"footnotes":"1. Àwọn wo gan-an ni àwọn tí Allāhu ṣe ìdẹ̀ra fún, tí àwa mùsùlùmí ń tọ ojú-ọ̀nà wọn? Ẹ ka sūrah Mọryam;19:58.","lang":"yo","meta":{"transliteration":"ṣirāṭa alladhīna anʿamta ʿalayhim ghayri al-maghḍūbi ʿalayhim walā al-ḍālīna ","translations":["(The) path","(of) those","You have bestowed (Your) Favors","on them","not (of)","those who earned (Your) wrath","on themselves","and not","(of) those who go astray","(7)"],"transliterationArr":["ṣirāṭa","alladhīna","anʿamta","ʿalayhim","ghayri","al-maghḍūbi","ʿalayhim","walā","al-ḍālīna",null],"verseTiming":[[1,0,750],[2,750,1670],[3,1670,2690],[4,2690,3620],[5,3620,4210],[6,4210,5380],[7,5380,6380],[8,6380,6670],[9,6670,13175]]}},{"name":"2:1","price":"’Alif lām mīm. (Allāhu ló mọ ohun tí Ó gbàlérò pẹ̀lú àwọn háràfí náà.)¹","arabic":"الٓمٓ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":8,"juzNumber":1,"footnotes":"1. Bí ó tilẹ̀ jẹ́ pé àwọn kan nínú àwọn onímọ̀ ’Islām máa ń sọ pé irúfẹ́ àwọn lẹ́tà (háràfí) wọ̀nyí dúró fún àwọn ọ̀rọ̀ kan, ohun tí àwọn onímọ̀ ’Islām faramọ́ jùlọ ni pé, Allāhu - subhānahu wa ta‘ālā - nìkan ṣoṣo l’Ó nímọ̀ jùlọ nípa ohun tí Ó gbàlérò pẹ̀lú àwọn harafi náà.\n Láti ọ̀dọ̀ bàbá Huraerah - kí Allāhu yọ́nú sí i -, dájúdájú Òjíṣẹ́ Allāhu - kí ìkẹ́ àti ọlà Allāhu máa bá a -, ó sọ pé, “Ẹ má sọ ilé yín di itẹ́. Dájúdájú èṣù máa ń sá kúrò nínú ilé tí wọ́n ń ké sūrah al-Baƙọrah nínú rẹ̀.” Muslim ló gbà á wá nínú sọhīhu rẹ̀.","lang":"yo","meta":{"transliteration":"alif-lam-meem ","translations":["Alif Laam Meem","(1)"],"transliterationArr":["alif-lam-meem",null],"verseTiming":[[1,0,7595]]}},{"name":"2:2","price":"Tírà yìí, kò sí iyèméjì nínú rẹ̀. Ìmọ̀nà ni fún àwọn olùbẹ̀rù (Allāhu).","arabic":"ذَٰلِكَ ٱلۡكِتَٰبُ لَا رَيۡبَۛ فِيهِۛ هُدٗى لِّلۡمُتَّقِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":9,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"dhālika al-kitābu lā rayba fīhi hudan lil'muttaqīna ","translations":["That","(is) the book","no","doubt","in it","a Guidance","for the God-conscious","(2)"],"transliterationArr":["dhālika","al-kitābu","lā","rayba","fīhi","hudan","lil'muttaqīna",null],"verseTiming":[[1,0,900],[2,900,1800],[3,1800,2180],[4,2180,2750],[5,2750,5010],[6,5010,5310],[7,5310,8905]]}},{"name":"2:3","price":"(Àwọn olùbẹ̀rù Allāhu ni:) àwọn tó gbàgbọ́ ní òdodo nínú ìkọ̀kọ̀¹ àti àwọn tó ń kírun àti àwọn tó ń ná nínú ohun tí A pèsè fún wọn,","arabic":"ٱلَّذِينَ يُؤۡمِنُونَ بِٱلۡغَيۡبِ وَيُقِيمُونَ ٱلصَّلَوٰةَ وَمِمَّا رَزَقۡنَٰهُمۡ يُنفِقُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":10,"juzNumber":1,"footnotes":"1. Ní ti ìkọ̀kọ̀, ohun tí wọ́n gbàlérò pẹ̀lú rẹ̀ ní àyè yìí, oríṣiríṣi ni ọ̀rọ̀ àwọn aṣíwájú lórí rẹ̀. Bàbá ‘Āliyah sọ pé, “Wọ́n gbàgbọ́ nínú Allāhu àti àwọn mọlāikah Rẹ̀ àti àwọn tírà Rẹ̀ àti àwọn Òjíṣẹ́ Rẹ̀ àti Ọgbà Ìdẹ̀ra Rẹ̀ àti ìpàdé Rẹ̀ àti ìṣẹ̀mí lẹ́yìn ikú. Ìkọ̀ọ̀kan ìwọ̀nyí ni ìkọ̀kọ̀.” Suddiy sọ pé, láti ọ̀dọ̀ ọmọ ‘Abbās àti ọmọ Mọs‘ūd, “Ìkọ̀kọ̀ ni n̄ǹkan tí ó pamọ́ fún àwọn ẹrú nípa ọ̀rọ̀ Ọgbà Ìdẹ̀ra àti ọ̀rọ̀ Iná àti n̄ǹkan tí wọ́n bá sọ nínú al-Ƙur’ān.” ‘Atọ̄’ sọ pé, “Ẹni tí ó bá gbàgbọ́ nínú Allāhu, ó kúkú ti gbàgbọ́ nínú ìkọ̀kọ̀.” Ìkọ̀ọ̀kan ọ̀rọ̀ wọ̀nyí súnmọ́ ara wọn tí ó ń já sí ìtúmọ̀ ẹyọ kan, gbogbo rẹ̀ sì ni wọ́n gbàlérò fún ìtúmọ̀ ìkọ̀kọ̀. (Tafsīr bn Kathīr)","lang":"yo","meta":{"transliteration":"alladhīna yu'minūna bil-ghaybi wayuqīmūna al-ṣalata wamimmā razaqnāhum yunfiqūna ","translations":["Those who","believe","in the unseen","and establish","the prayer","and out of what","We have provided them","they spend","(3)"],"transliterationArr":["alladhīna","yu'minūna","bil-ghaybi","wayuqīmūna","al-ṣalata","wamimmā","razaqnāhum","yunfiqūna",null],"verseTiming":[[1,0,1040],[2,1040,2190],[3,2190,3090],[4,3090,4260],[5,4260,5220],[6,5220,6580],[7,6580,7990],[8,7990,11365]]}},{"name":"2:4","price":"àti àwọn tó gbàgbọ́ ní òdodo nínú ohun tí A sọ̀kalẹ̀ fún ọ àti ohun tí A sọ̀kalẹ̀ ṣíwájú rẹ¹ àti àwọn tó ní àmọ̀dájú nípa Ọjọ́ Ìkẹ́yìn.²","arabic":"وَٱلَّذِينَ يُؤۡمِنُونَ بِمَآ أُنزِلَ إِلَيۡكَ وَمَآ أُنزِلَ مِن قَبۡلِكَ وَبِٱلۡأٓخِرَةِ هُمۡ يُوقِنُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":11,"juzNumber":1,"footnotes":"1. Ìgbàkígbà tí àwọn nasọ̄rọ̄ bá ka irú āyah yìí nínú al-Ƙur’ān, wọ́n a wí pé: “Al-Ƙur’ān gan-an sọ pé àwa mùsùlùmí gbọ́dọ̀ gbàgbọ́ nínú bíbélì!” Ní àkọ́kọ́ ná, Allāhu kò dárúkọ bíbélì nínú al-Ƙur’ān. Orúkọ àwọn tírà mímọ́ tí Allāhu - subhānahu wa ta‘ālā - sọ nípa wọn nínú al-Ƙur’ān ni Zabūr, Suhuf, Taorāt àti ’Injīl. \n Lẹ́yìn náà, ìkọ̀ọ̀kan àwọn tírà wọ̀nyẹn ló wà fún ìjọ Ànábì tí Allāhu fún nìkan, kò sì kan ìjọ mìíràn lẹ́yìn wọn, gẹ́gẹ́ bí ó ṣe jẹ́ pé ìjọ yẹn nìkan ni Allāhu rán Ànábì tí ọ̀rọ̀ kàn sí. \n Lẹ́yìn náà, Allāhu - subhānahu wa ta‘ālā - fi rinlẹ̀ nínú al-Ƙur’ān pé kò sí ojúlówó àwọn tírà náà mọ́ níta, gẹ́gẹ́ bí ó ṣe wà nínú sūrah al-Baƙọrah; 2:75 & 79, sūrah an-Nisā’; 4:46 àti sūrah al-Mọ̄’idah; 5:13. Lóde òní yìí, bíbélì ti lé ní oríṣi ọgbọ̀n! Wàyí, níwọ̀n ìgbà tí ó sì ti rinlẹ̀ pé Allāhu - subhānahu wa ta‘ālā - sọ àwọn tírà kan kalẹ̀ fún àwọn Ànábì kan tó ṣíwájú Ànábì wa - kí ìkẹ́ Allāhu máa bá gbogbo wọn -, mùsùlùmí gbọ́dọ̀ gbàgbọ́ pé Allāhu fún àwọn Ànábì kan ní tírà, ṣùgbọ́n kì í ṣe pé mùsùlùmí yóò sọ tírà náà di ohun tí yóò máa kà áḿbọ̀sìbọ́sí pé yóò tẹ̀lé wọn. Nítorí náà, al-Ƙur’ān alápọ̀n-ọ́nlé ni tírà ìkẹ́yìn láti ọ̀dọ̀ Allāhu fún gbogbo ẹ̀dá. Kò sí òmíràn mọ́.\n 2. Kíyè sí i! Āyah kẹ́ta àti ìkẹrin ló ń túmọ̀ “àwọn olùbẹ̀rù Allāhu” tí ó jẹyọ ní ìparí āyah kejì. Bákan náà, ìkọ̀ọ̀kan àwọn ìròyìn márààrún wọ̀nyí “ìgbàgbọ́ òdodo nínú ìkọ̀kọ̀, ìrun kíkí, nínáwó sí ọ̀nà ẹ̀tọ́, ìgbàgbọ́ òdodo nínú gbogbo àwọn tírà sánmọ̀ àti àmọ̀dájú (ìgbàgbọ́ òdodo) nínú Ọjọ́ Ìkẹ́yìn”, gbogbo ìwọ̀nyí gbọ́dọ̀ wà lára ẹni tí ó bá fẹ́ wà nínú àwọn olùbẹ̀rù Allāhu.","lang":"yo","meta":{"transliteration":"wa-alladhīna yu'minūna bimā unzila ilayka wamā unzila min qablika wabil-ākhirati hum yūqinūna ","translations":["And those who","believe","in what","(is) sent down","to you","and what","was sent down","from","before you","and in the Hereafter","they","firmly believe","(4)"],"transliterationArr":["wa-alladhīna","yu'minūna","bimā","unzila","ilayka","wamā","unzila","min","qablika","wabil-ākhirati","hum","yūqinūna",null],"verseTiming":[[1,0,1170],[2,1170,2240],[3,2240,3950],[4,3950,5290],[5,5290,6040],[6,6040,7820],[7,7820,9070],[8,9070,9940],[9,9940,10720],[10,10720,12170],[11,12170,12540],[12,12540,15755]]}},{"name":"2:5","price":"Àwọn wọ̀nyẹn wà lórí ìmọ̀nà láti ọ̀dọ̀ Olúwa wọn. Àwọn wọ̀nyẹn gan-an ni olùjèrè.","arabic":"أُوْلَٰٓئِكَ عَلَىٰ هُدٗى مِّن رَّبِّهِمۡۖ وَأُوْلَٰٓئِكَ هُمُ ٱلۡمُفۡلِحُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":12,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"ulāika ʿalā hudan min rabbihim wa-ulāika humu al-muf'liḥūna ","translations":["Those","(are) on","Guidance","from","their Lord","and those ","they","(are) the successful ones","(5)"],"transliterationArr":["ulāika","ʿalā","hudan","min","rabbihim","wa-ulāika","humu","al-muf'liḥūna",null],"verseTiming":[[1,0,2549],[2,2549,3099],[3,3099,3559],[4,3559,4289],[5,4289,5539],[6,5539,8039],[7,8039,8329],[8,8329,11314]]}},{"name":"2:6","price":"Dájúdájú àwọn tó ṣàì gbàgbọ́, bákan náà ni fún wọn, yálà o kìlọ̀ fún wọn tàbí o kò kìlọ̀ fún wọn, wọn kò níí gbàgbọ́.¹","arabic":"إِنَّ ٱلَّذِينَ كَفَرُواْ سَوَآءٌ عَلَيۡهِمۡ ءَأَنذَرۡتَهُمۡ أَمۡ لَمۡ تُنذِرۡهُمۡ لَا يُؤۡمِنُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":13,"juzNumber":1,"footnotes":"1. Àwọn wọ̀nyẹn ni àwọn tí kádàrá wọn lórí jíjẹ́ kèfèrí wọn kò níí yí padà. Àmọ́ ní ti àwọn tí kádàrá ìrònúpìwàdà máa borí wọn, ìkìlọ̀ máa sọ wọ́n di mùsùlùmí. Āyah yìí sọ̀kalẹ̀ nítorí àwọn tí wọ́n ń kú sínú kèfèrí lẹ́yìn tí ìkìlọ̀ ti dé etí ìgbọ́ wọn pé, ọmọ Iná ni gbogbo ẹni tí kò bá kú sínú ’Islām. Nítorí náà, āyah yìí kò sọ̀kalẹ̀ nítorí gbogbo àwọn aláìgbàgbọ́ nítorí pé, a kúkú ń fojú rí àwọn kan nínú wọn tí wọ́n ń gba ’Islām. Àti pé ọ̀wọ́ àwọn tí àdánwò èdídí ọkàn, èdídí ìgbọ́rọ̀ àti èbìbò ojú bá wà lára wọn ló máa takú sínú kèfèrí rẹ̀ títí di ọjọ́ ikú rẹ̀.","lang":"yo","meta":{"transliteration":"inna alladhīna kafarū sawāon ʿalayhim a-andhartahum am lam tundhir'hum lā yu'minūna ","translations":["Indeed","those who","disbelieve[d]","(it) is same","to them","whether you warn them","or","not","you warn them","not","they believe","(6)"],"transliterationArr":["inna","alladhīna","kafarū","sawāon","ʿalayhim","a-andhartahum","am","lam","tundhir'hum","lā","yu'minūna",null],"verseTiming":[[1,0,1260],[2,1260,2170],[3,2170,2910],[4,2910,5010],[5,5010,5920],[6,5920,7830],[7,7830,8120],[8,8120,8490],[9,8490,10110],[10,10110,10520],[11,10520,12555]]}},{"name":"2:7","price":"Allāhu fi èdídí dí ọkàn wọn àti ìgbọ́rọ̀ wọn. Èbìbò sì bo ìríran wọn. Ìyà ńlá sì wà fún wọn.","arabic":"خَتَمَ ٱللَّهُ عَلَىٰ قُلُوبِهِمۡ وَعَلَىٰ سَمۡعِهِمۡۖ وَعَلَىٰٓ أَبۡصَٰرِهِمۡ غِشَٰوَةٞۖ وَلَهُمۡ عَذَابٌ عَظِيمٞ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":14,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"khatama al-lahu ʿalā qulūbihim waʿalā samʿihim waʿalā abṣārihim ghishāwatun walahum ʿadhābun ʿaẓīmun ","translations":["Has set a seal","Allah","on","their hearts","and on","their hearing","and on","their vision","(is) a veil","And for them","(is) a punishment","great","(7)"],"transliterationArr":["khatama","al-lahu","ʿalā","qulūbihim","waʿalā","samʿihim","waʿalā","abṣārihim","ghishāwatun","walahum","ʿadhābun","ʿaẓīmun",null],"verseTiming":[[1,0,680],[2,680,1460],[3,1460,1980],[4,1980,3190],[5,3190,3890],[6,3890,5270],[7,5270,6940],[8,6940,8230],[9,8230,9270],[10,9270,10320],[11,10320,11290],[12,11290,13235]]}},{"name":"2:8","price":"Ó ń bẹ nínú àwọn ènìyàn, ẹni tó ń wí pé: “A gbàgbọ́ nínú Allāhu àti Ọjọ́ Ìkẹ́yìn.” Wọn kì í sì ṣe onígbàgbọ́ òdodo.","arabic":"وَمِنَ ٱلنَّاسِ مَن يَقُولُ ءَامَنَّا بِٱللَّهِ وَبِٱلۡيَوۡمِ ٱلۡأٓخِرِ وَمَا هُم بِمُؤۡمِنِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":15,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"wamina al-nāsi man yaqūlu āmannā bil-lahi wabil-yawmi al-ākhiri wamā hum bimu'minīna ","translations":["And of","the people","(are some) who","say","We believed","in Allah","and in the Day","[the] Last","but not","they","(are) believers (at all)","(8)"],"transliterationArr":["wamina","al-nāsi","man","yaqūlu","āmannā","bil-lahi","wabil-yawmi","al-ākhiri","wamā","hum","bimu'minīna",null],"verseTiming":[[1,0,590],[2,590,1920],[3,1920,2170],[4,2170,3510],[5,3510,5030],[6,5030,6050],[7,6050,7130],[8,7130,8050],[9,8050,8640],[10,8640,9610],[11,9610,11985]]}},{"name":"2:9","price":"Wọ́n ń tan Allāhu àti àwọn tó gbàgbọ́ ní òdodo. Wọn kò sì tan ẹnì kan bí kò ṣe ẹ̀mí ara wọn; wọn kò sì fura.","arabic":"يُخَٰدِعُونَ ٱللَّهَ وَٱلَّذِينَ ءَامَنُواْ وَمَا يَخۡدَعُونَ إِلَّآ أَنفُسَهُمۡ وَمَا يَشۡعُرُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":16,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"yukhādiʿūna al-laha wa-alladhīna āmanū wamā yakhdaʿūna illā anfusahum wamā yashʿurūna ","translations":["They seek to deceive","Allah","and those who","believe[d]","and not","they deceive","except","themselves","and not","they realize (it)","(9)"],"transliterationArr":["yukhādiʿūna","al-laha","wa-alladhīna","āmanū","wamā","yakhdaʿūna","illā","anfusahum","wamā","yashʿurūna",null],"verseTiming":[[1,0,1340],[2,1340,2200],[3,2200,3160],[4,3160,4220],[5,4220,4730],[6,4730,5940],[7,5940,7890],[8,7890,9600],[9,9600,10160],[10,10160,12485]]}},{"name":"2:10","price":"Àrùn kan wà nínú ọkàn wọn¹, nítorí náà Allāhu ṣe àlékún àrùn fún wọn.² Ìyà ẹlẹ́ta-eléro sì wà fún wọn nítorí pé wọ́n ń parọ́.","arabic":"فِي قُلُوبِهِم مَّرَضٞ فَزَادَهُمُ ٱللَّهُ مَرَضٗاۖ وَلَهُمۡ عَذَابٌ أَلِيمُۢ بِمَا كَانُواْ يَكۡذِبُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":17,"juzNumber":1,"footnotes":"1. Àrùn iyèméjì àti ìṣojúméjì sí āyah al-Ƙur’ān.\n 2. Ìyẹn ni pé, àrùn ọkàn wọn ń lékún sí i nígbàkígbà tí āyah bá sọ̀kalẹ̀ tí wọ́n ń takò ó.","lang":"yo","meta":{"transliteration":"fī qulūbihim maraḍun fazādahumu al-lahu maraḍan walahum ʿadhābun alīmun bimā kānū yakdhibūna ","translations":["In","their hearts","(is) a disease","so has increased them","Allah","(in) disease","and for them","(is) a punishment","painful","because","they used to","[they] lie","(10)"],"transliterationArr":["fī","qulūbihim","maraḍun","fazādahumu","al-lahu","maraḍan","walahum","ʿadhābun","alīmun","bimā","kānū","yakdhibūna",null],"verseTiming":[[1,0,410],[2,410,1550],[3,1550,2830],[4,2830,4630],[5,4630,5380],[6,5380,6510],[7,6510,7340],[8,7340,8300],[9,8300,9680],[10,9680,10200],[11,10200,11010],[12,11010,13465]]}},{"name":"2:11","price":"Nígbà tí wọ́n bá sọ fún wọn pé: “Ẹ má ṣèbàjẹ́ lórí ilẹ̀.” Wọ́n á wí pé: “Àwa kúkú ni alátùn-únṣe.”","arabic":"وَإِذَا قِيلَ لَهُمۡ لَا تُفۡسِدُواْ فِي ٱلۡأَرۡضِ قَالُوٓاْ إِنَّمَا نَحۡنُ مُصۡلِحُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":18,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"wa-idhā qīla lahum lā tuf'sidū fī al-arḍi qālū innamā naḥnu muṣ'liḥūna ","translations":["And when","it is said","to them","(Do) not","spread corruption","in","the earth","they say","Only","we","(are) reformers","(11)"],"transliterationArr":["wa-idhā","qīla","lahum","lā","tuf'sidū","fī","al-arḍi","qālū","innamā","naḥnu","muṣ'liḥūna",null],"verseTiming":[[1,0,790],[2,790,1410],[3,1410,1880],[4,1880,2230],[5,2230,3120],[6,3120,3350],[7,3350,4030],[8,4030,5970],[9,5970,7520],[10,7520,8050],[11,8050,10575]]}},{"name":"2:12","price":"Ẹ kíyè sí i! Dájúdájú àwọn gan-an ni òbìlẹ̀jẹ́, ṣùgbọ́n wọn kò fura.","arabic":"أَلَآ إِنَّهُمۡ هُمُ ٱلۡمُفۡسِدُونَ وَلَٰكِن لَّا يَشۡعُرُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":19,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"alā innahum humu al-muf'sidūna walākin lā yashʿurūna ","translations":["Beware","indeed they","themselves","(are) the ones who spread corruption","[and] but","not","they realize (it)","(12)"],"transliterationArr":["alā","innahum","humu","al-muf'sidūna","walākin","lā","yashʿurūna",null],"verseTiming":[[1,0,1970],[2,1970,3380],[3,3380,3730],[4,3730,5080],[5,5080,5910],[6,5910,6360],[7,6360,9065]]}},{"name":"2:13","price":"Nígbà tí wọ́n bá sọ fún wọn pé: “Ẹ gbàgbọ́ ní òdodo gẹ́gẹ́ bí àwọn ènìyàn ṣe gbàgbọ́.” Wọ́n á wí pé: “Ṣé kí á gbàgbọ́ gẹ́gẹ́ bí àwọn òmùgọ̀ ṣe gbàgbọ́ ni?” Ẹ kíyè sí i! Dájúdájú àwọn gan-an ni òmùgọ̀, ṣùgbọ́n wọn kò mọ̀.","arabic":"وَإِذَا قِيلَ لَهُمۡ ءَامِنُواْ كَمَآ ءَامَنَ ٱلنَّاسُ قَالُوٓاْ أَنُؤۡمِنُ كَمَآ ءَامَنَ ٱلسُّفَهَآءُۗ أَلَآ إِنَّهُمۡ هُمُ ٱلسُّفَهَآءُ وَلَٰكِن لَّا يَعۡلَمُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":20,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"wa-idhā qīla lahum āminū kamā āmana al-nāsu qālū anu'minu kamā āmana al-sufahāu alā innahum humu al-sufahāu walākin lā yaʿlamūna ","translations":["And when","it is said","to them","Believe","as","believed","the people","they say","Should we believe","as","believed","the fools","Beware","certainly they","themselves","(are) the fools","[and] but","not","they know","(13)"],"transliterationArr":["wa-idhā","qīla","lahum","āminū","kamā","āmana","al-nāsu","qālū","anu'minu","kamā","āmana","al-sufahāu","alā","innahum","humu","al-sufahāu","walākin","lā","yaʿlamūna",null],"verseTiming":[[1,0,850],[2,850,1430],[3,1430,1940],[4,1940,2810],[5,2810,4600],[6,4600,5250],[7,5250,6590],[8,6590,8470],[9,8470,9390],[10,9390,11280],[11,11280,11930],[12,11930,14680],[13,14680,16920],[14,16920,18230],[15,18230,18610],[16,18610,21110],[17,21110,21850],[18,21850,22380],[19,22380,24835]]}},{"name":"2:14","price":"Nígbà tí wọ́n bá pàdé àwọn tó gbàgbọ́ ní òdodo, wọ́n á wí pé: “A gbàgbọ́.” Nígbà tí ó bá sì kù wọ́n ku àwọn (ẹni) èṣù wọn, wọ́n á wí pé: “Dájúdájú àwa ń bẹ pẹ̀lú yín, àwa kàn ń ṣe yẹ̀yẹ́ ni.”","arabic":"وَإِذَا لَقُواْ ٱلَّذِينَ ءَامَنُواْ قَالُوٓاْ ءَامَنَّا وَإِذَا خَلَوۡاْ إِلَىٰ شَيَٰطِينِهِمۡ قَالُوٓاْ إِنَّا مَعَكُمۡ إِنَّمَا نَحۡنُ مُسۡتَهۡزِءُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":21,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"wa-idhā laqū alladhīna āmanū qālū āmannā wa-idhā khalaw ilā shayāṭīnihim qālū innā maʿakum innamā naḥnu mus'tahziūna ","translations":["And when","they meet","those who","believe[d]","they say","We believe[d]","But when","they are alone","with","their evil ones","they say","Indeed, we","(are) with you","only","we","(are) mockers","(14)"],"transliterationArr":["wa-idhā","laqū","alladhīna","āmanū","qālū","āmannā","wa-idhā","khalaw","ilā","shayāṭīnihim","qālū","innā","maʿakum","innamā","naḥnu","mus'tahziūna",null],"verseTiming":[[1,0,820],[2,820,1170],[3,1170,2060],[4,2060,3050],[5,3050,4940],[6,4940,6520],[7,6520,7250],[8,7250,7850],[9,7850,8330],[10,8330,9920],[11,9920,10750],[12,10750,11830],[13,11830,12470],[14,12470,12970],[15,12970,14640],[16,14640,16610],[17,16610,18020],[18,18020,18830],[19,18830,20490],[20,20490,21030],[21,21030,23685]]}},{"name":"2:15","price":"Allāhu máa fi wọ́n ṣe yẹ̀yẹ́. Ó sì máa mú wọn lékún sí i nínú àgbéré wọn, tí wọn yóò máa pa rìdàrìdà.¹","arabic":"ٱللَّهُ يَسۡتَهۡزِئُ بِهِمۡ وَيَمُدُّهُمۡ فِي طُغۡيَٰنِهِمۡ يَعۡمَهُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":22,"juzNumber":1,"footnotes":"1. Kì í ṣe gbogbo ìṣe tí Allāhu bá fi ròyìn Ara Rẹ̀ ni ó máa di orúkọ Rẹ̀ àfi èyí tí Allāhu bá fúnra Rẹ̀ mú wá gẹ́gẹ́ bí orúkọ Rẹ̀ nítorí àwọn ìdí wọ̀nyí: \n Ìdí àkọ́kọ́: Nínú ìdí tí a kò gbọ́dọ̀ fi sọ gbogbo ìṣe tí Allāhu bá fi ròyìn Ara Rẹ̀ di orúkọ Rẹ̀ ni pé, Allāhu fi àwọn ìṣe kan ròyìn Ara Rẹ̀, tí àwọn ìṣe náà jẹ́ ìṣe tó dúró sórí fífi orúkọ ìṣe ẹ̀dá sọ orúkọ ẹ̀san ìṣe náà. Irú rẹ̀ ló ṣẹlẹ̀ nínú āyah tí à ń tọsẹ̀ rẹ̀ lọ́wọ́ yìí. Allāhu - subhānahu wa ta‘ālā - kì í ṣe olùṣeyẹ̀yẹ́ (ẹni tí ó máa ń ṣe yẹ̀yẹ́) tàbí oníyẹ̀yẹ́ (ẹni tí ẹ̀dá lè fi ṣe yẹ̀yẹ́). Ẹnì kan kò sì níí máa ṣe yẹ̀yẹ́ àfi kí ó jẹ́ aláwàdà, oníranù. Allāhu - subhānahu wa ta‘ālā - kì í ṣe àwàdà, kì í sì ṣe ìranù. Ẹ̀dá l’ó lè jẹ́ aláwàdà, oníranù. Nítorí náà, kò sí orúkọ ẹ̀san tí a lè fún ẹni tí ó bá ń fi Allāhu tàbí āyah Rẹ̀ tàbí Òjíṣẹ́ Rẹ̀ ṣe yẹ̀yẹ́ bí kò ṣe yẹ̀yẹ́. Ìyẹn ni pé, ẹ̀san yẹ̀yẹ́ ni ẹ̀san olùṣeyẹ̀yẹ́.\n Síwájú sí i, irú èyí náà ló ṣẹlẹ̀ nínú sūrah an-Nisā’ 4:142. Àwọn munāfiki ni ẹlẹ́tàn, Allāhu kì í ṣe ẹlẹ́tàn. Ẹnì kan kò níí jẹ́ ẹlẹ́tàn àfi kí ó jẹ́ òpùrọ́, olùyapa-àdéhùn. Allāhu kì í ṣe òpùrọ́. Allāhu gan-an ni Òdodo. Bákan náà, Allāhu ni Olùmú-àdéhùn-ṣẹ. Àmọ́ nígbà tí ẹ̀dá bá lérò pé òun lè tan Allāhu, Onímọ̀-ìkọ̀kọ̀-àti-gban̄gba, ohun tí ó máa jẹ́ ẹ̀san rẹ̀ lọ́dọ̀ Allāhu kò níí jẹ́ kiní kan bí kò ṣe ẹ̀dẹ. Ìyẹn ni pé, Allāhu yóò máa jẹ́ kí ẹlẹ́tàn náà lérò pé, òjé òun ń jẹ Allāhu ni àṣírí òun kò fi tú síta. Kò sì sí òjé kan kan tí ó lè jẹ Allāhu. Ohun tí ẹlẹ́tàn ń ṣe ni ó rí ní ẹ̀san. Báyìí náà ni ọ̀rọ̀ ṣe rí lórí àwọn āyah tí Allāhu ti fi “mọkr” àti “kaed” (ète) ròyìn Ara Rẹ̀ gẹ́gẹ́ bí ó ṣe wà nínú àwọn āyah wọ̀nyí: sūrah al-’A‘rọ̄f; 7:99, sūrah Yūnus; 10:21, sūrah ar-Ra‘d; 13:42, sūrah at-Tọ̄riƙ; 86:16. \n Irú èyí náà ló ṣẹlẹ̀ nínú sūrah as-Sajdah; 32:14. Ìyẹn ni pé, ìgbàgbé ni ẹ̀san ìgbàgbé, kì í ṣe pé Allāhu jẹ́ onígbàgbé (ẹni tó máa ń gbàgbé n̄ǹkan) tàbí ẹni tí ó yẹ kí ẹ̀dá gbàgbé. Ẹni tí wọ́n bá kọ́ ní ẹ̀kọ́, tí ó sì gbàgbé rẹ̀ tàbí ẹni tí inú rẹ̀ bá bu ni onígbàgbé. Allāhu mọ́, Ó sì ga tayọ ìwọ̀nyẹn. Nítorí náà, ẹni tí ó bá gbàgbé Allāhu nílé ayé ni ẹni tí ó pa Allāhu tì, tí kò sì jọ́sìn fún Un. Kí ni ó máa jẹ́ ẹ̀san rẹ̀ lọ́dọ̀ Allāhu bí kò ṣe pé kí Allāhu pa òun náà tì sínú ìyà Iná gbére. Ìyẹn ni pé, Allāhu kò níí fún un ní àǹfààní kan kan láti jáde kúrò nínú Iná. Ṣé èyí wá túmọ̀ sí pé Allāhu máa ń gbàgbé bí? Rárá o. Ṣebí ohun tí àgbẹ̀ bá gbìn sínú ilẹ̀ ló máa ká lérè oko. Gbogbo ìṣẹ̀lẹ̀ wọ̀nyí ni wọ́n ń pè ní “muṣākalah” fífi iṣẹ́ jọ ẹ̀san iṣẹ́. \n Ìdí kejì: Nínú ìdí tí a kò gbọ́dọ̀ fi sọ gbogbo ìṣe tí Allāhu bá fi ròyìn Ara Rẹ̀ di orúkọ Rẹ̀ ni pé, Allāhu fi àwọn iṣẹ́ kan ròyìn Ara Rẹ̀, tí àwọn iṣẹ́ náà jẹ́ iṣẹ́ tó dúró sórí fífi gbólóhùn “kunfayakūn” Rẹ̀ kún iṣẹ́ ọwọ́ ẹ̀dá nítorí kí iṣẹ́ náà lè di òhun. Mùsùlùmí kò sì gbọ́dọ̀ sọ irúfẹ́ iṣẹ́ náà di orúkọ Allāhu - subhānahu wa ta‘ālā -. Irú rẹ̀ ló ṣẹlẹ̀ nínú sūrah al-’Anfāl; 8:17. \n Allāhu - subhānahu wa ta‘ālā - kò fi Ọwọ́ ara Rẹ̀ jùkò. Òkò tí Ànábì Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - sì jù lu àwọn ọ̀tá lójú ogun kì í ṣe òkò tí ó lè gba ẹ̀mí lára ènìyàn. Àmọ́ òkò náà gba ẹ̀mí wọn pẹ̀lú “kunfayakūn” Allāhu. Ṣé a wá lè pe Allāhu ní òǹjùkò bí nítorí pé Ó fi iṣẹ́ òkò jíjù ròyìn Ara Rẹ̀. Rárá.\n 1. Kì í ṣe gbogbo ìṣe tí Allāhu bá fi ròyìn Ara Rẹ̀ ni ó máa di orúkọ Rẹ̀ àfi èyí tí Allāhu bá fúnra Rẹ̀ mú wá gẹ́gẹ́ bí orúkọ Rẹ̀ nítorí àwọn ìdí wọ̀nyí: \n Ìdí àkọ́kọ́: Nínú ìdí tí a kò gbọ́dọ̀ fi sọ gbogbo ìṣe tí Allāhu bá fi ròyìn Ara Rẹ̀ di orúkọ Rẹ̀ ni pé, Allāhu fi àwọn ìṣe kan ròyìn Ara Rẹ̀, tí àwọn ìṣe náà jẹ́ ìṣe tó dúró sórí fífi orúkọ ìṣe ẹ̀dá sọ orúkọ ẹ̀san ìṣe náà. Irú rẹ̀ ló ṣẹlẹ̀ nínú āyah tí à ń tọsẹ̀ rẹ̀ lọ́wọ́ yìí. Allāhu - subhānahu wa ta‘ālā - kì í ṣe olùṣeyẹ̀yẹ́ (ẹni tí ó máa ń ṣe yẹ̀yẹ́) tàbí oníyẹ̀yẹ́ (ẹni tí ẹ̀dá lè fi ṣe yẹ̀yẹ́). Ẹnì kan kò sì níí máa ṣe yẹ̀yẹ́ àfi kí ó jẹ́ aláwàdà, oníranù. Allāhu - subhānahu wa ta‘ālā - kì í ṣe àwàdà, kì í sì ṣe ìranù. Ẹ̀dá l’ó lè jẹ́ aláwàdà, oníranù. Nítorí náà, kò sí orúkọ ẹ̀san tí a lè fún ẹni tí ó bá ń fi Allāhu tàbí āyah Rẹ̀ tàbí Òjíṣẹ́ Rẹ̀ ṣe yẹ̀yẹ́ bí kò ṣe yẹ̀yẹ́. Ìyẹn ni pé, ẹ̀san yẹ̀yẹ́ ni ẹ̀san olùṣeyẹ̀yẹ́.\n Síwájú sí i, irú èyí náà ló ṣẹlẹ̀ nínú sūrah an-Nisā’ 4:142. Àwọn munāfiki ni ẹlẹ́tàn, Allāhu kì í ṣe ẹlẹ́tàn. Ẹnì kan kò níí jẹ́ ẹlẹ́tàn àfi kí ó jẹ́ òpùrọ́, olùyapa-àdéhùn. Allāhu kì í ṣe òpùrọ́. Allāhu gan-an ni Òdodo. Bákan náà, Allāhu ni Olùmú-àdéhùn-ṣẹ. Àmọ́ nígbà tí ẹ̀dá bá lérò pé òun lè tan Allāhu, Onímọ̀-ìkọ̀kọ̀-àti-gban̄gba, ohun tí ó máa jẹ́ ẹ̀san rẹ̀ lọ́dọ̀ Allāhu kò níí jẹ́ kiní kan bí kò ṣe ẹ̀dẹ. Ìyẹn ni pé, Allāhu yóò máa jẹ́ kí ẹlẹ́tàn náà lérò pé, òjé òun ń jẹ Allāhu ni àṣírí òun kò fi tú síta. Kò sì sí òjé kan kan tí ó lè jẹ Allāhu. Ohun tí ẹlẹ́tàn ń ṣe ni ó rí ní ẹ̀san. Báyìí náà ni ọ̀rọ̀ ṣe rí lórí àwọn āyah tí Allāhu ti fi “mọkr” àti “kaed” (ète) ròyìn Ara Rẹ̀ gẹ́gẹ́ bí ó ṣe wà nínú àwọn āyah wọ̀nyí: sūrah al-’A‘rọ̄f; 7:99, sūrah Yūnus; 10:21, sūrah ar-Ra‘d; 13:42, sūrah at-Tọ̄riƙ; 86:16. \n Irú èyí náà ló ṣẹlẹ̀ nínú sūrah as-Sajdah; 32:14. Ìyẹn ni pé, ìgbàgbé ni ẹ̀san ìgbàgbé, kì í ṣe pé Allāhu jẹ́ onígbàgbé (ẹni tó máa ń gbàgbé n̄ǹkan) tàbí ẹni tí ó yẹ kí ẹ̀dá gbàgbé. Ẹni tí wọ́n bá kọ́ ní ẹ̀kọ́, tí ó sì gbàgbé rẹ̀ tàbí ẹni tí inú rẹ̀ bá bu ni onígbàgbé. Allāhu mọ́, Ó sì ga tayọ ìwọ̀nyẹn. Nítorí náà, ẹni tí ó bá gbàgbé Allāhu nílé ayé ni ẹni tí ó pa Allāhu tì, tí kò sì jọ́sìn fún Un. Kí ni ó máa jẹ́ ẹ̀san rẹ̀ lọ́dọ̀ Allāhu bí kò ṣe pé kí Allāhu pa òun náà tì sínú ìyà Iná gbére. Ìyẹn ni pé, Allāhu kò níí fún un ní àǹfààní kan kan láti jáde kúrò nínú Iná. Ṣé èyí wá túmọ̀ sí pé Allāhu máa ń gbàgbé bí? Rárá o. Ṣebí ohun tí àgbẹ̀ bá gbìn sínú ilẹ̀ ló máa ká lérè oko. Gbogbo ìṣẹ̀lẹ̀ wọ̀nyí ni wọ́n ń pè ní “muṣākalah” fífi iṣẹ́ jọ ẹ̀san iṣẹ́. \n Ìdí kejì: Nínú ìdí tí a kò gbọ́dọ̀ fi sọ gbogbo ìṣe tí Allāhu bá fi ròyìn Ara Rẹ̀ di orúkọ Rẹ̀ ni pé, Allāhu fi àwọn iṣẹ́ kan ròyìn Ara Rẹ̀, tí àwọn iṣẹ́ náà jẹ́ iṣẹ́ tó dúró sórí fífi gbólóhùn “kunfayakūn” Rẹ̀ kún iṣẹ́ ọwọ́ ẹ̀dá nítorí kí iṣẹ́ náà lè di òhun. Mùsùlùmí kò sì gbọ́dọ̀ sọ irúfẹ́ iṣẹ́ náà di orúkọ Allāhu - subhānahu wa ta‘ālā -. Irú rẹ̀ ló ṣẹlẹ̀ nínú sūrah al-’Anfāl; 8:17. \n Allāhu - subhānahu wa ta‘ālā - kò fi Ọwọ́ ara Rẹ̀ jùkò. Òkò tí Ànábì Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - sì jù lu àwọn ọ̀tá lójú ogun kì í ṣe òkò tí ó lè gba ẹ̀mí lára ènìyàn. Àmọ́ òkò náà gba ẹ̀mí wọn pẹ̀lú “kunfayakūn” Allāhu. Ṣé a wá lè pe Allāhu ní òǹjùkò bí nítorí pé Ó fi iṣẹ́ òkò jíjù ròyìn Ara Rẹ̀. Rárá.","lang":"yo","meta":{"transliteration":"al-lahu yastahzi-u bihim wayamudduhum fī ṭugh'yānihim yaʿmahūna ","translations":["Allah","mocks","at them","and prolongs them","in","their transgression","they wander blindly","(15)"],"transliterationArr":["al-lahu","yastahzi-u","bihim","wayamudduhum","fī","ṭugh'yānihim","yaʿmahūna",null],"verseTiming":[[1,0,950],[2,950,2050],[3,2050,2590],[4,2590,3770],[5,3770,4170],[6,4170,5440],[7,5440,7855]]}},{"name":"2:16","price":"Àwọn wọ̀nyẹn ni àwọn tí wọ́n fi ìmọ̀nà ra ìṣìnà.¹ Nítorí náà, òkòwò wọn kò lérè, wọn kò sì jẹ́ olùmọ̀nà.","arabic":"أُوْلَٰٓئِكَ ٱلَّذِينَ ٱشۡتَرَوُاْ ٱلضَّلَٰلَةَ بِٱلۡهُدَىٰ فَمَا رَبِحَت تِّجَٰرَتُهُمۡ وَمَا كَانُواْ مُهۡتَدِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":23,"juzNumber":1,"footnotes":"1. Ọmọ ‘Abbās - kí Allāhu yọ́nú sí àwọn méjèèjì - sọ pé, “Wọ́n mú ìṣìnà, wọ́n sì fi ìmọ̀nà sílẹ̀.” Tafsīr bun Kathīr. Ọmọ ‘Abbās - kí Allāhu yọ́nú sí àwọn méjèèjì - sọ pé, “Wọ́n mú ìṣìnà, wọ́n sì fi ìmọ̀nà sílẹ̀.” Tafsīr bun Kathīr.","lang":"yo","meta":{"transliteration":"ulāika alladhīna ish'tarawū al-ḍalālata bil-hudā famā rabiḥat tijāratuhum wamā kānū muh'tadīna ","translations":["Those","(are) the ones who","bought","[the] astraying","for [the] guidance","So not","profited","their commerce","and not","were they","guided-ones","(16)"],"transliterationArr":["ulāika","alladhīna","ish'tarawū","al-ḍalālata","bil-hudā","famā","rabiḥat","tijāratuhum","wamā","kānū","muh'tadīna",null],"verseTiming":[[1,0,2440],[2,2440,3270],[3,3270,4060],[4,4060,5210],[5,5210,6040],[6,6040,6530],[7,6530,7320],[8,7320,8670],[9,8670,9120],[10,9120,9920],[11,9920,12485]]}},{"name":"2:17","price":"Àpèjúwe wọn dà bí àpèjúwe ẹni tí ó tan iná, ṣùgbọ́n nígbà tí ìmọ́lẹ̀ tàn sí àyíká rẹ̀ tán, Allāhu mú ìmọ́lẹ̀ wọn lọ, Ó sì fi wọ́n sílẹ̀ sínú àwọn òkùnkùn; wọn kò sì ríran mọ́.","arabic":"مَثَلُهُمۡ كَمَثَلِ ٱلَّذِي ٱسۡتَوۡقَدَ نَارٗا فَلَمَّآ أَضَآءَتۡ مَا حَوۡلَهُۥ ذَهَبَ ٱللَّهُ بِنُورِهِمۡ وَتَرَكَهُمۡ فِي ظُلُمَٰتٖ لَّا يُبۡصِرُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":24,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"mathaluhum kamathali alladhī is'tawqada nāran falammā aḍāat mā ḥawlahu dhahaba al-lahu binūrihim watarakahum fī ẓulumātin lā yub'ṣirūna ","translations":["Their example","(is) like (the) example","(of) the one who","kindled","a fire","then, when","it illuminated","what","(was) around him","took away","Allah","their light","and left them","in","darkness[es]","(so) not","(do) they see","(17)"],"transliterationArr":["mathaluhum","kamathali","alladhī","is'tawqada","nāran","falammā","aḍāat","mā","ḥawlahu","dhahaba","al-lahu","binūrihim","watarakahum","fī","ẓulumātin","lā","yub'ṣirūna",null],"verseTiming":[[1,0,1010],[2,1010,1820],[3,1820,2340],[4,2340,3310],[5,3310,4600],[6,4600,7400],[7,7400,9620],[8,9620,9940],[9,9940,10880],[10,10880,11410],[11,11410,12230],[12,12230,13760],[13,13760,14250],[14,14250,15070],[15,15070,16190],[16,16190,17290],[17,17290,17690],[18,17690,18770],[19,18770,19140],[20,19140,21695]]}},{"name":"2:18","price":"Adití, ayaya, afọ́jú ni wọ́n; nítorí náà wọn kò níí ṣẹ́rí padà.","arabic":"صُمُّۢ بُكۡمٌ عُمۡيٞ فَهُمۡ لَا يَرۡجِعُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":25,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"ṣummun buk'mun ʿum'yun fahum lā yarjiʿūna ","translations":["Deaf","dumb","blind","so they","not","[they] will not return","(18)"],"transliterationArr":["ṣummun","buk'mun","ʿum'yun","fahum","lā","yarjiʿūna",null],"verseTiming":[[1,0,2410],[2,2410,3160],[3,3160,4170],[4,4170,4910],[5,4910,5260],[6,5260,7725]]}},{"name":"2:19","price":"Tàbí (àpèjúwe wọn) dà bí òjò ńlá tí ń rọ̀ láti sánmọ̀. Ó mú àwọn òkùnkùn, àrá sísán àti mọ̀nàmọ́ná lọ́wọ́. Wọ́n ń fi ìka wọn sínú etí wọn nítorí àwọn iná láti ojú sánmọ̀ fún ìbẹ̀rù ikú. Allāhu sì yí àwọn aláìgbàgbọ́ ká.","arabic":"أَوۡ كَصَيِّبٖ مِّنَ ٱلسَّمَآءِ فِيهِ ظُلُمَٰتٞ وَرَعۡدٞ وَبَرۡقٞ يَجۡعَلُونَ أَصَٰبِعَهُمۡ فِيٓ ءَاذَانِهِم مِّنَ ٱلصَّوَٰعِقِ حَذَرَ ٱلۡمَوۡتِۚ وَٱللَّهُ مُحِيطُۢ بِٱلۡكَٰفِرِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":26,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"aw kaṣayyibin mina al-samāi fīhi ẓulumātun waraʿdun wabarqun yajʿalūna aṣābiʿahum fī ādhānihim mina al-ṣawāʿiqi ḥadhara al-mawti wal-lahu muḥīṭun bil-kāfirīna ","translations":["Or","like a rainstorm","from","the sky","in it (are)","darkness[es]","and thunder","and lightning","They put","their fingers","in","their ears","from","the thunderclaps","(in) fear (of)","[the] death","And Allah","(is) [the One Who] encompasses","the disbelievers","(19)"],"transliterationArr":["aw","kaṣayyibin","mina","al-samāi","fīhi","ẓulumātun","waraʿdun","wabarqun","yajʿalūna","aṣābiʿahum","fī","ādhānihim","mina","al-ṣawāʿiqi","ḥadhara","al-mawti","wal-lahu","muḥīṭun","bil-kāfirīna",null],"verseTiming":[[1,0,370],[2,370,1460],[3,1460,2540],[4,2540,4660],[5,4660,5220],[6,5220,6760],[7,6760,7510],[8,7510,9180],[9,9180,10510],[10,10510,11880],[11,11880,13579],[12,13579,14739],[13,14739,15709],[14,15709,16889],[15,16889,17389],[16,17389,19899],[17,19899,20819],[18,20819,22509],[19,22509,25384]]}},{"name":"2:20","price":"Mọ̀nàmọ́ná náà fẹ́ẹ̀ mú ìríran wọn lọ. Ìgbàkígbà tí ó bá tan ìmọ́lẹ̀ sí wọn, wọ́n á rìn lọ nínú rẹ̀. Nígbà tí ó bá sì ṣóòòkùn mọ́ wọn, wọ́n á dúró si. Àti pé tí ó bá jẹ́ pé Allāhu bá fẹ́, dájúdájú ìbá gba ìgbọ́rọ̀ wọn àti ìríran wọn. Dájúdájú Allāhu ni Alágbára lórí gbogbo n̄ǹkan.","arabic":"يَكَادُ ٱلۡبَرۡقُ يَخۡطَفُ أَبۡصَٰرَهُمۡۖ كُلَّمَآ أَضَآءَ لَهُم مَّشَوۡاْ فِيهِ وَإِذَآ أَظۡلَمَ عَلَيۡهِمۡ قَامُواْۚ وَلَوۡ شَآءَ ٱللَّهُ لَذَهَبَ بِسَمۡعِهِمۡ وَأَبۡصَٰرِهِمۡۚ إِنَّ ٱللَّهَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":27,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"yakādu al-barqu yakhṭafu abṣārahum kullamā aḍāa lahum mashaw fīhi wa-idhā aẓlama ʿalayhim qāmū walaw shāa al-lahu ladhahaba bisamʿihim wa-abṣārihim inna al-laha ʿalā kulli shayin qadīrun ","translations":["Almost","the lightning","snatches away","their sight","Whenever","it flashes","for them","they walk","in it","and when","it darkens","on them","they stand (still)","And if","had willed","Allah","He would certainly have taken away","their hearing","and their sight","Indeed","Allah","(is) on","every","thing","All-Powerful","(20)"],"transliterationArr":["yakādu","al-barqu","yakhṭafu","abṣārahum","kullamā","aḍāa","lahum","mashaw","fīhi","wa-idhā","aẓlama","ʿalayhim","qāmū","walaw","shāa","al-lahu","ladhahaba","bisamʿihim","wa-abṣārihim","inna","al-laha","ʿalā","kulli","shayin","qadīrun",null],"verseTiming":[[1,0,920],[2,920,1640],[3,1640,2400],[4,2400,4140],[5,4140,6370],[6,6370,8590],[7,8590,9110],[8,9110,10280],[9,10280,10920],[10,10920,13030],[11,13030,13750],[12,13750,14710],[13,14710,15570],[14,15570,16470],[15,16470,18340],[16,18340,19180],[17,19180,19880],[18,19880,21140],[19,21140,23000],[20,23000,24110],[21,24110,24940],[22,24940,25560],[23,25560,26200],[24,26200,28050],[25,28050,30375]]}},{"name":"2:21","price":"Ẹ̀yin ènìyàn, ẹ jọ́sìn fún Olúwa yín, Ẹni tí Ó dá ẹ̀yin àti àwọn tó ṣíwájú yín, nítorí kí ẹ lè ṣọ́ra (fún ìyà Iná).¹","arabic":"يَٰٓأَيُّهَا ٱلنَّاسُ ٱعۡبُدُواْ رَبَّكُمُ ٱلَّذِي خَلَقَكُمۡ وَٱلَّذِينَ مِن قَبۡلِكُمۡ لَعَلَّكُمۡ تَتَّقُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":28,"juzNumber":1,"footnotes":"1. Kalmọh “لَعَلَّ” “la‘alla” ní ìtúmọ̀ mẹ́ta. Ìrètí, nítorí àti ìgbájúmọ́. (Ƙurtubiy) Ìyẹn túmọ̀ sí pé, ﴿ لَعَلَّكُمْ تَتَّقُونَ ﴾ máa túmọ̀ sí (1) Bí ẹ bá ń jọ́sìn fún Allāhu, ìrètí wà fún yín pé ẹ máa di olùbẹ̀rù Rẹ̀. (2) Nítorí kí ẹ lè ṣọ́ra fún Iná, ẹ máa jọ́sìn fún Allāhu. Ìyẹn ni pé, kò sí ọ̀nà mìíràn láti fi ṣọ́ra fún Iná bí kò ṣe jíjọ́sìn fún Allāhu. (3) Ẹ gbájúmọ́ ìbẹ̀rù Allāhu nípasẹ̀ àṣẹ t'Ó pa yín pé kí ẹ máa jọ́sìn fún Un.","lang":"yo","meta":{"transliteration":"yāayyuhā al-nāsu uʿ'budū rabbakumu alladhī khalaqakum wa-alladhīna min qablikum laʿallakum tattaqūna ","translations":["O","mankind","worship","your Lord","the One Who","created you","and those","from","before you","so that you may","become righteous","(21)"],"transliterationArr":["yāayyuhā","al-nāsu","uʿ'budū","rabbakumu","alladhī","khalaqakum","wa-alladhīna","min","qablikum","laʿallakum","tattaqūna",null],"verseTiming":[[1,0,2780],[2,2780,3980],[3,3980,4670],[4,4670,5480],[5,5480,6200],[6,6200,7180],[7,7180,8180],[8,8180,9100],[9,9100,9950],[10,9950,11030],[11,11030,13415]]}},{"name":"2:22","price":"(Ẹ jọ́sìn fún) Ẹni tí Ó ṣe ilẹ̀ fún yín ní ìtẹ́, (Ó ṣe) sánmọ̀ ní àjà (le yín lórí), Ó sọ omi kalẹ̀ láti sánmọ̀ (fún yín), Ó sì fi mú àwọn èso jáde ní ìjẹ-ìmu fún yín. Nítorí náà, ẹ má ṣe bá Allāhu wá akẹgbẹ́, ẹ sì mọ̀ (pé kò ní akẹgbẹ́).","arabic":"ٱلَّذِي جَعَلَ لَكُمُ ٱلۡأَرۡضَ فِرَٰشٗا وَٱلسَّمَآءَ بِنَآءٗ وَأَنزَلَ مِنَ ٱلسَّمَآءِ مَآءٗ فَأَخۡرَجَ بِهِۦ مِنَ ٱلثَّمَرَٰتِ رِزۡقٗا لَّكُمۡۖ فَلَا تَجۡعَلُواْ لِلَّهِ أَندَادٗا وَأَنتُمۡ تَعۡلَمُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":29,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"alladhī jaʿala lakumu al-arḍa firāshan wal-samāa bināan wa-anzala mina al-samāi māan fa-akhraja bihi mina al-thamarāti riz'qan lakum falā tajʿalū lillahi andādan wa-antum taʿlamūna ","translations":["The One Who","made","for you","the earth","a resting place","and the sky","a canopy","and sent down","from","the sky","water","then brought forth","therewith","[of]","the fruits","(as) provision","for you","So (do) not","set up","to Allah","rivals","while you","[you] know","(22)"],"transliterationArr":["alladhī","jaʿala","lakumu","al-arḍa","firāshan","wal-samāa","bināan","wa-anzala","mina","al-samāi","māan","fa-akhraja","bihi","mina","al-thamarāti","riz'qan","lakum","falā","tajʿalū","lillahi","andādan","wa-antum","taʿlamūna",null],"verseTiming":[[1,0,960],[2,960,1530],[3,1530,1960],[4,1960,2700],[5,2700,3460],[6,3460,6410],[7,6410,8760],[8,8760,11110],[9,11110,13360],[10,13360,13640],[11,13640,15720],[12,15720,18139],[13,18139,19059],[14,19059,19599],[15,19599,19939],[16,19939,21079],[17,21079,21689],[18,21689,22749],[19,22749,23279],[20,23279,24159],[21,24159,25049],[22,25049,26739],[23,26739,28619],[24,28619,30974]]}},{"name":"2:23","price":"Tí ẹ bá wà nínú iyèméjì nípa ohun tí A sọ̀kalẹ̀ fún ẹrúsìn Wa, nítorí náà, ẹ mú sūrah kan wá bí irú rẹ̀, kí ẹ sì pe àwọn ẹlẹ́rìí yín, yàtọ̀ sí Allāhu, tí ẹ bá jẹ́ olódodo.","arabic":"وَإِن كُنتُمۡ فِي رَيۡبٖ مِّمَّا نَزَّلۡنَا عَلَىٰ عَبۡدِنَا فَأۡتُواْ بِسُورَةٖ مِّن مِّثۡلِهِۦ وَٱدۡعُواْ شُهَدَآءَكُم مِّن دُونِ ٱللَّهِ إِن كُنتُمۡ صَٰدِقِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":30,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"wa-in kuntum fī raybin mimmā nazzalnā ʿalā ʿabdinā fatū bisūratin min mith'lihi wa-id'ʿū shuhadāakum min dūni al-lahi in kuntum ṣādiqīna ","translations":["And if","you are","in","doubt","about what","We have revealed","to","Our slave","then produce","a chapter","[of]","like it","and call","your witnesses","from","other than","Allah","if","you are","truthful","(23)"],"transliterationArr":["wa-in","kuntum","fī","raybin","mimmā","nazzalnā","ʿalā","ʿabdinā","fatū","bisūratin","min","mith'lihi","wa-id'ʿū","shuhadāakum","min","dūni","al-lahi","in","kuntum","ṣādiqīna",null],"verseTiming":[[1,0,1120],[2,1120,2430],[3,2430,2740],[4,2740,3410],[5,3410,5100],[6,5100,6170],[7,6170,6650],[8,6650,7570],[9,7570,8320],[10,8320,9590],[11,9590,10290],[12,10290,11320],[13,11320,12120],[14,12120,13490],[15,13490,14170],[16,14170,16700],[17,16700,18030],[18,18030,18570],[19,18570,19360],[20,19360,20130],[21,20130,21290],[22,21290,23745]]}},{"name":"2:24","price":"Tí ẹ kò bá sì ṣe bẹ́ẹ̀, ẹ kò wulẹ̀ lè ṣe bẹ́ẹ̀, nítorí náà, ẹ ṣọ́ra fún Iná, èyí tí ìkoná rẹ̀ jẹ́ àwọn ènìyàn àti òkúta tí wọ́n pa lésè sílẹ̀ de àwọn aláìgbàgbọ́.","arabic":"فَإِن لَّمۡ تَفۡعَلُواْ وَلَن تَفۡعَلُواْ فَٱتَّقُواْ ٱلنَّارَ ٱلَّتِي وَقُودُهَا ٱلنَّاسُ وَٱلۡحِجَارَةُۖ أُعِدَّتۡ لِلۡكَٰفِرِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":31,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"fa-in lam tafʿalū walan tafʿalū fa-ittaqū al-nāra allatī waqūduhā al-nāsu wal-ḥijāratu uʿiddat lil'kāfirīna ","translations":["But if","not","you do","and never","will you do","then fear","the Fire","whose","[its] fuel","(is) [the] men","and [the] stones","prepared","for the disbelievers","(24)"],"transliterationArr":["fa-in","lam","tafʿalū","walan","tafʿalū","fa-ittaqū","al-nāra","allatī","waqūduhā","al-nāsu","wal-ḥijāratu","uʿiddat","lil'kāfirīna",null],"verseTiming":[[1,0,450],[2,450,1000],[3,1000,2010],[4,2010,3250],[5,3250,4220],[6,4220,4980],[7,4980,6220],[8,6220,7000],[9,7000,7920],[10,7920,9380],[11,9380,11020],[12,11020,11960],[13,11960,14795]]}},{"name":"2:25","price":"Fún àwọn tó gbàgbọ́ ní òdodo, tí wọ́n sì ṣe àwọn iṣẹ́ rere ní ìró ìdùnnú pé, dájúdájú àwọn Ọgbà Ìdẹ̀ra kan ń bẹ fún wọn, èyí tí àwọn odò ń ṣàn ní ìsàlẹ̀ rẹ̀. Ìgbàkígbà tí A bá p’èsè jíjẹ-mímu kan fún wọn nínú èso rẹ̀, wọn yóò sọ pé: “Èyí ni wọ́n ti pèsè fún wa tẹ́lẹ̀tẹ́lẹ̀.” - Wọ́n mú un wá fún wọn ní ìrísí kan náà ni (àmọ́ pẹ̀lú adùn ọ̀tọ̀ọ̀tọ̀). - Àwọn ìyàwó mímọ́ sì ń bẹ fún wọn nínú Ọgbà Ìdẹ̀ra. Olùṣegbére sì ni wọ́n nínú rẹ̀.","arabic":"وَبَشِّرِ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ أَنَّ لَهُمۡ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُۖ كُلَّمَا رُزِقُواْ مِنۡهَا مِن ثَمَرَةٖ رِّزۡقٗا قَالُواْ هَٰذَا ٱلَّذِي رُزِقۡنَا مِن قَبۡلُۖ وَأُتُواْ بِهِۦ مُتَشَٰبِهٗاۖ وَلَهُمۡ فِيهَآ أَزۡوَٰجٞ مُّطَهَّرَةٞۖ وَهُمۡ فِيهَا خَٰلِدُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":32,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"wabashiri alladhīna āmanū waʿamilū al-ṣāliḥāti anna lahum jannātin tajrī min taḥtihā al-anhāru kullamā ruziqū min'hā min thamaratin riz'qan qālū hādhā alladhī ruziq'nā min qablu wa-utū bihi mutashābihan walahum fīhā azwājun muṭahharatun wahum fīhā khālidūna ","translations":["And give good news","(to) those who","believe","and do","[the] righteous deeds","that","for them","(will be) Gardens","flow","[from]","under them","the rivers","Every time","they are provided","therefrom","of","fruit","(as) provision","they (will) say","This (is)","the one which","we were provided","from","before","And they will be given","therefrom","(things) in resemblance","And for them","therein","spouses","purified","and they","therein","(will) abide forever","(25)"],"transliterationArr":["wabashiri","alladhīna","āmanū","waʿamilū","al-ṣāliḥāti","anna","lahum","jannātin","tajrī","min","taḥtihā","al-anhāru","kullamā","ruziqū","min'hā","min","thamaratin","riz'qan","qālū","hādhā","alladhī","ruziq'nā","min","qablu","wa-utū","bihi","mutashābihan","walahum","fīhā","azwājun","muṭahharatun","wahum","fīhā","khālidūna",null],"verseTiming":[[1,0,1100],[2,1100,1850],[3,1850,2860],[4,2860,3480],[5,3480,4810],[6,4810,5730],[7,5730,6330],[8,6330,8220],[9,8220,9420],[10,9420,10320],[11,10320,11010],[12,11010,13790],[13,13790,14630],[14,14630,15380],[15,15380,16130],[16,16130,17140],[17,17140,17940],[18,17940,19330],[19,19330,20190],[20,20190,20660],[21,20660,21410],[22,21410,22340],[23,22340,23440],[24,23440,23950],[25,23950,24650],[26,24650,25220],[27,25220,27060],[28,27060,27740],[29,27740,30190],[30,30190,31150],[31,31150,33850],[32,33850,34470],[33,34470,35310],[34,35310,38225]]}},{"name":"2:26","price":"Dájúdájú Allāhu kò níí tijú láti fí ohun kan (tí ó mọ) bí ẹ̀fọn tàbí ohun tí ó jù ú lọ ṣàkàwé ọ̀rọ̀. Ní ti àwọn tó gbàgbọ́ ní òdodo, wọn yóò mọ̀ pé dájúdájú òdodo ni láti ọ̀dọ̀ Olúwa wọn. Ní ti àwọn tó ṣàì gbàgbọ́, wọn yóò wí pé: “Kí ni ohun tí Allāhu gbàlérò pẹ̀lú àkàwé yìí?” Allāhu ń fi ṣi ọ̀pọ̀lọ́pọ̀ lọ́nà. Ó sì ń fi tọ́ ọ̀pọ̀lọ́pọ̀ sọ́nà. Kò sì níí fi ṣi ẹnikẹ́ni lọ́nà àyàfi àwọn arúfin.¹","arabic":"۞ إِنَّ ٱللَّهَ لَا يَسۡتَحۡيِۦٓ أَن يَضۡرِبَ مَثَلٗا مَّا بَعُوضَةٗ فَمَا فَوۡقَهَاۚ فَأَمَّا ٱلَّذِينَ ءَامَنُواْ فَيَعۡلَمُونَ أَنَّهُ ٱلۡحَقُّ مِن رَّبِّهِمۡۖ وَأَمَّا ٱلَّذِينَ كَفَرُواْ فَيَقُولُونَ مَاذَآ أَرَادَ ٱللَّهُ بِهَٰذَا مَثَلٗاۘ يُضِلُّ بِهِۦ كَثِيرٗا وَيَهۡدِي بِهِۦ كَثِيرٗاۚ وَمَا يُضِلُّ بِهِۦٓ إِلَّا ٱلۡفَٰسِقِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":33,"juzNumber":1,"footnotes":"1. Ìtúmọ̀ “fāsiƙ” ni ẹni tí ó jáde kúrò lábẹ́ àṣẹ Allāhu àti Òjíṣẹ́ Rẹ̀ - kí ìkẹ́ àti ọlà Allāhu máa bá a -; ẹni tí ó gbé àṣẹ Allāhu àti Òjíṣẹ́ Rẹ̀ jù sílẹ̀.","lang":"yo","meta":{"transliteration":"inna al-laha lā yastaḥyī an yaḍriba mathalan mā baʿūḍatan famā fawqahā fa-ammā alladhīna āmanū fayaʿlamūna annahu al-ḥaqu min rabbihim wa-ammā alladhīna kafarū fayaqūlūna mādhā arāda al-lahu bihādhā mathalan yuḍillu bihi kathīran wayahdī bihi kathīran wamā yuḍillu bihi illā al-fāsiqīna ","translations":["Indeed","Allah","(is) not","ashamed","to","set forth","an example","(like) even","(of) a mosquito","and (even) something","above it","Then as for","those who","believed","[thus] they will know","that it","(is) the truth","from","their Lord","And as for","those who","disbelieved","[thus] they will say","what","(did) intend","Allah","by this","example","He lets go astray","by it","many","and He guides","by it","many","And not","He lets go astray","by it","except","the defiantly disobedient","(26)"],"transliterationArr":["inna","al-laha","lā","yastaḥyī","an","yaḍriba","mathalan","mā","baʿūḍatan","famā","fawqahā","fa-ammā","alladhīna","āmanū","fayaʿlamūna","annahu","al-ḥaqu","min","rabbihim","wa-ammā","alladhīna","kafarū","fayaqūlūna","mādhā","arāda","al-lahu","bihādhā","mathalan","yuḍillu","bihi","kathīran","wayahdī","bihi","kathīran","wamā","yuḍillu","bihi","illā","al-fāsiqīna",null],"verseTiming":[[1,0,1460],[2,1460,2340],[3,2340,2650],[4,2650,5390],[5,5390,5650],[6,5650,6890],[7,6890,7500],[8,7500,8510],[9,8510,10390],[10,10390,10890],[11,10890,11910],[12,11910,13580],[13,13580,14470],[14,14470,15370],[15,15370,16650],[16,16650,17980],[17,17980,18770],[18,18770,18900],[19,18900,20490],[20,20490,21830],[21,21830,22760],[22,22760,23490],[23,23490,24840],[24,24840,26990],[25,26990,27710],[26,27710,28460],[27,28460,29400],[28,29400,30650],[29,30650,31370],[30,31370,31910],[31,31910,32780],[32,32780,34350],[33,34350,34860],[34,34860,36360],[35,36360,36870],[36,36870,37660],[37,37660,39710],[38,39710,40250],[39,40250,43055]]}},{"name":"2:27","price":"(Àwọn arúfin náà ni) àwọn tó ń yẹ májẹ̀mu Allāhu lẹ́yìn tí májẹ̀mu náà ti fìdí múlẹ̀, wọ́n tún ń já ohun tí Allāhu pa láṣẹ pé kí wọ́n dàpọ̀, wọ́n sì ń ṣe ìbàjẹ́ lórí ilẹ̀, àwọn wọ̀nyẹn gan-an ni ẹni òfò.","arabic":"ٱلَّذِينَ يَنقُضُونَ عَهۡدَ ٱللَّهِ مِنۢ بَعۡدِ مِيثَٰقِهِۦ وَيَقۡطَعُونَ مَآ أَمَرَ ٱللَّهُ بِهِۦٓ أَن يُوصَلَ وَيُفۡسِدُونَ فِي ٱلۡأَرۡضِۚ أُوْلَٰٓئِكَ هُمُ ٱلۡخَٰسِرُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":34,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"alladhīna yanquḍūna ʿahda al-lahi min baʿdi mīthāqihi wayaqṭaʿūna mā amara al-lahu bihi an yūṣala wayuf'sidūna fī al-arḍi ulāika humu al-khāsirūna ","translations":["Those who","break","(the) Covenant","(of) Allah","from","after","its ratification","and [they] cut","what","has ordered","Allah","it","to","be joined","and [they] spread corruption","in","the earth","Those","they","(are) the losers","(27)"],"transliterationArr":["alladhīna","yanquḍūna","ʿahda","al-lahi","min","baʿdi","mīthāqihi","wayaqṭaʿūna","mā","amara","al-lahu","bihi","an","yūṣala","wayuf'sidūna","fī","al-arḍi","ulāika","humu","al-khāsirūna",null],"verseTiming":[[1,0,1110],[2,1110,2890],[3,2890,3510],[4,3510,4260],[5,4260,5220],[6,5220,5810],[7,5810,7040],[8,7040,8470],[9,8470,10210],[10,10210,10750],[11,10750,11500],[12,11500,13440],[13,13440,13750],[14,13750,15040],[15,15040,16250],[16,16250,16470],[17,16470,17270],[18,17270,20150],[19,20150,20470],[20,20470,23395]]}},{"name":"2:28","price":"Báwo ni ẹ ṣe ń ṣàì gbàgbọ́ nínú Allāhu ná! Bẹ́ẹ̀ sì ni òkú ni yín (tẹ́lẹ̀), Ó sì sọ yín di alààyè. Lẹ́yìn náà, Ó máa sọ yín di òkú. Lẹ́yìn náà, Ó máa sọ yín di alààyè. Lẹ́yìn náà, ọ̀dọ̀ Rẹ̀ ni wọn yóò da yín padà sí.¹","arabic":"كَيۡفَ تَكۡفُرُونَ بِٱللَّهِ وَكُنتُمۡ أَمۡوَٰتٗا فَأَحۡيَٰكُمۡۖ ثُمَّ يُمِيتُكُمۡ ثُمَّ يُحۡيِيكُمۡ ثُمَّ إِلَيۡهِ تُرۡجَعُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":35,"juzNumber":1,"footnotes":"1. Ẹ wo ìtọsẹ̀-ọ̀rọ̀ sūrah Gọ̄fir; 40:11.","lang":"yo","meta":{"transliteration":"kayfa takfurūna bil-lahi wakuntum amwātan fa-aḥyākum thumma yumītukum thumma yuḥ'yīkum thumma ilayhi tur'jaʿūna ","translations":["How","(can) you disbelieve","in Allah","While you were","dead","then He gave you life","then","He will cause you to die","then","He will give you life","then","to Him","you will be returned","(28)"],"transliterationArr":["kayfa","takfurūna","bil-lahi","wakuntum","amwātan","fa-aḥyākum","thumma","yumītukum","thumma","yuḥ'yīkum","thumma","ilayhi","tur'jaʿūna",null],"verseTiming":[[1,0,660],[2,660,1790],[3,1790,2670],[4,2670,4380],[5,4380,6190],[6,6190,7540],[7,7540,9190],[8,9190,10440],[9,10440,11590],[10,11590,12740],[11,12740,14060],[12,14060,14960],[13,14960,17895]]}},{"name":"2:29","price":"Òun ni Ẹni tí Ó dá ohunkóhun tó wà lórí ilẹ̀ fún yín pátápátá. Lẹ́yìn náà, Ó wà l’ókè sánmọ̀, Ó sì ṣe wọ́n tógún régé sí sánmọ̀ méje. Òun sì ni Onímọ̀ nípa gbogbo n̄ǹkan.¹","arabic":"هُوَ ٱلَّذِي خَلَقَ لَكُم مَّا فِي ٱلۡأَرۡضِ جَمِيعٗا ثُمَّ ٱسۡتَوَىٰٓ إِلَى ٱلسَّمَآءِ فَسَوَّىٰهُنَّ سَبۡعَ سَمَٰوَٰتٖۚ وَهُوَ بِكُلِّ شَيۡءٍ عَلِيمٞ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":36,"juzNumber":1,"footnotes":"1. Àwọn kan wí pé, “Sūrah al-Baƙọrah; 2:29 tako sūrah an-Nāzi‘āt; 79:27-30 nítorí pé, ìkíní ń sọ pé ilẹ̀ ni Allāhu kọ́kọ́ dá ṣíwájú sánmọ̀, ìkejì sì ń sọ pé sánmọ̀ ni Allāhu kọ́kọ́ dá ṣíwájú ilẹ̀!” \n Èsì: Èyí jẹ́ “ìtakora tófẹ́jọbẹ́ẹ̀”, kì í ṣe “ìtakora tóríbẹ́ẹ̀”. Àlàyé rẹ̀ nìyí, ìṣẹ̀dá ilẹ̀ ṣíwájú ìṣẹ̀dá sánmọ̀ gẹ́gẹ́ bí āyah tinú sūrah Baƙọrah yẹn ṣe fi rinlẹ̀. Àmọ́ kì í ṣe ọ̀rọ̀ nípa ìṣẹ̀dá ilẹ̀ ni āyah sūrah an-Nāzi‘āt ń sọ̀rọ̀ nípa rẹ̀. Allāhu - subhānahu wa ta‘ālā - kò sì lo ọ̀rọ̀ tó túmọ̀ sí ìṣẹ̀dá ilẹ̀ nínú āyah t’Ó ti dárúkọ ilẹ̀, ìyẹn āyah 30 nínú sūrah an-Nāzi‘āt. Kalmọh “dahāhā” ni Allāhu lò níbẹ̀ fún ilẹ̀. Ìtúmọ̀ “dahāhā” sì ni pé “Ó tẹ́ ilẹ̀ pẹrẹsẹ”. Ẹ tún wo sūrah al-Hijr; 15:19. Àlàyé tí àwọn onímọ̀ ’Islām mú wá nípa èyí ni pé, ìṣẹ̀dá ilẹ̀ wáyé fún ọjọ́ méjì. Lẹ́yìn náà, ìṣẹ̀dá gbogbo ohun tó máa wà nínú ilẹ̀ ní àwọn igi, àwọn ibúdò, àwọn àpáta, àwọn àlùmọ́nì ilẹ̀, àwọn oúnjẹ ènìyàn, àwọn oúnjẹ àlùjànnú àti àwọn oúnjẹ gbogbo abẹ̀mí wáyé fún ọjọ́ méjì. \n Lẹ́yìn náà, ìṣẹ̀dá sánmọ̀ pẹ̀lú àwọn ẹrù inú rẹ̀ ní àwọn ìràwọ̀, òṣùpá, òòrùn àti òjò wáyé fún ọjọ́ méjì. Àpapọ̀ gbogbo ọjọ́ ìṣẹ̀dá wọ̀nyí jẹ́ ọjọ́ mẹ́fà. Àmọ́, ilẹ̀ tòhun ti àwọn ẹrù inú rẹ̀ sì wà roboto títí Allāhu fi parí ìṣẹ̀dá sánmọ̀. Sísọ ilẹ̀ roboto di ilẹ̀ pẹrẹsẹ wá ṣẹlẹ̀ lẹ́yìn ìṣẹ̀dá sánmọ̀. Ohun tí ó sì fa èyí ni pé, ilẹ̀ bùkátà sí ìmọ́lẹ̀ òṣùpá àti ìmọ́lẹ̀ òòrùn nítorí kí àwọn ohun gbogbo tí Allāhu ti ṣẹ̀dá sínú ilẹ̀ lè máa gbèrú sí i. Báyìí ni Allāhu ṣe tẹ́ ilẹ̀ pẹrẹsẹ fún òṣùpá, ìràwọ̀ àti òòrùn nítorí kí wọ́n lè rí iṣẹ́ ṣe lára ilẹ̀, Ó sì fi àwọn àpáta inú ilẹ̀ ṣe èṣó t’Ó fi kan ilẹ̀ nítorí kí àwọn ibúdò má lè yí ilẹ̀ dànù. Nítorí náà, Allāhu ti parí ìṣẹ̀dá ilẹ̀ àti ohun inú rẹ̀ ṣíwájú ìṣẹ̀dá sánmọ̀. Àmọ́ Ó sọ ilẹ̀ roboto di ilẹ̀ pẹrẹsẹ lẹ́yìn ìṣẹ̀dá sánmọ̀. Kì í ṣe pé Ó ṣẹ̀dá ilẹ̀ lẹ́yìn sánmọ̀. Nítorí náà, kò sí ìtakora tóríbẹ́ẹ̀ nínú àwọn āyah náà. W-Allāhu ’a‘lam.","lang":"yo","meta":{"transliteration":"huwa alladhī khalaqa lakum mā fī al-arḍi jamīʿan thumma is'tawā ilā al-samāi fasawwāhunna sabʿa samāwātin wahuwa bikulli shayin ʿalīmun ","translations":["He","(is) the One Who","created","for you","what","(is) in","the earth","all","Moreover","He turned","to","the heaven","and fashioned them","seven","heavens","And He","of every","thing","(is) All-Knowing","(29)"],"transliterationArr":["huwa","alladhī","khalaqa","lakum","mā","fī","al-arḍi","jamīʿan","thumma","is'tawā","ilā","al-samāi","fasawwāhunna","sabʿa","samāwātin","wahuwa","bikulli","shayin","ʿalīmun",null],"verseTiming":[[1,0,380],[2,380,1110],[3,1110,1750],[4,1750,2430],[5,2430,3330],[6,3330,3610],[7,3610,4350],[8,4350,5950],[9,5950,7090],[10,7090,9599],[11,9599,9959],[12,9959,12409],[13,12409,14449],[14,14449,14999],[15,14999,17569],[16,17569,18029],[17,18029,18809],[18,18809,19539],[19,19539,21634]]}},{"name":"2:30","price":"(Rántí) nígbà tí Olúwa rẹ sọ fún àwọn mọlāika pé: “Dájúdájú Èmi yóò fi àrólé kan sórí ilẹ̀.”¹ Wọ́n sọ pé: “Ṣé Ìwọ yóò fi ẹni tí ó máa ṣèbàjẹ́ síbẹ̀, tí ó sì máa ta ẹ̀jẹ̀ sílẹ̀? Àwa sì ń ṣe àfọ̀mọ́ àti ẹyìn fún Ọ. A óò máa ṣe àfọ̀mọ́ fún Ọ sẹ́!” Ó sọ pé: “Dájúdájú Èmi mọ ohun tí ẹ̀yin kò mọ̀.”","arabic":"وَإِذۡ قَالَ رَبُّكَ لِلۡمَلَٰٓئِكَةِ إِنِّي جَاعِلٞ فِي ٱلۡأَرۡضِ خَلِيفَةٗۖ قَالُوٓاْ أَتَجۡعَلُ فِيهَا مَن يُفۡسِدُ فِيهَا وَيَسۡفِكُ ٱلدِّمَآءَ وَنَحۡنُ نُسَبِّحُ بِحَمۡدِكَ وَنُقَدِّسُ لَكَۖ قَالَ إِنِّيٓ أَعۡلَمُ مَا لَا تَعۡلَمُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":37,"juzNumber":1,"footnotes":"1. Ànábì Ādam - kí ọlà Allāhu máa bá a - jẹ́ àrólé nítorí pé, ó jẹ́ ẹ̀dá tí yóò máa bímọ, tí àwọn ọmọ rẹ̀ náà yóò máa bímọ àti bẹ́ẹ̀ bẹ́ẹ̀ lọ. Àwọn mọlāika kò sì lè jẹ́ àrólé nítorí pé, bíbí ọmọ kò sí nínú ìṣẹ̀dá tiwọn.","lang":"yo","meta":{"transliteration":"wa-idh qāla rabbuka lil'malāikati innī jāʿilun fī al-arḍi khalīfatan qālū atajʿalu fīhā man yuf'sidu fīhā wayasfiku al-dimāa wanaḥnu nusabbiḥu biḥamdika wanuqaddisu laka qāla innī aʿlamu mā lā taʿlamūna ","translations":["And when","said","your Lord","to the angels","Indeed, I (am)","going to place","in","the earth","a vicegerent","they said","Will You place","in it","(one) who","will spread corruption","in it","and will shed","[the] blood[s]","while we","[we] glorify (You)","with Your praises","and we sanctify","[to] You","He said","Indeed, I","[I] know","what","not","you know","(30)"],"transliterationArr":["wa-idh","qāla","rabbuka","lil'malāikati","innī","jāʿilun","fī","al-arḍi","khalīfatan","qālū","atajʿalu","fīhā","man","yuf'sidu","fīhā","wayasfiku","al-dimāa","wanaḥnu","nusabbiḥu","biḥamdika","wanuqaddisu","laka","qāla","innī","aʿlamu","mā","lā","taʿlamūna",null],"verseTiming":[[1,0,640],[2,640,1270],[3,1270,1970],[4,1970,4710],[5,4710,5860],[6,5860,7050],[7,7050,7690],[8,7690,8420],[9,8420,9820],[10,9820,12060],[11,12060,12980],[12,12980,13760],[13,13760,13940],[14,13940,14850],[15,14850,15490],[16,15490,16200],[17,16200,17150],[18,17150,19260],[19,19260,19910],[20,19910,20840],[21,20840,21770],[22,21770,22900],[23,22900,23090],[24,23090,24220],[25,24220,26620],[26,26620,27420],[27,27420,27810],[28,27810,28120],[29,28120,30475]]}},{"name":"2:31","price":"Allāhu fi gbogbo àwọn orúkọ náà mọ Ādam. Lẹ́yìn náà, Ó kó wọn síwájú àwọn mọlāika, Ó sì sọ pé: “Ẹ sọ \n àwọn orúkọ ìwọ̀nyí fún Mi, tí ẹ bá jẹ́ olódodo.”","arabic":"وَعَلَّمَ ءَادَمَ ٱلۡأَسۡمَآءَ كُلَّهَا ثُمَّ عَرَضَهُمۡ عَلَى ٱلۡمَلَٰٓئِكَةِ فَقَالَ أَنۢبِـُٔونِي بِأَسۡمَآءِ هَٰٓؤُلَآءِ إِن كُنتُمۡ صَٰدِقِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":38,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"waʿallama ādama al-asmāa kullahā thumma ʿaraḍahum ʿalā al-malāikati faqāla anbiūnī bi-asmāi hāulāi in kuntum ṣādiqīna ","translations":["And He taught","Adam","the names ","all of them","Then","He displayed them","to","the angels","then He said","Inform Me","of (the) names","(of) these","if","you are","truthful","(31)"],"transliterationArr":["waʿallama","ādama","al-asmāa","kullahā","thumma","ʿaraḍahum","ʿalā","al-malāikati","faqāla","anbiūnī","bi-asmāi","hāulāi","in","kuntum","ṣādiqīna",null],"verseTiming":[[1,0,1120],[2,1120,1790],[3,1790,4090],[4,4090,5040],[5,5040,5950],[6,5950,6890],[7,6890,7270],[8,7270,9580],[9,9580,10400],[10,10400,12830],[11,12830,13650],[12,13650,15780],[13,15780,18280],[14,18280,22680],[15,22680,23480],[16,23480,24780],[17,24780,27145]]}},{"name":"2:32","price":"Wọ́n sọ pé: “Mímọ́ ni fún Ọ, kò sí ìmọ̀ kan fún wa àyàfi ohun tí O fi mọ̀ wá. Dájúdájú Ìwọ, Ìwọ ni Onímọ̀, Ọlọ́gbọ́n.”","arabic":"قَالُواْ سُبۡحَٰنَكَ لَا عِلۡمَ لَنَآ إِلَّا مَا عَلَّمۡتَنَآۖ إِنَّكَ أَنتَ ٱلۡعَلِيمُ ٱلۡحَكِيمُ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":39,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"qālū sub'ḥānaka lā ʿil'ma lanā illā mā ʿallamtanā innaka anta al-ʿalīmu al-ḥakīmu ","translations":["They said","Glory be to You","No","knowledge","(is) for us","except","what","You have taught us","Indeed You","You","(are) the All-Knowing","the All-Wise","(32)"],"transliterationArr":["qālū","sub'ḥānaka","lā","ʿil'ma","lanā","illā","mā","ʿallamtanā","innaka","anta","al-ʿalīmu","al-ḥakīmu",null],"verseTiming":[[1,0,810],[2,810,2060],[3,2060,2390],[4,2390,2910],[5,2910,4990],[6,4990,5770],[7,5770,6110],[8,6110,7570],[9,7570,9300],[10,9300,10360],[11,10360,11310],[12,11310,14115]]}},{"name":"2:33","price":"Ó sọ pé: “Ādam, sọ orúkọ wọn fún wọn.” Nígbà tí ó sọ orúkọ wọn fún wọn tán, Ó sọ pé: “Ṣé Èmi kò sọ fún yín pé dájúdájú Èmi nímọ̀ ìkọ̀kọ̀ àwọn sánmọ̀ àti ilẹ̀, Mo sì nímọ̀ ohun tí ẹ̀ ń ṣe àfihàn rẹ̀ àti ohun tí ẹ̀ ń fi pamọ́?”","arabic":"قَالَ يَٰٓـَٔادَمُ أَنۢبِئۡهُم بِأَسۡمَآئِهِمۡۖ فَلَمَّآ أَنۢبَأَهُم بِأَسۡمَآئِهِمۡ قَالَ أَلَمۡ أَقُل لَّكُمۡ إِنِّيٓ أَعۡلَمُ غَيۡبَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَأَعۡلَمُ مَا تُبۡدُونَ وَمَا كُنتُمۡ تَكۡتُمُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":40,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"qāla yāādamu anbi'hum bi-asmāihim falammā anba-ahum bi-asmāihim qāla alam aqul lakum innī aʿlamu ghayba al-samāwāti wal-arḍi wa-aʿlamu mā tub'dūna wamā kuntum taktumūna ","translations":["He said","O Adam","Inform them","of their names","And when","he had informed them","of their names","He said","Did not","I say","to you","Indeed, I","[I] know","(the) unseen","(of) the heavens","and the earth","and I know","what","you reveal","and what","you [were]","conceal","(33)"],"transliterationArr":["qāla","yāādamu","anbi'hum","bi-asmāihim","falammā","anba-ahum","bi-asmāihim","qāla","alam","aqul","lakum","innī","aʿlamu","ghayba","al-samāwāti","wal-arḍi","wa-aʿlamu","mā","tub'dūna","wamā","kuntum","taktumūna",null],"verseTiming":[[1,0,710],[2,710,3290],[3,3290,5690],[4,5690,8900],[5,8900,11960],[6,11960,14370],[7,14370,16940],[8,16940,17600],[9,17600,18100],[10,18100,18650],[11,18650,19620],[12,19620,20200],[13,20200,20710],[14,20710,21250],[15,21250,21880],[16,21880,24510],[17,24510,25270],[18,25270,25680],[19,25680,27180],[20,27180,28110],[21,28110,29090],[22,29090,29440],[23,29440,30400],[24,30400,30880],[25,30880,32390],[26,32390,35015]]}},{"name":"2:34","price":"(Rántí) nígbà tí A sọ fún àwọn mọlāika pé: “Ẹ forí kanlẹ̀ kí (Ànábì) Ādam.”¹ Wọ́n sì forí kanlẹ̀ kí i àyàfi ’Iblīs.² Ó kọ̀, ó sì ṣe ìgbéraga. Ó sì wà nínú àwọn aláìgbàgbọ́.","arabic":"وَإِذۡ قُلۡنَا لِلۡمَلَٰٓئِكَةِ ٱسۡجُدُواْ لِأٓدَمَ فَسَجَدُوٓاْ إِلَّآ إِبۡلِيسَ أَبَىٰ وَٱسۡتَكۡبَرَ وَكَانَ مِنَ ٱلۡكَٰفِرِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":41,"juzNumber":1,"footnotes":"1. Ìforíkanlẹ̀-kíni èyí tí Allāhu - subhānahu wa ta‘āla - pa láṣẹ fún àwọn mọlāika Rẹ̀, ó ti di èèwọ̀ fún ìjọ Ànábì wa Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a -. Èyí ni pé, kò bá òfin ’Islām mu fún ẹnikẹ́ni láti forí kanlẹ̀ kí ẹlòmíìràn, ẹni yòówù ìbáà jẹ́. Ìdí ni pé, nínú hadīth Abū Huraerah, láti ọ̀dọ̀ Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a -. Ó sọ pé: “Èmi ìbá jẹ́ apàṣẹ fún ẹnì kan pé kí ó forí kanlẹ̀ kí ẹlòmíìràn ni, èmi ìbá pa ìyàwó ní àṣẹ pé kí ó forí kanlẹ̀ kí ọkọ rẹ̀.” (Sunan at-Tirmithiy; 1159, ’Abū Dāwud; 2140. Ṣeek Albāniy sọ pé: Hadīth náà dára, ó ní àlàáfíà.) Ipò tí ìforíkanlẹ̀-kíni wà náà ni ìdọ̀bálẹ̀-kíni, ìkúnlẹ̀-kíni àti títẹ̀-kíni. Gbogbo ìwọ̀nyí ni kò lẹ́tọ̀ọ́ mọ́. Àṣà ìkíni tí ẹ̀sìn ’Islām faramọ́ ni sísálámọ̀ (ìyẹn ni, sí sọ pé “as-salām ‘aleekum warahmọtullāh wabarakātuh”) àti bíbọ ọwọ́ ní ibi tí ó ti ní ẹ̀tọ́. \n 2. ’Iblīs ni àlàjẹ́ rẹ̀ ń jẹ́ Ṣaetọ̄n. Àwọn kan kà á mọ́ ara àwọn mọlāika. Wọ́n tún lérò pé Ṣaetọ̄n jẹ́ onímọ̀-jùlọ àti olùjọ́sìn-jùlọ láààrin àwọn mọlāika ṣíwájú kí ó tó di ẹni-ẹ̀kọ̀. Àmọ́ sá, ọ̀rọ̀ kò rí bẹ́ẹ̀ rárá. Ẹyọ kan nínú àwọn àlùjànnú ni ’Iblīs, gẹ́gẹ́ bí èyí ṣe rinlẹ̀ nínú sūrah al-Kahf; 18:50. Allāhu kò sì fi ìmọ̀ àti ìjọ́sìn ròyìn Ṣaetọ̄n rí.","lang":"yo","meta":{"transliteration":"wa-idh qul'nā lil'malāikati us'judū liādama fasajadū illā ib'līsa abā wa-is'takbara wakāna mina al-kāfirīna ","translations":["And when","We said","to the angels","Prostrate","to Adam","[so] they prostrated","except","Iblis","He refused","and was arrogant","and became","of","the disbelievers","(34)"],"transliterationArr":["wa-idh","qul'nā","lil'malāikati","us'judū","liādama","fasajadū","illā","ib'līsa","abā","wa-is'takbara","wakāna","mina","al-kāfirīna",null],"verseTiming":[[1,0,650],[2,650,1440],[3,1440,4370],[4,4370,5120],[5,5120,6020],[6,6020,8200],[7,8200,10340],[8,10340,11240],[9,11240,11850],[10,11850,13000],[11,13000,13750],[12,13750,14050],[13,14050,16755]]}},{"name":"2:35","price":"A sì sọ pé: “Ādam, ìwọ àti ìyàwó rẹ, ẹ máa gbé nínú Ọgbà Ìdẹ̀ra. Kí ẹ máa jẹ nínú rẹ̀ ní gbẹdẹmukẹ ní ibikíbi tí ẹ bá fẹ́. Kí ẹ sì má ṣe súnmọ́ igi yìí, kí ẹ má baà wà nínú àwọn alábòsí.”¹","arabic":"وَقُلۡنَا يَٰٓـَٔادَمُ ٱسۡكُنۡ أَنتَ وَزَوۡجُكَ ٱلۡجَنَّةَ وَكُلَا مِنۡهَا رَغَدًا حَيۡثُ شِئۡتُمَا وَلَا تَقۡرَبَا هَٰذِهِ ٱلشَّجَرَةَ فَتَكُونَا مِنَ ٱلظَّٰلِمِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":42,"juzNumber":1,"footnotes":"1. Nípa èso tí Ànábì Ādam - kí ọlà Allāhu máa bá a - jẹ, ẹ wo ìtọsẹ̀-ọ̀rọ̀ sūrah al-’Arọ̄f; 7:22.","lang":"yo","meta":{"transliteration":"waqul'nā yāādamu us'kun anta wazawjuka al-janata wakulā min'hā raghadan ḥaythu shi'tumā walā taqrabā hādhihi al-shajarata fatakūnā mina al-ẓālimīna ","translations":["And We said","O Adam","Dwell","you","and your spouse","(in) Paradise","and [you both] eat","from it","freely","(from) wherever","you [both] wish","But do not","[you two] approach","this","[the] tree","lest you [both] be","of","the wrongdoers","(35)"],"transliterationArr":["waqul'nā","yāādamu","us'kun","anta","wazawjuka","al-janata","wakulā","min'hā","raghadan","ḥaythu","shi'tumā","walā","taqrabā","hādhihi","al-shajarata","fatakūnā","mina","al-ẓālimīna",null],"verseTiming":[[1,0,1070],[2,1070,3490],[3,3490,4090],[4,4090,5410],[5,5410,6350],[6,6350,7790],[7,7790,8510],[8,8510,9210],[9,9210,9980],[10,9980,10530],[11,10530,11540],[12,11540,11990],[13,11990,13070],[14,13070,13950],[15,13950,14980],[16,14980,15710],[17,15710,16630],[18,16630,17790],[19,17790,18130],[20,18130,20475]]}},{"name":"2:36","price":"Lẹ́yìn náà, Èṣù yẹ àwọn méjèèjì lẹ́sẹ̀ kúrò nínú Ọgbà Ìdẹ̀ra, ó sì mú wọn jáde kúrò nínú ibi tí wọ́n wà. A sì sọ pé: “Ẹ sọ̀kalẹ̀, ọ̀tá ní apá kan yín jẹ́ fún apá kan. Ibùgbé àti n̄ǹkan ìgbádùn sì ń bẹ fún yín lórí ilẹ̀ títí di ìgbà kan.”","arabic":"فَأَزَلَّهُمَا ٱلشَّيۡطَٰنُ عَنۡهَا فَأَخۡرَجَهُمَا مِمَّا كَانَا فِيهِۖ وَقُلۡنَا ٱهۡبِطُواْ بَعۡضُكُمۡ لِبَعۡضٍ عَدُوّٞۖ وَلَكُمۡ فِي ٱلۡأَرۡضِ مُسۡتَقَرّٞ وَمَتَٰعٌ إِلَىٰ حِينٖ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":43,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"fa-azallahumā al-shayṭānu ʿanhā fa-akhrajahumā mimmā kānā fīhi waqul'nā ih'biṭū baʿḍukum libaʿḍin ʿaduwwun walakum fī al-arḍi mus'taqarrun wamatāʿun ilā ḥīnin ","translations":["Then made [both of] them slip","the Shaitaan","from it","and he got [both of] them out","from what","they [both] were","in [it]","And We said","Go down (all of you)","some of you","to others","(as) enemy","and for you","in","the earth","(is) a dwelling place","and a provision","for","a period","(36)"],"transliterationArr":["fa-azallahumā","al-shayṭānu","ʿanhā","fa-akhrajahumā","mimmā","kānā","fīhi","waqul'nā","ih'biṭū","baʿḍukum","libaʿḍin","ʿaduwwun","walakum","fī","al-arḍi","mus'taqarrun","wamatāʿun","ilā","ḥīnin",null],"verseTiming":[[1,0,1370],[2,1370,2560],[3,2560,3290],[4,3290,4780],[5,4780,5990],[6,5990,6820],[7,6820,9290],[8,9290,9990],[9,9990,10780],[10,10780,11660],[11,11660,12590],[12,12590,13860],[13,13860,14590],[14,14590,14820],[15,14820,15580],[16,15580,17520],[17,17520,18610],[18,18610,19120],[19,19120,21225]]}},{"name":"2:37","price":"Lẹ́yìn náà, (Ànábì) Ādam rí àwọn ọ̀rọ̀ kan gbà láti ọ̀dọ̀ Olúwa rẹ̀. Ó sì gba ìronúpìwàdà rẹ̀. Dájúdájú Allāhu, Òun ni Olùgba-ìronúpìwàdà, Àṣàkẹ́-ọ̀run.","arabic":"فَتَلَقَّىٰٓ ءَادَمُ مِن رَّبِّهِۦ كَلِمَٰتٖ فَتَابَ عَلَيۡهِۚ إِنَّهُۥ هُوَ ٱلتَّوَّابُ ٱلرَّحِيمُ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":44,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"fatalaqqā ādamu min rabbihi kalimātin fatāba ʿalayhi innahu huwa al-tawābu al-raḥīmu ","translations":["Then received","Adam","from","his Lord","words","So (his Lord) turned","towards him","Indeed He","He","(is) the Oft-returning (to mercy)","the Most Merciful","(37)"],"transliterationArr":["fatalaqqā","ādamu","min","rabbihi","kalimātin","fatāba","ʿalayhi","innahu","huwa","al-tawābu","al-raḥīmu",null],"verseTiming":[[1,0,2950],[2,2950,3720],[3,3720,3870],[4,3870,5020],[5,5020,6920],[6,6920,7630],[7,7630,10110],[8,10110,11700],[9,11700,12020],[10,12020,13180],[11,13180,15585]]}},{"name":"2:38","price":"A sọ pé¹: “Gbogbo yín, ẹ sọ̀kalẹ̀ kúrò nínú rẹ̀. Nígbà tí ìmọ̀nà bá dé ba yín láti ọ̀dọ̀ Mi, ẹni tí ó bá tẹ̀lé ìmọ̀nà Mi, ìpáyà kò níí sí fún wọn. Wọn kò sì níí banújẹ́.","arabic":"قُلۡنَا ٱهۡبِطُواْ مِنۡهَا جَمِيعٗاۖ فَإِمَّا يَأۡتِيَنَّكُم مِّنِّي هُدٗى فَمَن تَبِعَ هُدَايَ فَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":45,"juzNumber":1,"footnotes":"1. Kíyè sí i, nígbàkígbà tí Allāhu - subhānahu wa ta‘ālā - bá lo ọ̀rọ̀ arọ́pò-orúkọ “ọ̀pọ̀” dípò “ẹyọ” fún ara Rẹ̀, kò túmọ̀ sí pé “Ọlọ́hun Òdodo” pọ̀ ní òǹkà. Ọ̀rọ̀ arọ́pò-orúkọ ọ̀pọ̀ lè dúró fún ọ̀pọ̀ ní òǹkà tàbí àpọ́nlé. Ibikíbi tí Allāhu - subhānahu wa ta‘ālā - bá ti lo ọ̀rọ̀ arọ́pò-orúkọ “ọ̀pọ̀” nínú al-Ƙur’ān tàbí ọ̀rọ̀-orúkọ “ọ̀pọ̀” tàbí ọ̀rọ̀-ìṣe “ọ̀pọ̀”, kò túmọ̀ sí “Ọlọ́hun” púpọ̀ rárá. Àmọ́ Ó ń ṣe àpọ́nlé fún iṣẹ́ ọwọ́ Rẹ̀ ni. Kí èyí lè dájú pé ìwọ̀nyí kò túmọ̀ sí “Ọlọ́hun” púpọ̀, ṣebí ìtúmọ̀ ọlọ́hun ni ẹni tí wọ́n ń jọ́sìn fún tàbí ẹni tí wọ́n ń bọ, ìdí nìyí tó fi jẹ́ pé ibikíbi tí Allāhu - subhānahu wa ta‘ālā - bá ti sọ̀rọ̀ kan jíjọ́sìn fún Un kì í lo ọ̀rọ̀-orúkọ tàbí ọ̀rọ̀ arọ́pò-orúkọ kan àfi “ẹyọ”. Èyí ló fi rinlẹ̀ pé ọ̀kan ṣoṣo ni Ọlọ́hun Òdodo tí a gbọ́dọ̀ jọ́sìn fún ní ọ̀nà òdodo, àmọ́ Ó lè lo ọ̀rọ̀ arọ́pò-orúkọ ọ̀pọ̀ “Àwa” fún ara Rẹ̀ ní ti ìtúmọ̀ àpọ́nlé.","lang":"yo","meta":{"transliteration":"qul'nā ih'biṭū min'hā jamīʿan fa-immā yatiyannakum minnī hudan faman tabiʿa hudāya falā khawfun ʿalayhim walā hum yaḥzanūna ","translations":["We said","Go down","from it","all (of you)","and when","comes to you","from Me","Guidance","then whoever","follows","My Guidance","[then] no","fear","(will be) on them","and not","they","will grieve","(38)"],"transliterationArr":["qul'nā","ih'biṭū","min'hā","jamīʿan","fa-immā","yatiyannakum","minnī","hudan","faman","tabiʿa","hudāya","falā","khawfun","ʿalayhim","walā","hum","yaḥzanūna",null],"verseTiming":[[1,0,600],[2,600,1430],[3,1430,2120],[4,2120,3610],[5,3610,4960],[6,4960,7000],[7,7000,8620],[8,8620,9780],[9,9780,10770],[10,10770,11400],[11,11400,12120],[12,12120,12680],[13,12680,13450],[14,13450,14400],[15,14400,14960],[16,14960,15350],[17,15350,18035]]}},{"name":"2:39","price":"Àwọn tó bá sì ṣàì gbàgbọ́, tí wọ́n pe àwọn āyah Wa ní irọ́, àwọn wọ̀nyẹn ni èrò inú Iná. Olùṣegbére ni wọ́n nínú rẹ̀.”","arabic":"وَٱلَّذِينَ كَفَرُواْ وَكَذَّبُواْ بِـَٔايَٰتِنَآ أُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلنَّارِۖ هُمۡ فِيهَا خَٰلِدُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":46,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"wa-alladhīna kafarū wakadhabū biāyātinā ulāika aṣḥābu al-nāri hum fīhā khālidūna ","translations":["And those","who disbelieve[d]","and deny","Our Signs","those","(are the) companions","(of) the Fire","they","in it","(will) abide forever","(39)"],"transliterationArr":["wa-alladhīna","kafarū","wakadhabū","biāyātinā","ulāika","aṣḥābu","al-nāri","hum","fīhā","khālidūna",null],"verseTiming":[[1,0,1150],[2,1150,1980],[3,1980,3080],[4,3080,5900],[5,5900,8260],[6,8260,9120],[7,9120,12790],[8,12790,13190],[9,13190,14060],[10,14060,17475]]}},{"name":"2:40","price":"Ẹ̀yin ọmọ ’Isrọ̄’īl,¹ ẹ rántí ìdẹ̀ra Mi, èyí tí Mo ṣe fún yín. Ẹ mú májẹ̀mu Mi ṣẹ, Mo máa mú (ẹ̀san) májẹ̀mu yín ṣẹ. Èmi nìkan ni kí ẹ sì páyà.","arabic":"يَٰبَنِيٓ إِسۡرَٰٓءِيلَ ٱذۡكُرُواْ نِعۡمَتِيَ ٱلَّتِيٓ أَنۡعَمۡتُ عَلَيۡكُمۡ وَأَوۡفُواْ بِعَهۡدِيٓ أُوفِ بِعَهۡدِكُمۡ وَإِيَّٰيَ فَٱرۡهَبُونِ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":47,"juzNumber":1,"footnotes":"1. Ibn ‘Abbās - kí Allāhu yọ́nú sí i - sọ pé: “Nínú èdè ‘Abrāniyyah (Hébérù), “’Isrọ̄” túmọ̀ sí “ẹrú”, “ ’īl” sì túmọ̀ sí “Allāhu”. Èyí já sí pé, “ẹrú Allāhu” ni ìtúmọ̀ “’Isrọ̄’īl”. (Tọbariy)","lang":"yo","meta":{"transliteration":"yābanī is'rāīla udh'kurū niʿ'matiya allatī anʿamtu ʿalaykum wa-awfū biʿahdī ūfi biʿahdikum wa-iyyāya fa-ir'habūni ","translations":["O Children","(of) Israel","Remember","My Favor","which","I bestowed","upon you","and fulfill","My Covenant","I will fulfill","your covenant","and Me Alone","fear [Me]","(40)"],"transliterationArr":["yābanī","is'rāīla","udh'kurū","niʿ'matiya","allatī","anʿamtu","ʿalaykum","wa-awfū","biʿahdī","ūfi","biʿahdikum","wa-iyyāya","fa-ir'habūni",null],"verseTiming":[[1,0,2650],[2,2650,5480],[3,5480,6240],[4,6240,7220],[5,7220,9170],[6,9170,10080],[7,10080,11060],[8,11060,11980],[9,11980,13500],[10,13500,14400],[11,14400,16570],[12,16570,17120],[13,17120,18320],[14,18320,19390],[15,19390,21815]]}},{"name":"2:41","price":"Ẹ gbàgbọ́ nínú ohun tí Mo sọ̀kalẹ̀, tí ó ń fi ohun tó jẹ́ òdodo rinlẹ̀ nípa èyí tó wà pẹ̀lú yín. Ẹ má ṣe jẹ́ ẹni àkọ́kọ́ tí ó máa ṣàì gbàgbọ́ nínú rẹ̀. Ẹ má ṣe ta àwọn āyah Mi ní owó pọ́ọ́kú.¹ Èmi nìkan ṣoṣo ni kí ẹ sì bẹ̀rù.","arabic":"وَءَامِنُواْ بِمَآ أَنزَلۡتُ مُصَدِّقٗا لِّمَا مَعَكُمۡ وَلَا تَكُونُوٓاْ أَوَّلَ كَافِرِۭ بِهِۦۖ وَلَا تَشۡتَرُواْ بِـَٔايَٰتِي ثَمَنٗا قَلِيلٗا وَإِيَّٰيَ فَٱتَّقُونِ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":48,"juzNumber":1,"footnotes":"1. Títa āyah Taorāt àti ’Injīl “bíbélì” ní owó pọ́ọ́kú ni títi ọwọ́ bọ̀ ọ́ lójú nítorí kí wọ́n lè jáde kúrò lábẹ́ òfin Allāhu fún ìgbádùn ayé.","lang":"yo","meta":{"transliteration":"waāminū bimā anzaltu muṣaddiqan limā maʿakum walā takūnū awwala kāfirin bihi walā tashtarū biāyātī thamanan qalīlan wa-iyyāya fa-ittaqūni ","translations":["And believe","in what","I have sent down","confirming","that which","(is) with you","and (do) not","be","(the) first","disbeliever","of it","And (do) not","exchange","My Signs (for)","a price","small","and Me Alone","fear [Me]","(41)"],"transliterationArr":["waāminū","bimā","anzaltu","muṣaddiqan","limā","maʿakum","walā","takūnū","awwala","kāfirin","bihi","walā","tashtarū","biāyātī","thamanan","qalīlan","wa-iyyāya","fa-ittaqūni",null],"verseTiming":[[1,0,1270],[2,1270,3280],[3,3280,4610],[4,4610,5600],[5,5600,6280],[6,6280,7090],[7,7090,7600],[8,7600,9790],[9,9790,10610],[10,10610,12120],[11,12120,12830],[12,12830,13370],[13,13370,14320],[14,14320,15650],[15,15650,17190],[16,17190,17960],[17,17960,19660],[18,19660,22045]]}},{"name":"2:42","price":"Ẹ má da irọ́ pọ̀ mọ́ òdodo, ẹ sì má fi òdodo pamọ́ nígbà tí ẹ̀yin mọ (òdodo).","arabic":"وَلَا تَلۡبِسُواْ ٱلۡحَقَّ بِٱلۡبَٰطِلِ وَتَكۡتُمُواْ ٱلۡحَقَّ وَأَنتُمۡ تَعۡلَمُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":49,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"walā talbisū al-ḥaqa bil-bāṭili wataktumū al-ḥaqa wa-antum taʿlamūna ","translations":["And (do) not","mix","the Truth","with [the] falsehood","and conceal","the Truth","while you","[you] know","(42)"],"transliterationArr":["walā","talbisū","al-ḥaqa","bil-bāṭili","wataktumū","al-ḥaqa","wa-antum","taʿlamūna",null],"verseTiming":[[1,0,700],[2,700,1450],[3,1450,2250],[4,2250,3350],[5,3350,4220],[6,4220,5090],[7,5090,6670],[8,6670,9445]]}},{"name":"2:43","price":"Ẹ kírun, ẹ yọ zakāh, kí ẹ sì dáwọ́tẹ orúnkún pẹ̀lú àwọn olùdáwọ́tẹ-orúnkún (lórí ìrun).","arabic":"وَأَقِيمُواْ ٱلصَّلَوٰةَ وَءَاتُواْ ٱلزَّكَوٰةَ وَٱرۡكَعُواْ مَعَ ٱلرَّٰكِعِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":50,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"wa-aqīmū al-ṣalata waātū al-zakata wa-ir'kaʿū maʿa al-rākiʿīna ","translations":["And establish","the prayer","and give","zakah","and bow down","with","those who bow down","(43)"],"transliterationArr":["wa-aqīmū","al-ṣalata","waātū","al-zakata","wa-ir'kaʿū","maʿa","al-rākiʿīna",null],"verseTiming":[[1,0,1030],[2,1030,2060],[3,2060,2770],[4,2770,3800],[5,3800,4710],[6,4710,5080],[7,5080,7915]]}},{"name":"2:44","price":"Ṣé ẹ̀yin yóò máa pa àwọn ènìyàn l’áṣẹ ohun rere, ẹ sì ń gbàgbé ẹ̀mí ara yín, ẹ̀yin sì ń ké Tírà, ṣé ẹ kò ṣe làákàyè ni!","arabic":"۞ أَتَأۡمُرُونَ ٱلنَّاسَ بِٱلۡبِرِّ وَتَنسَوۡنَ أَنفُسَكُمۡ وَأَنتُمۡ تَتۡلُونَ ٱلۡكِتَٰبَۚ أَفَلَا تَعۡقِلُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":51,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"atamurūna al-nāsa bil-biri watansawna anfusakum wa-antum tatlūna al-kitāba afalā taʿqilūna ","translations":["Do you order","[the] people","[the] righteousness","and you forget","yourselves","while you","[you] recite","the Book","Then, will not","you use reason","(44)"],"transliterationArr":["atamurūna","al-nāsa","bil-biri","watansawna","anfusakum","wa-antum","tatlūna","al-kitāba","afalā","taʿqilūna",null],"verseTiming":[[1,0,1250],[2,1250,2870],[3,2870,3780],[4,3780,5680],[5,5680,7390],[6,7390,8680],[7,8680,9570],[8,9570,12310],[9,12310,13370],[10,13370,16245]]}},{"name":"2:45","price":"Ẹ wá oore (Allāhu) pẹ̀lú sùúrù¹ àti ìrun kíkí. Dájúdájú ó lágbára (láti ṣe bẹ́ẹ̀) àyàfi fún àwọn olùpáyà (Allāhu),","arabic":"وَٱسۡتَعِينُواْ بِٱلصَّبۡرِ وَٱلصَّلَوٰةِۚ وَإِنَّهَا لَكَبِيرَةٌ إِلَّا عَلَى ٱلۡخَٰشِعِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":52,"juzNumber":1,"footnotes":"1. Mẹ́ta ni sùúrù yìí pín sí. Ìkíní: Dídúró ṣinṣin nínú ẹ̀sìn ’Islām. Ìkejì: Ṣíṣe ìfaradà lórí àdánwò àti níní àtẹ̀mọ́ra ìnira. Ìkẹta: Sísá fún ẹ̀ṣẹ̀.","lang":"yo","meta":{"transliteration":"wa-is'taʿīnū bil-ṣabri wal-ṣalati wa-innahā lakabīratun illā ʿalā al-khāshiʿīna ","translations":["And seek help","through patience","and the prayer","and indeed, it","(is) surely difficult","except","on","the humble ones","(45)"],"transliterationArr":["wa-is'taʿīnū","bil-ṣabri","wal-ṣalati","wa-innahā","lakabīratun","illā","ʿalā","al-khāshiʿīna",null],"verseTiming":[[1,0,1350],[2,1350,2280],[3,2280,5250],[4,5250,6950],[5,6950,8190],[6,8190,8990],[7,8990,9360],[8,9360,12295]]}},{"name":"2:46","price":"(Àwọn olùpáyà Allāhu ni) àwọn tó mọ̀ dájúdájú pé, àwọn yóò pàdé Olúwa wọn, àti pé dájúdájú àwọn yóò padà sí ọ̀dọ̀ Rẹ̀.","arabic":"ٱلَّذِينَ يَظُنُّونَ أَنَّهُم مُّلَٰقُواْ رَبِّهِمۡ وَأَنَّهُمۡ إِلَيۡهِ رَٰجِعُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":53,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"alladhīna yaẓunnūna annahum mulāqū rabbihim wa-annahum ilayhi rājiʿūna ","translations":["Those who","believe","that they","will meet","their Lord","and that they","to Him","will return","(46)"],"transliterationArr":["alladhīna","yaẓunnūna","annahum","mulāqū","rabbihim","wa-annahum","ilayhi","rājiʿūna",null],"verseTiming":[[1,0,1080],[2,1080,2740],[3,2740,4250],[4,4250,5900],[5,5900,6890],[6,6890,8700],[7,8700,9430],[8,9430,12735]]}},{"name":"2:47","price":"Ẹ̀yin ọmọ ’Isrọ̄’īl, ẹ rántí ìdẹ̀ra Mi, èyí tí Mo fi ṣèdẹ̀ra fún yín. Dájúdájú Èmi tún ṣoore àjùlọ fún yín lórí àwọn ẹ̀dá (àsìkò yín).","arabic":"يَٰبَنِيٓ إِسۡرَٰٓءِيلَ ٱذۡكُرُواْ نِعۡمَتِيَ ٱلَّتِيٓ أَنۡعَمۡتُ عَلَيۡكُمۡ وَأَنِّي فَضَّلۡتُكُمۡ عَلَى ٱلۡعَٰلَمِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":54,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"yābanī is'rāīla udh'kurū niʿ'matiya allatī anʿamtu ʿalaykum wa-annī faḍḍaltukum ʿalā al-ʿālamīna ","translations":["O Children","(of) Israel","Remember","My Favor","which","I bestowed","upon you","and that I","[I] preferred you","over","the worlds","(47)"],"transliterationArr":["yābanī","is'rāīla","udh'kurū","niʿ'matiya","allatī","anʿamtu","ʿalaykum","wa-annī","faḍḍaltukum","ʿalā","al-ʿālamīna",null],"verseTiming":[[1,0,2450],[2,2450,5440],[3,5440,6270],[4,6270,7220],[5,7220,9190],[6,9190,10140],[7,10140,11180],[8,11180,12660],[9,12660,14060],[10,14060,14470],[11,14470,17265]]}},{"name":"2:48","price":"Ẹ bẹ̀rù ọjọ́ kan tí ẹ̀mí kan kò níí rọrọ̀ kiní kan fún ẹ̀mí kan. Wọn kò níí gba ìṣìpẹ̀ l’ọ́wọ́ rẹ̀. Wọn kò níí gba ààrọ̀ l’ọ́wọ́ rẹ̀.¹ Wọn kò sì níí ràn wọ́n lọ́wọ́.²","arabic":"وَٱتَّقُواْ يَوۡمٗا لَّا تَجۡزِي نَفۡسٌ عَن نَّفۡسٖ شَيۡـٔٗا وَلَا يُقۡبَلُ مِنۡهَا شَفَٰعَةٞ وَلَا يُؤۡخَذُ مِنۡهَا عَدۡلٞ وَلَا هُمۡ يُنصَرُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":55,"juzNumber":1,"footnotes":"1. Ìyẹn ni pé, l’ọ́jọ́ Àjíǹde dúkìá kan kan kò níí wúlò fún ìràpadà ẹ̀mí níbi Iná àfi iṣẹ́ rere tí í ṣe ìjọ́sìn fún Allāhu àti ìwà rere tó tọ sunnah.\n 2. Àwọn kan sọ pé, “Àwọn āyah kan sọ pé kò sí ìṣìpẹ̀ l’ọ́jọ́ Àjíǹde, àwọn āyah mìíràn sọ pé ìṣìpẹ̀ wà.” Wọ́n ní, “Ìtakora nìyẹn.”\n Èsì: Èyí jẹ́ “ìtakora tófẹ́jọbẹ́ẹ̀”, kì í ṣe “ìtakora tóríbẹ́ẹ̀”. Àlàyé rẹ̀ nìyí. Àwọn āyah tó ń sọ pé kò sí ìṣìpẹ̀ l’ọ́jọ́ Àjíǹde ń jẹ́ ọ̀rọ̀ ajáni-ní-tànmọ́ọ̀n fún àwọn yẹhudi àti àwọn nasọ̄rọ̄ tí wọ́n ń fọkàn sí ìṣìpẹ̀ láì ṣe iṣẹ́ tí ó máa mú wọn lẹ́tọ̀ọ́ sí ìṣìpẹ̀ àti àwọn ọ̀ṣẹbọ tí ẹ̀sìn ìbọ̀rìṣà tiwọn wulẹ̀ dúró sórí bíbọ ẹ̀dá kan nítorí kí ó lè ṣìpẹ̀ wọn l’ọ́jọ́ Àjíǹde. Irúfẹ́ àwọn āyah náà ni sūrah al-Baƙọrah; 2:48, 123 àti 254 àti sūrah al-’Ani‘ām; 6:51. Àmọ́ àwọn āyah tó ń sọ pé ìṣìpẹ̀ máa wà l’ọ́jọ́ Àjíǹde ń sọ nípa àwọn májẹ̀mú tí ó wà fún ìṣìpẹ̀, olùṣìpẹ̀ àti olùṣìpẹ̀-fún. Irúfẹ́ àwọn āyah náà ni sūrah al-Baƙọrah; 2:255, sūrah Tọ̄hā; 20:109, sūrah Saba’; 34:23, sūrah az-Zukruf; 43:86 àti sūrah al-’Ani‘ām; 6:70. Kíyè sí i, gbígbà tí Allāhu - subhānahu wa ta‘ālā - máa gba ìṣìpẹ̀ lọ́wọ́ àwọn kan fún àwọn kan kò kéré ipò fún agbára Allāhu, àmọ́ ipò tí ìbániṣàdúà wà ni ìṣìpẹ̀ wà. Nítorí náà, bí ó ṣe lẹ́tọ̀ọ́ láti bá ẹlòmíìràn ṣàdúà, bẹ́ẹ̀ náà ló máa ní ẹ̀tọ́ láti bá ẹlòmíìràn ṣìpẹ̀ l’ọ́jọ́ Àjíǹde. Olùṣìpẹ̀ àkọ́kọ́ fún gbogbo ẹ̀dá sì ni Ànábì wa Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a -. Àmọ́ má ṣe fọkàn sí pé mùsùlùmí kan máa ṣìpẹ̀ rẹ tàbí pé o máa ṣìpẹ̀ mùsùlùmí kan nítorí pé, nínú ohun tó pamọ́ fún ẹ̀dá ni ìmọ̀ nípa ta gan-an ni Allāhu - subhānahu wa ta‘ālā - máa fi ìṣìpẹ̀ pọ́nlé nínú àwa ẹrúsìn Rẹ̀. Àdúà wa ni pé, kí Allāhu fi ìṣìpẹ̀ ṣe àpọ́nlé fún èmi àti ẹ̀yin.","lang":"yo","meta":{"transliteration":"wa-ittaqū yawman lā tajzī nafsun ʿan nafsin shayan walā yuq'balu min'hā shafāʿatun walā yu'khadhu min'hā ʿadlun walā hum yunṣarūna ","translations":["And fear","a day","(will) not","avail","any soul","for","(another) soul","anything","and not","will be accepted","from it","any intercession","and not","will be taken","from it","a compensation","and not","they","will be helped","(48)"],"transliterationArr":["wa-ittaqū","yawman","lā","tajzī","nafsun","ʿan","nafsin","shayan","walā","yuq'balu","min'hā","shafāʿatun","walā","yu'khadhu","min'hā","ʿadlun","walā","hum","yunṣarūna",null],"verseTiming":[[1,0,1050],[2,1050,1680],[3,1680,2170],[4,2170,2990],[5,2990,3660],[6,3660,3960],[7,3960,6100],[8,6100,6800],[9,6800,8090],[10,8090,8900],[11,8900,9620],[12,9620,11040],[13,11040,11610],[14,11610,12400],[15,12400,13130],[16,13130,14920],[17,14920,15430],[18,15430,16190],[19,16190,16920],[20,16920,18430],[21,18430,18910],[22,18910,19290],[23,19290,22605]]}},{"name":"2:49","price":"(Ẹ rántí) nígbà tí A gbà yín là lọ́wọ́ àwọn ènìyàn Fir‘aon, tí wọ́n ń fi ìyà burúkú jẹ yín, tí wọ́n ń dúńbú àwọn ọmọkùnrin yín, tí wọ́n sì ń jẹ́ kí àwọn obìnrin yín ṣẹ̀mí. Àdánwò ńlá wà nínú ìyẹn fún yín láti ọ̀dọ̀ Olúwa yín.","arabic":"وَإِذۡ نَجَّيۡنَٰكُم مِّنۡ ءَالِ فِرۡعَوۡنَ يَسُومُونَكُمۡ سُوٓءَ ٱلۡعَذَابِ يُذَبِّحُونَ أَبۡنَآءَكُمۡ وَيَسۡتَحۡيُونَ نِسَآءَكُمۡۚ وَفِي ذَٰلِكُم بَلَآءٞ مِّن رَّبِّكُمۡ عَظِيمٞ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":56,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"wa-idh najjaynākum min āli fir'ʿawna yasūmūnakum sūa al-ʿadhābi yudhabbiḥūna abnāakum wayastaḥyūna nisāakum wafī dhālikum balāon min rabbikum ʿaẓīmun ","translations":["And when","We saved you","from","(the) people","(of) Firaun","(who were) afflicting you (with)","horrible","torment","slaughtering","your sons","and letting live","your women","And in","that","(was) a trial","from","your Lord","great","(49)"],"transliterationArr":["wa-idh","najjaynākum","min","āli","fir'ʿawna","yasūmūnakum","sūa","al-ʿadhābi","yudhabbiḥūna","abnāakum","wayastaḥyūna","nisāakum","wafī","dhālikum","balāon","min","rabbikum","ʿaẓīmun",null],"verseTiming":[[1,0,620],[2,620,2110],[3,2110,3110],[4,3110,3640],[5,3640,4610],[6,4610,6070],[7,6070,8309],[8,8309,9199],[9,9199,10549],[10,10549,13199],[11,13199,14669],[12,14669,17529],[13,17529,18159],[14,18159,18999],[15,18999,21759],[16,21759,22689],[17,22689,23799],[18,23799,26044]]}},{"name":"2:50","price":"(Ẹ rántí) nígbà tí A pín agbami òkun sí ọ̀tọ̀ọ̀tọ̀ fún yín,¹ A sì gbà yín là. A tẹ àwọn ènìyàn Fir‘aon rì. Ẹ̀yin náà sì ń wò (wọ́n nínú agbami odò).","arabic":"وَإِذۡ فَرَقۡنَا بِكُمُ ٱلۡبَحۡرَ فَأَنجَيۡنَٰكُمۡ وَأَغۡرَقۡنَآ ءَالَ فِرۡعَوۡنَ وَأَنتُمۡ تَنظُرُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":57,"juzNumber":1,"footnotes":"1. Àwọn kan nínú àwọn onímọ̀ nípa Tafsīr sọ pé, “Agbami òkun pín sí méjì fún àwọn ọmọ Isrọ̄’īl, ojú-ọ̀nà ẹyọ kan sì là fún gbogbo wọn.” Àmọ́ ọ̀pọ̀lọ́pọ̀ àwọn onímọ̀ nípa Tafsīr sọ pé, “Agbami òkun pín sí méjìlá fún wọn tí ìdìlé kọ̀ọ̀kan sì tọ ojú-ọ̀nà kọ̀ọ̀kan nítorí pé, ìdílé méjìlá ni ìran ọmọ Isrọ̄’īl.” Ìyapa-ẹnu yìí kò gbọ́dọ̀ bí wàhálà. Kókó ọ̀rọ̀ ni pé, agbami òkun pín sí ọ̀tọ̀ọ̀tọ̀. Mélòó ló wá pín sí? Wallāhu ’a‘lam.","lang":"yo","meta":{"transliteration":"wa-idh faraqnā bikumu al-baḥra fa-anjaynākum wa-aghraqnā āla fir'ʿawna wa-antum tanẓurūna ","translations":["And when","We parted","for you","the sea","then We saved you","and We drowned","(the) people","(of) Firaun","while you","(were) looking","(50)"],"transliterationArr":["wa-idh","faraqnā","bikumu","al-baḥra","fa-anjaynākum","wa-aghraqnā","āla","fir'ʿawna","wa-antum","tanẓurūna",null],"verseTiming":[[1,0,910],[2,910,1860],[3,1860,2410],[4,2410,3260],[5,3260,5740],[6,5740,8690],[7,8690,9330],[8,9330,10380],[9,10380,12070],[10,12070,15075]]}},{"name":"2:51","price":"(Ẹ rántí) nígbà tí A ṣe àdéhùn ogójì òru fún (Ànábì) Mūsā. Lẹ́yìn náà, ẹ tún bọ ọ̀bọrọgidi ọmọ màálù lẹ́yìn rẹ̀. Alábòsí sì ni yín.","arabic":"وَإِذۡ وَٰعَدۡنَا مُوسَىٰٓ أَرۡبَعِينَ لَيۡلَةٗ ثُمَّ ٱتَّخَذۡتُمُ ٱلۡعِجۡلَ مِنۢ بَعۡدِهِۦ وَأَنتُمۡ ظَٰلِمُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":58,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"wa-idh wāʿadnā mūsā arbaʿīna laylatan thumma ittakhadhtumu al-ʿij'la min baʿdihi wa-antum ẓālimūna ","translations":["And when","We appointed","(for) Musa","forty","nights","Then","you took","the calf","from","after him","and you","(were) wrongdoers","(51)"],"transliterationArr":["wa-idh","wāʿadnā","mūsā","arbaʿīna","laylatan","thumma","ittakhadhtumu","al-ʿij'la","min","baʿdihi","wa-antum","ẓālimūna",null],"verseTiming":[[1,0,660],[2,660,1830],[3,1830,3880],[4,3880,4980],[5,4980,6560],[6,6560,7510],[7,7510,8670],[8,8670,9490],[9,9490,10320],[10,10320,11280],[11,11280,12870],[12,12870,15505]]}},{"name":"2:52","price":"Lẹ́yìn náà, A mójú kúrò fún yín lẹ́yìn ìyẹn nítorí kí ẹ lè dúpẹ́ (fún Allāhu).","arabic":"ثُمَّ عَفَوۡنَا عَنكُم مِّنۢ بَعۡدِ ذَٰلِكَ لَعَلَّكُمۡ تَشۡكُرُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":59,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"thumma ʿafawnā ʿankum min baʿdi dhālika laʿallakum tashkurūna ","translations":["Then","We forgave","you","from","after","that","so that you may","(be) grateful","(52)"],"transliterationArr":["thumma","ʿafawnā","ʿankum","min","baʿdi","dhālika","laʿallakum","tashkurūna",null],"verseTiming":[[1,0,1320],[2,1320,2350],[3,2350,3660],[4,3660,5050],[5,5050,5700],[6,5700,6450],[7,6450,7630],[8,7630,10385]]}},{"name":"2:53","price":"(Ẹ rántí) nígbà tí A fún (Ànábì) Mūsā ní Tírà àti ọ̀rọ̀-ìpínyà nítorí kí ẹ lè mọ̀nà.¹","arabic":"وَإِذۡ ءَاتَيۡنَا مُوسَى ٱلۡكِتَٰبَ وَٱلۡفُرۡقَانَ لَعَلَّكُمۡ تَهۡتَدُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":60,"juzNumber":1,"footnotes":"1. Kíyè sí i, al-Furƙọ̄n “ọ̀rọ̀-ìpínyà” (ọ̀rọ̀ tó ń ṣe ìpínyà láààrin òdodo àti irọ́) jẹ́ ìròyìn àti àbùdá kan tí ń bẹ lára gbogbo tírà tí Allāhu - subhānahu wa ta‘ālā - fún gbogbo àwọn Ànábì Rẹ̀ - kí ìkẹ́ àti ọlà Allāhu máa bá wọn -. Kì í ṣe pé ọ̀tọ̀ ni Tírà, ọ̀tọ̀ ni Furƙọ̄n. Ọmọ ‘Abbās - kí Allāhu yọ́nú sí àwọn méjèèjì - sọ pé, “Furƙọ̄n ni orúkọ fún àpapọ̀ gbogbo tírà Zabūr, Taorāt, ’Injīl àti Ƙur’ān. (Tọbariy) Ìdí sì nìyí tí al-Furƙọ̄n fi jẹ́ orúkọ mìíràn fún al-Ƙur’ān.","lang":"yo","meta":{"transliteration":"wa-idh ātaynā mūsā al-kitāba wal-fur'qāna laʿallakum tahtadūna ","translations":["And when","We gave","Musa","the Book","and the Criterion","perhaps you","(would be) guided","(53)"],"transliterationArr":["wa-idh","ātaynā","mūsā","al-kitāba","wal-fur'qāna","laʿallakum","tahtadūna",null],"verseTiming":[[1,0,680],[2,680,1810],[3,1810,2390],[4,2390,3430],[5,3430,4640],[6,4640,5940],[7,5940,8995]]}},{"name":"2:54","price":"(Ẹ rántí) nígbà tí (Ànábì) Mūsā sọ fún ìjọ rẹ̀ pé: “Ẹ̀yin ìjọ mi, dájúdájú ẹ̀yin ṣàbòsí sí ẹ̀mí ara yín nípa sísọ ọ̀bọrọgidi ọmọ màálù di òrìṣà. Nítorí náà, ẹ ronú pìwàdà sí ọ̀dọ̀ Ẹlẹ́dàá yín, kí àwọn tí kò bọ màálù pa àwọn tó bọ ọ́ láààrin yín. Ìyẹn l’óore jùlọ fún yín ní ọ̀dọ̀ Ẹlẹ́dàá yín. Ó sì máa gba ìronúpìwàdà yín. Dájúdájú Allāhu, Òun ni Olùgba-ìronúpìwàdà, Àṣàkẹ́-ọ̀run.","arabic":"وَإِذۡ قَالَ مُوسَىٰ لِقَوۡمِهِۦ يَٰقَوۡمِ إِنَّكُمۡ ظَلَمۡتُمۡ أَنفُسَكُم بِٱتِّخَاذِكُمُ ٱلۡعِجۡلَ فَتُوبُوٓاْ إِلَىٰ بَارِئِكُمۡ فَٱقۡتُلُوٓاْ أَنفُسَكُمۡ ذَٰلِكُمۡ خَيۡرٞ لَّكُمۡ عِندَ بَارِئِكُمۡ فَتَابَ عَلَيۡكُمۡۚ إِنَّهُۥ هُوَ ٱلتَّوَّابُ ٱلرَّحِيمُ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":61,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"wa-idh qāla mūsā liqawmihi yāqawmi innakum ẓalamtum anfusakum bi-ittikhādhikumu al-ʿij'la fatūbū ilā bāri-ikum fa-uq'tulū anfusakum dhālikum khayrun lakum ʿinda bāri-ikum fatāba ʿalaykum innahu huwa al-tawābu al-raḥīmu ","translations":["And when","said","Musa","to his people","O my people","Indeed, you","[you] have wronged","yourselves","by your taking","the calf","So turn in repentance","to","your Creator","and kill","yourselves","That","(is) better","for you","with","your Creator","Then He turned","towards you","Indeed He","He","(is) the-returning","the Most Merciful","(54)"],"transliterationArr":["wa-idh","qāla","mūsā","liqawmihi","yāqawmi","innakum","ẓalamtum","anfusakum","bi-ittikhādhikumu","al-ʿij'la","fatūbū","ilā","bāri-ikum","fa-uq'tulū","anfusakum","dhālikum","khayrun","lakum","ʿinda","bāri-ikum","fatāba","ʿalaykum","innahu","huwa","al-tawābu","al-raḥīmu",null],"verseTiming":[[1,0,610],[2,610,1210],[3,1210,1910],[4,1910,3150],[5,3150,4040],[6,4040,5700],[7,5700,6620],[8,6620,9160],[9,9160,10560],[10,10560,11440],[11,11440,12520],[12,12520,15120],[13,15120,15670],[14,15670,16740],[15,16740,19190],[16,19190,20850],[17,20850,21720],[18,21720,22380],[19,22380,23510],[20,23510,24470],[21,24470,25180],[22,25180,25810],[23,25810,27150],[24,27150,28210],[25,28210,28980],[26,28980,29960],[27,29960,31970],[28,31970,32320],[29,32320,33520],[30,33520,35785]]}},{"name":"2:55","price":"(Ẹ rántí) nígbà tí ẹ wí pé: “Mūsā, a ò níí gbàgbọ́ nínú rẹ àfi kí á rí Allāhu ní ojúkojú.” Nítorí náà, iná láti ojú sánmọ̀ gba yín mú, ẹ sì ń wò bọ̀ọ̀.","arabic":"وَإِذۡ قُلۡتُمۡ يَٰمُوسَىٰ لَن نُّؤۡمِنَ لَكَ حَتَّىٰ نَرَى ٱللَّهَ جَهۡرَةٗ فَأَخَذَتۡكُمُ ٱلصَّٰعِقَةُ وَأَنتُمۡ تَنظُرُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":62,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"wa-idh qul'tum yāmūsā lan nu'mina laka ḥattā narā al-laha jahratan fa-akhadhatkumu al-ṣāʿiqatu wa-antum tanẓurūna ","translations":["And when","you said","O Musa","Never","(will) we believe","in you","until","we see","Allah","manifestly","So seized you","the thunderbolt","while you","(were) looking","(55)"],"transliterationArr":["wa-idh","qul'tum","yāmūsā","lan","nu'mina","laka","ḥattā","narā","al-laha","jahratan","fa-akhadhatkumu","al-ṣāʿiqatu","wa-antum","tanẓurūna",null],"verseTiming":[[1,0,680],[2,680,1470],[3,1470,2630],[4,2630,2900],[5,2900,4140],[6,4140,4560],[7,4560,5350],[8,5350,5680],[9,5680,6470],[10,6470,8250],[11,8250,9540],[12,9540,11160],[13,11160,12470],[14,12470,13760],[15,13760,15320],[16,15320,18265]]}},{"name":"2:56","price":"Lẹ́yìn náà, A ji yín dìde lẹ́yìn ikú yín, nítorí kí ẹ lè dúpẹ́ (fún Allāhu).¹","arabic":"ثُمَّ بَعَثۡنَٰكُم مِّنۢ بَعۡدِ مَوۡتِكُمۡ لَعَلَّكُمۡ تَشۡكُرُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":63,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"thumma baʿathnākum min baʿdi mawtikum laʿallakum tashkurūna ","translations":["Then","We revived you","from","after","your death","so that you may","(be) grateful","(56)"],"transliterationArr":["thumma","baʿathnākum","min","baʿdi","mawtikum","laʿallakum","tashkurūna",null],"verseTiming":[[1,0,1210],[2,1210,2540],[3,2540,4250],[4,4250,4840],[5,4840,5700],[6,5700,6900],[7,6900,10005]]}},{"name":"2:57","price":"A tún fi ẹ̀ṣújò ṣe ibòji fún yín. A sì tún sọ (ohun mímu) mọnnu¹ àti (ohun jíjẹ) salwā² kalẹ̀ fún yín. Ẹ jẹ nínú àwọn n̄ǹkan dáadáa tí A pèsè fún yín. Wọn kò sì ṣàbòsí sí Wa, ṣùgbọ́n ẹ̀mí ara wọn ni wọ́n ń ṣàbòsí sí.","arabic":"وَظَلَّلۡنَا عَلَيۡكُمُ ٱلۡغَمَامَ وَأَنزَلۡنَا عَلَيۡكُمُ ٱلۡمَنَّ وَٱلسَّلۡوَىٰۖ كُلُواْ مِن طَيِّبَٰتِ مَا رَزَقۡنَٰكُمۡۚ وَمَا ظَلَمُونَا وَلَٰكِن كَانُوٓاْ أَنفُسَهُمۡ يَظۡلِمُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":64,"juzNumber":1,"footnotes":"1. Adùn rẹ̀ dà bí adùn oyin.\n 2. Orúkọ ẹyẹ kan tí ó ládùn gan-an.","lang":"yo","meta":{"transliteration":"waẓallalnā ʿalaykumu al-ghamāma wa-anzalnā ʿalaykumu al-mana wal-salwā kulū min ṭayyibāti mā razaqnākum wamā ẓalamūnā walākin kānū anfusahum yaẓlimūna ","translations":["And We shaded","[over] you","(with) [the] clouds","and We sent down","to you","[the] manna","and [the] quails","Eat","from","(the) good things","that","We have provided you","And not","they wronged Us","but","they were","(to) themselves","doing wrong","(57)"],"transliterationArr":["waẓallalnā","ʿalaykumu","al-ghamāma","wa-anzalnā","ʿalaykumu","al-mana","wal-salwā","kulū","min","ṭayyibāti","mā","razaqnākum","wamā","ẓalamūnā","walākin","kānū","anfusahum","yaẓlimūna",null],"verseTiming":[[1,0,1450],[2,1450,2400],[3,2400,3490],[4,3490,5590],[5,5590,6520],[6,6520,8220],[7,8220,9380],[8,9380,10320],[9,10320,11340],[10,11340,12610],[11,12610,12920],[12,12920,14770],[13,14770,15200],[14,15200,16440],[15,16440,17780],[16,17780,19939],[17,19939,21749],[18,21749,24074]]}},{"name":"2:58","price":"(Ẹ rántí) nígbà tí A sọ pé: “Ẹ wọ inú ìlú yìí.¹ Ẹ jẹ nínú ìlú náà níbikíbi tí ẹ bá fẹ́ ní gbẹdẹmukẹ. Ẹ gba ẹnu-ọ̀nà (ìlú) náà wọlé ní ìtẹríba.² Kí ẹ sì wí pé: “Ha ẹ̀ṣẹ̀ wa dànù.” A óò forí àwọn ẹ̀ṣẹ̀ yín jìn yín. A ó sì ṣe àlékún (ẹ̀san rere) fún àwọn olùṣe-rere.","arabic":"وَإِذۡ قُلۡنَا ٱدۡخُلُواْ هَٰذِهِ ٱلۡقَرۡيَةَ فَكُلُواْ مِنۡهَا حَيۡثُ شِئۡتُمۡ رَغَدٗا وَٱدۡخُلُواْ ٱلۡبَابَ سُجَّدٗا وَقُولُواْ حِطَّةٞ نَّغۡفِرۡ لَكُمۡ خَطَٰيَٰكُمۡۚ وَسَنَزِيدُ ٱلۡمُحۡسِنِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":65,"juzNumber":1,"footnotes":"1. Ìlú náà ni Baetul-Mọƙdis.\n 2. “Sujūd” tí ó wà nínú “Sujjadān” kò níí ṣe é túmọ̀ sí ìforíkanlẹ̀ nínú āyah yìí bí kò ṣe ìtẹríba. Wulẹ̀ tẹ́lẹ̀, ohun tí “sujūd” kó sínú ni ìtẹrùn wálẹ̀ “inhinā’”, ìdáwọ́tẹ-orúnkún “rukū‘” àti ìforíkanlẹ̀ “sujūd”.","lang":"yo","meta":{"transliteration":"wa-idh qul'nā ud'khulū hādhihi al-qaryata fakulū min'hā ḥaythu shi'tum raghadan wa-ud'khulū al-bāba sujjadan waqūlū ḥiṭṭatun naghfir lakum khaṭāyākum wasanazīdu al-muḥ'sinīna ","translations":["And when","We said","Enter","this","town","then eat","from","wherever","you wish[ed]","abundantly","and enter","the gate","prostrating","And say","Repentance","We will forgive","for you","your sins","And We will increase","the good-doers (in reward)","(58)"],"transliterationArr":["wa-idh","qul'nā","ud'khulū","hādhihi","al-qaryata","fakulū","min'hā","ḥaythu","shi'tum","raghadan","wa-ud'khulū","al-bāba","sujjadan","waqūlū","ḥiṭṭatun","naghfir","lakum","khaṭāyākum","wasanazīdu","al-muḥ'sinīna",null],"verseTiming":[[1,0,680],[2,680,1280],[3,1280,2040],[4,2040,2880],[5,2880,3800],[6,3800,4560],[7,4560,5290],[8,5290,5870],[9,5870,6620],[10,6620,8010],[11,8010,8680],[12,8680,9430],[13,9430,10600],[14,10600,11720],[15,11720,12500],[16,12500,13290],[17,13290,14110],[18,14110,14980],[19,14980,15750],[20,15750,17420],[21,17420,18040],[22,18040,19900],[23,19900,21000],[24,21000,24125]]}},{"name":"2:59","price":"Àwọn tó ṣàbòsí yí ọ̀rọ̀ náà padà (sí ọ̀rọ̀ mìíràn) yàtọ̀ sí èyí tí A sọ fún wọn. Nítorí náà, A sọ ìyà kalẹ̀ láti sánmọ̀ lé àwọn tó ṣàbòsí lórí nítorí pé, wọ́n ń rú òfin.","arabic":"فَبَدَّلَ ٱلَّذِينَ ظَلَمُواْ قَوۡلًا غَيۡرَ ٱلَّذِي قِيلَ لَهُمۡ فَأَنزَلۡنَا عَلَى ٱلَّذِينَ ظَلَمُواْ رِجۡزٗا مِّنَ ٱلسَّمَآءِ بِمَا كَانُواْ يَفۡسُقُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":66,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"fabaddala alladhīna ẓalamū qawlan ghayra alladhī qīla lahum fa-anzalnā ʿalā alladhīna ẓalamū rij'zan mina al-samāi bimā kānū yafsuqūna ","translations":["But changed","those who","wronged","(the) word","other (than)","(that) which","was said","to them","so We sent down","upon","those who","wronged","a punishment","from","the sky","because","they were","defiantly disobeying","(59)"],"transliterationArr":["fabaddala","alladhīna","ẓalamū","qawlan","ghayra","alladhī","qīla","lahum","fa-anzalnā","ʿalā","alladhīna","ẓalamū","rij'zan","mina","al-samāi","bimā","kānū","yafsuqūna",null],"verseTiming":[[1,0,1090],[2,1090,2090],[3,2090,2840],[4,2840,3630],[5,3630,4160],[6,4160,4970],[7,4970,5590],[8,5590,6130],[9,6130,8320],[10,8320,8730],[11,8730,9630],[12,9630,10410],[13,10410,11060],[14,11060,12080],[15,12080,14350],[16,14350,14880],[17,14880,15810],[18,15810,19115]]}},{"name":"2:60","price":"(Ẹ rántí) nígbà tí (Ànábì) Mūsā tọrọ omi fún ìjọ rẹ̀. A sì sọ pé: “Fi ọ̀pá rẹ na òkúta.” Orísun omi méjìlá sì ṣàn jáde láti inú rẹ̀. Àwọn ènìyàn kọ̀ọ̀kan sì ti mọ ibùmu wọn. Ẹ jẹ, kí ẹ sì mu nínú arísìkí Allāhu. Kí ẹ sì má ṣèbàjẹ́ sórí ilẹ̀.","arabic":"۞ وَإِذِ ٱسۡتَسۡقَىٰ مُوسَىٰ لِقَوۡمِهِۦ فَقُلۡنَا ٱضۡرِب بِّعَصَاكَ ٱلۡحَجَرَۖ فَٱنفَجَرَتۡ مِنۡهُ ٱثۡنَتَا عَشۡرَةَ عَيۡنٗاۖ قَدۡ عَلِمَ كُلُّ أُنَاسٖ مَّشۡرَبَهُمۡۖ كُلُواْ وَٱشۡرَبُواْ مِن رِّزۡقِ ٱللَّهِ وَلَا تَعۡثَوۡاْ فِي ٱلۡأَرۡضِ مُفۡسِدِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":67,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"wa-idhi is'tasqā mūsā liqawmihi faqul'nā iḍ'rib biʿaṣāka al-ḥajara fa-infajarat min'hu ith'natā ʿashrata ʿaynan qad ʿalima kullu unāsin mashrabahum kulū wa-ish'rabū min riz'qi al-lahi walā taʿthaw fī al-arḍi muf'sidīna ","translations":["And when","asked (for) water","Musa","for his people","[so] We said","Strike","with your staff","the stone","Then gushed forth","from it","(of)","twelve","springs","Indeed","knew","all","(the) people","their drinking place","Eat","and drink","from","(the) provision (of)","Allah","and (do) not","act wickedly","in","the earth","spreading corruption","(60)"],"transliterationArr":["wa-idhi","is'tasqā","mūsā","liqawmihi","faqul'nā","iḍ'rib","biʿaṣāka","al-ḥajara","fa-infajarat","min'hu","ith'natā","ʿashrata","ʿaynan","qad","ʿalima","kullu","unāsin","mashrabahum","kulū","wa-ish'rabū","min","riz'qi","al-lahi","walā","taʿthaw","fī","al-arḍi","muf'sidīna",null],"verseTiming":[[1,0,710],[2,710,1670],[3,1670,2440],[4,2440,3560],[5,3560,4330],[6,4330,4840],[7,4840,6020],[8,6020,6720],[9,6720,9240],[10,9240,9830],[11,9830,10610],[12,10610,11400],[13,11400,12660],[14,12660,12910],[15,12910,13650],[16,13650,14200],[17,14200,14980],[18,14980,17320],[19,17320,17880],[20,17880,18770],[21,18770,19040],[22,19040,19830],[23,19830,20580],[24,20580,21110],[25,21110,21910],[26,21910,22160],[27,22160,22990],[28,22990,25895]]}},{"name":"2:61","price":"(Ẹ rántí) nígbà tí ẹ wí pé: “Mūsā, a ò níí ṣe ìfaradà lórí oúnjẹ ẹyọ kan. Nítorí náà, pe Olúwa rẹ fún wa. Kí Ó mú jáde fún wa nínú ohun tí ilẹ̀ ń hù jáde ní ewébẹ̀ rẹ̀ àti kùkúḿbà rẹ̀ àti fūmu rẹ̀ (wíìtì àti àlùbọ́sà áyù) àti ọkàbàbà rẹ̀ àti àlùbọ́sà rẹ̀.” (Ànábì Mūsā) sọ pé: “Ṣé ẹ̀yin yóò fi èyí tó yẹpẹrẹ pààrọ̀ èyí tí ó dára jùlọ ni? Ẹ sọ̀kalẹ̀ sínú ìlú (mìíràn). Dájúdájú ohun tí ẹ̀ ń bèèrè fún ń bẹ (níbẹ̀) fún yín.” A sì mú ìyẹpẹrẹ àti òṣì bá wọn. Wọ́n sì padà wálé pẹ̀lú ìbínú láti ọ̀dọ̀ Allāhu. Ìyẹn nítorí pé, dájúdájú wọ́n ń ṣàì gbàgbọ́ nínú àwọn āyah Allāhu, wọ́n sì ń pa àwọn Ànábì láì lẹ́tọ̀ọ́. Ìyẹn nítorí pé, wọ́n yapa (àṣẹ Allāhu), wọ́n sì ń tayọ ẹnu-ààlà.","arabic":"وَإِذۡ قُلۡتُمۡ يَٰمُوسَىٰ لَن نَّصۡبِرَ عَلَىٰ طَعَامٖ وَٰحِدٖ فَٱدۡعُ لَنَا رَبَّكَ يُخۡرِجۡ لَنَا مِمَّا تُنۢبِتُ ٱلۡأَرۡضُ مِنۢ بَقۡلِهَا وَقِثَّآئِهَا وَفُومِهَا وَعَدَسِهَا وَبَصَلِهَاۖ قَالَ أَتَسۡتَبۡدِلُونَ ٱلَّذِي هُوَ أَدۡنَىٰ بِٱلَّذِي هُوَ خَيۡرٌۚ ٱهۡبِطُواْ مِصۡرٗا فَإِنَّ لَكُم مَّا سَأَلۡتُمۡۗ وَضُرِبَتۡ عَلَيۡهِمُ ٱلذِّلَّةُ وَٱلۡمَسۡكَنَةُ وَبَآءُو بِغَضَبٖ مِّنَ ٱللَّهِۚ ذَٰلِكَ بِأَنَّهُمۡ كَانُواْ يَكۡفُرُونَ بِـَٔايَٰتِ ٱللَّهِ وَيَقۡتُلُونَ ٱلنَّبِيِّـۧنَ بِغَيۡرِ ٱلۡحَقِّۚ ذَٰلِكَ بِمَا عَصَواْ وَّكَانُواْ يَعۡتَدُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":68,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"wa-idh qul'tum yāmūsā lan naṣbira ʿalā ṭaʿāmin wāḥidin fa-ud'ʿu lanā rabbaka yukh'rij lanā mimmā tunbitu al-arḍu min baqlihā waqithāihā wafūmihā waʿadasihā wabaṣalihā qāla atastabdilūna alladhī huwa adnā bi-alladhī huwa khayrun ih'biṭū miṣ'ran fa-inna lakum mā sa-altum waḍuribat ʿalayhimu al-dhilatu wal-maskanatu wabāū bighaḍabin mina al-lahi dhālika bi-annahum kānū yakfurūna biāyāti al-lahi wayaqtulūna al-nabiyīna bighayri al-ḥaqi dhālika bimā ʿaṣaw wakānū yaʿtadūna ","translations":["And when","you said","O Musa","Never (will)","we endure","[on]","food","(of) one (kind)","so pray","for us","(to) your Lord","to bring forth","for us","out of what","grows","the earth","of","its herbs","[and] its cucumbers","[and] its garlic","[and] its lentils","and its onions","He said","Would you exchange","that which","[it]","(is) inferior","for that which","[it]","(is) better","Go down","(to) a city","so indeed","for you","(is) what","you have asked (for)","And were struck","on them","the humiliation","and the misery","and they drew on themselves","wrath","of","Allah","That (was)","because they","used to","disbelieve","in (the) Signs","(of) Allah","and kill","the Prophets","without (any)","[the] right","That","(was) because","they disobeyed","and they were","transgressing","(61)"],"transliterationArr":["wa-idh","qul'tum","yāmūsā","lan","naṣbira","ʿalā","ṭaʿāmin","wāḥidin","fa-ud'ʿu","lanā","rabbaka","yukh'rij","lanā","mimmā","tunbitu","al-arḍu","min","baqlihā","waqithāihā","wafūmihā","waʿadasihā","wabaṣalihā","qāla","atastabdilūna","alladhī","huwa","adnā","bi-alladhī","huwa","khayrun","ih'biṭū","miṣ'ran","fa-inna","lakum","mā","sa-altum","waḍuribat","ʿalayhimu","al-dhilatu","wal-maskanatu","wabāū","bighaḍabin","mina","al-lahi","dhālika","bi-annahum","kānū","yakfurūna","biāyāti","al-lahi","wayaqtulūna","al-nabiyīna","bighayri","al-ḥaqi","dhālika","bimā","ʿaṣaw","wakānū","yaʿtadūna",null],"verseTiming":[[1,0,580],[2,580,1430],[3,1430,2600],[4,2600,2860],[5,2860,4220],[6,4220,4680],[7,4680,6250],[8,6250,7810],[9,7810,8340],[10,8340,8890],[11,8890,10060],[12,10060,10690],[13,10690,11210],[14,11210,12040],[15,12040,12840],[16,12840,13380],[17,13380,14640],[18,14640,16050],[19,16050,16850],[20,16850,17720],[21,17720,18730],[22,18730,21250],[23,21250,23120],[24,23120,24170],[25,24170,25470],[26,25470,26520],[27,26520,28130],[28,28130,28950],[29,28950,29270],[30,29270,30080],[31,30080,31030],[32,31030,31450],[33,31450,33870],[34,33870,34820],[35,34820,36450],[36,36450,37720],[37,37720,38330],[38,38330,39450],[39,39450,40870],[40,40870,41780],[41,41780,42710],[42,42710,43810],[43,43810,45120],[44,45120,47390],[45,47390,48200],[46,48200,49190],[47,49190,52250],[48,52250,53030],[49,53030,54670],[50,54670,55400],[51,55400,56530],[52,56530,57740],[53,57740,58430],[54,58430,59730],[55,59730,61450],[56,61450,62220],[57,62220,63340],[58,63340,64110],[59,64110,64650],[60,64650,65280],[61,65280,66270],[62,66270,68865]]}},{"name":"2:62","price":"Dájúdájú àwọn tó gbàgbọ́ ní òdodo àti àwọn yẹhudi àti àwọn nasọ̄rọ̄ àti àwọn sọ̄bi’u; ẹnikẹ́ni tí ó bá ní ìgbàgbọ́ òdodo nínú Allāhu àti Ọjọ́ Ìkẹ́yìn, tí ó sì ṣe iṣẹ́ rere, ẹ̀san wọn ń bẹ fún wọn ní ọ̀dọ̀ Olúwa wọn. Kò sí ìbẹ̀rù fún wọn. Wọn kò sì níí banújẹ́.¹","arabic":"إِنَّ ٱلَّذِينَ ءَامَنُواْ وَٱلَّذِينَ هَادُواْ وَٱلنَّصَٰرَىٰ وَٱلصَّٰبِـِٔينَ مَنۡ ءَامَنَ بِٱللَّهِ وَٱلۡيَوۡمِ ٱلۡأٓخِرِ وَعَمِلَ صَٰلِحٗا فَلَهُمۡ أَجۡرُهُمۡ عِندَ رَبِّهِمۡ وَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":69,"juzNumber":1,"footnotes":"1. Irú āyah yìí wà nínú sūrah al-Mọ̄’idah; 5:69 àti sūrah al-Hajj; 22:17.\n Àgbọ́yé āyah yìí nìyí:\n Ìkíní: Kò sí ẹ̀sìn kan lọ́dọ̀ Allāhu àfi ’Islām (Ẹ wo sūrah āli-’Imrọ̄n; 3:19 àti 85 àti sūrah al-Mọ̄’dah; 5:3.)\n Ìkejì: Kò sí Ànábì tàbí Òjíṣẹ́ kan tí Allāhu rán níṣẹ́ rí pẹ̀lú ẹ̀sìn mìíràn àfi ’Islām. (Ẹ wo sūrah al-Baƙọrah; 2:130 -140, āl 'Imrọ̄n; 3:51-52 àti 84) Ẹ tún wo ìtọsẹ̀-ọ̀rọ̀ sūrah Yūnus; 10:90. \n Síwájú sí i, okùnfà ìsọ̀kalẹ̀ āyah yìí ni pé, nígbà tí Salmọ̄n Farisiy - kí Allāhu yọ́nú sí i - gba ’Islām, ó sọ̀rọ̀ nípa ìrun kíkí, ààwẹ̀ gbígbà àti ìjọ́sìn àwọn ènìyàn rẹ̀ kan tí wọ́n jẹ́ yẹ̀húdí àti nasọ̄rọ̄, àti ìrètí wọn nínú Ànábì ìkẹ́yìn tí wọ́n ń retí nígbà yẹn. Ó sọ̀rọ̀ wọn fún Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - dáadáa. Kò fi ẹbọ ṣíṣe kún un. Kò fi mẹ́ta lọ́kan kún un. Kò sì fi pípe ẹnì kan ní ọmọ Ọlọ́hun kún un. Ànábí - kí ìkẹ́ àti ọlà Allāhu máa bá a - kọ́kọ́ sọ pé, wọ́n máa wọ inú Iná. Inú Salmọ̄n bàjẹ́ gan-an. Lẹ́yìn náà, āyah yìí sọ̀kalẹ̀, ìyẹn āyah tí à ń tọsẹ rẹ̀ lọ́wọ́. \n Àlàyé lórí ìsọ̀kalẹ̀ āyah náà nìyí, ní ti èsì àkọ́kọ́ tí Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - fún Salmọ̄n, ìyẹn dúró lé àwọn āyah kan nínú al-Ƙur’ān tí ó ń fi rinlẹ̀ pé, ẹnikẹ́ni kò gbọ́dọ̀ tẹ̀lé ànábì kan kan mọ́ nínú àwọn Ànábì tó ṣíwájú Ànábì wa Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - níkété tí Allāhu ti gbé Ànábì wa - kí ìkẹ́ àti ọlà Allāhu máa bá a - dìde ní Òjíṣẹ́ sí gbogbo ayé ní ìbámu sí sūrah āl ‘Imrọ̄n; 3:31-32 àti al-’A‘rọ̄f; 7:158. Nínú hadīth Muslim láti ọ̀dọ̀ bàbá Huraerah - kí Allāhu yọ́nú sí i -, láti ọ̀dọ̀ Òjíṣẹ́ Allāhu - kí ìkẹ́ àti ọlà Allāhu máa bá a -, dájúdájú Òjíṣẹ́ Allāhu sọ pé: “Èmi fi Ẹni tí ẹ̀mí Muhammad wà ní ọwọ́ Rẹ̀ búra; ẹnì kan nínú ìjọ yìí, yẹhudi tàbí nasọ̄rọ̄, kò níí gbọ́ nípa mi, lẹ́yìn náà kí ó kú láì gbàgbọ́ nínú ohun tí Wọ́n fi rán mi níṣẹ́, àfi kí ó wà nínú àwọn èrò Iná.” \n Ní ti āyah tí à ń tọsẹ rẹ̀ lọ́wọ́ àti àwọn irú rẹ̀ méjèèjì tí mo tọ́ka sí nínú sūrah al-Mọ̄’idah; 5:69 àti sūrah al- Hajj; 22:17, ìwọ̀nyẹn dúró lé ìdájọ́ ẹni tí ó kú nínú wọn lórí ìgbàgbọ́ òdodo nínú Allāhu pé Òun ni Ọlọ́hun ọ̀kan ṣoṣo tí a gbọ́dọ̀ jọ́sìn fún ní ọ̀nà òdodo àti iṣẹ́ rere nípa títẹ̀lé Ànábì àsìkò tiwọn ṣíwájú ìgbédìde Ànábì mìíràn. \n Kíyè sí i, èyí kò wá túmọ̀ sí pé, ẹ̀sìn kan ń jẹ́ yẹhūdiyyah tàbí nasrọ̄niyyah tàbí sọ̄bi’iyyah ní ọ̀dọ̀ Allāhu. Ohun tí ó ṣẹlẹ̀ ni pé, ni ìbẹ̀rẹ̀ pẹ̀pẹ̀ àwọn orúkọ wọ̀nyẹn, wọ́n jẹ́ àlàjẹ́ fún àwọn mùsùlùmí lẹ́yìn ìpapòdà Ànábì Mūsā - kí ọlà Allāhu máa bá a - àti lẹ́yìn gbígbé Ànábì ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - gun sánmọ̀ lọ. Àmọ́ wọ́n padà gbé orúkọ ’Islām jù sílẹ̀ pátápátá, wọ́n sì fi àwọn àlàjẹ́ wọ̀nyẹn rọ́pò rẹ̀. Lẹ́yìn náà, olúkùlùkù wọn yí ẹ̀sìn ’Islām wọn padà sí ohun mìíràn pátápátá. Ìgbàgbọ́ wọn sì padà di àìgbàgbọ́ mọ́ wọn lọ́wọ́. Èyí ni Allāhu - subhānahu wa ta‘ālā - tọ́ka sí nínú sūrah āl ‘Imrọ̄n; 3:19, sūrah aṣ-Ṣūrọ̄; 42:13-14, al-Jāthiyah; 45:16-17 àti sūrah al-Bayyinnah; 98:1-8. Ẹ tún ka āyah 111-112 níwájú nínú sūrah al Baƙọrah.\n Ẹ̀kọ́ pàtàkì tí āyah tí à ń tọsẹ̀ rẹ̀ lọ́wọ́ fẹ́ kọ́ àwa mùsùlùmí ni ìwọ̀nyí:\n Ìkíní: Kí á má ṣe fi orúkọ mìíràn jìrọ̀ orúkọ ẹ̀sìn wa, ’Islām. \n Ìkejì: Bí a bá tún sọra wa ní orúkọ àlàjẹ́ mìíràn lẹ́yìn “mùsùlùmí”, ohun tí ń jẹ́ “Islām” kò gbọ́dọ̀ kúrò nínú ayé wa.\n Ìkẹta: Ọ̀tọ̀ ni orúkọ, ọ̀tọ̀ ni ìgbàgbọ́ àti iṣẹ́. Méjèèjì ni a bùkátà sí. Àmọ́ ìgbàgbọ́ àti iṣẹ́ ló máa sọni ní orúkọ. Nítorí náà, bí ènìyàn bá pe ara rẹ̀ ní mùsùlùmí lórí ahọ́n, àmọ́ kò ṣe ohun tí ń jẹ́ ’Islām níbi àdìsọ́kàn àti ìjọ́sìn àti ìwà rere, pípe ara rẹ̀ ní mùsùlùmí kò níí rọ̀ ọ́ lọ́rọ̀ kan kan níbi ìyà Iná. Èyí ló mú kí “wa lathīna āmọnū” jẹyọ pọ̀ pẹ̀lú àwọn yẹ̀húdí àti àwọn nasọ̄rọ̄ nínú āyah náà. W-Allāhu ’a‘lam.","lang":"yo","meta":{"transliteration":"inna alladhīna āmanū wa-alladhīna hādū wal-naṣārā wal-ṣābiīna man āmana bil-lahi wal-yawmi al-ākhiri waʿamila ṣāliḥan falahum ajruhum ʿinda rabbihim walā khawfun ʿalayhim walā hum yaḥzanūna ","translations":["Indeed","those who","believed","and those who","became Jews","and the Christians","and the Sabians ","who","believed","in Allah","and the Day","[the] Last","and did","righteous deeds","so for them","their reward","(is) with","their Lord","and no","fear","on them","and not","they","will grieve","(62)"],"transliterationArr":["inna","alladhīna","āmanū","wa-alladhīna","hādū","wal-naṣārā","wal-ṣābiīna","man","āmana","bil-lahi","wal-yawmi","al-ākhiri","waʿamila","ṣāliḥan","falahum","ajruhum","ʿinda","rabbihim","walā","khawfun","ʿalayhim","walā","hum","yaḥzanūna",null],"verseTiming":[[1,0,1290],[2,1290,2220],[3,2220,3270],[4,3270,4280],[5,4280,5150],[6,5150,7340],[7,7340,8820],[8,8820,9160],[9,9160,9850],[10,9850,10950],[11,10950,11850],[12,11850,12780],[13,12780,13470],[14,13470,15050],[15,15050,15760],[16,15760,17150],[17,17150,17880],[18,17880,18820],[19,18820,19980],[20,19980,20930],[21,20930,21450],[22,21450,22180],[23,22180,23190],[24,23190,23780],[25,23780,24130],[26,24130,26865]]}},{"name":"2:63","price":"Ẹ rántí nígbà tí A gba àdéhùn yín, A sì gbé àpáta wá sókè orí yín, (A sì sọ pé): “Ẹ gbá ohun tí A fún yín mú dáradára, kí ẹ sì rántí ohun tó wà nínú rẹ̀, nítorí kí ẹ lè bẹ̀rù (Allāhu).","arabic":"وَإِذۡ أَخَذۡنَا مِيثَٰقَكُمۡ وَرَفَعۡنَا فَوۡقَكُمُ ٱلطُّورَ خُذُواْ مَآ ءَاتَيۡنَٰكُم بِقُوَّةٖ وَٱذۡكُرُواْ مَا فِيهِ لَعَلَّكُمۡ تَتَّقُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":70,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"wa-idh akhadhnā mīthāqakum warafaʿnā fawqakumu al-ṭūra khudhū mā ātaynākum biquwwatin wa-udh'kurū mā fīhi laʿallakum tattaqūna ","translations":["And when","We took","your covenant","and We raised","over you","the mount","Hold","what","We have given you","with strength","and remember","what","(is) in it","perhaps you","(would become) righteous","(63)"],"transliterationArr":["wa-idh","akhadhnā","mīthāqakum","warafaʿnā","fawqakumu","al-ṭūra","khudhū","mā","ātaynākum","biquwwatin","wa-udh'kurū","mā","fīhi","laʿallakum","tattaqūna",null],"verseTiming":[[1,0,630],[2,630,1610],[3,1610,2940],[4,2940,4040],[5,4040,5000],[6,5000,5760],[7,5760,6320],[8,6320,7870],[9,7870,10110],[10,10110,11950],[11,11950,12950],[12,12950,14270],[13,14270,14610],[14,14610,15270],[15,15270,16390],[16,16390,18965]]}},{"name":"2:64","price":"Lẹ́yìn náà, ẹ pẹ̀yìndà lẹ́yìn ìyẹn. Tí kì í bá ṣe oore àjùlọ Allāhu àti àánú Rẹ̀ lórí yín, ẹ̀yin ìbá wà nínú ẹni òfò.","arabic":"ثُمَّ تَوَلَّيۡتُم مِّنۢ بَعۡدِ ذَٰلِكَۖ فَلَوۡلَا فَضۡلُ ٱللَّهِ عَلَيۡكُمۡ وَرَحۡمَتُهُۥ لَكُنتُم مِّنَ ٱلۡخَٰسِرِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":71,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"thumma tawallaytum min baʿdi dhālika falawlā faḍlu al-lahi ʿalaykum waraḥmatuhu lakuntum mina al-khāsirīna ","translations":["Then","you turned away","from","after","that","So if not","(for the) Grace","(of) Allah","upon you","and His Mercy","surely you would have been","of","the losers","(64)"],"transliterationArr":["thumma","tawallaytum","min","baʿdi","dhālika","falawlā","faḍlu","al-lahi","ʿalaykum","waraḥmatuhu","lakuntum","mina","al-khāsirīna",null],"verseTiming":[[1,0,1410],[2,1410,2860],[3,2860,4880],[4,4880,5490],[5,5490,6630],[6,6630,7540],[7,7540,8040],[8,8040,8920],[9,8920,9870],[10,9870,11140],[11,11140,12850],[12,12850,13650],[13,13650,16275]]}},{"name":"2:65","price":"Dájúdájú ẹ mọ àwọn tó kọjá ẹnu-ààlà nínú yín nípa ọjọ́ Sabt. A sì sọ fún wọn pé: “Ẹ di ọ̀bọ, ẹni-ìgbéjìnnà sí ìkẹ́ (ẹni àbùkù ẹni yẹpẹrẹ).”","arabic":"وَلَقَدۡ عَلِمۡتُمُ ٱلَّذِينَ ٱعۡتَدَوۡاْ مِنكُمۡ فِي ٱلسَّبۡتِ فَقُلۡنَا لَهُمۡ كُونُواْ قِرَدَةً خَٰسِـِٔينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":72,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"walaqad ʿalim'tumu alladhīna iʿ'tadaw minkum fī al-sabti faqul'nā lahum kūnū qiradatan khāsiīna ","translations":["And indeed","you knew","those who","transgressed","among you","in","the (matter of) Sabbath","So We said","to them","Be","apes","despised","(65)"],"transliterationArr":["walaqad","ʿalim'tumu","alladhīna","iʿ'tadaw","minkum","fī","al-sabti","faqul'nā","lahum","kūnū","qiradatan","khāsiīna",null],"verseTiming":[[1,0,760],[2,760,1690],[3,1690,2630],[4,2630,3420],[5,3420,4570],[6,4570,4810],[7,4810,5570],[8,5570,6560],[9,6560,7070],[10,7070,7820],[11,7820,8790],[12,8790,11245]]}},{"name":"2:66","price":"A sì ṣe é ní ìyà (àríkọ́gbọ́n) fún ẹni tó ṣojú rẹ̀ àti ẹni tó ń bọ̀ lẹ́yìn rẹ̀. (Ó tún jẹ́) wáàsí (ìṣítí) fún àwọn olùbẹ̀rù (Allāhu).","arabic":"فَجَعَلۡنَٰهَا نَكَٰلٗا لِّمَا بَيۡنَ يَدَيۡهَا وَمَا خَلۡفَهَا وَمَوۡعِظَةٗ لِّلۡمُتَّقِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":73,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"fajaʿalnāhā nakālan limā bayna yadayhā wamā khalfahā wamawʿiẓatan lil'muttaqīna ","translations":["So We made it","a deterrent punishment","for those","(in) front","(of) them","and those","after them","and an admonition","for those who fear (Allah)","(66)"],"transliterationArr":["fajaʿalnāhā","nakālan","limā","bayna","yadayhā","wamā","khalfahā","wamawʿiẓatan","lil'muttaqīna",null],"verseTiming":[[1,0,1650],[2,1650,2450],[3,2450,3190],[4,3190,3700],[5,3700,4730],[6,4730,5270],[7,5270,6430],[8,6430,7660],[9,7660,11485]]}},{"name":"2:67","price":"(Ẹ rántí) nígbà tí (Ànábì) Mūsā sọ fún ìjọ rẹ̀ pé: “Dájúdájú Allāhu ń pa yín ní àṣẹ pé kí ẹ pa abo màálù kan.” Wọ́n wí pé: “Ṣé ò ń fi wá ṣe yẹ̀yẹ́ ni!” Ó sọ pé: “Mò ń sádi Allāhu kúrò níbi kí n̄g jẹ́ ara àwọn òpè.”","arabic":"وَإِذۡ قَالَ مُوسَىٰ لِقَوۡمِهِۦٓ إِنَّ ٱللَّهَ يَأۡمُرُكُمۡ أَن تَذۡبَحُواْ بَقَرَةٗۖ قَالُوٓاْ أَتَتَّخِذُنَا هُزُوٗاۖ قَالَ أَعُوذُ بِٱللَّهِ أَنۡ أَكُونَ مِنَ ٱلۡجَٰهِلِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":74,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"wa-idh qāla mūsā liqawmihi inna al-laha yamurukum an tadhbaḥū baqaratan qālū atattakhidhunā huzuwan qāla aʿūdhu bil-lahi an akūna mina al-jāhilīna ","translations":["And when","said","Musa","to his people","Indeed","Allah","commands you","that","you slaughter","a cow","They said","Do you take us","(in) ridicule","He said","I seek refuge","in Allah","that","I be","among","the ignorant","(67)"],"transliterationArr":["wa-idh","qāla","mūsā","liqawmihi","inna","al-laha","yamurukum","an","tadhbaḥū","baqaratan","qālū","atattakhidhunā","huzuwan","qāla","aʿūdhu","bil-lahi","an","akūna","mina","al-jāhilīna",null],"verseTiming":[[1,0,720],[2,720,1330],[3,1330,2090],[4,2090,4610],[5,4610,5870],[6,5870,6650],[7,6650,7910],[8,7910,9040],[9,9040,9990],[10,9990,11230],[11,11230,13210],[12,13210,14740],[13,14740,15660],[14,15660,16700],[15,16700,17460],[16,17460,18430],[17,18430,18770],[18,18770,19580],[19,19580,19870],[20,19870,22485]]}},{"name":"2:68","price":"Wọ́n wí pé: “Pe Olúwa rẹ fún wa, kí Ó ṣàlàyé irú èyí tí ó bá jẹ́ fún wa.” Ó sọ pé: “Dájúdájú Ó ń sọ pé abo màálù ni. Kò níí jẹ́ ògbólógbòó, kò sì níí jẹ́ gódógbó. Ọdún rẹ̀ máa wà láààrin (méjèèjì) yẹn. Nítorí náà, ẹ ṣe ohun tí wọ́n ń pa yín láṣẹ.”","arabic":"قَالُواْ ٱدۡعُ لَنَا رَبَّكَ يُبَيِّن لَّنَا مَا هِيَۚ قَالَ إِنَّهُۥ يَقُولُ إِنَّهَا بَقَرَةٞ لَّا فَارِضٞ وَلَا بِكۡرٌ عَوَانُۢ بَيۡنَ ذَٰلِكَۖ فَٱفۡعَلُواْ مَا تُؤۡمَرُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":75,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"qālū ud'ʿu lanā rabbaka yubayyin lanā mā hiya qāla innahu yaqūlu innahā baqaratun lā fāriḍun walā bik'run ʿawānun bayna dhālika fa-if'ʿalū mā tu'marūna ","translations":["They said","Pray","for us","(to) your Lord","to make clear","to us","what","it (is)","He said","Indeed, He","says","[Indeed] it","(is) a cow","not","old","and not","young","middle aged","between","that","so do","what","you are commanded","(68)"],"transliterationArr":["qālū","ud'ʿu","lanā","rabbaka","yubayyin","lanā","mā","hiya","qāla","innahu","yaqūlu","innahā","baqaratun","lā","fāriḍun","walā","bik'run","ʿawānun","bayna","dhālika","fa-if'ʿalū","mā","tu'marūna",null],"verseTiming":[[1,0,760],[2,760,1130],[3,1130,1660],[4,1660,2520],[5,2520,3300],[6,3300,4070],[7,4070,4430],[8,4430,5330],[9,5330,5980],[10,5980,7280],[11,7280,8140],[12,8140,9560],[13,9560,10450],[14,10450,10920],[15,10920,12310],[16,12310,12810],[17,12810,13540],[18,13540,15060],[19,15060,15660],[20,15660,16790],[21,16790,17690],[22,17690,18090],[23,18090,20635]]}},{"name":"2:69","price":"Wọ́n wí pé: “Pe Olúwa rẹ fún wa, kí Ó ṣàlàyé irú èyí tí àwọ̀ rẹ̀ bá jẹ́ fún wa.” Ó sọ pé: “Dájúdájú Ó ń sọ pé abo màálù, aláwọ̀ omi-ọsàn ni. Àwọ̀ rẹ̀ sì máa mọ́ fónífóní, tí ó máa dùn-ún wò lójú àwọn olùwòran.","arabic":"قَالُواْ ٱدۡعُ لَنَا رَبَّكَ يُبَيِّن لَّنَا مَا لَوۡنُهَاۚ قَالَ إِنَّهُۥ يَقُولُ إِنَّهَا بَقَرَةٞ صَفۡرَآءُ فَاقِعٞ لَّوۡنُهَا تَسُرُّ ٱلنَّٰظِرِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":76,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"qālū ud'ʿu lanā rabbaka yubayyin lanā mā lawnuhā qāla innahu yaqūlu innahā baqaratun ṣafrāu fāqiʿun lawnuhā tasurru al-nāẓirīna ","translations":["They said","Pray","for us","(to) your Lord","to make clear","to us","what","(is) its color","He said","Indeed, He","says","'[Indeed] it is","a cow","yellow","bright","(in) its color","pleasing","(to) those who see (it).'","(69)"],"transliterationArr":["qālū","ud'ʿu","lanā","rabbaka","yubayyin","lanā","mā","lawnuhā","qāla","innahu","yaqūlu","innahā","baqaratun","ṣafrāu","fāqiʿun","lawnuhā","tasurru","al-nāẓirīna",null],"verseTiming":[[1,0,690],[2,690,1070],[3,1070,1680],[4,1680,2420],[5,2420,3350],[6,3350,4000],[7,4000,4400],[8,4400,5460],[9,5460,6470],[10,6470,7880],[11,7880,8720],[12,8720,10080],[13,10080,11630],[14,11630,14240],[15,14240,14990],[16,14990,16150],[17,16150,16980],[18,16980,20195]]}},{"name":"2:70","price":"Wọ́n wí pé: “Pe Olúwa rẹ fún wa, kí Ó ṣàlàyé irú èyí tí ó bá jẹ́ fún wa sẹ́.” Dájúdájú àwọn abo màálù jọra wọn lójú wa. Àti pé dájúdájú, tí Allāhu bá fẹ́, àwa máa mọ̀nà (tí a ó gbà rí i.)”","arabic":"قَالُواْ ٱدۡعُ لَنَا رَبَّكَ يُبَيِّن لَّنَا مَا هِيَ إِنَّ ٱلۡبَقَرَ تَشَٰبَهَ عَلَيۡنَا وَإِنَّآ إِن شَآءَ ٱللَّهُ لَمُهۡتَدُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":77,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"qālū ud'ʿu lanā rabbaka yubayyin lanā mā hiya inna al-baqara tashābaha ʿalaynā wa-innā in shāa al-lahu lamuh'tadūna ","translations":["They said","Pray","for us","(to) your Lord","to make clear","to us","what","it (is)","Indeed","[the] cows","look alike","to us","And indeed we","if","wills","Allah","(will) surely be those who are guided","(70)"],"transliterationArr":["qālū","ud'ʿu","lanā","rabbaka","yubayyin","lanā","mā","hiya","inna","al-baqara","tashābaha","ʿalaynā","wa-innā","in","shāa","al-lahu","lamuh'tadūna",null],"verseTiming":[[1,0,710],[2,710,1150],[3,1150,1630],[4,1630,2440],[5,2440,3340],[6,3340,4020],[7,4020,4370],[8,4370,4770],[9,4770,5740],[10,5740,6560],[11,6560,7560],[12,7560,8540],[13,8540,11110],[14,11110,11870],[15,11870,13950],[16,13950,14770],[17,14770,17985]]}},{"name":"2:71","price":"Ó sọ pé: “Dájúdájú Ó ń sọ pé abo màálù ni. Kò níí jẹ́ màálù yẹpẹrẹ tí ó ń kọ ebè sórí ilẹ̀ (tó ń ro oko) àti èyí tí ó ń fomi wọ́n oko. Ó máa ní àlàáfíà, kò sì níí ní àbàwọ́n kan lára.” Wọ́n wí pé: “Nísinsìn yìí lo mú òdodo wá.” Wọ́n sì pa màálù náà. Wọ́n fẹ́ẹ̀ má ṣe é mọ́.","arabic":"قَالَ إِنَّهُۥ يَقُولُ إِنَّهَا بَقَرَةٞ لَّا ذَلُولٞ تُثِيرُ ٱلۡأَرۡضَ وَلَا تَسۡقِي ٱلۡحَرۡثَ مُسَلَّمَةٞ لَّا شِيَةَ فِيهَاۚ قَالُواْ ٱلۡـَٰٔنَ جِئۡتَ بِٱلۡحَقِّۚ فَذَبَحُوهَا وَمَا كَادُواْ يَفۡعَلُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":78,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"qāla innahu yaqūlu innahā baqaratun lā dhalūlun tuthīru al-arḍa walā tasqī al-ḥartha musallamatun lā shiyata fīhā qālū al-āna ji'ta bil-ḥaqi fadhabaḥūhā wamā kādū yafʿalūna ","translations":["He said","Indeed, He","says","[Indeed] it","(is) a cow","not","trained","to plough","the earth","and not","water","the field","sound","no","blemish","in it","They said","Now","you have come","with the truth","So they slaughtered it","and not","they were near","(to) doing (it)","(71)"],"transliterationArr":["qāla","innahu","yaqūlu","innahā","baqaratun","lā","dhalūlun","tuthīru","al-arḍa","walā","tasqī","al-ḥartha","musallamatun","lā","shiyata","fīhā","qālū","al-āna","ji'ta","bil-ḥaqi","fadhabaḥūhā","wamā","kādū","yafʿalūna",null],"verseTiming":[[1,0,730],[2,730,2140],[3,2140,3040],[4,3040,4380],[5,4380,5210],[6,5210,5760],[7,5760,6810],[8,6810,7860],[9,7860,8760],[10,8760,9210],[11,9210,9860],[12,9860,10630],[13,10630,11840],[14,11840,12290],[15,12290,12940],[16,12940,13810],[17,13810,14760],[18,14760,15470],[19,15470,16030],[20,16030,17380],[21,17380,18610],[22,18610,19150],[23,19150,19980],[24,19980,22385]]}},{"name":"2:72","price":"(Ẹ rántí) nígbà tí ẹ pa ẹnì kan, ẹ sì ń tì í síra yín. Allāhu yó sì ṣàfi hàn ohun tí ẹ̀ ń fi pamọ́.","arabic":"وَإِذۡ قَتَلۡتُمۡ نَفۡسٗا فَٱدَّٰرَٰءۡتُمۡ فِيهَاۖ وَٱللَّهُ مُخۡرِجٞ مَّا كُنتُمۡ تَكۡتُمُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":79,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"wa-idh qataltum nafsan fa-iddāratum fīhā wal-lahu mukh'rijun mā kuntum taktumūna ","translations":["And when","you killed","a man","then you disputed","concerning it","but Allah","(is) the One Who brought forth","what","you were","concealing","(72)"],"transliterationArr":["wa-idh","qataltum","nafsan","fa-iddāratum","fīhā","wal-lahu","mukh'rijun","mā","kuntum","taktumūna",null],"verseTiming":[[1,0,690],[2,690,1700],[3,1700,3030],[4,3030,4650],[5,4650,5430],[6,5430,6440],[7,6440,7240],[8,7240,8240],[9,8240,9840],[10,9840,12935]]}},{"name":"2:73","price":"Nítorí náà, A sọ pé: “Ẹ fi burè kan (lára màálù) lu (òkú náà).”¹ Báyẹn ni Allāhu ṣe ń sọ òkú di alààyè. Ó sì ń fi àwọn àmì Rẹ̀ hàn yín, nítorí kí ẹ lè ṣe làákàyè.","arabic":"فَقُلۡنَا ٱضۡرِبُوهُ بِبَعۡضِهَاۚ كَذَٰلِكَ يُحۡيِ ٱللَّهُ ٱلۡمَوۡتَىٰ وَيُرِيكُمۡ ءَايَٰتِهِۦ لَعَلَّكُمۡ تَعۡقِلُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":80,"juzNumber":1,"footnotes":"1. Wọ́n ṣe bẹ́ẹ̀. Òkú náà sì ta jí. Ó tú àṣírí ẹni tí ó pa á. Ó sì kú padà. Báyìí ni Ànábì Mūsā - kí ọlà Allāhu máa bá a - ṣe jí òkú dìde pẹ̀lú ìyọ̀ǹda Allāhu - subhānahu wa ta‘ālā -.","lang":"yo","meta":{"transliteration":"faqul'nā iḍ'ribūhu bibaʿḍihā kadhālika yuḥ'yī al-lahu al-mawtā wayurīkum āyātihi laʿallakum taʿqilūna ","translations":["So We said","Strike him","with a part of it","Like this","revives","Allah","the dead","and shows you","His Signs","perhaps you may","use your intellect","(73)"],"transliterationArr":["faqul'nā","iḍ'ribūhu","bibaʿḍihā","kadhālika","yuḥ'yī","al-lahu","al-mawtā","wayurīkum","āyātihi","laʿallakum","taʿqilūna",null],"verseTiming":[[1,0,920],[2,920,2000],[3,2000,3220],[4,3220,4600],[5,4600,5230],[6,5230,5980],[7,5980,6960],[8,6960,8140],[9,8140,9490],[10,9490,10680],[11,10680,13255]]}},{"name":"2:74","price":"Lẹ́yìn náà, ọkàn yín le lẹ́yìn ìyẹn. Ó sì dà bí òkúta tàbí líle tó lágbára jù bẹ́ẹ̀ lọ.¹ Dájúdájú ó ń bẹ nínú àwọn òkúta tí àwọn odò ń ṣàn jáde láti inú rẹ̀. Dájúdájú ó tún ń bẹ nínú wọn tí ó máa sán kànkàn. Omi sì máa jáde láti inú rẹ̀. Dájúdájú ó tún ń bẹ nínú wọn tí ó ń wó lulẹ̀ gbì fún ìpáyà Allāhu. Allāhu kò sì níí gbàgbé ohun tí ẹ̀ ń ṣe níṣẹ́.","arabic":"ثُمَّ قَسَتۡ قُلُوبُكُم مِّنۢ بَعۡدِ ذَٰلِكَ فَهِيَ كَٱلۡحِجَارَةِ أَوۡ أَشَدُّ قَسۡوَةٗۚ وَإِنَّ مِنَ ٱلۡحِجَارَةِ لَمَا يَتَفَجَّرُ مِنۡهُ ٱلۡأَنۡهَٰرُۚ وَإِنَّ مِنۡهَا لَمَا يَشَّقَّقُ فَيَخۡرُجُ مِنۡهُ ٱلۡمَآءُۚ وَإِنَّ مِنۡهَا لَمَا يَهۡبِطُ مِنۡ خَشۡيَةِ ٱللَّهِۗ وَمَا ٱللَّهُ بِغَٰفِلٍ عَمَّا تَعۡمَلُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":81,"juzNumber":1,"footnotes":"1. Nínú èdè Lárúbáwá, ìtúmọ̀ “ ’ao” ni “tàbí”. Nínú al-Ƙur’ān alápọ̀n-ọ́nlé, kò sì sí ọ̀rọ̀ tàbí-ṣùgbọ́n tó ń bí iyèméjì nínú rẹ̀. Nítorí náà, ẹ wo àwọn ìtúmọ̀ ìjìnlẹ̀ fún“ ’ao”.\n (Ìkíní) Lárúbáwá ń lo “ ’ao” láti ṣe àfihàn ìwọ̀fún àti ìṣẹ̀ṣà láààrin n̄ǹkan méjì tàbí jù bẹ́ẹ̀ lọ. \n (Ìkejì) Wọ́n ń lo “ ’ao” nígbà tí òǹsọ̀rọ̀ bá ń ṣiyèméjì nípa ọ̀rọ̀ tí ó ń sọ. Ìlò yìí kò sì lè ṣẹlẹ̀ nínú ọ̀rọ̀ Allāhu - subhānahu wa ta‘ālā - àti ọ̀rọ̀ Òjíṣẹ́ Rẹ̀ - kí ìkẹ́ àti ọlà Allāhu máa bá a -. \n (Ìkẹta) Wọ́n ń lo “ ’ao” nígbà tí òǹsọ̀rọ̀ kò ṣiyèméjì nípa ohun tí ó ń sọ, àmọ́ tí kò fẹ́ kí olùbásọ̀rọ̀ rẹ̀ mọ pàtó nípa ọ̀rọ̀ náà. Àpẹ̀ẹrẹ ìlò yìí ni ìtúmọ̀ “ ’ao” tó jẹyọ nínú sūrah as-Sọffāt; 37:147. \n (Ìkẹrin) Wọ́n ń lo “’ao” nígbà tí òǹsọ̀rọ̀ kò ṣiyèméjì nípa ohun tí ó ń sọ, tí ó sì ti fún olùbásọ̀rọ̀ rẹ̀ ní àǹfààní láti mọ pàtó àti òkodoro ọ̀rọ̀ náà, àmọ́ tí olùbásọ̀rọ̀ ń ṣe ìṣe aláìníkan-ánṣe tàbí aláìgbàgbọ́. Àpẹ̀ẹrẹ ìlò yìí ni ìtúmọ̀ “ ’ao” tó jẹyọ nínú sūrah Saba’; 34:24. \n (Ìkarùn-ún) Wọ́n ń lo “ ’ao” láààrin ọ̀rọ̀ méjì tàbí jù bẹ́ẹ̀ lọ tó dúró fún ọ̀kan-ùn. Àpẹ̀ẹrẹ ìlò yìí ni ìtúmọ̀ “ ’ao” tó jẹyọ nínú sūrah al-’Isrọ̄’; 17:110. \n (Ìkẹfà) Wọ́n ń lo “wāwu-l-‘atf” fún “ ’ao” tó ń túmọ̀ sí “tàbí”. Àpẹ̀ẹrẹ ìlò yìí ni ìtúmọ̀ “wāwu-l-‘atf” tó jẹyọ nínú sūrah an-Nisā’; 4:3 àti Fātir; 35:1. \n (Ìkejè) Wọ́n ń lo “ ’ao” fún “bal” - “rárá” - nígbà tí òǹsọ̀rọ̀ bá fẹ́ bàbàrà ọ̀rọ̀. Àpẹ̀ẹrẹ ìlò yìí ni ìtúmọ̀ “ ’ao” tó jẹyọ nínú sūrah tí à ń tọsẹ̀ rẹ̀ lọ́wọ́. Ìyẹn ni pé, ọkàn àwọn ọmọ ’Isrọ̄’īl ìbá le bí òkúta ṣe le, ìrètí gbígba òdodo gbọ́ ìbá wà fún wọn nítorí pé, bí òkúta ṣe le tó, ó ń sán, ó ń fọ́, tí omi àti n̄ǹkan rere mìíràn ń tibẹ̀ jáde. Àmọ́ ọkàn wọn kò rí bẹ́ẹ̀ rárá. Ńṣe ni ọkàn wọn le ju òkúta. Allāhu - subhānahu wa ta‘ālā - sì ni Alámọ̀tán nípa ohun tó wà nínú igbá-àyà ẹ̀dá.","lang":"yo","meta":{"transliteration":"thumma qasat qulūbukum min baʿdi dhālika fahiya kal-ḥijārati aw ashaddu qaswatan wa-inna mina al-ḥijārati lamā yatafajjaru min'hu al-anhāru wa-inna min'hā lamā yashaqqaqu fayakhruju min'hu al-māu wa-inna min'hā lamā yahbiṭu min khashyati al-lahi wamā al-lahu bighāfilin ʿammā taʿmalūna ","translations":["Then","hardened","your hearts","from","after","that","so they","(became) like [the] stones","or","stronger","(in) hardness","And indeed","from","the stones","certainly (there are some) which","gush forth","from it","[the] rivers","and indeed","from them","certainly (there are some) which","split","so comes out","from it","[the] water","and indeed","from them","certainly (there are some) which","fall down","from","fear","(of) Allah","And not","(is) Allah","unaware","of what","you do","(74)"],"transliterationArr":["thumma","qasat","qulūbukum","min","baʿdi","dhālika","fahiya","kal-ḥijārati","aw","ashaddu","qaswatan","wa-inna","mina","al-ḥijārati","lamā","yatafajjaru","min'hu","al-anhāru","wa-inna","min'hā","lamā","yashaqqaqu","fayakhruju","min'hu","al-māu","wa-inna","min'hā","lamā","yahbiṭu","min","khashyati","al-lahi","wamā","al-lahu","bighāfilin","ʿammā","taʿmalūna",null],"verseTiming":[[1,0,1230],[2,1230,1840],[3,1840,3040],[4,3040,4740],[5,4740,5400],[6,5400,6140],[7,6140,6690],[8,6690,8080],[9,8080,8440],[10,8440,9240],[11,9240,10480],[12,10480,11870],[13,11870,12240],[14,12240,13520],[15,13520,14040],[16,14040,15290],[17,15290,15830],[18,15830,19530],[19,19530,20890],[20,20890,21720],[21,21720,22250],[22,22250,23410],[23,23410,24450],[24,24450,24960],[25,24960,27590],[26,27590,29390],[27,29390,30140],[28,30140,30730],[29,30730,31510],[30,31510,31830],[31,31830,32650],[32,32650,35280],[33,35280,35630],[34,35630,36490],[35,36490,37570],[36,37570,39100],[37,39100,42455]]}},{"name":"2:75","price":"Ṣé ẹ̀ ń rankàn pé wọn yóò gbà yín gbọ́, nígbà tí ó jẹ́ pé igun kan nínú wọn kúkú ń gbọ́ ọ̀rọ̀ Allāhu. Lẹ́yìn náà, wọ́n á yí i padà sódì lẹ́yìn tí wọ́n ti gbọ́ ọ yé; wọ́n sì mọ̀.","arabic":"۞ أَفَتَطۡمَعُونَ أَن يُؤۡمِنُواْ لَكُمۡ وَقَدۡ كَانَ فَرِيقٞ مِّنۡهُمۡ يَسۡمَعُونَ كَلَٰمَ ٱللَّهِ ثُمَّ يُحَرِّفُونَهُۥ مِنۢ بَعۡدِ مَا عَقَلُوهُ وَهُمۡ يَعۡلَمُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":82,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"afataṭmaʿūna an yu'minū lakum waqad kāna farīqun min'hum yasmaʿūna kalāma al-lahi thumma yuḥarrifūnahu min baʿdi mā ʿaqalūhu wahum yaʿlamūna ","translations":["Do you hope","that","they will believe","[for] you","while indeed","(there) has been","a party","of them","(who used to) hear","(the) words","(of) Allah","then","they distort it","from","after","[what]","they understood it","while they","know","(75)"],"transliterationArr":["afataṭmaʿūna","an","yu'minū","lakum","waqad","kāna","farīqun","min'hum","yasmaʿūna","kalāma","al-lahi","thumma","yuḥarrifūnahu","min","baʿdi","mā","ʿaqalūhu","wahum","yaʿlamūna",null],"verseTiming":[[1,0,1850],[2,1850,2180],[3,2180,3670],[4,3670,4300],[5,4300,4840],[6,4840,5390],[7,5390,6240],[8,6240,7680],[9,7680,8790],[10,8790,9500],[11,9500,10340],[12,10340,11650],[13,11650,13530],[14,13530,14880],[15,14880,16660],[16,16660,17660],[17,17660,18230],[18,18230,18590],[19,18590,19630],[20,19630,20140],[21,20140,22525]]}},{"name":"2:76","price":"Nígbà tí wọ́n bá sì pàdé àwọn tó gbàgbọ́ ní òdodo, wọ́n á wí pé: “A gbàgbọ́.” Nígbà tí ó bá sì ku apá kan wọn ku apá kan, wọ́n á wí pé: “Ṣé kì í ṣe pé ẹ̀ ń bá wọn sọ̀rọ̀ nípa ohun tí Allāhu ti ṣípayá rẹ̀ fún yín, kí wọ́n lè fi jà yín níyàn ní ọ̀dọ̀ Olúwa yín? Ṣé ẹ ò ṣe làákàyè ni!”","arabic":"وَإِذَا لَقُواْ ٱلَّذِينَ ءَامَنُواْ قَالُوٓاْ ءَامَنَّا وَإِذَا خَلَا بَعۡضُهُمۡ إِلَىٰ بَعۡضٖ قَالُوٓاْ أَتُحَدِّثُونَهُم بِمَا فَتَحَ ٱللَّهُ عَلَيۡكُمۡ لِيُحَآجُّوكُم بِهِۦ عِندَ رَبِّكُمۡۚ أَفَلَا تَعۡقِلُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":83,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"wa-idhā laqū alladhīna āmanū qālū āmannā wa-idhā khalā baʿḍuhum ilā baʿḍin qālū atuḥaddithūnahum bimā fataḥa al-lahu ʿalaykum liyuḥājjūkum bihi ʿinda rabbikum afalā taʿqilūna ","translations":["And when","they meet","those who","believe[d]","they say","We have believed","But when","meet in private","some of them","with","some (others)","they say","Do you tell them","what","has","Allah","to you","so that they argue with you","therewith","before","your Lord","Then do (you) not","understand","(76)"],"transliterationArr":["wa-idhā","laqū","alladhīna","āmanū","qālū","āmannā","wa-idhā","khalā","baʿḍuhum","ilā","baʿḍin","qālū","atuḥaddithūnahum","bimā","fataḥa","al-lahu","ʿalaykum","liyuḥājjūkum","bihi","ʿinda","rabbikum","afalā","taʿqilūna",null],"verseTiming":[[1,0,850],[2,850,1260],[3,1260,2200],[4,2200,3220],[5,3220,5350],[6,5350,7040],[7,7040,7830],[8,7830,8450],[9,8450,9430],[10,9430,9930],[11,9930,11540],[12,11540,13440],[13,13440,15560],[14,15560,16480],[15,16480,17150],[16,17150,17910],[17,17910,18880],[18,18880,23110],[19,23110,23200],[20,23200,24120],[21,24120,24660],[22,24660,25770],[23,25770,27150],[24,27150,27890],[25,27890,31035]]}},{"name":"2:77","price":"Ṣé wọn kò mọ̀ pé dájúdájú Allāhu mọ ohun tí wọ́n ń fi pamọ́ àti ohun tí wọ́n ń ṣàfi hàn rẹ̀?","arabic":"أَوَلَا يَعۡلَمُونَ أَنَّ ٱللَّهَ يَعۡلَمُ مَا يُسِرُّونَ وَمَا يُعۡلِنُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":84,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"awalā yaʿlamūna anna al-laha yaʿlamu mā yusirrūna wamā yuʿ'linūna ","translations":["Do not","they know","that","Allah","knows","what","they conceal","and what","they declare","(77)"],"transliterationArr":["awalā","yaʿlamūna","anna","al-laha","yaʿlamu","mā","yusirrūna","wamā","yuʿ'linūna",null],"verseTiming":[[1,0,920],[2,920,2020],[3,2020,3200],[4,3200,4000],[5,4000,4840],[6,4840,5290],[7,5290,6680],[8,6680,7380],[9,7380,10705]]}},{"name":"2:78","price":"Àti pé ó wà nínú wọn, àwọn aláìmọ̀ọ́nkọmọ̀ọ́nkà, tí wọn kò nímọ̀ nípa Tírà àfi àwọn irọ́. Kí ni wọ́n (ń sọ) bí kò ṣe pé wọ́n ń dá àbá (àròsọ).","arabic":"وَمِنۡهُمۡ أُمِّيُّونَ لَا يَعۡلَمُونَ ٱلۡكِتَٰبَ إِلَّآ أَمَانِيَّ وَإِنۡ هُمۡ إِلَّا يَظُنُّونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":85,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"wamin'hum ummiyyūna lā yaʿlamūna al-kitāba illā amāniyya wa-in hum illā yaẓunnūna ","translations":["And among them","(are) unlettered ones","(who) do not","know","the book","except","wishful thinking","and not","they","(do anything) except","guess","(78)"],"transliterationArr":["wamin'hum","ummiyyūna","lā","yaʿlamūna","al-kitāba","illā","amāniyya","wa-in","hum","illā","yaẓunnūna",null],"verseTiming":[[1,0,1190],[2,1190,3030],[3,3030,3360],[4,3360,4400],[5,4400,5510],[6,5510,7350],[7,7350,8550],[8,8550,9000],[9,9000,9460],[10,9460,10160],[11,10160,13595]]}},{"name":"2:79","price":"Nítorí náà, ègbé ni fún àwọn tó ń fi ọwọ́ ara wọn kọ tírà, lẹ́yìn náà tí wọ́n ń wí pé: “Èyí wá láti ọ̀dọ̀ Allāhu.” Nítorí kí wọ́n lè tà á ní owó pọ́ọ́kú. Ègbé ni fún wọn sẹ́ nípa ohun tí ọwọ́ wọn kọ. Ègbé sì ni fún wọn pẹ̀lú nípa ohun tí wọ́n ń ṣe níṣẹ́.","arabic":"فَوَيۡلٞ لِّلَّذِينَ يَكۡتُبُونَ ٱلۡكِتَٰبَ بِأَيۡدِيهِمۡ ثُمَّ يَقُولُونَ هَٰذَا مِنۡ عِندِ ٱللَّهِ لِيَشۡتَرُواْ بِهِۦ ثَمَنٗا قَلِيلٗاۖ فَوَيۡلٞ لَّهُم مِّمَّا كَتَبَتۡ أَيۡدِيهِمۡ وَوَيۡلٞ لَّهُم مِّمَّا يَكۡسِبُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":86,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"fawaylun lilladhīna yaktubūna al-kitāba bi-aydīhim thumma yaqūlūna hādhā min ʿindi al-lahi liyashtarū bihi thamanan qalīlan fawaylun lahum mimmā katabat aydīhim wawaylun lahum mimmā yaksibūna ","translations":["So woe","to those who","write","the book","with their (own) hands","then","they say","This","(is)","from","Allah","to barter","with it","(for) a price","little","So woe","to them","for what","have written","their hands","and woe","to them","for what","they earn","(79)"],"transliterationArr":["fawaylun","lilladhīna","yaktubūna","al-kitāba","bi-aydīhim","thumma","yaqūlūna","hādhā","min","ʿindi","al-lahi","liyashtarū","bihi","thamanan","qalīlan","fawaylun","lahum","mimmā","katabat","aydīhim","wawaylun","lahum","mimmā","yaksibūna",null],"verseTiming":[[1,0,880],[2,880,2090],[3,2090,3240],[4,3240,4320],[5,4320,5550],[6,5550,6670],[7,6670,7860],[8,7860,8610],[9,8610,8930],[10,8930,10020],[11,10020,10820],[12,10820,11850],[13,11850,12440],[14,12440,13760],[15,13760,14820],[16,14820,15950],[17,15950,16650],[18,16650,18470],[19,18470,19300],[20,19300,20440],[21,20440,21190],[22,21190,22050],[23,22050,24170],[24,24170,26785]]}},{"name":"2:80","price":"Wọ́n sì wí pé: “Iná kò lè fọwọ́ bà wá tayọ ọjọ́ tó lóǹkà.” Sọ pé: “Ṣé ẹ ti rí àdéhùn kan gbà lọ́dọ̀ Allāhu ni?”Allāhu kò sì níí yapa àdéhùn Rẹ̀. Àbí ṣé ẹ̀yin yóò máa pa irọ́ ohun tí ẹ kò nímọ̀ nípa rẹ̀ mọ́ Allāhu ni?","arabic":"وَقَالُواْ لَن تَمَسَّنَا ٱلنَّارُ إِلَّآ أَيَّامٗا مَّعۡدُودَةٗۚ قُلۡ أَتَّخَذۡتُمۡ عِندَ ٱللَّهِ عَهۡدٗا فَلَن يُخۡلِفَ ٱللَّهُ عَهۡدَهُۥٓۖ أَمۡ تَقُولُونَ عَلَى ٱللَّهِ مَا لَا تَعۡلَمُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":87,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"waqālū lan tamassanā al-nāru illā ayyāman maʿdūdatan qul attakhadhtum ʿinda al-lahi ʿahdan falan yukh'lifa al-lahu ʿahdahu am taqūlūna ʿalā al-lahi mā lā taʿlamūna ","translations":["And they say","Never","will touch us","the Fire","except","(for) days","numbered","Say","Have you taken","from","Allah","a covenant","so never","will break","Allah","His Covenant","Or","(do) you say","against","Allah","what","not","you know","(80)"],"transliterationArr":["waqālū","lan","tamassanā","al-nāru","illā","ayyāman","maʿdūdatan","qul","attakhadhtum","ʿinda","al-lahi","ʿahdan","falan","yukh'lifa","al-lahu","ʿahdahu","am","taqūlūna","ʿalā","al-lahi","mā","lā","taʿlamūna",null],"verseTiming":[[1,0,1120],[2,1120,2130],[3,2130,3120],[4,3120,4460],[5,4460,6830],[6,6830,7870],[7,7870,10280],[8,10280,10620],[9,10620,11920],[10,11920,13090],[11,13090,13870],[12,13870,15240],[13,15240,15740],[14,15740,17480],[15,17480,18300],[16,18300,19480],[17,19480,19780],[18,19780,20890],[19,20890,21310],[20,21310,22150],[21,22150,22530],[22,22530,22900],[23,22900,25675]]}},{"name":"2:81","price":"Rárá (Iná kò rí bí wọ́n ṣe rò ó sí); ẹnikẹ́ni tí ó bá ṣe iṣẹ́ ibi kan, tí àwọn ẹ̀ṣẹ̀ rẹ̀ tún yí i ká, àwọn wọ̀nyẹn ni èrò inú Iná. Olùṣegbére ni wọ́n nínú rẹ̀.","arabic":"بَلَىٰۚ مَن كَسَبَ سَيِّئَةٗ وَأَحَٰطَتۡ بِهِۦ خَطِيٓـَٔتُهُۥ فَأُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلنَّارِۖ هُمۡ فِيهَا خَٰلِدُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":88,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"balā man kasaba sayyi-atan wa-aḥāṭat bihi khaṭīatuhu fa-ulāika aṣḥābu al-nāri hum fīhā khālidūna ","translations":["Yes","whoever","earned","evil","and surrounded him","with","his sins ","[so] those","(are the) companions","(of) the Fire","they","in it","(will) abide forever","(81)"],"transliterationArr":["balā","man","kasaba","sayyi-atan","wa-aḥāṭat","bihi","khaṭīatuhu","fa-ulāika","aṣḥābu","al-nāri","hum","fīhā","khālidūna",null],"verseTiming":[[1,0,900],[2,900,2370],[3,2370,3020],[4,3020,4770],[5,4770,5850],[6,5850,6370],[7,6370,8950],[8,8950,11569],[9,11569,12459],[10,12459,13759],[11,13759,14209],[12,14209,14959],[13,14959,17494]]}},{"name":"2:82","price":"Àwọn tó gbàgbọ́ ní òdodo, tí wọ́n sì ṣe àwọn iṣẹ́ rere, àwọn wọ̀nyẹn ni èrò inú Ọgbà Ìdẹ̀ra. Olùṣegbére ni wọ́n nínú rẹ̀.","arabic":"وَٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ أُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلۡجَنَّةِۖ هُمۡ فِيهَا خَٰلِدُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":89,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"wa-alladhīna āmanū waʿamilū al-ṣāliḥāti ulāika aṣḥābu al-janati hum fīhā khālidūna ","translations":["And those who","believed","and did","righteous deeds","those","(are the) companions","(of) Paradise","they","in it","(will) abide forever","(82)"],"transliterationArr":["wa-alladhīna","āmanū","waʿamilū","al-ṣāliḥāti","ulāika","aṣḥābu","al-janati","hum","fīhā","khālidūna",null],"verseTiming":[[1,0,1230],[2,1230,2270],[3,2270,2940],[4,2940,4340],[5,4340,6510],[6,6510,7420],[7,7420,9690],[8,9690,10100],[9,10100,11010],[10,11010,14165]]}},{"name":"2:83","price":"(Ẹ rántí) nígbà tí A gba àdéhùn lọ́wọ́ àwọn ọmọ ’Isrọ̄’īl pé, ẹ̀yin kò gbọdọ̀ jọ́sìn fún ọlọ́hun kan àyàfi Allāhu. Kí ẹ sì ṣe dáadáa sí àwọn òbí méjèèjì, ìbátan, àwọn ọmọ òrukàn àti àwọn mẹ̀kúnnù.¹ Ẹ bá àwọn ènìyàn sọ̀rọ̀ rere. Ẹ kírun, kí ẹ sì yọ Zakāh. Lẹ́yìn náà lẹ pẹ̀yìn dà àfi díẹ̀ nínú yín. Ẹ̀yin sì ń gbúnrí (kúrò níbi àdéhùn).","arabic":"وَإِذۡ أَخَذۡنَا مِيثَٰقَ بَنِيٓ إِسۡرَٰٓءِيلَ لَا تَعۡبُدُونَ إِلَّا ٱللَّهَ وَبِٱلۡوَٰلِدَيۡنِ إِحۡسَانٗا وَذِي ٱلۡقُرۡبَىٰ وَٱلۡيَتَٰمَىٰ وَٱلۡمَسَٰكِينِ وَقُولُواْ لِلنَّاسِ حُسۡنٗا وَأَقِيمُواْ ٱلصَّلَوٰةَ وَءَاتُواْ ٱلزَّكَوٰةَ ثُمَّ تَوَلَّيۡتُمۡ إِلَّا قَلِيلٗا مِّنكُمۡ وَأَنتُم مُّعۡرِضُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":90,"juzNumber":1,"footnotes":"1. Ẹ wo ìtọsẹ̀-ọ̀rọ̀ sūrah at-Taobah; 9:60.","lang":"yo","meta":{"transliteration":"wa-idh akhadhnā mīthāqa banī is'rāīla lā taʿbudūna illā al-laha wabil-wālidayni iḥ'sānan wadhī al-qur'bā wal-yatāmā wal-masākīni waqūlū lilnnāsi ḥus'nan wa-aqīmū al-ṣalata waātū al-zakata thumma tawallaytum illā qalīlan minkum wa-antum muʿ'riḍūna ","translations":["And when","We took","(the) covenant","(from the) Children","(of) Israel","Not","you will worship","except","Allah","and with [the] parents","(be) good","and (with)","relatives","and [the] orphans","and the needy","and speak","to [the] people","good","and establish","the prayer","and give","the zakah","Then","you turned away","except","a few","of you","and you (were)","refusing","(83)"],"transliterationArr":["wa-idh","akhadhnā","mīthāqa","banī","is'rāīla","lā","taʿbudūna","illā","al-laha","wabil-wālidayni","iḥ'sānan","wadhī","al-qur'bā","wal-yatāmā","wal-masākīni","waqūlū","lilnnāsi","ḥus'nan","wa-aqīmū","al-ṣalata","waātū","al-zakata","thumma","tawallaytum","illā","qalīlan","minkum","wa-antum","muʿ'riḍūna",null],"verseTiming":[[1,0,670],[2,670,1600],[3,1600,2550],[4,2550,4300],[5,4300,7100],[6,7100,7410],[7,7410,8550],[8,8550,9080],[9,9080,9940],[10,9940,11590],[11,11590,13280],[12,13280,15000],[13,15000,16860],[14,16860,17180],[15,17180,18130],[16,18130,19550],[17,19550,21020],[18,21020,21970],[19,21970,23530],[20,23530,24820],[21,24820,25660],[22,25660,26690],[23,26690,27460],[24,27460,28460],[25,28460,29590],[26,29590,31050],[27,31050,31740],[28,31740,32650],[29,32650,34950],[30,34950,36410],[31,36410,39695]]}},{"name":"2:84","price":"(Ẹ rántí) nígbà tí A gba àdéhùn lọ́wọ́ yín¹ pé, ẹ̀yin kò gbọdọ̀ ta ẹ̀jẹ̀ yín sílẹ̀, ẹ̀yin kò sì gbọdọ̀ léra yín jáde kúrò nínú ilé yín. Lẹ́yìn náà, ẹ fi rinlẹ̀, ẹ sì ń jẹ́rìí sí i.","arabic":"وَإِذۡ أَخَذۡنَا مِيثَٰقَكُمۡ لَا تَسۡفِكُونَ دِمَآءَكُمۡ وَلَا تُخۡرِجُونَ أَنفُسَكُم مِّن دِيَٰرِكُمۡ ثُمَّ أَقۡرَرۡتُمۡ وَأَنتُمۡ تَشۡهَدُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":91,"juzNumber":1,"footnotes":"1. Àdéhùn yìí wáyé láààrin Ànábì wa - kí ìkẹ́ àti ọlà Allāhu máa bá a - àti àwọn yẹhudi ìlú Mọdīnah Onímọ̀ọ́lẹ̀. Nínú ìwé àdéhùn yìí, àwọn Mùsùlùmí àti àwọn yẹhudi dìjọ gbà pé àwọn kò níí gbé ìjà kora wọn. Wọ́n sì dìjọ gbà pé àwọn yóó máa dáàbò bo ara wọn lọ́wọ́ ọ̀tá òde. Ṣùgbọ́n gẹ́gẹ́ bí āyah 85 ṣe fi rinlẹ̀, àwọn yẹhudi gbàbọ̀dè, wọ́n sì lẹ̀dí àpò pọ̀ mọ́ àwọn Ƙuraeṣi tí wọ́n wá gbé ogun ti àwọn mùsùlùmí ní ìlú Mọdīnah.","lang":"yo","meta":{"transliteration":"wa-idh akhadhnā mīthāqakum lā tasfikūna dimāakum walā tukh'rijūna anfusakum min diyārikum thumma aqrartum wa-antum tashhadūna ","translations":["And when","We took","your covenant","Not","will you shed","your blood","and not","(will) evict","yourselves","from","your homes","then","you ratified","while you","(were) witnessing","(84)"],"transliterationArr":["wa-idh","akhadhnā","mīthāqakum","lā","tasfikūna","dimāakum","walā","tukh'rijūna","anfusakum","min","diyārikum","thumma","aqrartum","wa-antum","tashhadūna",null],"verseTiming":[[1,0,660],[2,660,1610],[3,1610,2920],[4,2920,3280],[5,3280,4460],[6,4460,7130],[7,7130,7650],[8,7650,8790],[9,8790,10440],[10,10440,11880],[11,11880,13030],[12,13030,14410],[13,14410,15640],[14,15640,17150],[15,17150,19575]]}},{"name":"2:85","price":"Lẹ́yìn náà, ẹ̀yin wọ̀nyí lẹ̀ ń pa ara yín. Ẹ tún ń lé apá kan nínú yín jáde kúrò nínú ilé wọn. Ẹ̀ ń fi ẹ̀ṣẹ̀ àti àbòsí ṣèrànwọ́ (fún àwọn ọ̀tá) lórí wọn. Tí wọ́n bá sì wá ba yín (tí wọ́n ti di) ẹrú, ẹ̀yin ń rà wọ́n (láti fi’ra yín ṣẹrú). Èèwọ̀ sì fẹ̀ẹ̀kan ni fún yín láti lé wọn jáde. Ṣé ẹ̀yin yóò gba apá kan Tírà gbọ́, ẹ sì ń ṣàì gbàgbọ́ nínú apá kan? Nítorí náà, kí ni ẹ̀san fún ẹni tó ṣè yẹn nínú yín bí kò ṣe àbùkù nínú ìṣẹ̀mí ayé. Ní ọjọ́ Àjíǹde, wọ́n sì máa dá wọn padà sínú ìyà tó le jùlọ. Allāhu kò sì níí gbàgbé ohun tí ẹ̀ ń ṣe níṣẹ́.","arabic":"ثُمَّ أَنتُمۡ هَٰٓؤُلَآءِ تَقۡتُلُونَ أَنفُسَكُمۡ وَتُخۡرِجُونَ فَرِيقٗا مِّنكُم مِّن دِيَٰرِهِمۡ تَظَٰهَرُونَ عَلَيۡهِم بِٱلۡإِثۡمِ وَٱلۡعُدۡوَٰنِ وَإِن يَأۡتُوكُمۡ أُسَٰرَىٰ تُفَٰدُوهُمۡ وَهُوَ مُحَرَّمٌ عَلَيۡكُمۡ إِخۡرَاجُهُمۡۚ أَفَتُؤۡمِنُونَ بِبَعۡضِ ٱلۡكِتَٰبِ وَتَكۡفُرُونَ بِبَعۡضٖۚ فَمَا جَزَآءُ مَن يَفۡعَلُ ذَٰلِكَ مِنكُمۡ إِلَّا خِزۡيٞ فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَاۖ وَيَوۡمَ ٱلۡقِيَٰمَةِ يُرَدُّونَ إِلَىٰٓ أَشَدِّ ٱلۡعَذَابِۗ وَمَا ٱللَّهُ بِغَٰفِلٍ عَمَّا تَعۡمَلُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":92,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"thumma antum hāulāi taqtulūna anfusakum watukh'rijūna farīqan minkum min diyārihim taẓāharūna ʿalayhim bil-ith'mi wal-ʿud'wāni wa-in yatūkum usārā tufādūhum wahuwa muḥarramun ʿalaykum ikh'rājuhum afatu'minūna bibaʿḍi al-kitābi watakfurūna bibaʿḍin famā jazāu man yafʿalu dhālika minkum illā khiz'yun fī al-ḥayati al-dun'yā wayawma al-qiyāmati yuraddūna ilā ashaddi al-ʿadhābi wamā al-lahu bighāfilin ʿammā taʿmalūna ","translations":["Then","you","(are) those","(who) kill","yourselves","and evict","a party","of you","from","their homes","you support one another","against them","in sin","and [the] transgression","And if","they come to you","(as) captives","you ransom them","while it","(was) forbidden","to you","their eviction","So do you believe","in part (of)","the Book","and disbelieve","in part","Then what","(should be the) recompense","(for the one) who","does","that","among you","except","disgrace","in","the life","(of) the world","and (on the) Day","of [the] Resurrection","they will be sent back","to","(the) most severe","punishment","And not","(is) Allah","unaware","of what","you do","(85)"],"transliterationArr":["thumma","antum","hāulāi","taqtulūna","anfusakum","watukh'rijūna","farīqan","minkum","min","diyārihim","taẓāharūna","ʿalayhim","bil-ith'mi","wal-ʿud'wāni","wa-in","yatūkum","usārā","tufādūhum","wahuwa","muḥarramun","ʿalaykum","ikh'rājuhum","afatu'minūna","bibaʿḍi","al-kitābi","watakfurūna","bibaʿḍin","famā","jazāu","man","yafʿalu","dhālika","minkum","illā","khiz'yun","fī","al-ḥayati","al-dun'yā","wayawma","al-qiyāmati","yuraddūna","ilā","ashaddi","al-ʿadhābi","wamā","al-lahu","bighāfilin","ʿammā","taʿmalūna",null],"verseTiming":[[1,0,1300],[2,1300,2800],[3,2800,6540],[4,6540,7650],[5,7650,9350],[6,9350,10640],[7,10640,11430],[8,11430,13620],[9,13620,14850],[10,14850,16200],[11,16200,17550],[12,17550,19060],[13,19060,20020],[14,20020,21380],[15,21380,22030],[16,22030,23910],[17,23910,24920],[18,24920,26380],[19,26380,26920],[20,26920,27920],[21,27920,29060],[22,29060,30820],[23,30820,32370],[24,32370,33160],[25,33160,34050],[26,34050,35420],[27,35420,36240],[28,36240,37100],[29,37100,39320],[30,39320,39590],[31,39590,40880],[32,40880,41720],[33,41720,43170],[34,43170,43880],[35,43880,44560],[36,44560,45630],[37,45630,46640],[38,46640,47760],[39,47760,48800],[40,48800,50170],[41,50170,51240],[42,51240,53210],[43,53210,54020],[44,54020,56759],[45,56759,57450],[46,57450,58330],[47,58330,59380],[48,59380,60810],[49,60810,63395]]}},{"name":"2:86","price":"Àwọn wọ̀nyẹn ni àwọn tí wọ́n fi ọ̀run ra ìṣẹ̀mí ayé.¹ Nítorí náà, A ò níí ṣe ìyà ní fífúyẹ́ fún wọn, A ò sì níí ràn wọ́n lọ́wọ́.","arabic":"أُوْلَٰٓئِكَ ٱلَّذِينَ ٱشۡتَرَوُاْ ٱلۡحَيَوٰةَ ٱلدُّنۡيَا بِٱلۡأٓخِرَةِۖ فَلَا يُخَفَّفُ عَنۡهُمُ ٱلۡعَذَابُ وَلَا هُمۡ يُنصَرُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":93,"juzNumber":1,"footnotes":"1. Ìyẹn ni pé, wọ́n mú ìṣẹ̀mí ayé, wọ́n sì fi ìṣẹ̀mí ọ̀run sílẹ̀. Ƙọtādah sọ pé, “Wọ́n fẹ́ràn kékeré tayé ju púpọ̀ tọ̀run” [Tọbariy] Ibn Kẹthīr sọ pé, “Wọ́n fẹ́ràn ayé ju ọ̀run, wọ́n sì ṣa ayé lẹ́ṣà ju ọ̀run.”","lang":"yo","meta":{"transliteration":"ulāika alladhīna ish'tarawū al-ḥayata al-dun'yā bil-ākhirati falā yukhaffafu ʿanhumu al-ʿadhābu walā hum yunṣarūna ","translations":["Those","(are) the ones who","bought","the life","(of) the world","for the Hereafter","so not","will be lightened","for them","the punishment","and not","they","will be helped","(86)"],"transliterationArr":["ulāika","alladhīna","ish'tarawū","al-ḥayata","al-dun'yā","bil-ākhirati","falā","yukhaffafu","ʿanhumu","al-ʿadhābu","walā","hum","yunṣarūna",null],"verseTiming":[[1,0,2430],[2,2430,3370],[3,3370,4210],[4,4210,5230],[5,5230,6260],[6,6260,8060],[7,8060,8600],[8,8600,9620],[9,9620,10330],[10,10330,11470],[11,11470,12170],[12,12170,12550],[13,12550,16775]]}},{"name":"2:87","price":"Dájúdájú A ti fún (Ànábì) Mūsā ní Tírà. A sì mú àwọn Òjíṣẹ́ wá ní tẹ̀léǹtẹ̀lé lẹ́yìn rẹ̀. A fún (Ànábì) ‘Īsā ọmọ Mọryam ní àwọn ẹ̀rí tó yanjú.¹ A sì fi Ẹ̀mí Mímọ́ (ìyẹn, Mọlāika Jibrīl) ràn án lọ́wọ́. Ṣé gbogbo ìgbà tí Òjíṣẹ́ kan bá wá ba yín pẹ̀lú ohun tí ọkàn yín kò fẹ́ ni ẹ ó máa ṣègbéraga? Ẹ sì pe apá kan (àwọn Ànábì) ní òpùrọ́, ẹ sì ń pa apá kan!","arabic":"وَلَقَدۡ ءَاتَيۡنَا مُوسَى ٱلۡكِتَٰبَ وَقَفَّيۡنَا مِنۢ بَعۡدِهِۦ بِٱلرُّسُلِۖ وَءَاتَيۡنَا عِيسَى ٱبۡنَ مَرۡيَمَ ٱلۡبَيِّنَٰتِ وَأَيَّدۡنَٰهُ بِرُوحِ ٱلۡقُدُسِۗ أَفَكُلَّمَا جَآءَكُمۡ رَسُولُۢ بِمَا لَا تَهۡوَىٰٓ أَنفُسُكُمُ ٱسۡتَكۡبَرۡتُمۡ فَفَرِيقٗا كَذَّبۡتُمۡ وَفَرِيقٗا تَقۡتُلُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":94,"juzNumber":1,"footnotes":"1. Ìyẹn ni àwọn iṣẹ́ ìyanu tí Allāhu fún un.","lang":"yo","meta":{"transliteration":"walaqad ātaynā mūsā al-kitāba waqaffaynā min baʿdihi bil-rusuli waātaynā ʿīsā ib'na maryama al-bayināti wa-ayyadnāhu birūḥi al-qudusi afakullamā jāakum rasūlun bimā lā tahwā anfusukumu is'takbartum fafarīqan kadhabtum wafarīqan taqtulūna ","translations":["And indeed","We gave","Musa","the Book","and We followed up","from","after him","with [the] Messengers","And We gave","Isa","(the) son","(of) Maryam","[the] clear signs","and We supported him","(with)","the Holy Spirit","Is it (not) so (that) whenever","came to you","a Messenger","with what","(does) not","desire","yourselves","you acted arrogantly","So a party","you denied","and a party","you kill(ed)","(87)"],"transliterationArr":["walaqad","ātaynā","mūsā","al-kitāba","waqaffaynā","min","baʿdihi","bil-rusuli","waātaynā","ʿīsā","ib'na","maryama","al-bayināti","wa-ayyadnāhu","birūḥi","al-qudusi","afakullamā","jāakum","rasūlun","bimā","lā","tahwā","anfusukumu","is'takbartum","fafarīqan","kadhabtum","wafarīqan","taqtulūna",null],"verseTiming":[[1,0,880],[2,880,1960],[3,1960,2500],[4,2500,3430],[5,3430,4660],[6,4660,5580],[7,5580,6450],[8,6450,7400],[9,7400,9050],[10,9050,9590],[11,9590,10020],[12,10020,10710],[13,10710,12070],[14,12070,13550],[15,13550,14300],[16,14300,15170],[17,15170,16670],[18,16670,18930],[19,18930,20390],[20,20390,21030],[21,21030,21320],[22,21320,23390],[23,23390,25030],[24,25030,26380],[25,26380,28080],[26,28080,29220],[27,29220,31050],[28,31050,33435]]}},{"name":"2:88","price":"Wọ́n sì wí pé: “Èbìbò bò wá lọ́kàn.” Kò sì rí bẹ́ẹ̀. Allāhu ti ṣẹ́bi lé wọn ni, nítorí àìgbàgbọ́ wọn. Ṣebí díẹ̀ ni wọ́n ń gbàgbọ́.","arabic":"وَقَالُواْ قُلُوبُنَا غُلۡفُۢۚ بَل لَّعَنَهُمُ ٱللَّهُ بِكُفۡرِهِمۡ فَقَلِيلٗا مَّا يُؤۡمِنُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":95,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"waqālū qulūbunā ghul'fun bal laʿanahumu al-lahu bikuf'rihim faqalīlan mā yu'minūna ","translations":["And they said","Our hearts","(are) wrapped","Nay","has cursed them","Allah","for their disbelief","so little","(is) what","they believe","(88)"],"transliterationArr":["waqālū","qulūbunā","ghul'fun","bal","laʿanahumu","al-lahu","bikuf'rihim","faqalīlan","mā","yu'minūna",null],"verseTiming":[[1,0,1040],[2,1040,2220],[3,2220,3020],[4,3020,3440],[5,3440,4500],[6,4500,5350],[7,5350,6420],[8,6420,7410],[9,7410,8470],[10,8470,10835]]}},{"name":"2:89","price":"89. Nígbà tí Tírà kan sì dé bá wọn láti ọ̀dọ̀ Allāhu, tí ó ń fi ìdí òdodo múlẹ̀ nípa ohun tí ó wà pẹ̀lú wọn (ìyẹn tírà Taorāt), bẹ́ẹ̀ sì ni tẹ́lẹ̀tẹ́lẹ̀ wọ́n ti ń tọrọ ìṣẹ́gun lórí àwọn tó ṣàì gbàgbọ́, àmọ́ nígbà tí ohun tí wọ́n nímọ̀ nípa rẹ̀ dé bá wọn, wọ́n ṣàì gbàgbọ́ nínú rẹ̀. Nítorí náà, ibi dandan Allāhu kí ó máa bá àwọn aláìgbàgbọ́.¹","arabic":"وَلَمَّا جَآءَهُمۡ كِتَٰبٞ مِّنۡ عِندِ ٱللَّهِ مُصَدِّقٞ لِّمَا مَعَهُمۡ وَكَانُواْ مِن قَبۡلُ يَسۡتَفۡتِحُونَ عَلَى ٱلَّذِينَ كَفَرُواْ فَلَمَّا جَآءَهُم مَّا عَرَفُواْ كَفَرُواْ بِهِۦۚ فَلَعۡنَةُ ٱللَّهِ عَلَى ٱلۡكَٰفِرِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":96,"juzNumber":1,"footnotes":"1. Ìyẹn ni pé, àwọn yẹ̀húdí, ṣíwájú kí Allāhu tó gbé Ànábì wa - kí ìkẹ́ àti ọlà Allāhu máa bá a - dìde, wọ́n máa ń sọ fún àwọn ọ̀sẹbọ Lárúbáwá pé, “Ẹ jẹ́ tètè gba Allāhu gbọ́ ní òdodo bí bẹ́ẹ̀ kọ nígbà tí òpin Òjíṣẹ́ náà bá dé, àwọn àti òun máa parapọ̀ le yín lórí.” Àmọ́ nígbà tí òpin Òjíṣẹ́ náà - kí ìkẹ́ àti ọlà Allāhu máa bá a - dé, àwọn gan-an náà gbógun tì í nítorí pé, gbogbo èrò-ọkàn wọn ni pé, nínú ìran ọmọ Isrọ̄’īl ni òpin Òjíṣẹ́ náà máa ti wá. Àmọ́ nínú ìran Lárúbáwá ni Allāhu ti gbé òpin Òjíṣẹ́ náà dìde.","lang":"yo","meta":{"transliteration":"walammā jāahum kitābun min ʿindi al-lahi muṣaddiqun limā maʿahum wakānū min qablu yastaftiḥūna ʿalā alladhīna kafarū falammā jāahum mā ʿarafū kafarū bihi falaʿnatu al-lahi ʿalā al-kāfirīna ","translations":["And when","came to them","a Book","of","from","Allah","confirming","what (was)","with them","though they used to","from","before","(that), pray for victory","over","those who","disbelieved ","then when","came to them","what","they recognized","they disbelieved","in it","So (the) curse","(of) Allah","(is) on","the disbelievers","(89)"],"transliterationArr":["walammā","jāahum","kitābun","min","ʿindi","al-lahi","muṣaddiqun","limā","maʿahum","wakānū","min","qablu","yastaftiḥūna","ʿalā","alladhīna","kafarū","falammā","jāahum","mā","ʿarafū","kafarū","bihi","falaʿnatu","al-lahi","ʿalā","al-kāfirīna",null],"verseTiming":[[1,0,1520],[2,1520,3720],[3,3720,4630],[4,4630,5670],[5,5670,6930],[6,6930,7630],[7,7630,8600],[8,8600,9360],[9,9360,10140],[10,10140,11212],[11,11212,12285],[12,12285,12928],[13,12928,14263],[14,14263,14590],[15,14590,15560],[16,15560,16230],[17,16230,17760],[18,17760,20190],[19,20190,20920],[20,20920,21700],[21,21700,22480],[22,22480,23250],[23,23250,24240],[24,24240,24980],[25,24980,25330],[26,25330,28265]]}},{"name":"2:90","price":"Aburú ni ohun tí wọ́n rà fún ẹ̀mí ara wọn nípa bí wọ́n ṣe ṣàì gbàgbọ́ nínú ohun tí Allāhu sọ̀kalẹ̀, ní ti ìlara pé Allāhu ń sọ (Tírà) kalẹ̀ nínú oore àjùlọ Rẹ̀ fún ẹni tí Ó fẹ́ nínú àwọn ẹrúsìn Rẹ̀. Wọ́n sì padà pẹ̀lú ìbínú (mìíràn) lórí ìbínú (Allāhu tí ó ti wà lórí wọn tẹ́lẹ̀). Ìyà tí í yẹpẹrẹ (ẹ̀dá) sì ń bẹ fún àwọn aláìgbàgbọ́.","arabic":"بِئۡسَمَا ٱشۡتَرَوۡاْ بِهِۦٓ أَنفُسَهُمۡ أَن يَكۡفُرُواْ بِمَآ أَنزَلَ ٱللَّهُ بَغۡيًا أَن يُنَزِّلَ ٱللَّهُ مِن فَضۡلِهِۦ عَلَىٰ مَن يَشَآءُ مِنۡ عِبَادِهِۦۖ فَبَآءُو بِغَضَبٍ عَلَىٰ غَضَبٖۚ وَلِلۡكَٰفِرِينَ عَذَابٞ مُّهِينٞ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":97,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"bi'samā ish'taraw bihi anfusahum an yakfurū bimā anzala al-lahu baghyan an yunazzila al-lahu min faḍlihi ʿalā man yashāu min ʿibādihi fabāū bighaḍabin ʿalā ghaḍabin walil'kāfirīna ʿadhābun muhīnun ","translations":["Evil (is) that","(for) which they have sold","with","themselves","that","they disbelieve","in what","has revealed","Allah","grudging","that","sends down","Allah","of","His Grace","on","whom","He wills","from","His servants","So they have drawn (on themselves)","wrath","upon","wrath","And for the disbelievers","(is) a punishment","humiliating","(90)"],"transliterationArr":["bi'samā","ish'taraw","bihi","anfusahum","an","yakfurū","bimā","anzala","al-lahu","baghyan","an","yunazzila","al-lahu","min","faḍlihi","ʿalā","man","yashāu","min","ʿibādihi","fabāū","bighaḍabin","ʿalā","ghaḍabin","walil'kāfirīna","ʿadhābun","muhīnun",null],"verseTiming":[[1,0,910],[2,910,1720],[3,1720,3480],[4,3480,5130],[5,5130,5380],[6,5380,6840],[7,6840,8600],[8,8600,9870],[9,9870,10790],[10,10790,11610],[11,11610,11770],[12,11770,13690],[13,13690,14510],[14,14510,15430],[15,15430,16450],[16,16450,17040],[17,17040,17330],[18,17330,20450],[19,20450,20820],[20,20820,22270],[21,22270,24670],[22,24670,25610],[23,25610,26190],[24,26190,26820],[25,26820,28930],[26,28930,29730],[27,29730,33135]]}},{"name":"2:91","price":"Nígbà tí wọ́n bá sọ fún wọn pé: “Ẹ gbàgbọ́ nínú ohun tí Allāhu sọ̀kalẹ̀.” Wọ́n á wí pé: “A gbàgbọ́ nínú ohun tí wọ́n sọ̀kalẹ̀ fún wa.” Wọ́n sì ń ṣàì gbàgbọ́ nínú ohun tó wà lẹ́yìn rẹ̀, òhun sì ni òdodo, tí ó ń fi ohun tó jẹ́ òdodo rinlẹ̀ nípa èyí tó wà pẹ̀lú wọn. Sọ pé: “Nítorí kí ni ẹ fi ń pa àwọn Ànábì Allāhu tẹ́lẹ̀tẹ́lẹ̀ tí ẹ bá jẹ́ onígbàgbọ́ òdodo?","arabic":"وَإِذَا قِيلَ لَهُمۡ ءَامِنُواْ بِمَآ أَنزَلَ ٱللَّهُ قَالُواْ نُؤۡمِنُ بِمَآ أُنزِلَ عَلَيۡنَا وَيَكۡفُرُونَ بِمَا وَرَآءَهُۥ وَهُوَ ٱلۡحَقُّ مُصَدِّقٗا لِّمَا مَعَهُمۡۗ قُلۡ فَلِمَ تَقۡتُلُونَ أَنۢبِيَآءَ ٱللَّهِ مِن قَبۡلُ إِن كُنتُم مُّؤۡمِنِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":98,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"wa-idhā qīla lahum āminū bimā anzala al-lahu qālū nu'minu bimā unzila ʿalaynā wayakfurūna bimā warāahu wahuwa al-ḥaqu muṣaddiqan limā maʿahum qul falima taqtulūna anbiyāa al-lahi min qablu in kuntum mu'minīna ","translations":["And when","it is said","to them","Believe","in what","has revealed","Allah","they say","We believe","in what","was revealed","to us","And they disbelieve","in what","(is) besides it","while it","(is) the truth","confirming","what","(is) with them","Say","Then why","(did) you kill","(the) Prophets","(of) Allah","from","before","if","you were","believers","(91)"],"transliterationArr":["wa-idhā","qīla","lahum","āminū","bimā","anzala","al-lahu","qālū","nu'minu","bimā","unzila","ʿalaynā","wayakfurūna","bimā","warāahu","wahuwa","al-ḥaqu","muṣaddiqan","limā","maʿahum","qul","falima","taqtulūna","anbiyāa","al-lahi","min","qablu","in","kuntum","mu'minīna",null],"verseTiming":[[1,0,910],[2,910,1560],[3,1560,2130],[4,2130,3080],[5,3080,5030],[6,5030,6320],[7,6320,7230],[8,7230,8100],[9,8100,9220],[10,9220,10010],[11,10010,11880],[12,11880,13270],[13,13270,14310],[14,14310,15640],[15,15640,16000],[16,16000,18720],[17,18720,19210],[18,19210,20040],[19,20040,21070],[20,21070,21820],[21,21820,22970],[22,22970,23290],[23,23290,23830],[24,23830,25040],[25,25040,28400],[26,28400,29330],[27,29330,30370],[28,30370,30890],[29,30890,31820],[30,31820,33290],[31,33290,36825]]}},{"name":"2:92","price":"Àti pé dájúdájú (Ànábì) Mūsā ti mú àwọn ẹ̀rí tó yanjú wá ba yín. Lẹ́yìn náà, ẹ tún bọ ọ̀bọrọgidi ọmọ màálù lẹ́yìn rẹ̀. Alábòsí sì ni yín.”","arabic":"۞ وَلَقَدۡ جَآءَكُم مُّوسَىٰ بِٱلۡبَيِّنَٰتِ ثُمَّ ٱتَّخَذۡتُمُ ٱلۡعِجۡلَ مِنۢ بَعۡدِهِۦ وَأَنتُمۡ ظَٰلِمُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":99,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"walaqad jāakum mūsā bil-bayināti thumma ittakhadhtumu al-ʿij'la min baʿdihi wa-antum ẓālimūna ","translations":["And indeed","came to you","Musa","with [the] clear signs","then","you took","the calf","from","after him","and you","(were) wrongdoers","(92)"],"transliterationArr":["walaqad","jāakum","mūsā","bil-bayināti","thumma","ittakhadhtumu","al-ʿij'la","min","baʿdihi","wa-antum","ẓālimūna",null],"verseTiming":[[1,0,950],[2,950,3330],[3,3330,4930],[4,4930,6440],[5,6440,7650],[6,7650,8860],[7,8860,9670],[8,9670,10500],[9,10500,11440],[10,11440,13300],[11,13300,16355]]}},{"name":"2:93","price":"(Ẹ rántí) nígbà tí A gba àdéhùn lọ́wọ́ yín, A sì gbé àpáta s’ókè orí yín, (A sọ pé:) “Ẹ gbá ohun tí A fún yín mú dáradára. Kí ẹ sì tẹ́tí gbọ́rọ̀.” Wọ́n wí pé: “A gbọ́ (àṣẹ), a sì yapa (rẹ̀).” Wọ́n ti kó ìfẹ́ bíbọ ọ̀bọrọgidi ọmọ màálù sínú ọkàn wọn nípasẹ̀ àìgbàgbọ́ wọn. Sọ pé: “Aburú ni ohun tí ìgbàgbọ́ (ìbọ̀rìṣà) yín ń pa yín láṣẹ rẹ̀, tí ẹ bá jẹ́ onígbàgbọ́ òdodo.”","arabic":"وَإِذۡ أَخَذۡنَا مِيثَٰقَكُمۡ وَرَفَعۡنَا فَوۡقَكُمُ ٱلطُّورَ خُذُواْ مَآ ءَاتَيۡنَٰكُم بِقُوَّةٖ وَٱسۡمَعُواْۖ قَالُواْ سَمِعۡنَا وَعَصَيۡنَا وَأُشۡرِبُواْ فِي قُلُوبِهِمُ ٱلۡعِجۡلَ بِكُفۡرِهِمۡۚ قُلۡ بِئۡسَمَا يَأۡمُرُكُم بِهِۦٓ إِيمَٰنُكُمۡ إِن كُنتُم مُّؤۡمِنِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":100,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"wa-idh akhadhnā mīthāqakum warafaʿnā fawqakumu al-ṭūra khudhū mā ātaynākum biquwwatin wa-is'maʿū qālū samiʿ'nā waʿaṣaynā wa-ush'ribū fī qulūbihimu al-ʿij'la bikuf'rihim qul bi'samā yamurukum bihi īmānukum in kuntum mu'minīna ","translations":["And when","We took","your covenant","and We raised","over you","the mount","Hold","what","We gave you","with firmness","and listen","They said","We heard","and we disobeyed","And they were made to drink","in","their hearts","(love of) the calf","because of their disbelief","Say","Evil (is) that","orders you (to do) it","with","your faith","if","you are","believers","(93)"],"transliterationArr":["wa-idh","akhadhnā","mīthāqakum","warafaʿnā","fawqakumu","al-ṭūra","khudhū","mā","ātaynākum","biquwwatin","wa-is'maʿū","qālū","samiʿ'nā","waʿaṣaynā","wa-ush'ribū","fī","qulūbihimu","al-ʿij'la","bikuf'rihim","qul","bi'samā","yamurukum","bihi","īmānukum","in","kuntum","mu'minīna",null],"verseTiming":[[1,0,660],[2,660,1640],[3,1640,2980],[4,2980,4150],[5,4150,5160],[6,5160,5930],[7,5930,6570],[8,6570,8410],[9,8410,10580],[10,10580,12430],[11,12430,13460],[12,13460,14500],[13,14500,15560],[14,15560,16780],[15,16780,17890],[16,17890,18290],[17,18290,19490],[18,19490,20360],[19,20360,21820],[20,21820,22220],[21,22220,23210],[22,23210,24560],[23,24560,26849],[24,26849,28179],[25,28179,28429],[26,28429,30589],[27,30589,34424]]}},{"name":"2:94","price":"Sọ pé: “Tí ó bá jẹ́ pé tiyín nìkan ni Ilé Ìkẹ́yìn tí ń bẹ ní ọ̀dọ̀ Allāhu, tí kò sì níí jẹ́ ti àwọn ènìyàn (mìíràn), ẹ tọrọ ikú, tí ẹ bá jẹ́ olódodo.”","arabic":"قُلۡ إِن كَانَتۡ لَكُمُ ٱلدَّارُ ٱلۡأٓخِرَةُ عِندَ ٱللَّهِ خَالِصَةٗ مِّن دُونِ ٱلنَّاسِ فَتَمَنَّوُاْ ٱلۡمَوۡتَ إِن كُنتُمۡ صَٰدِقِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":101,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"qul in kānat lakumu al-dāru al-ākhiratu ʿinda al-lahi khāliṣatan min dūni al-nāsi fatamannawū al-mawta in kuntum ṣādiqīna ","translations":["Say","If ","is","for you","the home","(of) the Hereafter","with","Allah","exclusively","from","excluding","the mankind","then wish","(for) [the] death","if","you are","truthful","(94)"],"transliterationArr":["qul","in","kānat","lakumu","al-dāru","al-ākhiratu","ʿinda","al-lahi","khāliṣatan","min","dūni","al-nāsi","fatamannawū","al-mawta","in","kuntum","ṣādiqīna",null],"verseTiming":[[1,0,470],[2,470,1440],[3,1440,2230],[4,2230,2800],[5,2800,3560],[6,3560,4740],[7,4740,5900],[8,5900,6730],[9,6730,7800],[10,7800,8960],[11,8960,9640],[12,9640,10300],[13,10300,11610],[14,11610,13520],[15,13520,15680],[16,15680,16540],[17,16540,17370],[18,17370,18760],[19,18760,21505]]}},{"name":"2:95","price":"Wọn kò níí tọrọ rẹ̀ láéláé nítorí ohun tí ọwọ́ wọn tì síwájú. Allāhu sì ni Onímọ̀ nípa àwọn alábòsí.","arabic":"وَلَن يَتَمَنَّوۡهُ أَبَدَۢا بِمَا قَدَّمَتۡ أَيۡدِيهِمۡۚ وَٱللَّهُ عَلِيمُۢ بِٱلظَّٰلِمِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":102,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"walan yatamannawhu abadan bimā qaddamat aydīhim wal-lahu ʿalīmun bil-ẓālimīna ","translations":["And never (will)","they wish for it","ever","because","(of what) sent ahead","their hands","And Allah","(is) All-Knower","of the wrongdoers","(95)"],"transliterationArr":["walan","yatamannawhu","abadan","bimā","qaddamat","aydīhim","wal-lahu","ʿalīmun","bil-ẓālimīna",null],"verseTiming":[[1,0,510],[2,510,3440],[3,3440,4830],[4,4830,5420],[5,5420,6440],[6,6440,8030],[7,8030,8980],[8,8980,10610],[9,10610,13515]]}},{"name":"2:96","price":"Dájúdájú o máa rí wọn pé àwọn ni ènìyàn tó l’ójú kòkòrò jùlọ nípa ìṣẹ̀mí ayé, (wọ́n tún l’ójú kòkòrò ju) àwọn ọ̀ṣẹbọ lọ. Ìkọ̀ọ̀kan wọn ń fẹ́ pé tí A bá lè fún òun ní ẹgbẹ̀rún ọdún lò láyé. Bẹ́ẹ̀ sì ni, kì í ṣe ohun tí ó máa là á nínú ìyà ni pé, kí Á fún un ní ìṣẹ̀mí gígùn lò. Allāhu sì ni Olùríran nípa ohun tí wọ́n ń ṣe níṣẹ́.","arabic":"وَلَتَجِدَنَّهُمۡ أَحۡرَصَ ٱلنَّاسِ عَلَىٰ حَيَوٰةٖ وَمِنَ ٱلَّذِينَ أَشۡرَكُواْۚ يَوَدُّ أَحَدُهُمۡ لَوۡ يُعَمَّرُ أَلۡفَ سَنَةٖ وَمَا هُوَ بِمُزَحۡزِحِهِۦ مِنَ ٱلۡعَذَابِ أَن يُعَمَّرَۗ وَٱللَّهُ بَصِيرُۢ بِمَا يَعۡمَلُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":103,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"walatajidannahum aḥraṣa al-nāsi ʿalā ḥayatin wamina alladhīna ashrakū yawaddu aḥaduhum law yuʿammaru alfa sanatin wamā huwa bimuzaḥziḥihi mina al-ʿadhābi an yuʿammara wal-lahu baṣīrun bimā yaʿmalūna ","translations":["And surely you will find them","(the) most greedy","(of) [the] mankind","for","life","and (greedier) than","those who","associate[d] partners (with Allah)","Loves","(each) one of them","if","he could be granted a life","(of) a thousand","year(s)","But not","it","(will) remove him","from","the punishment","that","he should be granted life","And Allah","(is) All-Seer","of what","they do","(96)"],"transliterationArr":["walatajidannahum","aḥraṣa","al-nāsi","ʿalā","ḥayatin","wamina","alladhīna","ashrakū","yawaddu","aḥaduhum","law","yuʿammaru","alfa","sanatin","wamā","huwa","bimuzaḥziḥihi","mina","al-ʿadhābi","an","yuʿammara","wal-lahu","baṣīrun","bimā","yaʿmalūna",null],"verseTiming":[[1,0,2560],[2,2560,3440],[3,3440,5260],[4,5260,5870],[5,5870,7640],[6,7640,8100],[7,8100,9100],[8,9100,10210],[9,10210,11360],[10,11360,12290],[11,12290,12680],[12,12680,14280],[13,14280,14810],[14,14810,16050],[15,16050,16710],[16,16710,17060],[17,17060,18700],[18,18700,19040],[19,19040,20000],[20,20000,20230],[21,20230,22990],[22,22990,23980],[23,23980,25540],[24,25540,26170],[25,26170,28745]]}},{"name":"2:97","price":"Sọ pé: “Ẹnikẹ́ni tí ó bá jẹ́ ọ̀tá fún (mọlāika) Jibrīl,¹ (ó ti di ọ̀tá Allāhu) nítorí pé, dájúdájú (mọlāika) Jibrīl ló sọ al-Ƙur’ān kalẹ̀ sínú ọkàn rẹ pẹ̀lú àṣẹ Allāhu. Al-Ƙur’ān sì ń fi ohun tó jẹ́ òdodo rinlẹ̀ nípa èyí tó wá ṣíwájú rẹ̀. Ó jẹ́ ìmọ̀nà àti ìdùnnú fún àwọn onígbàgbọ́ òdodo.","arabic":"قُلۡ مَن كَانَ عَدُوّٗا لِّـجِبۡرِيلَ فَإِنَّهُۥ نَزَّلَهُۥ عَلَىٰ قَلۡبِكَ بِإِذۡنِ ٱللَّهِ مُصَدِّقٗا لِّمَا بَيۡنَ يَدَيۡهِ وَهُدٗى وَبُشۡرَىٰ لِلۡمُؤۡمِنِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":104,"juzNumber":1,"footnotes":"1. Nínú àwọn mọlāika tí Allāhu - subhānahu wa ta‘ālā - máa ń fi iṣẹ́ ìmísí rán sí àwọn Ànábì àti àwọn Òjíṣẹ́ Rẹ̀ ni mọlaika Jibrīl - kí ọlà Allāhu máa bá a -. Òun sì ni olórí àwọn mọlāika. Mọlaika Jibrīl tún ní àwọn orúkọ mìíràn nínú al-Ƙur’ān. Nínú àwọn orúkọ rẹ̀ ni “ar-Rūh” - Ẹ̀mí - (sūrah al-Mọ‘ārij; 70:4), “rūhul-ƙudus” - Ẹ̀mí Mímọ́ - (sūrah an-Nahl; 16:102) àti “rūhul-’Amīn” - Ẹ̀mí Ìfàyàbalẹ̀, Ẹ̀mí tí kì í jàǹbá iṣẹ́ tí Allāhu fi rán an. - (sūrah aṣ-Ṣu‘arọ̄’; 26:193). Àmọ́ yàtọ̀ sí pé, mọlāika Jibrīl ń jẹ́ “ar-rūh”, nínú al-Ƙur’ān “rūh” tún lè túmọ̀ sí “ìmísí tàbí al-ƙur’ān (sūrah an-Nahl; 16:2); “rūh” lè túmọ̀ sí “ẹ̀mí” tí a fi ń jẹ́ abẹ̀mí (sūrah al-’Isrọ̄’; 17:85); àti bẹ́ẹ̀ bẹ́ẹ̀ lọ.","lang":"yo","meta":{"transliteration":"qul man kāna ʿaduwwan lijib'rīla fa-innahu nazzalahu ʿalā qalbika bi-idh'ni al-lahi muṣaddiqan limā bayna yadayhi wahudan wabush'rā lil'mu'minīna ","translations":["Say","Whoever","is","an enemy","to Jibreel ","then indeed he","brought it down","on","your heart","by (the) permission","(of) Allah","confirming","what","(was)","before it","and a guidance","and glad tiding(s)","for the believers","(97)"],"transliterationArr":["qul","man","kāna","ʿaduwwan","lijib'rīla","fa-innahu","nazzalahu","ʿalā","qalbika","bi-idh'ni","al-lahi","muṣaddiqan","limā","bayna","yadayhi","wahudan","wabush'rā","lil'mu'minīna",null],"verseTiming":[[1,0,490],[2,490,1820],[3,1820,2420],[4,2420,3290],[5,3290,4660],[6,4660,6370],[7,6370,7490],[8,7490,8100],[9,8100,8930],[10,8930,9770],[11,9770,12110],[12,12110,13880],[13,13880,15010],[14,15010,15610],[15,15610,16440],[16,16440,17230],[17,17230,18000],[18,18000,19080],[19,19080,19730],[20,19730,20370],[21,20370,21140],[22,21140,21860],[23,21860,23600],[24,23600,26485]]}},{"name":"2:98","price":"Ẹnikẹ́ni tí ó bá jẹ́ ọ̀tá fún Allāhu, àwọn mọlāika Rẹ̀, àwọn Òjíṣẹ́ Rẹ̀, mọlāika Jibrīl àti mọlāika Mīkāl, dájúdájú Allāhu ni ọ̀tá fún àwọn aláìgbàgbọ́.”","arabic":"مَن كَانَ عَدُوّٗا لِّلَّهِ وَمَلَٰٓئِكَتِهِۦ وَرُسُلِهِۦ وَجِبۡرِيلَ وَمِيكَىٰلَ فَإِنَّ ٱللَّهَ عَدُوّٞ لِّلۡكَٰفِرِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":105,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"man kāna ʿaduwwan lillahi wamalāikatihi warusulihi wajib'rīla wamīkāla fa-inna al-laha ʿaduwwun lil'kāfirīna ","translations":["Whoever","is","an enemy","(to) Allah","and His Angels","and His Messengers","and Jibreel","and Meekael","then indeed","Allah","(is) an enemy","to the disbelievers","(98)"],"transliterationArr":["man","kāna","ʿaduwwan","lillahi","wamalāikatihi","warusulihi","wajib'rīla","wamīkāla","fa-inna","al-laha","ʿaduwwun","lil'kāfirīna",null],"verseTiming":[[1,0,1530],[2,1530,2110],[3,2110,2960],[4,2960,4090],[5,4090,7120],[6,7120,8310],[7,8310,9520],[8,9520,10720],[9,10720,12040],[10,12040,12970],[11,12970,13830],[12,13830,16995]]}},{"name":"2:99","price":"Dájúdájú A ti sọ àwọn āyah tó yanjú kalẹ̀ fún ọ. Ẹnì kan kò níí ṣàì gbàgbọ́ nínú rẹ̀ àyàfi àwọn arúfin.","arabic":"وَلَقَدۡ أَنزَلۡنَآ إِلَيۡكَ ءَايَٰتِۭ بَيِّنَٰتٖۖ وَمَا يَكۡفُرُ بِهَآ إِلَّا ٱلۡفَٰسِقُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":106,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"walaqad anzalnā ilayka āyātin bayyinātin wamā yakfuru bihā illā al-fāsiqūna ","translations":["And indeed","We revealed","to you","Verses","clear","and not","disbelieves","in them","except","the defiantly disobedient","(99)"],"transliterationArr":["walaqad","anzalnā","ilayka","āyātin","bayyinātin","wamā","yakfuru","bihā","illā","al-fāsiqūna",null],"verseTiming":[[1,0,860],[2,860,4260],[3,4260,5040],[4,5040,7010],[5,7010,10010],[6,10010,10590],[7,10590,11350],[8,11350,13380],[9,13380,13940],[10,13940,17185]]}},{"name":"2:100","price":"Àti pé ṣé gbogbo ìgbà tí wọ́n bá dá májẹ̀mu kan ni apá kan nínú wọn yóò máa jù ú nù? Rárá, ọ̀pọ̀lọ́pọ̀ wọn gan-an ni kò gbàgbọ́.","arabic":"أَوَكُلَّمَا عَٰهَدُواْ عَهۡدٗا نَّبَذَهُۥ فَرِيقٞ مِّنۡهُمۚ بَلۡ أَكۡثَرُهُمۡ لَا يُؤۡمِنُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":107,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"awakullamā ʿāhadū ʿahdan nabadhahu farīqun min'hum bal aktharuhum lā yu'minūna ","translations":["And is (it not that) whenever","they took","a covenant","threw it away","a party","of them","Nay","most of them","(do) not","believe","(100)"],"transliterationArr":["awakullamā","ʿāhadū","ʿahdan","nabadhahu","farīqun","min'hum","bal","aktharuhum","lā","yu'minūna",null],"verseTiming":[[1,0,1470],[2,1470,2450],[3,2450,3140],[4,3140,4910],[5,4910,5740],[6,5740,7950],[7,7950,8310],[8,8310,9450],[9,9450,9850],[10,9850,12375]]}},{"name":"2:101","price":"¹0¹. Àti pé nígbà tí Òjíṣẹ́ kan láti ọ̀dọ̀ Allāhu dé bá wọn, tí ó ń jẹ́rìí sí èyí tó jẹ́ òdodo nínú ohun tó wà pẹ̀lú wọn, apá kan nínú àwọn tí A fún ní Tírà gbé Tírà Allāhu jù s’ẹ́yìn lẹ́yìn wọn bí ẹni pé wọn kò mọ̀ (pé àsọọ́lẹ̀ nípa Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - wà nínú rẹ̀)!","arabic":"وَلَمَّا جَآءَهُمۡ رَسُولٞ مِّنۡ عِندِ ٱللَّهِ مُصَدِّقٞ لِّمَا مَعَهُمۡ نَبَذَ فَرِيقٞ مِّنَ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ كِتَٰبَ ٱللَّهِ وَرَآءَ ظُهُورِهِمۡ كَأَنَّهُمۡ لَا يَعۡلَمُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":108,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"walammā jāahum rasūlun min ʿindi al-lahi muṣaddiqun limā maʿahum nabadha farīqun mina alladhīna ūtū al-kitāba kitāba al-lahi warāa ẓuhūrihim ka-annahum lā yaʿlamūna ","translations":["And when","came to them","a Messenger","(of)","from","Allah","confirming","what","(was) with them","threw away","a party","of","those who","were given","the Book","(the) Book","(of) Allah","behind","their backs","as if they","(do) not","know","(101)"],"transliterationArr":["walammā","jāahum","rasūlun","min","ʿindi","al-lahi","muṣaddiqun","limā","maʿahum","nabadha","farīqun","mina","alladhīna","ūtū","al-kitāba","kitāba","al-lahi","warāa","ẓuhūrihim","ka-annahum","lā","yaʿlamūna",null],"verseTiming":[[1,0,1680],[2,1680,4190],[3,4190,4970],[4,4970,5910],[5,5910,7180],[6,7180,7870],[7,7870,8940],[8,8940,9640],[9,9640,10480],[10,10480,11000],[11,11000,11800],[12,11800,13000],[13,13000,14050],[14,14050,14600],[15,14600,15550],[16,15550,16290],[17,16290,17130],[18,17130,17530],[19,17530,20700],[20,20700,22380],[21,22380,22780],[22,22780,25235]]}},{"name":"2:102","price":"Wọ́n sì tẹ̀lé ohun tí àwọn èṣù àlùjànnú ń kà (fún wọn nínú idán lásìkò) ìjọba (Ànábì) Sulaemọ̄n. (Ànábì) Sulaemọ̄n kò sì di kèfèrí, ṣùgbọ́n àwọn èṣù àlùjànnú ni wọ́n di kèfèrí, wọ́n ń kọ́ àwọn ènìyàn ní idán àti ohun tí wọ́n sọ̀kalẹ̀ fún àwọn mọlāika méjèèjì, Hārūt àti Mọ̄rūt ní ìlú Bābil.¹ Àwọn mọlāika méjèèjì náà kò sì níí kọ́ ẹnikẹ́ni àyàfi kí wọ́n sọ pé: “Àdánwò ni wá. Nítorí náà, má di kèfèrí.” Wọ́n sì ń kẹ́kọ̀ọ́ ohun tí wọn yóò fi ṣòpínyà láààrin ọmọnìyàn àti ẹnì kejì rẹ̀ lọ́dọ̀ wọn. - Wọn kò sì lè kó ìnira bá ẹnikẹ́ni àyàfi pẹ̀lú ìyọ̀ǹda Allāhu. - Wọ́n ń kẹ́kọ̀ọ́ ohun tí ó máa kó ìnira bá wọn, tí kò sì níí ṣe wọ́n ní àǹfààní. Wọ́n kúkú ti mọ̀ pé ẹnikẹ́ni tí ó bá ra idán, kò níí sí ìpín rere kan fún un ní Ọjọ́ Ìkẹ́yìn. Aburú sì ni ohun tí wọ́n rà fún ẹ̀mí ara wọn tí ó bá jẹ́ pé wọ́n mọ̀.","arabic":"وَٱتَّبَعُواْ مَا تَتۡلُواْ ٱلشَّيَٰطِينُ عَلَىٰ مُلۡكِ سُلَيۡمَٰنَۖ وَمَا كَفَرَ سُلَيۡمَٰنُ وَلَٰكِنَّ ٱلشَّيَٰطِينَ كَفَرُواْ يُعَلِّمُونَ ٱلنَّاسَ ٱلسِّحۡرَ وَمَآ أُنزِلَ عَلَى ٱلۡمَلَكَيۡنِ بِبَابِلَ هَٰرُوتَ وَمَٰرُوتَۚ وَمَا يُعَلِّمَانِ مِنۡ أَحَدٍ حَتَّىٰ يَقُولَآ إِنَّمَا نَحۡنُ فِتۡنَةٞ فَلَا تَكۡفُرۡۖ فَيَتَعَلَّمُونَ مِنۡهُمَا مَا يُفَرِّقُونَ بِهِۦ بَيۡنَ ٱلۡمَرۡءِ وَزَوۡجِهِۦۚ وَمَا هُم بِضَآرِّينَ بِهِۦ مِنۡ أَحَدٍ إِلَّا بِإِذۡنِ ٱللَّهِۚ وَيَتَعَلَّمُونَ مَا يَضُرُّهُمۡ وَلَا يَنفَعُهُمۡۚ وَلَقَدۡ عَلِمُواْ لَمَنِ ٱشۡتَرَىٰهُ مَا لَهُۥ فِي ٱلۡأٓخِرَةِ مِنۡ خَلَٰقٖۚ وَلَبِئۡسَ مَا شَرَوۡاْ بِهِۦٓ أَنفُسَهُمۡۚ لَوۡ كَانُواْ يَعۡلَمُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":109,"juzNumber":1,"footnotes":"1. Kíyè sí i, àwọn onímọ̀ Tafsīr tí wọ́n gbà pé mọlāika ni Hārūt àti Mọ̄rūt, wọ́n túmọ̀ āyah yìí pé, “ṣùgbọ́n àwọn èṣù àlùjànnú ni wọ́n di kèfèrí, wọ́n ń kọ́ àwọn ènìyàn ní idán àti ohun tí wọ́n sọ̀kalẹ̀ fún àwọn mọlāika méjèèjì náà Hārūt àti Mọ̄rūt,…”. Ṣùgbọ́n àwọn onímọ̀ Tafsīr tí wọ́n gbà pé orúkọ àwọn àlùjànnú méjì kan ni Hārūt àti Mọ̄rūt, wọ́n túmọ̀ āyah yìí pé, “(Ànábì) Sulaemọ̄n kò sì di kèfèrí, … àti pé wọn kò sọ idán kalẹ̀ fún àwọn mọlāika méjì náà “(ìyẹn, Jibrīl àti Mīkā’īl). Hārūt àti Mọ̄rūt sì ni àlùjànnú tí ń kọ́ àwọn ènìyàn ní idán ní Bābil.” Àmọ́ sá, igun méjèèjì ló ní àlàyé ìdáláre lórí rẹ̀ nínú èdè Lárúbáwá, kì í ṣe nínú hadīth. \n Síwájú sí i, àpólà ọ̀rọ̀-orúkọ yìí “ ‘alā muliki Sulaemọ̄n” kò túmọ̀ sí lórí àga ìjọba Ànábì Sulaemọ̄n - kí ọlà Allāhu máa bá a -. Rárá o. Kò sí ìgbà kan kan tí èṣù àlùjànnú rọ́nà jẹ gàba rí lórí àga Ànábì Sulaemọ̄n - kí ọlà Allāhu máa bá a -. Ohun tí ó ṣẹlẹ̀ ni pé, bí Ànábì Sulaemọ̄n - kí ọlà Allāhu máa bá a - ṣe ń kọ́ àwọn ènìyàn rẹ̀ ní ìgbàgbọ́ òdodo tí Allāhu - subhānahu wa ta‘ālā - fi rán an níṣẹ́ sí wọn, bẹ́ẹ̀ náà ni àwọn èṣù àlùjànnú kan ń lọ bá àwọn ènìyàn láti máa kọ́ wọn ní ẹ̀kọ́ idán láti máa fi tako ìgbàgbọ́ òdodo tí wọ́n ń gbọ́ lọ́dọ̀ Ànábì Sulaemọ̄n - kí ọlà Allāhu máa bá a -. Níkété tí ìró aburú yìí détí ìgbọ́ Ànábì Sulaemọ̄n - kí ọlà Allāhu máa bá a - ló pàṣẹ láti gba gbogbo àkọsílẹ̀ idán náà lọ́wọ́ wọn. Ó sì bo gbogbo rẹ̀ mọ́ inú ilẹ̀. Àmọ́ lẹ́yìn ikú rẹ̀, àwọn agbọ́mágbà ènìyàn kan pẹ̀lú àwọn èṣù àlùjànnú olóríkunkun padà wá a kàn ní ibi tí Ànábì Sulaemọ̄n - kí ọlà Allāhu máa bá a - bò ó mọ́. Wọ́n sì padà síbi lílo idán náà, wọ́n sì tún ń ba Ànábì Sulaemọ̄n - kí ọlà Allāhu máa bá a - lórúkọ jẹ́ kiri ìlú pé, ohun tí ó fi ṣe ìjọba lórí àwọn ẹ̀dá nìyẹn. Ọ̀rọ̀ kò sì rí bẹ́ẹ̀. Ìgbàgbọ́ òdodo àti àwọn iṣẹ́ ìyanu ni Ànábì Sulaemọ̄n - kí ọlà Allāhu máa bá a - fi ṣe ìjọba rẹ̀, kì í ṣe idán. Ẹ tún ka ìtọsẹ̀-ọ̀rọ̀ sūrah Sọ̄d; 38:34. W-Allāhu ’a‘lam.","lang":"yo","meta":{"transliteration":"wa-ittabaʿū mā tatlū al-shayāṭīnu ʿalā mul'ki sulaymāna wamā kafara sulaymānu walākinna al-shayāṭīna kafarū yuʿallimūna al-nāsa al-siḥ'ra wamā unzila ʿalā al-malakayni bibābila hārūta wamārūta wamā yuʿallimāni min aḥadin ḥattā yaqūlā innamā naḥnu fit'natun falā takfur fayataʿallamūna min'humā mā yufarriqūna bihi bayna al-mari wazawjihi wamā hum biḍārrīna bihi min aḥadin illā bi-idh'ni al-lahi wayataʿallamūna mā yaḍurruhum walā yanfaʿuhum walaqad ʿalimū lamani ish'tarāhu mā lahu fī al-ākhirati min khalāqin walabi'sa mā sharaw bihi anfusahum law kānū yaʿlamūna ","translations":["And they followed","what","recite(d)","the devils","over","(the) kingdom","(of) Sulaiman","And not","disbelieved","Sulaiman","[and] but","the devils","disbelieved","they teach","the people","[the] magic","and what","was sent down","to","the two angels","in Babylon","Harut","and Marut","And not","they both teach","any","one","unless","they [both] say","Only","we","(are) a trial","so (do) not","disbelieve","But they learn","from those two","what","[they] causes separation","with it","between","the man","and his spouse","And not","they (could)","at all [be those who] harm","with it","any","one","except","by permission","(of) Allah","And they learn","what","harms them","and not","profits them","And indeed","they knew","that whoever","buys it","not","for him","in","the Hereafter","any","share","And surely evil","(is) what","they sold","with it","themselves","if","they were","(to) know","(102)"],"transliterationArr":["wa-ittabaʿū","mā","tatlū","al-shayāṭīnu","ʿalā","mul'ki","sulaymāna","wamā","kafara","sulaymānu","walākinna","al-shayāṭīna","kafarū","yuʿallimūna","al-nāsa","al-siḥ'ra","wamā","unzila","ʿalā","al-malakayni","bibābila","hārūta","wamārūta","wamā","yuʿallimāni","min","aḥadin","ḥattā","yaqūlā","innamā","naḥnu","fit'natun","falā","takfur","fayataʿallamūna","min'humā","mā","yufarriqūna","bihi","bayna","al-mari","wazawjihi","wamā","hum","biḍārrīna","bihi","min","aḥadin","illā","bi-idh'ni","al-lahi","wayataʿallamūna","mā","yaḍurruhum","walā","yanfaʿuhum","walaqad","ʿalimū","lamani","ish'tarāhu","mā","lahu","fī","al-ākhirati","min","khalāqin","walabi'sa","mā","sharaw","bihi","anfusahum","law","kānū","yaʿlamūna",null],"verseTiming":[[1,0,1300],[2,1300,1600],[3,1600,2290],[4,2290,3690],[5,3690,4350],[6,4350,4910],[7,4910,8430],[8,8430,8960],[9,8960,9560],[10,9560,10750],[11,10750,12260],[12,12260,13630],[13,13630,14400],[14,14400,15690],[15,15690,16960],[16,16960,17780],[17,17780,19830],[18,19830,21330],[19,21330,21670],[20,21670,22920],[21,22920,23930],[22,23930,24975],[23,24975,27977],[24,27977,28895],[25,28895,30235],[26,30235,30440],[27,30440,31160],[28,31160,31920],[29,31920,34380],[30,34380,35900],[31,35900,36420],[32,36420,37890],[33,37890,38760],[34,38760,39530],[35,39530,41680],[36,41680,42630],[37,42630,42990],[38,42990,44370],[39,44370,44990],[40,44990,45500],[41,45500,46370],[42,46370,47820],[43,47820,48450],[44,48450,49600],[45,49600,53410],[46,53410,54080],[47,54080,54460],[48,54460,55290],[49,55290,55960],[50,55960,57061],[51,57061,59254],[52,59254,61081],[53,61081,61300],[54,61300,62530],[55,62530,63140],[56,63140,65510],[57,65510,66200],[58,66200,66990],[59,66990,67550],[60,67550,68580],[61,68580,68980],[62,68980,69530],[63,69530,69760],[64,69760,70960],[65,70960,71250],[66,71250,73670],[67,73670,74970],[68,74970,75280],[69,75280,75920],[70,75920,78030],[71,78030,80490],[72,80490,80830],[73,80830,81640],[74,81640,84235]]}},{"name":"2:103","price":"Tí ó bá jẹ́ pé dájúdájú wọ́n gbàgbọ́ ní òdodo, tí wọ́n sì bẹ̀rù (Allāhu), dájúdájú ẹ̀san tí ó máa wá láti ọ̀dọ̀ Allāhu l’óore jùlọ (fún wọn), tí wọ́n bá mọ̀.","arabic":"وَلَوۡ أَنَّهُمۡ ءَامَنُواْ وَٱتَّقَوۡاْ لَمَثُوبَةٞ مِّنۡ عِندِ ٱللَّهِ خَيۡرٞۚ لَّوۡ كَانُواْ يَعۡلَمُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":110,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"walaw annahum āmanū wa-ittaqaw lamathūbatun min ʿindi al-lahi khayrun law kānū yaʿlamūna ","translations":["And if","[that] they","(had) believed","and feared (Allah)","surely (the) reward","(of)","from","Allah","(would have been) better","if","they were","(to) know","(103)"],"transliterationArr":["walaw","annahum","āmanū","wa-ittaqaw","lamathūbatun","min","ʿindi","al-lahi","khayrun","law","kānū","yaʿlamūna",null],"verseTiming":[[1,0,760],[2,760,2290],[3,2290,3380],[4,3380,4230],[5,4230,5530],[6,5530,6490],[7,6490,7890],[8,7890,8600],[9,8600,10980],[10,10980,11360],[11,11360,12280],[12,12280,15775]]}},{"name":"2:104","price":"Ẹ̀yin tí ẹ gbàgbọ́ ní òdodo, ẹ má sọ pé “rọ̄‘inā”. (Àmọ́) ẹ sọ pé “unṭḥurnā”¹, kí ẹ sì máa tẹ́tí gbọ́ (ọ̀rọ̀ ẹ̀sìn). Ìyà ẹlẹ́ta-eléro sì wà fún àwọn aláìgbàgbọ́.","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَقُولُواْ رَٰعِنَا وَقُولُواْ ٱنظُرۡنَا وَٱسۡمَعُواْۗ وَلِلۡكَٰفِرِينَ عَذَابٌ أَلِيمٞ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":111,"juzNumber":1,"footnotes":"1. Rọ̄‘inā jẹ́ ọ̀rọ̀ méjì; “rọ̄‘i” àti “nā”. “Nā” jẹ́ ọ̀rọ̀ arọ́pò-orúkọ ẹnì kíní ọ̀pọ̀ “wa”. “Rọ̄‘i” ní ìtúmọ̀ méjì nínú èdè Lárúbáwá àti èdè Isrā’īl. Bákan náà, “rọ̄‘i” lè jẹ́ ọ̀rọ̀-orúkọ tàbí ọ̀rọ̀-ìṣe àṣẹ nínú èdè méjèèjì. Nígbà tí wọ́n bá lo “rọ̄‘i” ní ìlò ọ̀rọ̀-orúkọ, ìtúmọ̀ rẹ̀ ni “òmùgọ̀” nítorí pé ó jẹ́ ọ̀rọ̀ ìṣẹ̀dá láti ara “ru‘ūnah” agọ̀. Àmọ́ nígbà tí wọ́n bá lo “rọ̄‘i” ní ìlò ọ̀rọ̀-ìṣe àṣẹ, ìtúmọ̀ rẹ̀ ni “kíyè sí (i), wò (ó),” nítorí pé ó jẹ́ ọ̀rọ̀ ìṣẹ̀dá láti ara “ri‘ānah” kíkíyèsí tàbí mímójútó kiní kan / ẹnì kan. Ìgbàkígbà tí àwọn yẹhudi bá lo “rọ̄‘i” fún àwọn Ànábì wọn, ìlò ọ̀rọ̀-orúkọ ni wọ́n ń gbàlérò. \n Ìyẹn túmọ̀ sí pé, tí wọ́n bá sọ fún àwọn Ànábì wọn pé “rọ̄‘inā”, ohun tí wọ́n ń gbà lérò ni pé “òmùgọ̀ wa!”. Àmọ́ nígbà tí àwọn Sọhābah - kí Allāhu yọ́nú sí wọn - bá lò “rọ̄‘inā” fún Ànábì - kí ọlà Allāhu máa bá a -, ìlò ọ̀rọ̀-ìṣe àṣẹ ni wọ́n ń gbàlérò. Ìyẹn túmọ̀ sí pé àwọn Sọhābah ń sọ pé “kí Ànábì kíyè sí wa”. Nítorí kí àwọn yẹhudi má baà ṣe lérò pé irú wọn ni àwọn Sọhābah ni Allāhu fi kọ lílo ọ̀rọ̀ yẹn fún àwọn Sọhābah - kí Allāhu yọ́nú sí wọn -, Ó sì fún wọn ní ọ̀rọ̀ mìíràn tí ó gbé ìtúmọ̀ àti èròǹgbà rere wọn jáde, tí kò sì jẹmọ́ èdè abunikù. Èyí sì ni “unṭḥurnā”. Èyí rí bẹ́ẹ̀ kí àwa mùsùlùmí lè mọ̀ pé ìlò èdè wa àti ìṣe wa kò gbọdọ̀ jọ tàwọn aláìgbàgbọ́.","lang":"yo","meta":{"transliteration":"yāayyuhā alladhīna āmanū lā taqūlū rāʿinā waqūlū unẓur'nā wa-is'maʿū walil'kāfirīna ʿadhābun alīmun ","translations":["O you","who","believe[d]","(Do) not","say","Raina","and say","Unzurna","and listen","And for the disbelievers","(is) a punishment","painful","(104)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","lā","taqūlū","rāʿinā","waqūlū","unẓur'nā","wa-is'maʿū","walil'kāfirīna","ʿadhābun","alīmun",null],"verseTiming":[[1,0,2860],[2,2860,3770],[3,3770,4720],[4,4720,5050],[5,5050,6060],[6,6060,7020],[7,7020,7950],[8,7950,9410],[9,9410,10570],[10,10570,12590],[11,12590,13590],[12,13590,15805]]}},{"name":"2:105","price":"Àwọn tó ṣàì gbàgbọ́ nínú àwọn tí A fún ní Tírà àti àwọn ọ̀ṣẹbọ kò níí fẹ́ kí wọ́n sọ oore kan kan kalẹ̀ fún yín láti ọ̀dọ̀ Olúwa yín. Allāhu ló ń fi ìkẹ́ Rẹ̀ ṣa ẹni tí Ó bá fẹ́ lẹ́ṣà. Allāhu sì ni Olóore ńlá.","arabic":"مَّا يَوَدُّ ٱلَّذِينَ كَفَرُواْ مِنۡ أَهۡلِ ٱلۡكِتَٰبِ وَلَا ٱلۡمُشۡرِكِينَ أَن يُنَزَّلَ عَلَيۡكُم مِّنۡ خَيۡرٖ مِّن رَّبِّكُمۡۚ وَٱللَّهُ يَخۡتَصُّ بِرَحۡمَتِهِۦ مَن يَشَآءُۚ وَٱللَّهُ ذُو ٱلۡفَضۡلِ ٱلۡعَظِيمِ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":112,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"mā yawaddu alladhīna kafarū min ahli al-kitābi walā al-mush'rikīna an yunazzala ʿalaykum min khayrin min rabbikum wal-lahu yakhtaṣṣu biraḥmatihi man yashāu wal-lahu dhū al-faḍli al-ʿaẓīmi ","translations":["(Do) not","like","those who","disbelieve","from","(the) People","(of) the Book","and not","those who associate partners (with Allah)","that","(there should) be sent down","to you","any","good","from","your Lord","And Allah","chooses","for His Mercy","whom","He wills","And Allah","(is the) Possessor","(of) [the] Bounty","[the] Great","(105)"],"transliterationArr":["mā","yawaddu","alladhīna","kafarū","min","ahli","al-kitābi","walā","al-mush'rikīna","an","yunazzala","ʿalaykum","min","khayrin","min","rabbikum","wal-lahu","yakhtaṣṣu","biraḥmatihi","man","yashāu","wal-lahu","dhū","al-faḍli","al-ʿaẓīmi",null],"verseTiming":[[1,0,570],[2,570,1260],[3,1260,2170],[4,2170,3000],[5,3000,3350],[6,3350,3910],[7,3910,4850],[8,4850,5220],[9,5220,6520],[10,6520,6860],[11,6860,8360],[12,8360,9280],[13,9280,10050],[14,10050,10730],[15,10730,11730],[16,11730,13350],[17,13350,14280],[18,14280,15340],[19,15340,16680],[20,16680,16920],[21,16920,20670],[22,20670,21570],[23,21570,21740],[24,21740,22540],[25,22540,25115]]}},{"name":"2:106","price":"Ohunkóhun tí A bá parẹ́ (tàbí pààrọ̀) nínú āyah kan¹ tàbí tí A sọ di ìgbàgbé, A máa mú èyí tó dára jù ú lọ tàbí irú rẹ̀ wá. Ṣé ìwọ kò mọ̀ pé dájúdájú Allāhu ni Alágbára lórí gbogbo n̄ǹkan?","arabic":"۞ مَا نَنسَخۡ مِنۡ ءَايَةٍ أَوۡ نُنسِهَا نَأۡتِ بِخَيۡرٖ مِّنۡهَآ أَوۡ مِثۡلِهَآۗ أَلَمۡ تَعۡلَمۡ أَنَّ ٱللَّهَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٌ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":113,"juzNumber":1,"footnotes":"1. Èyí ni pé, kí ìdájọ́ tí ó wà nínú āyah kan di ohun tí a ò níí lò mọ́ nítorí ìdájọ́ titun tí āyah mìíràn mú wá, gẹ́gẹ́ bí àwọn āyah ìdájọ́ kan tí ó sọ̀kalẹ̀ lẹ́yìn Hijrah (āyah Mọdaniyyah) ṣe pa ìdájọ́ àwọn āyah tí ó sọ̀kalẹ̀ ṣíwájú Hijrah (āyah Mọkiyyah) rẹ́ àti gẹ́gẹ́ bí àwọn āyah ìdájọ́ kan tí ó sọ̀kalẹ̀ nínú àwọn ọdún ìparí nínú ìlú Mọdīnah ṣe pa àwọn āyah ìdájọ́ kan tí ó sọ̀kalẹ̀ nínú àwọn ọdún ìbẹ̀rẹ̀ nínú ìlú Mọdīnah rẹ́. Àpèjúwe fífi ìdájọ́ kan pa ìdájọ́ kan rẹ́ ni kí halāl di harām tàbí kí harām di halāl, tàbí kí ọ̀ran-anyàn di sunnah tàbí kí sunnah di ọ̀ran-anyàn.","lang":"yo","meta":{"transliteration":"mā nansakh min āyatin aw nunsihā nati bikhayrin min'hā aw mith'lihā alam taʿlam anna al-laha ʿalā kulli shayin qadīrun ","translations":["What","We abrogate","(of)","a sign","or","[We] cause it to be forgotten","We bring","better","than it","or","similar (to) it","Do not","you know","that","Allah","over","every","thing","(is) All-Powerful","(106)"],"transliterationArr":["mā","nansakh","min","āyatin","aw","nunsihā","nati","bikhayrin","min'hā","aw","mith'lihā","alam","taʿlam","anna","al-laha","ʿalā","kulli","shayin","qadīrun",null],"verseTiming":[[1,0,670],[2,670,2140],[3,2140,2520],[4,2520,3510],[5,3510,3840],[6,3840,5460],[7,5460,6060],[8,6060,6810],[9,6810,9840],[10,9840,10210],[11,10210,11250],[12,11250,12180],[13,12180,12990],[14,12990,14210],[15,14210,15030],[16,15030,15600],[17,15600,16200],[18,16200,17960],[19,17960,20695]]}},{"name":"2:107","price":"Ṣé ìwọ kò mọ̀ pé dájúdájú ti Allāhu ni ìjọba àwọn sánmọ̀ àti ilẹ̀? Kò sì sí aláàbò àti alárànṣe kan fún yín lẹ́yìn Allāhu.","arabic":"أَلَمۡ تَعۡلَمۡ أَنَّ ٱللَّهَ لَهُۥ مُلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۗ وَمَا لَكُم مِّن دُونِ ٱللَّهِ مِن وَلِيّٖ وَلَا نَصِيرٍ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":114,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"alam taʿlam anna al-laha lahu mul'ku al-samāwāti wal-arḍi wamā lakum min dūni al-lahi min waliyyin walā naṣīrin ","translations":["Do not","you know","that","Allah","for Him","(is the) Kingdom","(of) the heavens","and the earth","And not","(is) for you","from","besides","Allah","any","protector","and not","any helper","(107)"],"transliterationArr":["alam","taʿlam","anna","al-laha","lahu","mul'ku","al-samāwāti","wal-arḍi","wamā","lakum","min","dūni","al-lahi","min","waliyyin","walā","naṣīrin",null],"verseTiming":[[1,0,620],[2,620,1440],[3,1440,2450],[4,2450,3320],[5,3320,3850],[6,3850,4460],[7,4460,5870],[8,5870,7240],[9,7240,7810],[10,7810,8330],[11,8330,9820],[12,9820,10670],[13,10670,11470],[14,11470,12230],[15,12230,13930],[16,13930,14450],[17,14450,16795]]}},{"name":"2:108","price":"Tàbí ẹ fẹ́ máa bèèrè (ọ̀rọ̀kọ́rọ̀) lọ́wọ́ Òjíṣẹ́ yín ni gẹ́gẹ́ bí wọ́n ṣe bèèrè (ọ̀rọ̀kọ́rọ̀) lọ́wọ́ (Ànábì) Mūsā ṣíwájú? Ẹnikẹ́ni tí ó bá fi àìgbàgbọ́ rọ́pò ìgbàgbọ́, dájúdájú ó ti ṣìnà (kúrò) l’ójú ọ̀nà tààrà.","arabic":"أَمۡ تُرِيدُونَ أَن تَسۡـَٔلُواْ رَسُولَكُمۡ كَمَا سُئِلَ مُوسَىٰ مِن قَبۡلُۗ وَمَن يَتَبَدَّلِ ٱلۡكُفۡرَ بِٱلۡإِيمَٰنِ فَقَدۡ ضَلَّ سَوَآءَ ٱلسَّبِيلِ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":115,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"am turīdūna an tasalū rasūlakum kamā su-ila mūsā min qablu waman yatabaddali al-kuf'ra bil-īmāni faqad ḍalla sawāa al-sabīli ","translations":["Or","(do) you wish","that","you ask","your Messenger","as","was asked","Musa","from","before","And whoever","exchanges","[the] disbelief","with [the] faith","so certainly","he went astray (from)","(the) evenness","(of) the way","(108)"],"transliterationArr":["am","turīdūna","an","tasalū","rasūlakum","kamā","su-ila","mūsā","min","qablu","waman","yatabaddali","al-kuf'ra","bil-īmāni","faqad","ḍalla","sawāa","al-sabīli",null],"verseTiming":[[1,0,450],[2,450,1590],[3,1590,2590],[4,2590,3590],[5,3590,4700],[6,4700,5290],[7,5290,5940],[8,5940,6640],[9,6640,8190],[10,8190,9030],[11,9030,9520],[12,9520,11250],[13,11250,12020],[14,12020,13370],[15,13370,13850],[16,13850,14440],[17,14440,16730],[18,16730,19265]]}},{"name":"2:109","price":"Ọ̀pọ̀lọ́pọ̀ nínú àwọn tí A fún ní Tírà fẹ́ láti da yín padà sípò kèfèrí lẹ́yìn tí ẹ ti ní ìgbàgbọ́ òdodo, ní ti kèéta láti inú ẹ̀mí wọn, (àti) lẹ́yìn tí òdodo (’Islām) ti fojú hàn sí wọn. Nítorí náà, ẹ foríjìn wọ́n, kí ẹ ṣàmójú kúrò fún wọn (nípa ìnira tí wọ́n ń fi kàn yín) títí Allāhu yó fi mú àṣẹ Rẹ̀ wá (láti jà wọ́n lógun). Dájúdájú Allāhu ni Alágbára lórí gbogbo n̄ǹkan.","arabic":"وَدَّ كَثِيرٞ مِّنۡ أَهۡلِ ٱلۡكِتَٰبِ لَوۡ يَرُدُّونَكُم مِّنۢ بَعۡدِ إِيمَٰنِكُمۡ كُفَّارًا حَسَدٗا مِّنۡ عِندِ أَنفُسِهِم مِّنۢ بَعۡدِ مَا تَبَيَّنَ لَهُمُ ٱلۡحَقُّۖ فَٱعۡفُواْ وَٱصۡفَحُواْ حَتَّىٰ يَأۡتِيَ ٱللَّهُ بِأَمۡرِهِۦٓۗ إِنَّ ٱللَّهَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":116,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"wadda kathīrun min ahli al-kitābi law yaruddūnakum min baʿdi īmānikum kuffāran ḥasadan min ʿindi anfusihim min baʿdi mā tabayyana lahumu al-ḥaqu fa-iʿ'fū wa-iṣ'faḥū ḥattā yatiya al-lahu bi-amrihi inna al-laha ʿalā kulli shayin qadīrun ","translations":["Wish[ed]","many","from","(the) People","(of) the Book","if","they could turn you back","from","after","your (having) faith","(to) disbelievers","(out of) jealousy","from","(of)","themselves","(even) from","after","[what]","became clear","to them","the truth","So forgive","and overlook","until","brings","Allah","His Command","Indeed","Allah","on","every","thing","(is) All-Powerful","(109)"],"transliterationArr":["wadda","kathīrun","min","ahli","al-kitābi","law","yaruddūnakum","min","baʿdi","īmānikum","kuffāran","ḥasadan","min","ʿindi","anfusihim","min","baʿdi","mā","tabayyana","lahumu","al-ḥaqu","fa-iʿ'fū","wa-iṣ'faḥū","ḥattā","yatiya","al-lahu","bi-amrihi","inna","al-laha","ʿalā","kulli","shayin","qadīrun",null],"verseTiming":[[1,0,710],[2,710,1620],[3,1620,2840],[4,2840,3430],[5,3430,4420],[6,4420,4760],[7,4760,6450],[8,6450,7880],[9,7880,8540],[10,8540,9930],[11,9930,11010],[12,11010,11740],[13,11740,12860],[14,12860,14260],[15,14260,15860],[16,15860,17370],[17,17370,17960],[18,17960,18290],[19,18290,19350],[20,19350,19850],[21,19850,21210],[22,21210,22050],[23,22050,22920],[24,22920,23730],[25,23730,24490],[26,24490,25390],[27,25390,26670],[28,26670,27920],[29,27920,28750],[30,28750,29380],[31,29380,29890],[32,29890,31550],[33,31550,34035]]}},{"name":"2:110","price":"Ẹ kírun, ẹ yọ Zakāh; ohunkóhun tí ẹ bá sì tì síwájú fún ẹ̀mí ara yín ní rere, ẹ máa bá a lọ́dọ̀ Allāhu. Dájúdájú Allāhu ni Olùríran nípa ohun tí ẹ̀ ń ṣe níṣẹ́.","arabic":"وَأَقِيمُواْ ٱلصَّلَوٰةَ وَءَاتُواْ ٱلزَّكَوٰةَۚ وَمَا تُقَدِّمُواْ لِأَنفُسِكُم مِّنۡ خَيۡرٖ تَجِدُوهُ عِندَ ٱللَّهِۗ إِنَّ ٱللَّهَ بِمَا تَعۡمَلُونَ بَصِيرٞ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":117,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"wa-aqīmū al-ṣalata waātū al-zakata wamā tuqaddimū li-anfusikum min khayrin tajidūhu ʿinda al-lahi inna al-laha bimā taʿmalūna baṣīrun ","translations":["And establish","the prayer","and give","[the] zakah","And whatever","you send forth","for yourselves","of","good (deeds)","you will find it","with","Allah","Indeed","Allah","of what","you do","(is) All-Seer","(110)"],"transliterationArr":["wa-aqīmū","al-ṣalata","waātū","al-zakata","wamā","tuqaddimū","li-anfusikum","min","khayrin","tajidūhu","ʿinda","al-lahi","inna","al-laha","bimā","taʿmalūna","baṣīrun",null],"verseTiming":[[1,0,1020],[2,1020,2110],[3,2110,2870],[4,2870,5290],[5,5290,6250],[6,6250,7450],[7,7450,9430],[8,9430,10400],[9,10400,11620],[10,11620,12920],[11,12920,14280],[12,14280,16850],[13,16850,18080],[14,18080,18930],[15,18930,19530],[16,19530,20700],[17,20700,22865]]}},{"name":"2:111","price":"Wọ́n wí pé: “Ẹnì kan kò níí wọ inú Ọgbà Ìdẹ̀ra àfi ẹni tí ó bá jẹ́ yẹhudi tàbí nasọ̄rọ̄.” Ìyẹn ni ohun tí wọ́n ń fẹ́. Sọ pé: “Ẹ mú ẹ̀rí ọ̀rọ̀ yín wá tí ẹ bá jẹ́ olódodo.","arabic":"وَقَالُواْ لَن يَدۡخُلَ ٱلۡجَنَّةَ إِلَّا مَن كَانَ هُودًا أَوۡ نَصَٰرَىٰۗ تِلۡكَ أَمَانِيُّهُمۡۗ قُلۡ هَاتُواْ بُرۡهَٰنَكُمۡ إِن كُنتُمۡ صَٰدِقِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":118,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"waqālū lan yadkhula al-janata illā man kāna hūdan aw naṣārā til'ka amāniyyuhum qul hātū bur'hānakum in kuntum ṣādiqīna ","translations":["And they said","Never","will enter","the Paradise","except","who","is","(a) Jew[s]","or","(a) Christian[s]","That","(is) their wishful thinking","Say","Bring","your proof","if","you are","[those who are] truthful","(111)"],"transliterationArr":["waqālū","lan","yadkhula","al-janata","illā","man","kāna","hūdan","aw","naṣārā","til'ka","amāniyyuhum","qul","hātū","bur'hānakum","in","kuntum","ṣādiqīna",null],"verseTiming":[[1,0,1110],[2,1110,1440],[3,1440,2720],[4,2720,4230],[5,4230,5010],[6,5010,5950],[7,5950,6570],[8,6570,7310],[9,7310,7640],[10,7640,9260],[11,9260,9860],[12,9860,11830],[13,11830,12150],[14,12150,12980],[15,12980,14390],[16,14390,14660],[17,14660,16460],[18,16460,19655]]}},{"name":"2:112","price":"Bẹ́ẹ̀ kọ́ (wọn kò níí wọ inú Ọgbà Ìdẹ̀ra àfi) ẹni tí ó bá ju ara rẹ̀ sílẹ̀ (sínú ’Islām) fún Allāhu,¹ tí ó sì jẹ́ olùṣe rere. Nítorí náà, ẹ̀san (rere) rẹ̀ ń bẹ fún un lọ́dọ̀ Olúwa rẹ̀. Kò níí sí ìbẹ̀rù fún wọn.² Wọn kò sì níí banújẹ́.³","arabic":"بَلَىٰۚ مَنۡ أَسۡلَمَ وَجۡهَهُۥ لِلَّهِ وَهُوَ مُحۡسِنٞ فَلَهُۥٓ أَجۡرُهُۥ عِندَ رَبِّهِۦ وَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":119,"juzNumber":1,"footnotes":"1. Ìyẹn ni pé, ẹni tí ó bá ṣe ’Islām pẹ̀lú àfọ̀mọ́-ọkàn.\n 2. Ìyẹn ni pé, kò níí sí ìbẹ̀rù fún àwọn mùsùlùmí nípa ohun tí wọ́n ń lọ bá pàdé ní Ọjọ́ Àjíǹde.\n 3. Ìyẹn ni pé, kò níí sí ìbànújẹ́ fún àwọn mùsùlùmí nípa ohun tí ọwọ́ wọn kò bà nínú oore ayé nítorí pé, Allāhu máa dí i fún wọn ní Ọjọ́ Àjíǹde.","lang":"yo","meta":{"transliteration":"balā man aslama wajhahu lillahi wahuwa muḥ'sinun falahu ajruhu ʿinda rabbihi walā khawfun ʿalayhim walā hum yaḥzanūna ","translations":["Yes","whoever","submits","his face","to Allah","and he","(is) a good-doer","so for him","(is) his reward","with","his Lord","And no","fear","(will be) on them","and not","they","(will) grieve","(112)"],"transliterationArr":["balā","man","aslama","wajhahu","lillahi","wahuwa","muḥ'sinun","falahu","ajruhu","ʿinda","rabbihi","walā","khawfun","ʿalayhim","walā","hum","yaḥzanūna",null],"verseTiming":[[1,0,880],[2,880,1680],[3,1680,2450],[4,2450,3440],[5,3440,4430],[6,4430,4970],[7,4970,6690],[8,6690,8610],[9,8610,9480],[10,9480,10850],[11,10850,12040],[12,12040,14070],[13,14070,14910],[14,14910,16140],[15,16140,17110],[16,17110,17670],[17,17670,18460],[18,18460,19530],[19,19530,20120],[20,20120,20500],[21,20500,23055]]}},{"name":"2:113","price":"Àwọn yẹhudi wí pé: “Àwọn nasọ̄rọ̄ kò rí n̄ǹkan kan ṣe (nínú ẹ̀sìn).” Àwọn nasọ̄rọ̄ náà wí pé: “Àwọn yẹhudi kò rí n̄ǹkan kan ṣe (nínú ẹ̀sìn.)” Wọ́n sì ń ké Tírà! Báyẹn ni àwọn tí kò nímọ̀ ṣe sọ irú ọ̀rọ̀ wọn (yìí). Nítorí náà, Allāhu á dájọ́ láààrin wọn ní Ọjọ́ Àjíǹde nípa ohun tí wọ́n ń yapa-ẹnu lórí rẹ̀.","arabic":"وَقَالَتِ ٱلۡيَهُودُ لَيۡسَتِ ٱلنَّصَٰرَىٰ عَلَىٰ شَيۡءٖ وَقَالَتِ ٱلنَّصَٰرَىٰ لَيۡسَتِ ٱلۡيَهُودُ عَلَىٰ شَيۡءٖ وَهُمۡ يَتۡلُونَ ٱلۡكِتَٰبَۗ كَذَٰلِكَ قَالَ ٱلَّذِينَ لَا يَعۡلَمُونَ مِثۡلَ قَوۡلِهِمۡۚ فَٱللَّهُ يَحۡكُمُ بَيۡنَهُمۡ يَوۡمَ ٱلۡقِيَٰمَةِ فِيمَا كَانُواْ فِيهِ يَخۡتَلِفُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":120,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"waqālati al-yahūdu laysati al-naṣārā ʿalā shayin waqālati al-naṣārā laysati al-yahūdu ʿalā shayin wahum yatlūna al-kitāba kadhālika qāla alladhīna lā yaʿlamūna mith'la qawlihim fal-lahu yaḥkumu baynahum yawma al-qiyāmati fīmā kānū fīhi yakhtalifūna ","translations":["And said","the Jews","Not","the Christians","(are) on","anything","and said","the Christians","Not","the Jews","(are) on","anything","although they","recite","the Book","Like that","said","those who","(do) not","know","similar","their saying","[So] Allah","will judge","between them","(on the) Day","(of) Resurrection","in what","they were","[in it]","differing","(113)"],"transliterationArr":["waqālati","al-yahūdu","laysati","al-naṣārā","ʿalā","shayin","waqālati","al-naṣārā","laysati","al-yahūdu","ʿalā","shayin","wahum","yatlūna","al-kitāba","kadhālika","qāla","alladhīna","lā","yaʿlamūna","mith'la","qawlihim","fal-lahu","yaḥkumu","baynahum","yawma","al-qiyāmati","fīmā","kānū","fīhi","yakhtalifūna",null],"verseTiming":[[1,0,1180],[2,1180,2170],[3,2170,2990],[4,2990,4620],[5,4620,5160],[6,5160,6620],[7,6620,7570],[8,7570,9200],[9,9200,9980],[10,9980,10990],[11,10990,11550],[12,11550,12960],[13,12960,13490],[14,13490,14460],[15,14460,17130],[16,17130,18110],[17,18110,18560],[18,18560,19700],[19,19700,20010],[20,20010,21250],[21,21250,21830],[22,21830,23210],[23,23210,24180],[24,24180,25000],[25,25000,25910],[26,25910,26420],[27,26420,27700],[28,27700,28330],[29,28330,29220],[30,29220,29890],[31,29890,32465]]}},{"name":"2:114","price":"Àti pé ta ló ṣàbòsí ju ẹni tí ó ṣe àwọn mọ́sálásí Allāhu ní èèwọ̀ láti ṣèrántí orúkọ Allāhu nínú rẹ̀, tí ó tún ṣiṣẹ́ lórí ìparun àwọn mọ́sálásí náà?¹ Àwọn wọ̀nyẹn, kò lẹ́tọ̀ọ́ fún wọn láti wọ inú rẹ̀ àyàfi pẹ̀lú ìbẹ̀rù. Àbùkù ń bẹ fún wọn n’ílé ayé. Ìyà ńlá sì ń bẹ fún wọn ní ọ̀run.","arabic":"وَمَنۡ أَظۡلَمُ مِمَّن مَّنَعَ مَسَٰجِدَ ٱللَّهِ أَن يُذۡكَرَ فِيهَا ٱسۡمُهُۥ وَسَعَىٰ فِي خَرَابِهَآۚ أُوْلَٰٓئِكَ مَا كَانَ لَهُمۡ أَن يَدۡخُلُوهَآ إِلَّا خَآئِفِينَۚ لَهُمۡ فِي ٱلدُّنۡيَا خِزۡيٞ وَلَهُمۡ فِي ٱلۡأٓخِرَةِ عَذَابٌ عَظِيمٞ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":121,"juzNumber":1,"footnotes":"1. Àwọn onisūfī lérò pé āyah yìí ń ṣe é ní èèwọ̀ fún ẹnikẹ́ni láti lé àwọn kúrò nínú mọ́sálásì tàbí láti kọ̀ fún wọn láti ṣe wiridi wọn àti waṭḥīfah wọn nínú mọ́sálásí. Rárá o. Āyah yìí kò gba bẹ́ẹ̀ lọ. Ẹni tí kò jẹ́ kí àwa mùsùlùmí ṣe ìjọ́sìn tó tọ sunnah nínú mọ́sálásí ni Allāhu pè ní alábòsí jùlọ nínú āyah yìí, kì í ṣe ẹni tí ó kọ aburú àti bidiah ṣíṣe nínú àwọn mọ́sálásí. Ọ̀nà tí àwọn oníwírìdí ń gbà ṣe ìrántí Allāhu kò tọ sunnah rárá. Dandan sì ni fún wa láti lé wọn kúrò nínú mọ́sálásí Allāhu. “Zāwiyah” ni wọ́n máa ń kọ́ fún wírìdí bid‘ah, kì í ṣe mọ́sálásí.","lang":"yo","meta":{"transliteration":"waman aẓlamu mimman manaʿa masājida al-lahi an yudh'kara fīhā us'muhu wasaʿā fī kharābihā ulāika mā kāna lahum an yadkhulūhā illā khāifīna lahum fī al-dun'yā khiz'yun walahum fī al-ākhirati ʿadhābun ʿaẓīmun ","translations":["And who","(is) more unjust","than (one) who","prevents","(the) masajid","(of) Allah","to","be mentioned","in them","His name","and strives","for","their destruction","Those","Not","it is","for them","that","they enter them","except","(like) those in fear","For them","in","the world","(is) disgrace","and for them","in","the Hereafter","(is) a punishment","great","(114)"],"transliterationArr":["waman","aẓlamu","mimman","manaʿa","masājida","al-lahi","an","yudh'kara","fīhā","us'muhu","wasaʿā","fī","kharābihā","ulāika","mā","kāna","lahum","an","yadkhulūhā","illā","khāifīna","lahum","fī","al-dun'yā","khiz'yun","walahum","fī","al-ākhirati","ʿadhābun","ʿaẓīmun",null],"verseTiming":[[1,0,738],[2,738,1688],[3,1688,3323],[4,3323,4348],[5,4348,5170],[6,5170,6057],[7,6057,7074],[8,7074,7710],[9,7710,8309],[10,8309,9113],[11,9113,9813],[12,9813,10356],[13,10356,11690],[14,11690,14338],[15,14338,14830],[16,14830,15375],[17,15375,16045],[18,16045,17142],[19,17142,19621],[20,19621,20342],[21,20342,24500],[22,24500,25269],[23,25269,25694],[24,25694,26463],[25,26463,28014],[26,28014,28608],[27,28608,28974],[28,28974,29917],[29,29917,30847],[30,30847,33091]]}},{"name":"2:115","price":"Ti Allāhu ni ibùyọ òòrùn àti ibùwọ̀ òòrùn. Nítorí náà, ibikíbi tí wọ́n bá dojú yín kọ ibẹ̀ yẹn náà ni ojú rere Allāhu (ìyẹn ni pé, ẹ ti dojúkọ Allāhu ní ibi tí wọ́n bá pa yín láṣẹ pé kí ẹ dojúkọ kírun.) Dájúdájú Allāhu ni Olùgbààyè, Onímọ̀.¹","arabic":"وَلِلَّهِ ٱلۡمَشۡرِقُ وَٱلۡمَغۡرِبُۚ فَأَيۡنَمَا تُوَلُّواْ فَثَمَّ وَجۡهُ ٱللَّهِۚ إِنَّ ٱللَّهَ وَٰسِعٌ عَلِيمٞ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":122,"juzNumber":1,"footnotes":"1. Bí ó tilẹ̀ jẹ́ pé Allāhu - subhānahu wa ta‘ālā - ti fi sūrah al-Baƙọrah; 2:144, 149, àti 150 pa ìdájọ́ āyah yìí rẹ́, ìdájọ́ tí ń bẹ nínú āyah náà ṣe é lò fún ẹni tí ó wà ní àyè kan tí kò sì mọ agbègbè tí Kaabah wà sí ìlú náà láààrin orígun ayé mẹ́rẹ̀ẹ̀rin nínú ìlú náà. Ibikíbi tí ó bá kọjú sí kírun rẹ̀ láààrin orígun méjì nínú orígun mẹ́rẹ̀ẹ̀rin ìlú rẹ̀ tí gbé e títí ó máa fi mọ àmọ̀dájú nípa agbègbè tí Kaabah wà sí ìlú rẹ̀.","lang":"yo","meta":{"transliteration":"walillahi al-mashriqu wal-maghribu fa-aynamā tuwallū fathamma wajhu al-lahi inna al-laha wāsiʿun ʿalīmun ","translations":["And for Allah","(is) the east","and the west","so wherever","you turn","[so] there","(is the) face","(of) Allah","Indeed","Allah","(is) All-Encompassing","All-Knowing","(115)"],"transliterationArr":["walillahi","al-mashriqu","wal-maghribu","fa-aynamā","tuwallū","fathamma","wajhu","al-lahi","inna","al-laha","wāsiʿun","ʿalīmun",null],"verseTiming":[[1,0,1350],[2,1350,2270],[3,2270,3500],[4,3500,5010],[5,5010,6020],[6,6020,7450],[7,7450,7960],[8,7960,10740],[9,10740,11770],[10,11770,12680],[11,12680,13660],[12,13660,15755]]}},{"name":"2:116","price":"Wọ́n wí pé: “Allāhu sọ ẹnì kan di ọmọ.” Mímọ́ ni fún Un! Ọ̀rọ̀ kò rí bẹ́ẹ̀, (àmọ́) tiRẹ̀ ni ohunkóhun tó wà nínú àwọn sánmọ̀ àti ilẹ̀. Ẹnì kọ̀ọ̀kan sì ni olùtẹ̀lé-àṣẹ Rẹ̀.¹","arabic":"وَقَالُواْ ٱتَّخَذَ ٱللَّهُ وَلَدٗاۗ سُبۡحَٰنَهُۥۖ بَل لَّهُۥ مَا فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ كُلّٞ لَّهُۥ قَٰنِتُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":123,"juzNumber":1,"footnotes":"1. Àṣẹ Allāhu lórí ẹ̀dá pín sí ọ̀nà méjì gbòòrò. Ìkíní: ’amr ṣẹr‘iy “àṣẹ tẹ̀sìn” àti ’amr kaoniy “àṣẹ tayé”. Àwọn mọlāika àti àwọn mùsùlùmí nìkan ló ń tẹ̀lé àwọn àṣẹ méjèèjì. Àmọ́ àṣẹ tayé nìkan ṣoṣo ni àwọn aláìgbàgbọ́ ń tẹ̀lé. Ìyẹn sì ni àṣẹ tí kádàrá bá mú wá. Ìyẹn ni pé, ohun tí Allāhu bá fẹ́ fi ẹ̀dá Rẹ̀ rọ ló máa fi rọ, jíjẹ́ aláìgbàgbọ́ ẹ̀dá náà kò lè dí I lọ́wọ́.","lang":"yo","meta":{"transliteration":"waqālū ittakhadha al-lahu waladan sub'ḥānahu bal lahu mā fī al-samāwāti wal-arḍi kullun lahu qānitūna ","translations":["And they said","has taken","Allah","a son","Glory be to Him","Nay","for Him","(is) what","(is) in","the heavens","and the earth","All","to Him","(are) humbly obedient","(116)"],"transliterationArr":["waqālū","ittakhadha","al-lahu","waladan","sub'ḥānahu","bal","lahu","mā","fī","al-samāwāti","wal-arḍi","kullun","lahu","qānitūna",null],"verseTiming":[[1,0,910],[2,910,1650],[3,1650,2540],[4,2540,3870],[5,3870,5480],[6,5480,5730],[7,5730,6370],[8,6370,6810],[9,6810,7030],[10,7030,8460],[11,8460,9460],[12,9460,10020],[13,10020,10820],[14,10820,13615]]}},{"name":"2:117","price":"Olùpilẹ̀dá àwọn sánmọ̀ àti ilẹ̀ ni (Allāhu). Nígbà tí Ó bá sì pèbùbù kiní kan, Ó kàn máa sọ fún un pé: “Jẹ́ bẹ́ẹ̀.” Ó sì máa jẹ́ bẹ́ẹ̀.","arabic":"بَدِيعُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ وَإِذَا قَضَىٰٓ أَمۡرٗا فَإِنَّمَا يَقُولُ لَهُۥ كُن فَيَكُونُ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":124,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"badīʿu al-samāwāti wal-arḍi wa-idhā qaḍā amran fa-innamā yaqūlu lahu kun fayakūnu ","translations":["(The) Originator","(of) the heavens","and the earth","And when","He decrees","a matter","[so] only","He says","to it","Be","and it becomes","(117)"],"transliterationArr":["badīʿu","al-samāwāti","wal-arḍi","wa-idhā","qaḍā","amran","fa-innamā","yaqūlu","lahu","kun","fayakūnu",null],"verseTiming":[[1,0,960],[2,960,2390],[3,2390,3410],[4,3410,4080],[5,4080,6240],[6,6240,7610],[7,7610,9370],[8,9370,10190],[9,10190,10770],[10,10770,12110],[11,12110,14665]]}},{"name":"2:118","price":"Àwọn tí kò nímọ̀ wí pé: “Tí ó bá jẹ́ pé Allāhu ń bá wa sọ̀rọ̀ ni tàbí kí àmì kan wá bá wa (àwa ìbá gbàgbọ́)?” Báyẹn ni àwọn tó ṣíwájú wọn ṣe sọ irú ọ̀rọ̀ wọn (yìí). Ọkàn wọn jọra wọn. A kúkú ti ṣe àlàyé àwọn āyah fún ìjọ tó ní àmọ̀dájú.","arabic":"وَقَالَ ٱلَّذِينَ لَا يَعۡلَمُونَ لَوۡلَا يُكَلِّمُنَا ٱللَّهُ أَوۡ تَأۡتِينَآ ءَايَةٞۗ كَذَٰلِكَ قَالَ ٱلَّذِينَ مِن قَبۡلِهِم مِّثۡلَ قَوۡلِهِمۡۘ تَشَٰبَهَتۡ قُلُوبُهُمۡۗ قَدۡ بَيَّنَّا ٱلۡأٓيَٰتِ لِقَوۡمٖ يُوقِنُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":125,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"waqāla alladhīna lā yaʿlamūna lawlā yukallimunā al-lahu aw tatīnā āyatun kadhālika qāla alladhīna min qablihim mith'la qawlihim tashābahat qulūbuhum qad bayyannā al-āyāti liqawmin yūqinūna ","translations":["And said","those who","(do) not","know","Why not","speaks to us","Allah","or","comes to us","a sign","Like that","said","those","from","before them","similar","their saying","Became alike","their hearts","Indeed","We have made clear","the signs","for people","(who) firmly believe","(118)"],"transliterationArr":["waqāla","alladhīna","lā","yaʿlamūna","lawlā","yukallimunā","al-lahu","aw","tatīnā","āyatun","kadhālika","qāla","alladhīna","min","qablihim","mith'la","qawlihim","tashābahat","qulūbuhum","qad","bayyannā","al-āyāti","liqawmin","yūqinūna",null],"verseTiming":[[1,0,870],[2,870,1870],[3,1870,2360],[4,2360,3610],[5,3610,4330],[6,4330,5510],[7,5510,6400],[8,6400,6730],[9,6730,9340],[10,9340,10500],[11,10500,11520],[12,11520,12010],[13,12010,13060],[14,13060,14050],[15,14050,15010],[16,15010,16300],[17,16300,17660],[18,17660,18920],[19,18920,20450],[20,20450,20810],[21,20810,22350],[22,22350,23650],[23,23650,25300],[24,25300,28405]]}},{"name":"2:119","price":"Dájúdájú Àwa fi òdodo rán ọ níṣẹ́. (O sì jẹ́) oníròó-ìdùnnú àti olùkìlọ̀ (fún gbogbo ayé). Wọn kò sì níí bi ọ́ léèrè nípa àwọn èrò inú Iná.","arabic":"إِنَّآ أَرۡسَلۡنَٰكَ بِٱلۡحَقِّ بَشِيرٗا وَنَذِيرٗاۖ وَلَا تُسۡـَٔلُ عَنۡ أَصۡحَٰبِ ٱلۡجَحِيمِ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":126,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"innā arsalnāka bil-ḥaqi bashīran wanadhīran walā tus'alu ʿan aṣḥābi al-jaḥīmi ","translations":["Indeed We","[We] have sent you","with the truth","(as) a bearer of good news","and (as) a warner","And not","you will be asked","about","(the) companions","(of) the blazing Fire","(119)"],"transliterationArr":["innā","arsalnāka","bil-ḥaqi","bashīran","wanadhīran","walā","tus'alu","ʿan","aṣḥābi","al-jaḥīmi",null],"verseTiming":[[1,0,2960],[2,2960,4390],[3,4390,5430],[4,5430,6540],[5,6540,9030],[6,9030,9570],[7,9570,10300],[8,10300,10770],[9,10770,11730],[10,11730,14705]]}},{"name":"2:120","price":"Àwọn yẹhudi àti nasọ̄rọ̄ kò níí yọ́nú sí ọ títí o fi máa tẹ̀lé ẹ̀sìn wọn. Sọ pé: “Dájúdajú ìmọ̀nà ti Allāhu ni ìmọ̀nà.” Dájúdajú tí o bá sì tẹ̀lé ìfẹ́-inú wọn lẹ́yìn èyí tí ó dé bá ọ nínú ìmọ̀ (’Islām), kò níí sí aláàbò àti alárànṣe kan fún ọ lọ́dọ̀ Allāhu.","arabic":"وَلَن تَرۡضَىٰ عَنكَ ٱلۡيَهُودُ وَلَا ٱلنَّصَٰرَىٰ حَتَّىٰ تَتَّبِعَ مِلَّتَهُمۡۗ قُلۡ إِنَّ هُدَى ٱللَّهِ هُوَ ٱلۡهُدَىٰۗ وَلَئِنِ ٱتَّبَعۡتَ أَهۡوَآءَهُم بَعۡدَ ٱلَّذِي جَآءَكَ مِنَ ٱلۡعِلۡمِ مَا لَكَ مِنَ ٱللَّهِ مِن وَلِيّٖ وَلَا نَصِيرٍ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":127,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"walan tarḍā ʿanka al-yahūdu walā al-naṣārā ḥattā tattabiʿa millatahum qul inna hudā al-lahi huwa al-hudā wala-ini ittabaʿta ahwāahum baʿda alladhī jāaka mina al-ʿil'mi mā laka mina al-lahi min waliyyin walā naṣīrin ","translations":["And never","will be pleased","with you","the Jews","and [not]","the Christians","until","you follow","their religion","Say","Indeed","(the) Guidance","(of) Allah","it","(is) the Guidance","And if","you follow","their desires","after","what","has come to you","of","the knowledge","not","for you","from","Allah","any","protector","and not","any helper","(120)"],"transliterationArr":["walan","tarḍā","ʿanka","al-yahūdu","walā","al-naṣārā","ḥattā","tattabiʿa","millatahum","qul","inna","hudā","al-lahi","huwa","al-hudā","wala-ini","ittabaʿta","ahwāahum","baʿda","alladhī","jāaka","mina","al-ʿil'mi","mā","laka","mina","al-lahi","min","waliyyin","walā","naṣīrin",""],"verseTiming":[[1,0,1290],[2,1290,2150],[3,2150,3560],[4,3560,4650],[5,4650,4930],[6,4930,6510],[7,6510,7340],[8,7340,8360],[9,8360,9940],[10,9940,10270],[11,10270,11580],[12,11580,11920],[13,11920,12800],[14,12800,13070],[15,13070,14130],[16,14130,15350],[17,15350,16270],[18,16270,19490],[19,19490,19950],[20,19950,20800],[21,20800,22910],[22,22910,23220],[23,23220,24060],[24,24060,24510],[25,24510,24900],[26,24900,25230],[27,25230,26110],[28,26110,26780],[29,26780,28380],[30,28380,28960],[31,28960,31245]]}},{"name":"2:121","price":"Àwọn tí A fún ní Tírà (al-Ƙur’ān), wọ́n ń ké e ní kíké ẹ̀tọ́. Àwọn wọ̀nyẹn gbà á gbọ́ ní òdodo. Àwọn tó ṣàì gbàgbọ́ nínú rẹ̀, àwọn wọ̀nyẹn gan-an ni ẹni òfò.","arabic":"ٱلَّذِينَ ءَاتَيۡنَٰهُمُ ٱلۡكِتَٰبَ يَتۡلُونَهُۥ حَقَّ تِلَاوَتِهِۦٓ أُوْلَٰٓئِكَ يُؤۡمِنُونَ بِهِۦۗ وَمَن يَكۡفُرۡ بِهِۦ فَأُوْلَٰٓئِكَ هُمُ ٱلۡخَٰسِرُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":128,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"alladhīna ātaynāhumu al-kitāba yatlūnahu ḥaqqa tilāwatihi ulāika yu'minūna bihi waman yakfur bihi fa-ulāika humu al-khāsirūna ","translations":["Those","We have given them","the Book","recite it","(as it has the) right","(of) its recitation","Those (people)","believe","in it","And whoever","disbelieves","in it","then those","they","(are) the losers","(121)"],"transliterationArr":["alladhīna","ātaynāhumu","al-kitāba","yatlūnahu","ḥaqqa","tilāwatihi","ulāika","yu'minūna","bihi","waman","yakfur","bihi","fa-ulāika","humu","al-khāsirūna",null],"verseTiming":[[1,0,1240],[2,1240,2780],[3,2780,3920],[4,3920,5190],[5,5190,5870],[6,5870,8510],[7,8510,11320],[8,11320,12500],[9,12500,13310],[10,13310,13690],[11,13690,15640],[12,15640,16260],[13,16260,18770],[14,18770,19130],[15,19130,22405]]}},{"name":"2:122","price":"Ẹ̀yin ọmọ ’Isrọ̄’īl, ẹ rántí ìkẹ́ Mi, èyí tí Mo ṣe fún yín. Dájúdájú Èmi tún ṣoore àjùlọ fún yín lórí àwọn ẹ̀dá (àsìkò tiyín).¹","arabic":"يَٰبَنِيٓ إِسۡرَٰٓءِيلَ ٱذۡكُرُواْ نِعۡمَتِيَ ٱلَّتِيٓ أَنۡعَمۡتُ عَلَيۡكُمۡ وَأَنِّي فَضَّلۡتُكُمۡ عَلَى ٱلۡعَٰلَمِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":129,"juzNumber":1,"footnotes":"1. Èyí rí bẹ́ẹ̀ fún wí pé, òǹkà àwọn Ànábì àti àwọn Òjíṣẹ́ Allāhu (‘aleehim sọlāt wa salām) pọ̀ púpọ̀ nínú ìran ọmọ ’Isrọ̄’īl ju àwọn ìran ẹ̀dá yòókù lọ, àmọ́ àwọn ọmọ ’Isrọ̄’īl náà ni ìran tó ṣàì gbàgbọ́ jùlọ.","lang":"yo","meta":{"transliteration":"yābanī is'rāīla udh'kurū niʿ'matiya allatī anʿamtu ʿalaykum wa-annī faḍḍaltukum ʿalā al-ʿālamīna ","translations":["O Children","(of) Israel","Remember","My Favor","which","I bestowed","upon you","and that I","[I] preferred you","over","the worlds","(122)"],"transliterationArr":["yābanī","is'rāīla","udh'kurū","niʿ'matiya","allatī","anʿamtu","ʿalaykum","wa-annī","faḍḍaltukum","ʿalā","al-ʿālamīna",null],"verseTiming":[[1,0,2440],[2,2440,5250],[3,5250,6120],[4,6120,7080],[5,7080,9140],[6,9140,10120],[7,10120,11120],[8,11120,12510],[9,12510,13910],[10,13910,14310],[11,14310,17475]]}},{"name":"2:123","price":"Ẹ bẹ̀rù ọjọ́ kan tí ẹ̀mí kan kò níí rọrọ̀ kiní kan fún ẹ̀mí kan. A ò sì níí gba ààrọ̀ l’ọ́wọ́ rẹ̀. Ìṣìpẹ̀ kan kò níí wúlò fún un. A ò sì níí ràn wọ́n lọ́wọ́.¹","arabic":"وَٱتَّقُواْ يَوۡمٗا لَّا تَجۡزِي نَفۡسٌ عَن نَّفۡسٖ شَيۡـٔٗا وَلَا يُقۡبَلُ مِنۡهَا عَدۡلٞ وَلَا تَنفَعُهَا شَفَٰعَةٞ وَلَا هُمۡ يُنصَرُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":130,"juzNumber":1,"footnotes":"1. Ẹ wo ìtọsẹ̀-ọ̀rọ̀ sūrah al-Baƙọrah; 2:48.","lang":"yo","meta":{"transliteration":"wa-ittaqū yawman lā tajzī nafsun ʿan nafsin shayan walā yuq'balu min'hā ʿadlun walā tanfaʿuhā shafāʿatun walā hum yunṣarūna ","translations":["And fear","a day","not","will avail","a soul","(of)","(another) soul","anything","and not","will be accepted","from it","any compensation","and not","will benefit it","any intercession","and not","they","will be helped","(123)"],"transliterationArr":["wa-ittaqū","yawman","lā","tajzī","nafsun","ʿan","nafsin","shayan","walā","yuq'balu","min'hā","ʿadlun","walā","tanfaʿuhā","shafāʿatun","walā","hum","yunṣarūna",null],"verseTiming":[[1,0,1160],[2,1160,1780],[3,1780,2310],[4,2310,3230],[5,3230,3960],[6,3960,4240],[7,4240,5760],[8,5760,7730],[9,7730,8290],[10,8290,9070],[11,9070,9860],[12,9860,11020],[13,11020,11520],[14,11520,13380],[15,13380,15450],[16,15450,16030],[17,16030,16440],[18,16440,20525]]}},{"name":"2:124","price":"(Ẹ rántí) nígbà tí Olúwa fi àwọn ọ̀rọ̀ kan dán (Ànábì) ’Ibrọ̄hīm wò. Ó sì parí wọn ní pípé. (Allāhu) sọ pé: “Dájúdájú Èmi yó ṣe ọ́ ní aṣíwájú fún àwọn ènìyàn.” (Ànábì ’Ibrọ̄hīm) sọ pé: “Àti nínú àwọn àrọ́mọdọ́mọ mi.” (Allāhu) sọ pé: “Àdéhùn Mi (láti sọ ẹnì kan di Òjíṣẹ́ tàbí Ànábì) kò níí tẹ àwọn alábòsí lọ́wọ́.”","arabic":"۞ وَإِذِ ٱبۡتَلَىٰٓ إِبۡرَٰهِـۧمَ رَبُّهُۥ بِكَلِمَٰتٖ فَأَتَمَّهُنَّۖ قَالَ إِنِّي جَاعِلُكَ لِلنَّاسِ إِمَامٗاۖ قَالَ وَمِن ذُرِّيَّتِيۖ قَالَ لَا يَنَالُ عَهۡدِي ٱلظَّٰلِمِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":131,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"wa-idhi ib'talā ib'rāhīma rabbuhu bikalimātin fa-atammahunna qāla innī jāʿiluka lilnnāsi imāman qāla wamin dhurriyyatī qāla lā yanālu ʿahdī al-ẓālimīna ","translations":["And when","tried","Ibrahim","his Lord","with words","and he fulfilled them","He said","Indeed I","(am) the One to make you","for the mankind","a leader","He said","And from","my offspring","He said","(Does) not","reach","My Covenant","(to) the wrongdoers","(124)"],"transliterationArr":["wa-idhi","ib'talā","ib'rāhīma","rabbuhu","bikalimātin","fa-atammahunna","qāla","innī","jāʿiluka","lilnnāsi","imāman","qāla","wamin","dhurriyyatī","qāla","lā","yanālu","ʿahdī","al-ẓālimīna",null],"verseTiming":[[1,0,770],[2,770,3330],[3,3330,4710],[4,4710,5800],[5,5800,7940],[6,7940,10890],[7,10890,11930],[8,11930,13130],[9,13130,14220],[10,14220,15960],[11,15960,17450],[12,17450,18070],[13,18070,19250],[14,19250,20930],[15,20930,21980],[16,21980,22330],[17,22330,23180],[18,23180,23770],[19,23770,26535]]}},{"name":"2:125","price":"(Ẹ rántí) nígbà tí A ṣe Ilé (Kaaba) ní àyè tí àwọn ènìyàn yóò máa wá àti àyè ìfàyàbalẹ̀. Kí ẹ sì mú ibùdúró ’Ibrọ̄hīm ní ibùkírun. A sì pa (Ànábì) ’Ibrọ̄hīm àti (Ànábì) ’Ismọ̄‘īl láṣẹ pé “Ẹ ṣe Ilé Mi ní mímọ́ fún àwọn olùyípo rẹ̀, àwọn olùkóraró sínú rẹ̀ àti àwọn olùdáwọ́tẹ-orúnkún, àwọn olùforíkanlẹ̀ (lórí ìrun).","arabic":"وَإِذۡ جَعَلۡنَا ٱلۡبَيۡتَ مَثَابَةٗ لِّلنَّاسِ وَأَمۡنٗا وَٱتَّخِذُواْ مِن مَّقَامِ إِبۡرَٰهِـۧمَ مُصَلّٗىۖ وَعَهِدۡنَآ إِلَىٰٓ إِبۡرَٰهِـۧمَ وَإِسۡمَٰعِيلَ أَن طَهِّرَا بَيۡتِيَ لِلطَّآئِفِينَ وَٱلۡعَٰكِفِينَ وَٱلرُّكَّعِ ٱلسُّجُودِ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":132,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"wa-idh jaʿalnā al-bayta mathābatan lilnnāsi wa-amnan wa-ittakhidhū min maqāmi ib'rāhīma muṣallan waʿahid'nā ilā ib'rāhīma wa-is'māʿīla an ṭahhirā baytiya lilṭṭāifīna wal-ʿākifīna wal-rukaʿi al-sujūdi ","translations":["And when","We made","the House","a place of return","for mankind","and (a place of) security","and (said), \"Take","[from]","(the) standing place","(of) Ibrahim","(as) a place of prayer","And We made a covenant","with","Ibrahim","and Ishmael","[that]","[You both] purify","My House","for those who circumambulate","and those who seclude themselves for devotion and prayer","and those who bow down","and those who prostrate","(125)"],"transliterationArr":["wa-idh","jaʿalnā","al-bayta","mathābatan","lilnnāsi","wa-amnan","wa-ittakhidhū","min","maqāmi","ib'rāhīma","muṣallan","waʿahid'nā","ilā","ib'rāhīma","wa-is'māʿīla","an","ṭahhirā","baytiya","lilṭṭāifīna","wal-ʿākifīna","wal-rukaʿi","al-sujūdi",null],"verseTiming":[[1,0,750],[2,750,1670],[3,1670,2520],[4,2520,3540],[5,3540,5280],[6,5280,6740],[7,6740,7940],[8,7940,8330],[9,8330,9810],[10,9810,11220],[11,11220,12760],[12,12760,15170],[13,15170,17140],[14,17140,18600],[15,18600,20180],[16,20180,21270],[17,21270,22350],[18,22350,23330],[19,23330,25000],[20,25000,26060],[21,26060,26890],[22,26890,29960],[23,29960,31670],[24,31670,32880],[25,32880,35475]]}},{"name":"2:126","price":"(Ẹ rántí) nígbà tí (Ànábì) ’Ibrọ̄hīm sọ pé: “Olúwa mi, ṣe ìlú yìí ní ìlú ìfàyàbalẹ̀. Kí O sì pèsè àwọn èso fún àwọn ará ibẹ̀ (ìyẹn) ẹnikẹ́ni nínú wọn tí ó bá ní ìgbàgbọ́ òdodo nínú Allāhu àti Ọjọ́ Ìkẹ́yìn.” (Allāhu) sọ pé: “Àti ẹni tí ó bá ṣàì gbàgbọ́, Èmi yóò fún un ní ìgbádùn díẹ̀. Lẹ́yìn náà, Mo máa taari rẹ̀ sínú ìyà Iná. Ìkángun náà sì burú.”","arabic":"وَإِذۡ قَالَ إِبۡرَٰهِـۧمُ رَبِّ ٱجۡعَلۡ هَٰذَا بَلَدًا ءَامِنٗا وَٱرۡزُقۡ أَهۡلَهُۥ مِنَ ٱلثَّمَرَٰتِ مَنۡ ءَامَنَ مِنۡهُم بِٱللَّهِ وَٱلۡيَوۡمِ ٱلۡأٓخِرِۚ قَالَ وَمَن كَفَرَ فَأُمَتِّعُهُۥ قَلِيلٗا ثُمَّ أَضۡطَرُّهُۥٓ إِلَىٰ عَذَابِ ٱلنَّارِۖ وَبِئۡسَ ٱلۡمَصِيرُ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":133,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"wa-idh qāla ib'rāhīmu rabbi ij'ʿal hādhā baladan āminan wa-ur'zuq ahlahu mina al-thamarāti man āmana min'hum bil-lahi wal-yawmi al-ākhiri qāla waman kafara fa-umattiʿuhu qalīlan thumma aḍṭarruhu ilā ʿadhābi al-nāri wabi'sa al-maṣīru ","translations":["And when","said","Ibrahim","My Lord","make","this","a city","secure","and provide","its people","with","fruits","(to) whoever","believed","from them","in Allah","and the Day","the Last","He said","And whoever","disbelieved","[then] I will grant him enjoyment","a little","then","I will force him","to","(the) punishment","(of) the Fire","and evil","(is) the destination","(126)"],"transliterationArr":["wa-idh","qāla","ib'rāhīmu","rabbi","ij'ʿal","hādhā","baladan","āminan","wa-ur'zuq","ahlahu","mina","al-thamarāti","man","āmana","min'hum","bil-lahi","wal-yawmi","al-ākhiri","qāla","waman","kafara","fa-umattiʿuhu","qalīlan","thumma","aḍṭarruhu","ilā","ʿadhābi","al-nāri","wabi'sa","al-maṣīru",null],"verseTiming":[[1,0,740],[2,740,1370],[3,1370,2680],[4,2680,3340],[5,3340,3950],[6,3950,4780],[7,4780,5580],[8,5580,7230],[9,7230,7980],[10,7980,8970],[11,8970,9320],[12,9320,10610],[13,10610,10990],[14,10990,11800],[15,11800,13120],[16,13120,14100],[17,14100,15060],[18,15060,15980],[19,15980,17010],[20,17010,18150],[21,18150,18730],[22,18730,20350],[23,20350,22190],[24,22190,23450],[25,23450,26250],[26,26250,26840],[27,26840,27710],[28,27710,31480],[29,31480,32240],[30,32240,34665]]}},{"name":"2:127","price":"(Ẹ rántí) nígbà tí (Ànábì) ’Ibrọ̄hīm àti ’Ismọ̄‘īl gbé àwọn ìpìlẹ̀ Ilé náà dúró. (Wọ́n ṣàdúà pé) “Olúwa wa, gbà á lọ́wọ́ wa, dájúdájú Ìwọ, Ìwọ ni Olùgbọ́, Onímọ̀.","arabic":"وَإِذۡ يَرۡفَعُ إِبۡرَٰهِـۧمُ ٱلۡقَوَاعِدَ مِنَ ٱلۡبَيۡتِ وَإِسۡمَٰعِيلُ رَبَّنَا تَقَبَّلۡ مِنَّآۖ إِنَّكَ أَنتَ ٱلسَّمِيعُ ٱلۡعَلِيمُ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":134,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"wa-idh yarfaʿu ib'rāhīmu al-qawāʿida mina al-bayti wa-is'māʿīlu rabbanā taqabbal minnā innaka anta al-samīʿu al-ʿalīmu ","translations":["And when","(was) raising","Ibrahim","the foundations","of","the House","and Ishmael","(saying), \"Our Lord","Accept","from us","Indeed You","[You] (are)","the All-Hearing","the All-Knowing","(127)"],"transliterationArr":["wa-idh","yarfaʿu","ib'rāhīmu","al-qawāʿida","mina","al-bayti","wa-is'māʿīlu","rabbanā","taqabbal","minnā","innaka","anta","al-samīʿu","al-ʿalīmu",null],"verseTiming":[[1,0,700],[2,700,1540],[3,1540,2910],[4,2910,4180],[5,4180,4460],[6,4460,5390],[7,5390,7030],[8,7030,7950],[9,7950,8990],[10,8990,10680],[11,10680,12550],[12,12550,13910],[13,13910,14940],[14,14940,17545]]}},{"name":"2:128","price":"Olúwa wa, ṣe wá ní mùsùlùmí fún Ọ. Kí O sì ṣe nínú àrọ́mọdọ́mọ wa ní ìjọ mùsùlùmí fún Ọ. Fi ìlànà ẹ̀sìn wa hàn wá. Kí O sì gba ìronúpìwàdà wa. Dájúdájú Ìwọ, Ìwọ ni Olùgba-ìronúpìwàdà, Àṣàkẹ́-ọ̀run.","arabic":"رَبَّنَا وَٱجۡعَلۡنَا مُسۡلِمَيۡنِ لَكَ وَمِن ذُرِّيَّتِنَآ أُمَّةٗ مُّسۡلِمَةٗ لَّكَ وَأَرِنَا مَنَاسِكَنَا وَتُبۡ عَلَيۡنَآۖ إِنَّكَ أَنتَ ٱلتَّوَّابُ ٱلرَّحِيمُ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":135,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"rabbanā wa-ij'ʿalnā mus'limayni laka wamin dhurriyyatinā ummatan mus'limatan laka wa-arinā manāsikanā watub ʿalaynā innaka anta al-tawābu al-raḥīmu ","translations":["Our Lord","[and] Make us","both submissive","to You","And from","our offspring","a community","submissive","to You","And show us","our ways of worship","and turn","to us","Indeed You","[You] (are)","the Oft-returning","the Most Merciful","(128)"],"transliterationArr":["rabbanā","wa-ij'ʿalnā","mus'limayni","laka","wamin","dhurriyyatinā","ummatan","mus'limatan","laka","wa-arinā","manāsikanā","watub","ʿalaynā","innaka","anta","al-tawābu","al-raḥīmu",null],"verseTiming":[[1,0,1190],[2,1190,2400],[3,2400,3570],[4,3570,3990],[5,3990,5050],[6,5050,8280],[7,8280,9530],[8,9530,10990],[9,10990,11670],[10,11670,12620],[11,12620,14180],[12,14180,15610],[13,15610,17020],[14,17020,17600],[15,17600,20060],[16,20060,21680],[17,21680,22740],[18,22740,23950],[19,23950,26535]]}},{"name":"2:129","price":"Olúwa wa, gbé dìde nínú wọn Òjíṣẹ́ kan láààrin wọn, (ẹni tí) ó máa ké àwọn āyah Rẹ fún wọn, tí ó máa kọ́ wọn ní Tírà àti ọgbọ́n ìjìnlẹ̀ (sunnah), tí ó sì máa sọ wọ́n di ẹni mímọ́. Dájúdájú Ìwọ, Ìwọ ni Alágbára, Ọlọ́gbọ́n.”","arabic":"رَبَّنَا وَٱبۡعَثۡ فِيهِمۡ رَسُولٗا مِّنۡهُمۡ يَتۡلُواْ عَلَيۡهِمۡ ءَايَٰتِكَ وَيُعَلِّمُهُمُ ٱلۡكِتَٰبَ وَٱلۡحِكۡمَةَ وَيُزَكِّيهِمۡۖ إِنَّكَ أَنتَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":136,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"rabbanā wa-ib'ʿath fīhim rasūlan min'hum yatlū ʿalayhim āyātika wayuʿallimuhumu al-kitāba wal-ḥik'mata wayuzakkīhim innaka anta al-ʿazīzu al-ḥakīmu ","translations":["Our Lord","[And] raise up","in them","a Messenger","from them","(who) will recite","to them","Your Verses","and will teach them","the Book","and the wisdom","and purify them","Indeed You","You (are)","the All-Mighty","the All-Wise","(129)"],"transliterationArr":["rabbanā","wa-ib'ʿath","fīhim","rasūlan","min'hum","yatlū","ʿalayhim","āyātika","wayuʿallimuhumu","al-kitāba","wal-ḥik'mata","wayuzakkīhim","innaka","anta","al-ʿazīzu","al-ḥakīmu",null],"verseTiming":[[1,0,1260],[2,1260,1930],[3,1930,2650],[4,2650,3580],[5,3580,4950],[6,4950,5710],[7,5710,6730],[8,6730,8000],[9,8000,9530],[10,9530,10610],[11,10610,11780],[12,11780,13420],[13,13420,15430],[14,15430,16650],[15,16650,17790],[16,17790,21405]]}},{"name":"2:130","price":"Ta sì ni ó máa kọ ẹ̀sìn (Ànábì) ’Ibrọ̄hīm sílẹ̀ àfi ẹni tí ó bá gọ ẹ̀mí ara rẹ̀. A kúkú ti ṣà á lẹ́ṣà n’ílé ayé. Dájúdájú ó tún wà nínú àwọn ẹni rere ní ọ̀run.","arabic":"وَمَن يَرۡغَبُ عَن مِّلَّةِ إِبۡرَٰهِـۧمَ إِلَّا مَن سَفِهَ نَفۡسَهُۥۚ وَلَقَدِ ٱصۡطَفَيۡنَٰهُ فِي ٱلدُّنۡيَاۖ وَإِنَّهُۥ فِي ٱلۡأٓخِرَةِ لَمِنَ ٱلصَّٰلِحِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":137,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"waman yarghabu ʿan millati ib'rāhīma illā man safiha nafsahu walaqadi iṣ'ṭafaynāhu fī al-dun'yā wa-innahu fī al-ākhirati lamina al-ṣāliḥīna ","translations":["And who","will turn away","from","(the) religion","(of) Ibrahim","except","who","fooled","himself","And indeed","We chose him","in","the world","and indeed he","in","the Hereafter","surely (will be) among","the righteous","(130)"],"transliterationArr":["waman","yarghabu","ʿan","millati","ib'rāhīma","illā","man","safiha","nafsahu","walaqadi","iṣ'ṭafaynāhu","fī","al-dun'yā","wa-innahu","fī","al-ākhirati","lamina","al-ṣāliḥīna",null],"verseTiming":[[1,0,710],[2,710,2080],[3,2080,2430],[4,2430,3870],[5,3870,5190],[6,5190,6010],[7,6010,6930],[8,6930,7740],[9,7740,8600],[10,8600,9630],[11,9630,10990],[12,10990,11210],[13,11210,12090],[14,12090,14490],[15,14490,14720],[16,14720,15940],[17,15940,16440],[18,16440,19945]]}},{"name":"2:131","price":"(Ẹ rántí) nígbà tí Olúwa rẹ̀ sọ fún un pé: “Jẹ́ mùsùlùmí.” Ó sọ pé: “Mo jẹ́ mùsùlùmí fún Olúwa gbogbo ẹ̀dá.”","arabic":"إِذۡ قَالَ لَهُۥ رَبُّهُۥٓ أَسۡلِمۡۖ قَالَ أَسۡلَمۡتُ لِرَبِّ ٱلۡعَٰلَمِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":138,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"idh qāla lahu rabbuhu aslim qāla aslamtu lirabbi al-ʿālamīna ","translations":["When","said","to him","his Lord","Submit (yourself)","he said","I (have) submitted (myself)","to (the) Lord","(of) the worlds","(131)"],"transliterationArr":["idh","qāla","lahu","rabbuhu","aslim","qāla","aslamtu","lirabbi","al-ʿālamīna",null],"verseTiming":[[1,0,610],[2,610,1200],[3,1200,1790],[4,1790,4100],[5,4100,5370],[6,5370,5930],[7,5930,7000],[8,7000,7720],[9,7720,10775]]}},{"name":"2:132","price":"(Ànábì) ’Ibrọ̄hīm sì pa á láṣẹ fún àwọn ọmọ rẹ̀. (Ànábì) Ya‘ƙūb náà ṣe bẹ́ẹ̀. (Ìkíní kejì sọ pé): “Ẹ̀yin ọmọ mi, dájúdájú Allāhu yan ẹ̀sìn náà fún yín. Nítorí náà, ẹ ò gbọdọ̀ kú àyàfi kí ẹ jẹ́ mùsùlùmí.”","arabic":"وَوَصَّىٰ بِهَآ إِبۡرَٰهِـۧمُ بَنِيهِ وَيَعۡقُوبُ يَٰبَنِيَّ إِنَّ ٱللَّهَ ٱصۡطَفَىٰ لَكُمُ ٱلدِّينَ فَلَا تَمُوتُنَّ إِلَّا وَأَنتُم مُّسۡلِمُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":139,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"wawaṣṣā bihā ib'rāhīmu banīhi wayaʿqūbu yābaniyya inna al-laha iṣ'ṭafā lakumu al-dīna falā tamūtunna illā wa-antum mus'limūna ","translations":["And enjoined","[it]","Ibrahim","(upon) his sons","and Yaqub","O my sons","Indeed","Allah","has chosen","for you","the religion","so not","(should) you die","except","while you","(are) submissive","(132)"],"transliterationArr":["wawaṣṣā","bihā","ib'rāhīmu","banīhi","wayaʿqūbu","yābaniyya","inna","al-laha","iṣ'ṭafā","lakumu","al-dīna","falā","tamūtunna","illā","wa-antum","mus'limūna",null],"verseTiming":[[1,0,1140],[2,1140,3380],[3,3380,4760],[4,4760,5570],[5,5570,6790],[6,6790,8040],[7,8040,9060],[8,9060,9890],[9,9890,10760],[10,10760,11320],[11,11320,12100],[12,12100,12730],[13,12730,14680],[14,14680,15470],[15,15470,17180],[16,17180,21025]]}},{"name":"2:133","price":"Tàbí ẹ̀yín jẹ́ ẹlẹ́rìí nígbà tí ikú dé bá (Ànábì) Ya‘ƙūb? Nígbà tí ó sọ fún àwọn ọmọ rẹ̀ pé: “Kí ni ẹ̀yin yóò máa jọ́sìn fún lẹ́yìn (ikú) mi?” Wọ́n sọ pé: “Àwa yó máa jọ́sìn fún Ọlọ́hun rẹ àti Ọlọ́hun àwọn bàbá rẹ, (àwọn Ànábì) ’Ibrọ̄hīm, ’Ismọ̄‘īl àti ’Ishāƙ, Ọlọ́hun Ọ̀kan ṣoṣo tí a gbọ́dọ̀ jọ́sìn fún ní ọ̀nà òdodo. Àwa sì ni mùsùlùmí (olùjuwọ́-jusẹ̀-sílẹ̀) fún Un.”","arabic":"أَمۡ كُنتُمۡ شُهَدَآءَ إِذۡ حَضَرَ يَعۡقُوبَ ٱلۡمَوۡتُ إِذۡ قَالَ لِبَنِيهِ مَا تَعۡبُدُونَ مِنۢ بَعۡدِيۖ قَالُواْ نَعۡبُدُ إِلَٰهَكَ وَإِلَٰهَ ءَابَآئِكَ إِبۡرَٰهِـۧمَ وَإِسۡمَٰعِيلَ وَإِسۡحَٰقَ إِلَٰهٗا وَٰحِدٗا وَنَحۡنُ لَهُۥ مُسۡلِمُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":140,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"am kuntum shuhadāa idh ḥaḍara yaʿqūba al-mawtu idh qāla libanīhi mā taʿbudūna min baʿdī qālū naʿbudu ilāhaka wa-ilāha ābāika ib'rāhīma wa-is'māʿīla wa-is'ḥāqa ilāhan wāḥidan wanaḥnu lahu mus'limūna ","translations":["Or","were you","witnesses","when","came to","Yaqub","[the] death","when","he said","to his sons","What","will you worship","from","after me","They said","We will worship","your God","and (the) God","(of) your forefathers","Ibrahim","and Ishmael","and Isaac ","God","One","And we","to Him","(are) submissive","(133)"],"transliterationArr":["am","kuntum","shuhadāa","idh","ḥaḍara","yaʿqūba","al-mawtu","idh","qāla","libanīhi","mā","taʿbudūna","min","baʿdī","qālū","naʿbudu","ilāhaka","wa-ilāha","ābāika","ib'rāhīma","wa-is'māʿīla","wa-is'ḥāqa","ilāhan","wāḥidan","wanaḥnu","lahu","mus'limūna",null],"verseTiming":[[1,0,550],[2,550,2110],[3,2110,4600],[4,4600,4930],[5,4930,5550],[6,5550,6550],[7,6550,7460],[8,7460,7860],[9,7860,8410],[10,8410,9440],[11,9440,9800],[12,9800,11130],[13,11130,12230],[14,12230,13010],[15,13010,13900],[16,13900,14720],[17,14720,15780],[18,15780,16780],[19,16780,19420],[20,19420,20770],[21,20770,22440],[22,22440,23630],[23,23630,24490],[24,24490,26870],[25,26870,27640],[26,27640,28280],[27,28280,30715]]}},{"name":"2:134","price":"Ìjọ kan nìyẹn tí ó ti lọ. Tiwọn ni ohun tí wọ́n ṣe níṣẹ́. Tiyín ni ohun tí ẹ ṣe níṣẹ́. Wọn kò sì níí bi yín léèrè nípa ohun tí wọ́n ń ṣe níṣẹ́.","arabic":"تِلۡكَ أُمَّةٞ قَدۡ خَلَتۡۖ لَهَا مَا كَسَبَتۡ وَلَكُم مَّا كَسَبۡتُمۡۖ وَلَا تُسۡـَٔلُونَ عَمَّا كَانُواْ يَعۡمَلُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":141,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"til'ka ummatun qad khalat lahā mā kasabat walakum mā kasabtum walā tus'alūna ʿammā kānū yaʿmalūna ","translations":["This","(was) a community","(which)","has passed away","for it","what","it earned","and for you","what","you have earned","And not","you will be asked","about what","they used to","do","(134)"],"transliterationArr":["til'ka","ummatun","qad","khalat","lahā","mā","kasabat","walakum","mā","kasabtum","walā","tus'alūna","ʿammā","kānū","yaʿmalūna",null],"verseTiming":[[1,0,740],[2,740,3280],[3,3280,3690],[4,3690,4800],[5,4800,5400],[6,5400,5730],[7,5730,6610],[8,6610,7400],[9,7400,8520],[10,8520,10080],[11,10080,10620],[12,10620,11840],[13,11840,13240],[14,13240,14180],[15,14180,17155]]}},{"name":"2:135","price":"Wọ́n wí pé: “Ẹ jẹ́ yẹhudi tàbí nasọ̄rọ̄ kí ẹ mọ̀nà.” Sọ pé: “Rárá, ẹ̀sìn (Ànábì) ’Ibrọ̄hīm (lẹ̀sìn), ó jẹ́ olùdúró-déédé, kò sì sí nínú àwọn ọ̀ṣẹbọ.”","arabic":"وَقَالُواْ كُونُواْ هُودًا أَوۡ نَصَٰرَىٰ تَهۡتَدُواْۗ قُلۡ بَلۡ مِلَّةَ إِبۡرَٰهِـۧمَ حَنِيفٗاۖ وَمَا كَانَ مِنَ ٱلۡمُشۡرِكِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":142,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"waqālū kūnū hūdan aw naṣārā tahtadū qul bal millata ib'rāhīma ḥanīfan wamā kāna mina al-mush'rikīna ","translations":["And they said","Be","Jews","or","Christians","(then) you will be guided","Say","Nay","(the) religion","(of) Ibrahim","(the) upright","and not","he was","of","those who associated partners (with Allah)","(135)"],"transliterationArr":["waqālū","kūnū","hūdan","aw","naṣārā","tahtadū","qul","bal","millata","ib'rāhīma","ḥanīfan","wamā","kāna","mina","al-mush'rikīna",null],"verseTiming":[[1,0,1090],[2,1090,2000],[3,2000,2800],[4,2800,3200],[5,3200,4280],[6,4280,5430],[7,5430,6280],[8,6280,6710],[9,6710,7560],[10,7560,8890],[11,8890,10490],[12,10490,10940],[13,10940,11620],[14,11620,11960],[15,11960,15185]]}},{"name":"2:136","price":"Ẹ sọ pé: “A gbàgbọ́ nínú Allāhu àti ohun tí wọ́n sọ̀kalẹ̀ fún wa àti ohun tí wọ́n sọ̀kalẹ̀ fún (àwọn Ànábì) ’Ibrọ̄hīm, ’Ismọ̄‘īl, ’Ishāƙ, Ya‘ƙūb àti àwọn àrọ́mọdọ́mọ Ya‘ƙūb. (A gbàgbọ́ nínú) ohun tí wọ́n fún (àwọn Ànábì) Mūsā àti ‘Īsā, àti ohun tí wọ́n fún àwọn Ànábì (yòókù) láti ọ̀dọ̀ Olúwa wọn. A kò ya ẹnì kan sọ́tọ̀ nínú wọn. Àwa sì ni mùsùlùmí (olùjuwọ́-jusẹ̀-sílẹ̀) fún Un.”","arabic":"قُولُوٓاْ ءَامَنَّا بِٱللَّهِ وَمَآ أُنزِلَ إِلَيۡنَا وَمَآ أُنزِلَ إِلَىٰٓ إِبۡرَٰهِـۧمَ وَإِسۡمَٰعِيلَ وَإِسۡحَٰقَ وَيَعۡقُوبَ وَٱلۡأَسۡبَاطِ وَمَآ أُوتِيَ مُوسَىٰ وَعِيسَىٰ وَمَآ أُوتِيَ ٱلنَّبِيُّونَ مِن رَّبِّهِمۡ لَا نُفَرِّقُ بَيۡنَ أَحَدٖ مِّنۡهُمۡ وَنَحۡنُ لَهُۥ مُسۡلِمُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":143,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"qūlū āmannā bil-lahi wamā unzila ilaynā wamā unzila ilā ib'rāhīma wa-is'māʿīla wa-is'ḥāqa wayaʿqūba wal-asbāṭi wamā ūtiya mūsā waʿīsā wamā ūtiya al-nabiyūna min rabbihim lā nufarriqu bayna aḥadin min'hum wanaḥnu lahu mus'limūna ","translations":["Say","We have believed","in Allah","and what","(is) revealed","to us","and what","was revealed","to","Ibrahim","and Ishmael","and Isaac","and Yaqub","and the descendants","and what","was given","(to) Musa","and Isa","and what","was given","(to) the Prophets","from","their Lord","Not","we make distinction","between","any","of them","And we","to Him","(are) submissive","(136)"],"transliterationArr":["qūlū","āmannā","bil-lahi","wamā","unzila","ilaynā","wamā","unzila","ilā","ib'rāhīma","wa-is'māʿīla","wa-is'ḥāqa","wayaʿqūba","wal-asbāṭi","wamā","ūtiya","mūsā","waʿīsā","wamā","ūtiya","al-nabiyūna","min","rabbihim","lā","nufarriqu","bayna","aḥadin","min'hum","wanaḥnu","lahu","mus'limūna",null],"verseTiming":[[1,0,2390],[2,2390,4260],[3,4260,5320],[4,5320,7310],[5,7310,8680],[6,8680,9660],[7,9660,11690],[8,11690,13110],[9,13110,15050],[10,15050,16440],[11,16440,18150],[12,18150,19390],[13,19390,20590],[14,20590,21990],[15,21990,23900],[16,23900,24660],[17,24660,25400],[18,25400,26460],[19,26460,28330],[20,28330,29110],[21,29110,31100],[22,31100,31310],[23,31310,32500],[24,32500,32930],[25,32930,33970],[26,33970,34490],[27,34490,35210],[28,35210,37410],[29,37410,37820],[30,37820,38870],[31,38870,39340],[32,39340,39980],[33,39980,41690],[34,41690,42470],[35,42470,43050],[36,43050,45585]]}},{"name":"2:137","price":"Nítorí náà, tí wọ́n bá gbàgbọ́ nínú irú ohun tí ẹ gbàgbọ́, wọ́n ti mọ̀nà. Tí wọ́n bá sì gbúnrí, wọ́n ti wà nínú ìyapa (òdodo). Allāhu sì máa tó ọ (níbi aburú) wọn. Òun ni Olùgbọ́, Onímọ̀.","arabic":"فَإِنۡ ءَامَنُواْ بِمِثۡلِ مَآ ءَامَنتُم بِهِۦ فَقَدِ ٱهۡتَدَواْۖ وَّإِن تَوَلَّوۡاْ فَإِنَّمَا هُمۡ فِي شِقَاقٖۖ فَسَيَكۡفِيكَهُمُ ٱللَّهُۚ وَهُوَ ٱلسَّمِيعُ ٱلۡعَلِيمُ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":144,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"fa-in āmanū bimith'li mā āmantum bihi faqadi ih'tadaw wa-in tawallaw fa-innamā hum fī shiqāqin fasayakfīkahumu al-lahu wahuwa al-samīʿu al-ʿalīmu ","translations":["So if","they believe[d]","in (the) like","(of) what","you have believed","in [it]","then indeed","they are (rightly) guided","But if","they turn away","then only","they","(are) in","dissension","So will suffice you against them","Allah","and He","(is) the All-Hearing","the All-Knowing","(137)"],"transliterationArr":["fa-in","āmanū","bimith'li","mā","āmantum","bihi","faqadi","ih'tadaw","wa-in","tawallaw","fa-innamā","hum","fī","shiqāqin","fasayakfīkahumu","al-lahu","wahuwa","al-samīʿu","al-ʿalīmu",null],"verseTiming":[[1,0,830],[2,830,1690],[3,1690,2490],[4,2490,4480],[5,4480,7290],[6,7290,7840],[7,7840,8570],[8,8570,9340],[9,9340,10550],[10,10550,11970],[11,11970,13710],[12,13710,14090],[13,14090,14480],[14,14480,17170],[15,17170,19160],[16,19160,21950],[17,21950,22480],[18,22480,23540],[19,23540,26535]]}},{"name":"2:138","price":"(Ẹ dúró ti) aró Allāhu. Ta sì ló dára ju Allāhu lọ ní aró? Àwa sì ni olùjọ́sìn fún Un.¹","arabic":"صِبۡغَةَ ٱللَّهِ وَمَنۡ أَحۡسَنُ مِنَ ٱللَّهِ صِبۡغَةٗۖ وَنَحۡنُ لَهُۥ عَٰبِدُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":145,"juzNumber":1,"footnotes":"1. Kíyè sí i, ìtúmọ̀ àkànlò ni wọ́n lò fún “aró” nínú āyah yìí. “Aró” sì dúró fún ẹ̀sìn. Kókó ìtúmọ̀ rẹ̀ sì ni pé, ẹ̀sìn gbọ́dọ̀ hàn lára olùjọ́sìn fún Allāhu gẹ́gẹ́ bí aró ṣe máa ń hàn lára aṣọ tí wọ́n bá pa láró. Nípa èyí, mùsùlùmí gbọ́dọ̀ ní ìrísí ọkàn àti ìrísí ara tó tọ sunnah, tí ó máa mú un yàtọ̀ gédégbé sí ẹlẹ́sìn mìíràn.","lang":"yo","meta":{"transliteration":"ṣib'ghata al-lahi waman aḥsanu mina al-lahi ṣib'ghatan wanaḥnu lahu ʿābidūna ","translations":["(The) color (religion)","(of) Allah","And who","(is) better","than","Allah","at coloring","And we","to Him","(are) worshippers","(138)"],"transliterationArr":["ṣib'ghata","al-lahi","waman","aḥsanu","mina","al-lahi","ṣib'ghatan","wanaḥnu","lahu","ʿābidūna",null],"verseTiming":[[1,0,960],[2,960,4620],[3,4620,5230],[4,5230,6020],[5,6020,6360],[6,6360,7200],[7,7200,8500],[8,8500,9320],[9,9320,9900],[10,9900,13005]]}},{"name":"2:139","price":"Sọ pé: “Ṣé ẹ̀yin yóò jà wá níyàn nípa Allāhu ni?” Òun sì ni Olúwa wa àti Olúwa yín. Tiwa ni àwọn iṣẹ́ wa. Tiyín sì ni àwọn iṣẹ́ yín. Àwa (mùsùlùmí) sì ni olùṣàfọ̀mọ́-ẹ̀sìn fún Un.","arabic":"قُلۡ أَتُحَآجُّونَنَا فِي ٱللَّهِ وَهُوَ رَبُّنَا وَرَبُّكُمۡ وَلَنَآ أَعۡمَٰلُنَا وَلَكُمۡ أَعۡمَٰلُكُمۡ وَنَحۡنُ لَهُۥ مُخۡلِصُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":146,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"qul atuḥājjūnanā fī al-lahi wahuwa rabbunā warabbukum walanā aʿmālunā walakum aʿmālukum wanaḥnu lahu mukh'liṣūna ","translations":["Say","Do you argue with us","about","Allah","while He","(is) our Lord","and your Lord","And for us","(are) our deeds","and for you","(are) your deeds","and we","to Him","(are) sincere","(139)"],"transliterationArr":["qul","atuḥājjūnanā","fī","al-lahi","wahuwa","rabbunā","warabbukum","walanā","aʿmālunā","walakum","aʿmālukum","wanaḥnu","lahu","mukh'liṣūna",null],"verseTiming":[[1,0,420],[2,420,4550],[3,4550,4950],[4,4950,5600],[5,5600,6260],[6,6260,7230],[7,7230,8550],[8,8550,10700],[9,10700,12140],[10,12140,12990],[11,12990,14450],[12,14450,15210],[13,15210,15820],[14,15820,18315]]}},{"name":"2:140","price":"Tàbí ẹ̀ ń wí pé: “Dájúdájú (àwọn Ànábì) ’Ibrọ̄hīm, ’Ismọ̄‘īl, ’Ishāƙ, Ya‘ƙūb àti àwọn àrọ́mọdọ́mọ Ya‘ƙūb, wọ́n jẹ́ yẹhudi tàbí nasọ̄rọ̄.”¹ Sọ pé: “Ṣé ẹ̀yin lẹ nímọ̀ jùlọ (nípa wọn ni) tàbí Allāhu?” Ta ló ṣàbòsí ju ẹni tó daṣọ bo ẹ̀rí ọ̀dọ̀ rẹ̀ (tí ó sọ̀kalẹ̀) láti ọ̀dọ̀ Allāhu? Allāhu kò sì níí gbàgbé ohun tí ẹ̀ ń ṣe níṣẹ́.","arabic":"أَمۡ تَقُولُونَ إِنَّ إِبۡرَٰهِـۧمَ وَإِسۡمَٰعِيلَ وَإِسۡحَٰقَ وَيَعۡقُوبَ وَٱلۡأَسۡبَاطَ كَانُواْ هُودًا أَوۡ نَصَٰرَىٰۗ قُلۡ ءَأَنتُمۡ أَعۡلَمُ أَمِ ٱللَّهُۗ وَمَنۡ أَظۡلَمُ مِمَّن كَتَمَ شَهَٰدَةً عِندَهُۥ مِنَ ٱللَّهِۗ وَمَا ٱللَّهُ بِغَٰفِلٍ عَمَّا تَعۡمَلُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":147,"juzNumber":1,"footnotes":"1. Kókó tí āyah yìí ń fi rinlẹ̀ ni pé, kò sí Ànábì kan tàbí Òjíṣẹ́ Allāhu kan tó ṣe ẹ̀sìn yẹ̀húdí tàbí nasọ̄rọ̄ tàbí ìbọ̀rìṣà. ’Islām ni ẹ̀sìn tí gbogbo wọn ṣe - kí ìkẹ́ àti ọlà Allāhu máa bá wọn -.","lang":"yo","meta":{"transliteration":"am taqūlūna inna ib'rāhīma wa-is'māʿīla wa-is'ḥāqa wayaʿqūba wal-asbāṭa kānū hūdan aw naṣārā qul a-antum aʿlamu ami al-lahu waman aẓlamu mimman katama shahādatan ʿindahu mina al-lahi wamā al-lahu bighāfilin ʿammā taʿmalūna ","translations":["Or","(do) you say","that","Ibrahim","and Ishmael","and Isaac","and Yaqub","and the descendants","were","Jews","or","Christians","Say","Are you","better knowing","or","(is) Allah","And who","(is) more unjust","than (the one) who","concealed","a testimony","(that) he has","from","Allah","And not","(is) Allah","unaware","of what","you do","(140)"],"transliterationArr":["am","taqūlūna","inna","ib'rāhīma","wa-is'māʿīla","wa-is'ḥāqa","wayaʿqūba","wal-asbāṭa","kānū","hūdan","aw","naṣārā","qul","a-antum","aʿlamu","ami","al-lahu","waman","aẓlamu","mimman","katama","shahādatan","ʿindahu","mina","al-lahi","wamā","al-lahu","bighāfilin","ʿammā","taʿmalūna",null],"verseTiming":[[1,0,470],[2,470,1790],[3,1790,2840],[4,2840,4360],[5,4360,6030],[6,6030,7270],[7,7270,8530],[8,8530,9960],[9,9960,11080],[10,11080,11600],[11,11600,12000],[12,12000,13690],[13,13690,13980],[14,13980,16050],[15,16050,16730],[16,16730,17250],[17,17250,19519],[18,19519,20549],[19,20549,21449],[20,21449,23269],[21,23269,23769],[22,23769,25069],[23,25069,26739],[24,26739,27109],[25,27109,29979],[26,29979,30299],[27,30299,31219],[28,31219,32349],[29,32349,33669],[30,33669,36174]]}},{"name":"2:141","price":"Ìjọ kan nìyẹn tí ó ti lọ. Tiwọn ni ohun tí wọ́n ṣe níṣẹ́. Tiyín ni ohun tí ẹ ṣe níṣẹ́. Wọn kò sì níí bi yín léèrè nípa ohun tí wọ́n ń ṣe níṣẹ́.","arabic":"تِلۡكَ أُمَّةٞ قَدۡ خَلَتۡۖ لَهَا مَا كَسَبَتۡ وَلَكُم مَّا كَسَبۡتُمۡۖ وَلَا تُسۡـَٔلُونَ عَمَّا كَانُواْ يَعۡمَلُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":148,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"til'ka ummatun qad khalat lahā mā kasabat walakum mā kasabtum walā tus'alūna ʿammā kānū yaʿmalūna ","translations":["This","(was) a community","(which)","has passed away","for it","what","it earned","and for you","what","you have earned","And not","you will be asked","about what","they used to","do","(141)"],"transliterationArr":["til'ka","ummatun","qad","khalat","lahā","mā","kasabat","walakum","mā","kasabtum","walā","tus'alūna","ʿammā","kānū","yaʿmalūna",null],"verseTiming":[[1,0,760],[2,760,3310],[3,3310,3600],[4,3600,4700],[5,4700,5310],[6,5310,5640],[7,5640,6530],[8,6530,7270],[9,7270,8370],[10,8370,9890],[11,9890,10440],[12,10440,11650],[13,11650,13090],[14,13090,14090],[15,14090,18625]]}}],"juz":{"id":1,"name":"الم","transliteration":"Alif-Lam-Meem","transEn":"The Letters Alif Lam Meem","startVerse":"1:1","endVerse":"2:141","totalVerses":148},"version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."}}