{"data":[{"name":"2:186","price":"186਼ (ਹੇ ਨਬੀ!) ਜਦੋਂ ਮੇਰੇ ਬੰਦੇ ਤੁਹਾਥੋਂ ਮੇਰੇ ਬਾਰੇ ਪੁੱਛਣ (ਕਿ ਮੈਂ ਕਿੱਥੇ ਹਾਂ) ਤਾਂ ਆਖ ਦਿਓ ਕਿ ਮੈਂ ਉਹਨਾਂ ਦੇ ਅੰਗ-ਸੰਗ ਹੀ ਹਾਂ 1 ਜਦੋਂ ਵੀ ਉਹ ਮੈਂਥੋਂ ਦੁਆਵਾਂ ਕਰਦੇ ਹਨ ਤਾਂ ਮੈਂ ਉਹਨਾਂ ਦੀਆਂ ਦੁਆਵਾਂ ਨੂੰ ਕਬੂਲ ਕਰਦਾ ਹਾਂ ਸੋ ਉਹਨਾਂ ਨੂ ਚਾਹੀਦਾ ਹੇ ਕਿ ਮੇਰੇ ਹੁਕਮਾਂ ਦੀ ਪਾਲਣਾ ਕਰਨ ਅਤੇ ਮੇਰੇ ਉੱਤੇ ਹੀ ਈਮਾਨ ਲਿਆਉਣ ਤਾਂ ਜੋ ਉਹ ਹਿਦਾਇਤ ਪ੍ਰਾਪਤ ਕਰ ਸਕਣ।","arabic":"وَإِذَا سَأَلَكَ عِبَادِي عَنِّي فَإِنِّي قَرِيبٌۖ أُجِيبُ دَعۡوَةَ ٱلدَّاعِ إِذَا دَعَانِۖ فَلۡيَسۡتَجِيبُواْ لِي وَلۡيُؤۡمِنُواْ بِي لَعَلَّهُمۡ يَرۡشُدُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah"],"ayahNumber":193,"juzNumber":2,"footnotes":"2 ਇਹ ਹੁਕਮ ਇਸ ਤੋਂ ਅਗਲੀ ਆਇਤ 185 ਰਾਹੀਂ ਰੱਦ ਕਰ ਦਿੱਤਾ ਗਿਆ।\n1 ਇਕ ਮੁਸਲਮਾਨ ਨੇ ਨਬੀ ਕਰੀਮ (ਸ:) ਤੋਂ ਪੁੱਛਿਆ ਕਿ ਹੇ ਅੱਲਾਹ ਦੇ ਰਸੂਲ! ਮੈਨੂੰ ਦੱਸੋ ਕਿ ਮੇਰੇ ਲਈ ਕਿੰਨੀਆਂ ਨਮਾਜ਼ਾਂ ਪੜ੍ਹਣੀਆਂ ਫ਼ਰਜ਼ ਹਨ? ਆਪ (ਸ:) ਨੇ ਫ਼ਰਮਾਇਆ ਪੰਜ, ਜੇ ਇਸ ਤੋਂ ਵੱਧ ਪੜ੍ਹਣਾ ਚਾਹੋ ਤਾਂ ਤੇਰੇ ਮਰਜ਼ੀ। ਉਸ ਨੇ ਪੁੱਛਿਆ ਕਿ ਅੱਲਾਹ ਨੇ ਮੇਰੇ ਲਈ ਕਿੰਨੇ ਰੋਜ਼ੇ ਫ਼ਰਜ਼ ਕੀਤੇ ਹਨ, ਆਪ (ਸ:) ਨੇ ਫ਼ਰਮਾਇਆ ਕਿ ਪੂਰੇ ਰਮਜ਼ਾਨ ਮਹੀਨੇ ਦੇ ਜੇ ਤੂੰ ਨਫ਼ਲੀ ਰੋਜ਼ੇ ਰੱਖੇਂ ਤਾਂ ਤੇਰੀ ਮਰਜ਼ੀ ਹੇ ਉਸ ਨੇ ਫਿਰ ਪੁੱਛਿਆ ਕਿ ਮੇਰੇ ’ਤੇ ਜ਼ਕਾਤ ਕਿੰਨੀ ਫ਼ਰਜ਼ ਹੇ ਦੱਸਣ ਵਾਲੇ ਦਾ ਕਹਿਣਾ ਹੇ ਕਿ ਨਬੀ ਕਰੀਮ (ਸ:) ਨੇ ਉਸ ਨੂੰ ਇਸਲਾਮ ਦੇ ਅਸੂਲ ਦੱਸ ਦਿੱਤੇ ਤਾਂ ਉਸ ਵਿਅਕਤੀ ਨੇ ਆਖਿਆ, ਉਸੇ ਅੱਲਾਹ ਦੀ ਕਸਮ ਜਿਸ ਨੇ ਤੁਹਾ` ਮਾਨ ਬਖ਼ਸ਼ਿਆ ਹੇ, ਨਾਂ ਤਾਂ ਮੈਂ ਕੋਈ ਵਾਧੂ (ਨਫ਼ਲੀ) ਇਬਾਦਤ ਕਰਾਂਗਾ ਅਤੇ ਨਾ ਹੀ ਫ਼ਰਜ਼ਾਂ ਵਿਚ ਕੋਈ ਕਟੌੌਤੀ ਕਰਾਂਗਾ ਇਹ ਸੁਣ ਕੇ ਨਬੀ ਕਰੀਮ (ਸ:) ਨੇ ਫ਼ਰਮਾਇਆ ਕਿ ਜੇ ਇਹ ਆਪਣੀ ਕਥਣੀ ਵਿਚ ਸੱਚਾ ਹੇ ਤਾਂ ਉਹ ਆਪਣੀ ਮੁਰਾਦ ਪਾ ਗਿਆ ਜਾਂ ਜੰਨਤ ਵਿਚ ਚਲਾ ਗਿਆ। (ਸਹੀ ਬੁਖ਼ਾਰੀ, ਹਦੀਸ: 1891)\n* ਅੱਲਾਹ ਦੇ ਰਸੂਲ (ਸ:) ਨੇ ਫ਼ਰਮਾਇਆ ਕਿ ਰੋਜ਼ਾ ਢਾਲ ਨੂੰ, ਸੋ ਰੋਜ਼ੇਦਾਰ ਨੂੰ ਚਾਹੀਦਾ ਹੇ ਕਿ ਉਹ ਨਾ ਤਾਂ ਕੋਈ ਭੈੜੇ ਕੰਮ ਕਰੇ ਅਤੇ ਨਾ ਜਾਹਲਾਂ ਵਰਗੀਆਂ ਗੱਲਾਂ ਕਰੇ ਜੇ ਕੋਈ ਉਸ ਨਾਲ ਲੜਾਈ ਝਗੜਾ ਕਰੇ ਜਾਂ ਗਾਲਾਂ ਦੇਵੇ ਤਾਂ ਉਸ ਨੂੰ ਦੋ ਵਾਰ ਆਖੇ ਕਿ ਉਸ ਦਾ ਰੋਜ਼ਾ ਹੇ ਫਿਰ ਨਬੀ (ਸ:) ਨੇ ਫ਼ਰਮਾਇਆ ਕਿ ਕਸਮ ਹੇ ਉਸ ਹਸਤੀ ਦੀ ਜਿਸ ਦੇ ਹੱਥ ਵਿਚ ਮੇਰੀ ਜਾਨ ਹੇ ਰੋਜ਼ੇਦਾਰ ਦੇ ਮੂੰਹ ਦੀ ਗੰਧ ਅੱਲਾਹ ਦੀਆਂ ਨਜ਼ਰਾਂ ਵਿਚ ਮੁਸ਼ਕ ਦੀ ਖ਼ੁਸ਼ਬੂ ਤੋਂ ਵੀ ਵਧੀਆ ਹੇ ਕਿਉਂ ਜੋ ਉਹ ਮੇਰੇ ਲਈ ਆਪਣਾ ਖਾਣਾ ਪੀਣਾ ਛਡਦਾ ਹੇ ਆਪਣੀਆਂ ਇੱਛਾਵਾਂ ਨੂੰ ਮਾਰਦਾ ਹੇ, ਸੋ ਰੋਜ਼ਾ ਵਿਸ਼ੇਸ਼ ਕਰ ਮੇਰੇ ਹੀ ਲਈ ਹੇ ਅਤੇ ਮੈਂ ਹੀ ਇਸ ਦਾ ਬਦਲਾ ਦੇਵਾਂਗਾ ਅਤੇ ਇਕ ਨੇਕੀ ਦਾ ਬਦਲਾ ਦਸ ਗੁਣਾ ਸਵਾਬ ਹੇ। (ਸਹੀ ਬੁਖ਼ਾਰੀ, ਹਦੀਸ: 1894)\n* ਜਿਹੜਾ ਵਿਅਕਤੀ ਰੋਜ਼ੇ ਦੀ ਹਾਲਤ ਵਿਚ ਵੀ ਝੂਠ ਬੋਲਣ ਤੋਂ ਨਹੀਂ ਰੁਕਦਾ ਤਾਂ ਅੱਲਾਹ ਨੂੰ ਉੱਕਾ ਹੀ ਲੋੜ ਨਹੀਂ ਕਿ ਉਹ ਖਾਣਾ ਪੀਣਾ ਛੱਡੇ ਭਾਵ ਉਸ ਦਾ ਰੋਜ਼ਾ ਕਬੂਲ ਨਹੀਂ ਕੀਤਾ ਜਾਵੇਗਾ। (ਸਹੀ ਬੁਖ਼ਾਰੀ, ਹਦੀਸ: 1903) 1 ਇਸ ਤੋਂ ਭਾਵ ਉਹ ਫ਼ਰਜ਼ ਇਬਾਦਤ ਹੇ ਜਿਹੜੀ ਅੱਲਾਹ ਵੱਲੋਂ ਮਨੁੱਖਾਂ ਨੂੰ ਅਦਾ ਕਰਨੀ ਜ਼ਰੂਰੀ ਹੇ। ਹਦੀਸ ਵਿਚ ਹੇਕਿ ਅੱਲਾਹ ਦਾ ਫ਼ਰਮਾਨ ਹੇ ਕਿ ਜਿਹੜਾ ਵਿਅਕਤੀ ਮੇਰੇ ਕਿਸੇ ਮਿੱਤਰ (ਵਲੀ) ਨਾਲ ਵੈਰ ਰੱਖਦਾਹੇ ਤਾਂ ਉਹ ਸੁਣ ਲਵੇ ਕਿ ਮੈਂ ਉਸ ਦੇ ਵਿਰੁੱਧ ਜੰਗ ਦਾ ਐਲਾਨ ਕਰਦਾ ਹਾਂ ਅਤੇ ਮੇਰਾ ਬੰਦਾ ਜਿਹੜੀਆਂ ਇਬਾਦਤਾਂ ਰਾਹੀਂ ਮੇਰੀ ਨੇੜਤਾ ਪ੍ਰਾਪਤ ਕਰਦਾ ਹੇ ਉਹਨਾਂ ਵਿੱਚੋਂ ਮੈ` ਕੋਈ ਵੀ ਇਬਾਦਤ ਇਸ ਤੋਂ ਵੱਧ ਪਸੰਦ ਨਹੀਂ ਜਿਹੜੀ ਮੈਂ ਉਸ ਲਈ ਫ਼ਰਜ਼ ਕੀਤੀ ਹੇ ਅਤੇ ਮੇਰਾ ਬੰਦਾ ਨਫ਼ਲੀ ਇਬਾਦਤ ਕਰਕੇ ਮੇਰੇ ਇੰਨਾ ਨੇੜੇ ਹੋ ਜਾਂਦਾ ਹੇ ਕਿ ਮੈਂ ਉਸ ਨਾਲ ਮੁਹੱਬਤ ਕਰਨ ਲੱਗ ਜਾਂਦਾ ਹਾਂ, ਸੋ ਮੈਂ ਉਸ ਦਾ ਕੰਨ ਬਣ ਜਾਂਦਾ ਹਾਂ ਜਿਸ ਤੋਂ ਉਹ ਸੁਣਦਾ ਹੇ, ਮੈਂ ਉਸ ਦੀ ਅੱਖ ਬਣ ਜਾਂਦਾ ਹਾਂ ਜਿਸ ਤੋਂ ਉਹ ਵੇਖਦਾ ਹੇ, ਮੈਂ ਹੱਥ ਬਣ ਜਾਂਦਾ ਹਾਂ ਜਿਸ ਤੋਂ ਉਹ ਫੜਦਾ ਹੇ, ਮੈਂ ਉਸਦਾ ਪੈਰ ਬਣ ਜਾਂਦਾ ਹਾਂ ਜਿਸ ਤੋਂ ਉਹ ਤੁਰਦਾ ਹੇ, ਜਦੋਂ ਉਹ ਮੈਥੋਂ ਕੁੱਝ ਮੰਗਦਾ ਹੇ ਤਾਂ ਮੈਂ ਉਸ ਨੂੰ ਦਿੰਦਾ ਹਾਂ, ਜੇ ਉਹ ਮੇਰੀ ਪਨਾਹ ਚਾਹੁੰਦਾ ਹੇ ਤਾਂ ਮੈਂ ਉਸ ਨੂੰ ਪਨਾਹ ਦਿੰਦਾ ਹਾਂ, ਮੈਂ` ਕਿਸੇ ਕੰਮ ਕਰਨ ਵਿਚ ਇੰਨੀ ਦੁਵਿਧਾ ਨਹੀਂ ਹੁੰਦੀ ਜਿੰਨੀ ਜਦ ਮੈਂ ਕਿਸੇ ਮੋਮਿਨ ਦੀ ਜਾਨ ਲੈਂਦਾ ਹਾਂ, ਉਸ ਸਮੇਂ ਹੁੰਦੀ ਹੇ। ਕਿਉਂ ਜੋ ਸਰੀਰਿਕ ਕਸ਼ਟ ਉਸ ਨੂੰ ਚੰਗਾ ਨਹੀਂ ਲੱਗਦਾ ਅਤੇ ਮੈ` ਆਪ ਵੀ ਉਸ ਨੂੰ ਕਸ਼ਟ ਦੇਣਾ ਪਸੰਦ ਨਹੀਂ। (ਸਹੀ ਬੁਖ਼ਾਰੀ, ਹਦੀਸ: 6502)","lang":"pa","meta":{"transliteration":"wa-idhā sa-alaka ʿibādī ʿannī fa-innī qarībun ujību daʿwata al-dāʿi idhā daʿāni falyastajībū lī walyu'minū bī laʿallahum yarshudūna ","translations":["And when","ask you","My servants","about Me","then indeed I am","near","I respond","(to the) invocation","(of) the supplicant","when","he calls Me","So let them respond","to Me","and let them believe","in Me","so that they may","(be) led aright","(186)"],"transliterationArr":["wa-idhā","sa-alaka","ʿibādī","ʿannī","fa-innī","qarībun","ujību","daʿwata","al-dāʿi","idhā","daʿāni","falyastajībū","lī","walyu'minū","bī","laʿallahum","yarshudūna",null],"verseTiming":[[1,0,910],[2,910,1730],[3,1730,2690],[4,2690,4130],[5,4130,5790],[6,5790,8670],[7,8670,9350],[8,9350,10130],[9,10130,10950],[10,10950,11500],[11,11500,14190],[12,14190,16260],[13,16260,16850],[14,16850,18250],[15,18250,18710],[16,18710,19870],[17,19870,23185]]}}],"dua":{"id":31,"name":"Dua for Divine Connection","arabicName":"دعاء الاتصال الإلهي","reference":"2:186","verseTitle":"The Intimate Supplication","significanceReason":"Emphasizes the direct and intimate connection between the believer and the Divine, highlighting that Allah is always near and responsive."},"version":{"key":"punjabi_arif","direction":"ltr","language_iso_code":"pa","version":"1.0.0","last_update":1666783255,"title":"Punjabi translation","description":"Translation of the Quran meanings into Punjabi by Arif Halim, published by Darussalam"}}