{"data":[{"name":"1:6","price":"Udhëzona në rrugën e drejtë![3]","arabic":"ٱهۡدِنَا ٱلصِّرَٰطَ ٱلۡمُسۡتَقِيمَ","category":["1 (Al-Fatihah)","Al-Fatihah","Surah Al-Fatihah"],"ayahNumber":6,"juzNumber":1,"footnotes":"[3] Pas lavdërimit të Allahut, pas njohjes së sundimit të Tij hyjnor mbi gjithësinë dhe mbi Ditën e Gjykimit dhe pas deklarimit të nënshtrimit të tërësishëm ndaj Allahut, që konkretizohet në adhurimin kushtuar Atij dhe në heqjen dorë nga çdo lloj ndihmësi e mbrojtësi tjetër përveç Atij, njeriu i kërkon Zotit të Tij që t’i japë një udhëzim për në rrugën e drejtë, një sistem doktrinar, shpirtëror dhe ligjor që do ta udhëheqë përmes kësaj prove tokësore deri në jetën e përtejme.","lang":"sq","meta":{"transliteration":"ih'dinā al-ṣirāṭa al-mus'taqīma ","translations":["Guide us","(to) the path","the straight","(6)"],"transliterationArr":["ih'dinā","al-ṣirāṭa","al-mus'taqīma",null],"verseTiming":[[1,0,740],[2,740,1640],[3,1640,5525]]}},{"name":"1:7","price":"Në rrugën e atyre që u ke dhuruar mirësi[4] e jo në të atyre që kanë shkaktuar zemërimin Tënd,[5] as në të atyre që janë të humbur![6]","arabic":"صِرَٰطَ ٱلَّذِينَ أَنۡعَمۡتَ عَلَيۡهِمۡ غَيۡرِ ٱلۡمَغۡضُوبِ عَلَيۡهِمۡ وَلَا ٱلضَّآلِّينَ","category":["1 (Al-Fatihah)","Al-Fatihah","Surah Al-Fatihah"],"ayahNumber":7,"juzNumber":1,"footnotes":"[4] Vargu i fundit përmban pohimin se edhe para shpalljes së Kuranit, mëshira e Allahut të Madhëruar vepronte midis njerëzve, duke prodhuar sjellje të ndriçuara nga besimi dhe të udhëhequra nga frika ndaj Zotit. Sipas komentuesit më të njohur të Kuranit, Ibn Abbasit (r.a.), ata njerëz të cilëve Allahu u ka dhuruar mirësi, janë: profetët, besimtarët e sinqertë e të drejtë (siddikûn), martirët për çështjen e besimit (shuhadâ’) dhe besimtarët e mirë e të drejtë (sâlihûn). \n[5] Njerëzit e tillë janë ata që e njohin rrugën e drejtë, por që nuk e ndjekin atë.\n[6] Njerëzit e tillë janë ata që kanë gabuar rrugë, duke kujtuar se ndjekin rrugën e drejtë.","lang":"sq","meta":{"transliteration":"ṣirāṭa alladhīna anʿamta ʿalayhim ghayri al-maghḍūbi ʿalayhim walā al-ḍālīna ","translations":["(The) path","(of) those","You have bestowed (Your) Favors","on them","not (of)","those who earned (Your) wrath","on themselves","and not","(of) those who go astray","(7)"],"transliterationArr":["ṣirāṭa","alladhīna","anʿamta","ʿalayhim","ghayri","al-maghḍūbi","ʿalayhim","walā","al-ḍālīna",null],"verseTiming":[[1,0,750],[2,750,1670],[3,1670,2690],[4,2690,3620],[5,3620,4210],[6,4210,5380],[7,5380,6380],[8,6380,6670],[9,6670,13175]]}}],"dua":{"id":6,"name":"Dua of Right Guidance","arabicName":"دعاء الهداية","reference":"1:6-7","verseTitle":"The Guidance Supplication","significanceReason":"Most repeated dua in daily prayers, seeking divine guidance and protection from misguided paths. Muslims recite this in every prayer, making it universally recognized and spiritually powerful."},"version":{"key":"albanian_nahi","direction":"ltr","language_iso_code":"sq","version":"1.1.0","last_update":1576962000,"title":"Albanian Translation - Hasan Nahi","description":"Translation of the Quran meanings into Albanian by Hasan Nahi, published by Albanian Institute of Islamic Thought and Civilization, printed in 2006."}}