{"data":[{"name":"1:6","price":"Fi ẹsẹ̀ wa rinlẹ̀ l’ójú ọ̀nà tààrà (’Islām),¹","arabic":"ٱهۡدِنَا ٱلصِّرَٰطَ ٱلۡمُسۡتَقِيمَ","category":["1 (Al-Fatihah)","Al-Fatihah","Surah Al-Fatihah"],"ayahNumber":6,"juzNumber":1,"footnotes":"1. Sirọ̄tun mustaƙīm “ọ̀nà tààrà” jẹyọ ní àyè 33 nínú al-Ƙur’ān alápọ̀n-ọ́nlé. Ó sì dúró fún ìwọ̀nyí: \n (1) Jíjìnnà sí ẹbọ ṣíṣe, jíjìnnà sí ìwà ìbàjẹ́, ṣíṣe rere àti lílo òfin Allāhu; ìtúmọ̀ yìí wà bẹ́ẹ̀ nínú sūrah al-’Ani-‘Ām; 6:151-153. \n (2) Jíjọ́sìn fún Allāhu níkan ṣoṣo àti dídúró ṣinṣin nínú ìjọ́sìn Rẹ̀; ìtúmọ̀ yìí wà bẹ́ẹ̀ nínú sūrah Āli ‘Imrọ̄n; 3:51&101. \n (3) Ẹ̀sìn kan ṣoṣo tí gbogbo àwọn Ànábì àti àwọn Òjíṣẹ́ Allāhu ṣe; ìtúmọ̀ yìí wà bẹ́ẹ̀ nínú sūrah al-’Ani-‘Ām; 6:83-90. \n (4) Ẹ̀sìn ’Islām; ìtúmọ̀ yìí wà bẹ́ẹ̀ nínú sūrah al-’Ani-‘Ām; 6:125-126. Nítorí náà, kò sí àyè kan nínú al-Ƙur’ān tí ọ̀nà tààrà ti dúró fún ẹ̀sìn nasọ̄rọ̄ tàbí ẹ̀sìn yẹhudi. \n Nígbà tí mùsùlùmí bá sì ń ṣàdúà ní gbogbo ìgbà pé “ihdina-ssirọ̄tọl-mustaƙīm” ìtúmọ̀ rẹ̀ ni pé, “Fi ẹsẹ̀ wa rinlẹ̀ l’ójú ọ̀nà tààrà.” Ìyẹn ni pé, “Fi ẹsẹ̀ wa rinlẹ̀ sínú ’Islām ọ̀nà tààrà.” Nítorí náà, àdúà ìfẹsẹ̀rinlẹ̀ sínú ẹ̀sìn ’Islām títí d’ọjọ́ ikú ni àdúà náà dúró fún. Àti pé, āyah 7 ti yanjú ọ̀rọ̀ náà pé, kì í ṣe ọ̀nà yẹhudi nítorí pé, wọ́n ti di ẹni ìbínú lọ́dọ̀ Allāhu. Kì í sì ṣe ọ̀nà nasọ̄rọ̄ nítorí pé, wọ́n ti di olùṣìnà. Ẹ tún wo ìtọsẹ̀-ọ̀rọ̀ sūrah Al-’a‘rọ̄f; 7:23. = \n Kíyè sí i! Ìdí tí àdúà yìí sì fi pàtàkì púpọ̀ ni pé, tí ènìyàn bá ṣe ẹ̀sìn ’Islām, kò lè jèrè rẹ̀ àyàfi kí ó kú sínú rẹ̀ nítorí sūrah Āli-‘Imrọ̄n; 3:102. Ẹ tún wo ìtọsẹ̀-ọ̀rọ̀ sūrah al-Ƙọsọs; 28:56.","lang":"yo","meta":{"transliteration":"ih'dinā al-ṣirāṭa al-mus'taqīma ","translations":["Guide us","(to) the path","the straight","(6)"],"transliterationArr":["ih'dinā","al-ṣirāṭa","al-mus'taqīma",null],"verseTiming":[[1,0,740],[2,740,1640],[3,1640,5525]]}},{"name":"1:7","price":"ọ̀nà àwọn tí O ṣe ìdẹ̀ra fún,¹ yàtọ̀ sí (ọ̀nà) àwọn ẹni-ìbínú (ìyẹn, àwọn yẹhudi) àti (ọ̀nà) àwọn olùṣìnà (ìyẹn, àwọn nasọ̄rọ̄).","arabic":"صِرَٰطَ ٱلَّذِينَ أَنۡعَمۡتَ عَلَيۡهِمۡ غَيۡرِ ٱلۡمَغۡضُوبِ عَلَيۡهِمۡ وَلَا ٱلضَّآلِّينَ","category":["1 (Al-Fatihah)","Al-Fatihah","Surah Al-Fatihah"],"ayahNumber":7,"juzNumber":1,"footnotes":"1. Àwọn wo gan-an ni àwọn tí Allāhu ṣe ìdẹ̀ra fún, tí àwa mùsùlùmí ń tọ ojú-ọ̀nà wọn? Ẹ ka sūrah Mọryam;19:58.","lang":"yo","meta":{"transliteration":"ṣirāṭa alladhīna anʿamta ʿalayhim ghayri al-maghḍūbi ʿalayhim walā al-ḍālīna ","translations":["(The) path","(of) those","You have bestowed (Your) Favors","on them","not (of)","those who earned (Your) wrath","on themselves","and not","(of) those who go astray","(7)"],"transliterationArr":["ṣirāṭa","alladhīna","anʿamta","ʿalayhim","ghayri","al-maghḍūbi","ʿalayhim","walā","al-ḍālīna",null],"verseTiming":[[1,0,750],[2,750,1670],[3,1670,2690],[4,2690,3620],[5,3620,4210],[6,4210,5380],[7,5380,6380],[8,6380,6670],[9,6670,13175]]}}],"dua":{"id":6,"name":"Dua of Right Guidance","arabicName":"دعاء الهداية","reference":"1:6-7","verseTitle":"The Guidance Supplication","significanceReason":"Most repeated dua in daily prayers, seeking divine guidance and protection from misguided paths. Muslims recite this in every prayer, making it universally recognized and spiritually powerful."},"version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."}}