{"data":[{"name":"1:1","price":"Ní orúkọ Allāhu, Àjọkẹ́-ayé, Àṣàkẹ́-ọ̀run.¹","arabic":"بِسۡمِ ٱللَّهِ ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ","category":["1 (Al-Fatihah)","Al-Fatihah","Surah Al-Fatihah"],"ayahNumber":1,"juzNumber":1,"footnotes":"1. Sūratun Mọkkiyyah túmọ̀ sí sūrah tí ó sọ̀kalẹ̀ ṣíwájú Hijrah. Bákan náà, sūratun Mọdaniyyah túmọ̀ sí sūrah tí ó sọ̀kalẹ̀ lẹ́yìn Hijrah. Ìyẹn ni pé, Hijrah tí àwọn mùsùlùmí ṣe láti ìlú Mọkkah Alápọ̀n-ọ́nlé sí ìlú Mọdīnah Onímọ̀ọ́lẹ̀ ni wọ́n fi pín gbogbo sūrah al-Ƙur’ān alápọ̀n-ọ́nlé sábẹ́ sūratun Mọkkiyyah àti sūratun Mọdaniyyah. Ìwọ̀nyí ni àwọn orúkọ sūrah yìí: (1) Fātihatul-kitāb “Sūrah Ìbẹ̀rẹ̀ Tírà (ìyẹn ní ti àkọsílẹ̀, kì í ṣe ní ti ìsọ̀kalẹ̀.” (2) ’Ummul-Ƙur’ān “Ìpìlẹ̀ al-Ƙur’ān”, (3) ’Ummul-kitāb “Ìpìlẹ̀ Tírà”, (4) as-Sab‘u al-mọthāniy “sūrah alāyah méje tí ó kún fún ẹyìn Allāhu” (Wọ́n ṣí “bismillāh ar-rahmọ̄n ar-rọhīm” mọ́ ọn.)“, (5) al-Ƙur’ān al-‘aṭḥīm “N̄ǹkan Kíkà ńlá”, (6) al-hamd “ẹyìn”, (7) as-sọlāt “ìrun”, (8) aṣ-ṣifā’ “ìwòsàn” àti (9) ar-ruƙyah “àdúà pàjáwìrì”.","lang":"yo","meta":{"transliteration":"bis'mi al-lahi al-raḥmāni al-raḥīmi ","translations":["In (the) name","(of) Allah","the Most Gracious","the Most Merciful","(1)"],"transliterationArr":["bis'mi","al-lahi","al-raḥmāni","al-raḥīmi",null],"verseTiming":[[1,0,580],[2,580,1409],[3,1409,2502],[4,2502,5840]]}},{"name":"1:2","price":"Gbogbo ẹyìn¹ ń jẹ́ ti Allāhu, Olúwa² gbogbo ẹ̀dá,","arabic":"ٱلۡحَمۡدُ لِلَّهِ رَبِّ ٱلۡعَٰلَمِينَ","category":["1 (Al-Fatihah)","Al-Fatihah","Surah Al-Fatihah"],"ayahNumber":2,"juzNumber":1,"footnotes":"1. Nínú èdè Lárúbáwá, “hamd” yàtọ̀ sí “ṣukr” àmọ́ ìtúmọ̀ ìkíní kejì fẹ́ súnmọ́ ara wọn. \n Ìtúmọ̀ “hamd” ni “ẹyìn” èyí tí a sọ jáde ní ẹnu pẹ̀lú ìfẹ́ àti gbígbé-títóbi fún ẹni tí ẹyìn tọ́ sí nítorí pé ẹni náà jẹ́ ẹni tí ó pé tán pátápátá tí kò kù sí ibì kan kan níbi pàápàá rẹ̀, àwọn ìròyìn rẹ̀ àti àwọn ìṣe rẹ̀. Kò sì sí ẹni tí ó pé tán pátápátá bí kò ṣe Allāhu - Ọba tó ga jùlọ -. Nítorí náà, Allāhu nìkan ṣoṣo ni a gbọ́dọ̀ máa yìn gẹ́gẹ́ bí ó ṣe jẹ́ pé, Òun nìkan náà ni a gbọ́dọ̀ máa jọ́sìn fún ní ọ̀nà òdodo. Nígbà tí a bá yin ẹ̀dá ẹgbẹ́ wa, “mọdh” ni wọ́n ń pe ìyẹn nínú èdè Lárúbáwá. Kò sì pọn dandan kí ẹyìn náà dénú, ó lè má kọjá orí ahọ́n, gẹ́gẹ́ bí ẹyìn àwọn eléwì. \n Ní ti “ṣukr”, ìtúmọ̀ rẹ̀ ni mímọ rírì oore àti sísọ ọ́ jáde. Ẹni tí ó bá mọ rírì oore kan, tí ó sì sọ ọ́ jáde ló dúpẹ́ oore náà fún ẹni tí ó ṣe oore náà fún un. Bí Allāhu bá ṣe oore kan fún mi, mo lè sọ pé, “’aṣkuru-llāh / ṣukrān lillāh” (mo dúpẹ́ fún Allāhu). Bí ìwọ bá ṣoore kan fún mi, mo lè sọ pé, “ ’aṣkuruk / ṣukrān lak (mo dúpẹ́ fún ọ). Paban̄barì rẹ̀ ni pé kí n̄g sọ fún ọ pé, “jazākumullāhu kọerā” (Allāhu á san yín ní ẹ̀san rere.). Kí ìwọ náà yára fọ èsì pé, “ wa ’antum fajazākumullāhu kọerā” (Àti ẹ̀yin náà, Allāhu á san yín ní ẹ̀san rere.) Èsì kọ́ ni “wa’iyyākum” \n Àmọ́ a kò gbọ́dọ̀ lo “hamd” fún ẹ̀dá kan lẹ́yìn Allāhu - Ọba Ẹlẹ́yìn. Ẹni tí ó bá wá sọ pé, “alhamdu lillāh” Ó ti kó ẹyìn àti ọpẹ́ sínú. Nítorí náà, kí ẹ̀dá máa ṣe “alhamdu lillāh” ní àsìkò tí a bá rí oore kan gbà láti ọ̀dọ̀ Allāhu àti ní àsìkò tí a kò ì rí oore náà gbá nítorí pé, oore Allāhu lọ́dọ̀ wa pọ̀ láì ní òǹkà. \n Ìdí nìyí tí ó fi jẹ́ pé, nígbà tí ìdùnnú kan bá ṣẹlẹ̀ sí Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a -, ó máa sọ pé “ alhamdu lillāh allathī bi ni‘mọtihi tatimmu-ssọ̄lihāt” (gbogbo ẹyìn ń jẹ́ ti Allāhu, ẹni tí àwọn ohun rere ń pé (ń kẹ́sẹjá) pẹ̀lú ìdẹ̀ra Rẹ̀. Tí ìdà kejì bá sì ṣẹlẹ̀, ó máa sọ pé, “alhamdu lillāhi ‘alā kulli hāl” (gbogbo ẹyìn ń jẹ́ ti Allāhu lórí gbogbo ipò (tí ẹ̀dá bá wà).\n 2. Ọ̀rọ̀ yìí “rọbb” (Olúwa), ó kó ọ̀rọ̀ mẹ́ta sínú. Dídá ẹ̀dá, ṣíṣe ìjọba lórí ẹ̀dá tàbí níni ẹ̀dá àti dídarí ọ̀rọ̀ ẹ̀dá. Nígbà tí a bá pe Allāhu ní “rọbb” (Olúwa), gbogbo ìwọ̀nyẹn ló kó sínú nítorí pé, Allāhu ni Ẹlẹ́dàá wa, tiRẹ̀ ni ìjọba lórí gbogbo ẹ̀dá, Òun sì ni Ó ń darí kádàrá ẹ̀dá. Nítorí náà, Allāhu ni Olúwa wa. \n Àmọ́ nígbà tí a bá pe ẹ̀dá kan ní “rọbb”, kò lè kó gbogbo ìròyìn mẹ́tẹ̀ẹ̀ta wọ̀nyẹn sínú. Bí àpẹ̀ẹrẹ, à ń pe onílé ní “rọbbul-baet” nítorí pé, ìtúmọ̀ kan nínú àwọn ìtúmọ̀ “rọbb” ni níni n̄ǹkan”","lang":"yo","meta":{"transliteration":"al-ḥamdu lillahi rabbi al-ʿālamīna ","translations":["All praises and thanks","(be) to Allah","the Lord","of the universe","(2)"],"transliterationArr":["al-ḥamdu","lillahi","rabbi","al-ʿālamīna",null],"verseTiming":[[1,0,1000],[2,1000,1860],[3,1860,2490],[4,2490,5525]]}},{"name":"1:3","price":"Àjọkẹ́-ayé, Àṣàkẹ́-ọ̀run,","arabic":"ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ","category":["1 (Al-Fatihah)","Al-Fatihah","Surah Al-Fatihah"],"ayahNumber":3,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"al-raḥmāni al-raḥīmi ","translations":["The Most Gracious","the Most Merciful","(3)"],"transliterationArr":["al-raḥmāni","al-raḥīmi",null],"verseTiming":[[1,0,1240],[3,1240,4565]]}},{"name":"1:4","price":"Olùkápá-ọjọ́-ẹ̀san.","arabic":"مَٰلِكِ يَوۡمِ ٱلدِّينِ","category":["1 (Al-Fatihah)","Al-Fatihah","Surah Al-Fatihah"],"ayahNumber":4,"juzNumber":1,"footnotes":"","lang":"yo","meta":{"transliteration":"māliki yawmi al-dīni ","translations":["(The) Master","(of the) Day","(of the) Judgment","(4)"],"transliterationArr":["māliki","yawmi","al-dīni",null],"verseTiming":[[1,0,820],[2,820,1420],[3,1420,4585]]}},{"name":"1:5","price":"Ìwọ nìkan ni à ń jọ́sìn fún. Ọ̀dọ̀ Rẹ nìkan sì ni à ń wá oore sí.¹","arabic":"إِيَّاكَ نَعۡبُدُ وَإِيَّاكَ نَسۡتَعِينُ","category":["1 (Al-Fatihah)","Al-Fatihah","Surah Al-Fatihah"],"ayahNumber":5,"juzNumber":1,"footnotes":"1. Èyí ni àdéhùn ojoojúmọ́ tí à ń ṣe fún Allāhu, Ọlọ́hun tí a gbọ́dọ̀ máa jọ́sìn fún ní ọ̀nà òdodo. Nítorí náà, èèwọ̀ ẹ̀sìn ni fún mùsùlùmí láti yapa àdéhùn náà. Ẹnikẹ́ni tí ó bá yapa àdéhùn náà, ó ti di ẹlẹ́bọ pọ́nńbélé títí ó fi máa ronú pìwàdà.","lang":"yo","meta":{"transliteration":"iyyāka naʿbudu wa-iyyāka nastaʿīnu ","translations":["You Alone","we worship","and You Alone","we ask for help","(5)"],"transliterationArr":["iyyāka","naʿbudu","wa-iyyāka","nastaʿīnu",null],"verseTiming":[[1,0,990],[2,990,1760],[3,1760,2880],[4,2880,6635]]}},{"name":"1:6","price":"Fi ẹsẹ̀ wa rinlẹ̀ l’ójú ọ̀nà tààrà (’Islām),¹","arabic":"ٱهۡدِنَا ٱلصِّرَٰطَ ٱلۡمُسۡتَقِيمَ","category":["1 (Al-Fatihah)","Al-Fatihah","Surah Al-Fatihah"],"ayahNumber":6,"juzNumber":1,"footnotes":"1. Sirọ̄tun mustaƙīm “ọ̀nà tààrà” jẹyọ ní àyè 33 nínú al-Ƙur’ān alápọ̀n-ọ́nlé. Ó sì dúró fún ìwọ̀nyí: \n (1) Jíjìnnà sí ẹbọ ṣíṣe, jíjìnnà sí ìwà ìbàjẹ́, ṣíṣe rere àti lílo òfin Allāhu; ìtúmọ̀ yìí wà bẹ́ẹ̀ nínú sūrah al-’Ani-‘Ām; 6:151-153. \n (2) Jíjọ́sìn fún Allāhu níkan ṣoṣo àti dídúró ṣinṣin nínú ìjọ́sìn Rẹ̀; ìtúmọ̀ yìí wà bẹ́ẹ̀ nínú sūrah Āli ‘Imrọ̄n; 3:51&101. \n (3) Ẹ̀sìn kan ṣoṣo tí gbogbo àwọn Ànábì àti àwọn Òjíṣẹ́ Allāhu ṣe; ìtúmọ̀ yìí wà bẹ́ẹ̀ nínú sūrah al-’Ani-‘Ām; 6:83-90. \n (4) Ẹ̀sìn ’Islām; ìtúmọ̀ yìí wà bẹ́ẹ̀ nínú sūrah al-’Ani-‘Ām; 6:125-126. Nítorí náà, kò sí àyè kan nínú al-Ƙur’ān tí ọ̀nà tààrà ti dúró fún ẹ̀sìn nasọ̄rọ̄ tàbí ẹ̀sìn yẹhudi. \n Nígbà tí mùsùlùmí bá sì ń ṣàdúà ní gbogbo ìgbà pé “ihdina-ssirọ̄tọl-mustaƙīm” ìtúmọ̀ rẹ̀ ni pé, “Fi ẹsẹ̀ wa rinlẹ̀ l’ójú ọ̀nà tààrà.” Ìyẹn ni pé, “Fi ẹsẹ̀ wa rinlẹ̀ sínú ’Islām ọ̀nà tààrà.” Nítorí náà, àdúà ìfẹsẹ̀rinlẹ̀ sínú ẹ̀sìn ’Islām títí d’ọjọ́ ikú ni àdúà náà dúró fún. Àti pé, āyah 7 ti yanjú ọ̀rọ̀ náà pé, kì í ṣe ọ̀nà yẹhudi nítorí pé, wọ́n ti di ẹni ìbínú lọ́dọ̀ Allāhu. Kì í sì ṣe ọ̀nà nasọ̄rọ̄ nítorí pé, wọ́n ti di olùṣìnà. Ẹ tún wo ìtọsẹ̀-ọ̀rọ̀ sūrah Al-’a‘rọ̄f; 7:23. = \n Kíyè sí i! Ìdí tí àdúà yìí sì fi pàtàkì púpọ̀ ni pé, tí ènìyàn bá ṣe ẹ̀sìn ’Islām, kò lè jèrè rẹ̀ àyàfi kí ó kú sínú rẹ̀ nítorí sūrah Āli-‘Imrọ̄n; 3:102. Ẹ tún wo ìtọsẹ̀-ọ̀rọ̀ sūrah al-Ƙọsọs; 28:56.","lang":"yo","meta":{"transliteration":"ih'dinā al-ṣirāṭa al-mus'taqīma ","translations":["Guide us","(to) the path","the straight","(6)"],"transliterationArr":["ih'dinā","al-ṣirāṭa","al-mus'taqīma",null],"verseTiming":[[1,0,740],[2,740,1640],[3,1640,5525]]}},{"name":"1:7","price":"ọ̀nà àwọn tí O ṣe ìdẹ̀ra fún,¹ yàtọ̀ sí (ọ̀nà) àwọn ẹni-ìbínú (ìyẹn, àwọn yẹhudi) àti (ọ̀nà) àwọn olùṣìnà (ìyẹn, àwọn nasọ̄rọ̄).","arabic":"صِرَٰطَ ٱلَّذِينَ أَنۡعَمۡتَ عَلَيۡهِمۡ غَيۡرِ ٱلۡمَغۡضُوبِ عَلَيۡهِمۡ وَلَا ٱلضَّآلِّينَ","category":["1 (Al-Fatihah)","Al-Fatihah","Surah Al-Fatihah"],"ayahNumber":7,"juzNumber":1,"footnotes":"1. Àwọn wo gan-an ni àwọn tí Allāhu ṣe ìdẹ̀ra fún, tí àwa mùsùlùmí ń tọ ojú-ọ̀nà wọn? Ẹ ka sūrah Mọryam;19:58.","lang":"yo","meta":{"transliteration":"ṣirāṭa alladhīna anʿamta ʿalayhim ghayri al-maghḍūbi ʿalayhim walā al-ḍālīna ","translations":["(The) path","(of) those","You have bestowed (Your) Favors","on them","not (of)","those who earned (Your) wrath","on themselves","and not","(of) those who go astray","(7)"],"transliterationArr":["ṣirāṭa","alladhīna","anʿamta","ʿalayhim","ghayri","al-maghḍūbi","ʿalayhim","walā","al-ḍālīna",null],"verseTiming":[[1,0,750],[2,750,1670],[3,1670,2690],[4,2690,3620],[5,3620,4210],[6,4210,5380],[7,5380,6380],[8,6380,6670],[9,6670,13175]]}}],"chapter":["1 (Al-Fatihah)","Al-Fatihah","Surah Al-Fatihah","Chapter Al-Fatihah","Fatihah","Surah Fatihah","Chapter Fatihah","Al Fatihah","Surah Al Fatihah","Chapter Al Fatihah","Surah 1","Chapter 1","The Opening","الفَاتِحَة"],"version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."}}