{"data":[{"name":"41:1","price":"Hā mīm. (Allāhu ló mọ ohun tí Ó gbàlérò pẹ̀lú àwọn háràfí náà.)¹","arabic":"حمٓ","category":["41 (Fussilat)","Fussilat","Surah Fussilat"],"ayahNumber":4219,"juzNumber":24,"footnotes":"1. Ẹ wo ìtọsẹ̀-ọ̀rọ̀ sūrah al Baƙọrah; 2:1.","lang":"yo","meta":{"transliteration":"hha-meem ","translations":["Ha Meem","(1)"],"transliterationArr":["hha-meem",null],"verseTiming":[[1,0,5015]]}},{"name":"41:2","price":"Ìmísí kan (nìyí) tó sọ̀kalẹ̀ láti ọ̀dọ̀ Àjọkẹ́-ayé, Àṣàkẹ́-ọ̀run.","arabic":"تَنزِيلٞ مِّنَ ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ","category":["41 (Fussilat)","Fussilat","Surah Fussilat"],"ayahNumber":4220,"juzNumber":24,"footnotes":"","lang":"yo","meta":{"transliteration":"tanzīlun mina al-raḥmāni al-raḥīmi ","translations":["A revelation","from","the Most Gracious","the Most Merciful","(2)"],"transliterationArr":["tanzīlun","mina","al-raḥmāni","al-raḥīmi",null],"verseTiming":[[1,0,1800],[2,1800,2780],[3,2780,3820],[4,3820,7045]]}},{"name":"41:3","price":"Tírà kan ni tí wọ́n ṣàlàyé àwọn āyah inú rẹ̀,¹ (ó ń jẹ́) al-Ƙur’ān (tí wọ́n sọ̀kalẹ̀ ní) èdè Lárúbáwá fún ìjọ tó nímọ̀.","arabic":"كِتَٰبٞ فُصِّلَتۡ ءَايَٰتُهُۥ قُرۡءَانًا عَرَبِيّٗا لِّقَوۡمٖ يَعۡلَمُونَ","category":["41 (Fussilat)","Fussilat","Surah Fussilat"],"ayahNumber":4221,"juzNumber":24,"footnotes":"1. Ìtúmọ̀ mìíràn “Tírà kan ni tí wọ́n pín àwọn āyah inú rẹ̀ sínú àwọn sūrah.” (Tafsīr at-Tashīl li ‘ulūmi-ttanzīl libn Juziy). \n Wàyí nípa ti ìtúmọ̀ àkọ́kọ́ “Tírà kan ni tí wọ́n ṣàlàyé àwọn āyah inú rẹ̀”, kí ni n̄ǹkan náà tí wọ́n fi ṣàlàyé àwọn āyah inú al-Ƙur’ān? Ní àyè yìí ni a óò ti mọ pàtàkì àwọn hadīth Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá -. Ìdí ni pé, gbogbo àwọn āyah tí ó jẹmọ́ ìgbàgbọ́ òdodo “al-‘aƙīdah” àti àwon āyah tó jẹmọ́ ìjọ́sìn “al-‘ibādah” àti àwọn āyah tó jẹmọ́ òfin àti ìdájọ́ “al-hukm wal-ƙọdọ̄’, kò sí àlàyé wọn nínú al-Ƙur’ān bí kò ṣe nínú àwọn hadīth Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá -.","lang":"yo","meta":{"transliteration":"kitābun fuṣṣilat āyātuhu qur'ānan ʿarabiyyan liqawmin yaʿlamūna ","translations":["A Book","are detailed","its Verses","a Quran","(in) Arabic","for a people","(who) know","(3)"],"transliterationArr":["kitābun","fuṣṣilat","āyātuhu","qur'ānan","ʿarabiyyan","liqawmin","yaʿlamūna",null],"verseTiming":[[1,0,800],[2,800,2540],[3,2540,3820],[4,3820,4920],[5,4920,5920],[6,5920,7990],[7,7990,11025]]}},{"name":"41:4","price":"(Ó jẹ́) ìró-ìdùnnú àti ìkìlọ̀, ṣùgbọ́n ọ̀pọ̀lọ́pọ̀ wọn gbúnrí kúrò níbẹ̀. Wọn kò sì tẹ́tí sí i.","arabic":"بَشِيرٗا وَنَذِيرٗا فَأَعۡرَضَ أَكۡثَرُهُمۡ فَهُمۡ لَا يَسۡمَعُونَ","category":["41 (Fussilat)","Fussilat","Surah Fussilat"],"ayahNumber":4222,"juzNumber":24,"footnotes":"","lang":"yo","meta":{"transliteration":"bashīran wanadhīran fa-aʿraḍa aktharuhum fahum lā yasmaʿūna ","translations":["A giver of glad tidings","and a warner","but turn away","most of them","so they","(do) not","hear","(4)"],"transliterationArr":["bashīran","wanadhīran","fa-aʿraḍa","aktharuhum","fahum","lā","yasmaʿūna",null],"verseTiming":[[1,0,890],[2,890,3190],[3,3190,4260],[4,4260,5360],[5,5360,5950],[6,5950,6360],[7,6360,9845]]}},{"name":"41:5","price":"Wọ́n sì wí pé: “Ọkàn wa wà ní títì pa sí ohun tí ẹ̀ ń pè wá sí. Èdídí sì wà nínú etí wa. Àti pé gàgá wà láààrin àwa àti ìwọ. Nítorí náà, máa ṣe tìrẹ. Dájúdájú àwa náà ń ṣe tiwa.”","arabic":"وَقَالُواْ قُلُوبُنَا فِيٓ أَكِنَّةٖ مِّمَّا تَدۡعُونَآ إِلَيۡهِ وَفِيٓ ءَاذَانِنَا وَقۡرٞ وَمِنۢ بَيۡنِنَا وَبَيۡنِكَ حِجَابٞ فَٱعۡمَلۡ إِنَّنَا عَٰمِلُونَ","category":["41 (Fussilat)","Fussilat","Surah Fussilat"],"ayahNumber":4223,"juzNumber":24,"footnotes":"","lang":"yo","meta":{"transliteration":"waqālū qulūbunā fī akinnatin mimmā tadʿūnā ilayhi wafī ādhāninā waqrun wamin bayninā wabaynika ḥijābun fa-iʿ'mal innanā ʿāmilūna ","translations":["And they say","Our hearts","(are) in","coverings","from what","you call us","to it","and in","our ears","(is) deafness","and between us","and between us","and between you","(is) a screen","So work","indeed, we","(are) working","(5)"],"transliterationArr":["waqālū","qulūbunā","fī","akinnatin","mimmā","tadʿūnā","ilayhi","wafī","ādhāninā","waqrun","wamin","bayninā","wabaynika","ḥijābun","fa-iʿ'mal","innanā","ʿāmilūna",null],"verseTiming":[[1,0,970],[2,970,2140],[3,2140,3759],[4,3759,5529],[5,5529,7589],[6,7589,10288],[7,10288,11028],[8,11028,13358],[9,13358,14718],[10,14718,15368],[11,15368,17798],[12,17798,19228],[13,19228,20428],[14,20428,21438],[15,21438,22448],[16,22448,23438],[17,23438,24998],[18,24998,25878],[19,25878,27608],[20,27608,30793]]}},{"name":"41:6","price":"Sọ pé: “Abara bí irú yín kúkú ni èmi náà. Wọ́n ń fi ìmísí ránṣẹ́ sí mi ni, pé Ọlọ́hun yín tí ẹ gbọ́dọ̀ máa jọ́sìn fún ní ọ̀nà òdodo, Ọlọ́hun Ọ̀kan ṣoṣo ni. Nítorí náà, ẹ dúró ṣinṣin tì Í (nínú ìjọ́sìn), kí ẹ sì tọrọ àforíjìn ní ọ̀dọ̀ Rẹ̀. Ègbé sì ni fún àwọn ọ̀ṣẹbọ.","arabic":"قُلۡ إِنَّمَآ أَنَا۠ بَشَرٞ مِّثۡلُكُمۡ يُوحَىٰٓ إِلَيَّ أَنَّمَآ إِلَٰهُكُمۡ إِلَٰهٞ وَٰحِدٞ فَٱسۡتَقِيمُوٓاْ إِلَيۡهِ وَٱسۡتَغۡفِرُوهُۗ وَوَيۡلٞ لِّلۡمُشۡرِكِينَ","category":["41 (Fussilat)","Fussilat","Surah Fussilat"],"ayahNumber":4224,"juzNumber":24,"footnotes":"","lang":"yo","meta":{"transliteration":"qul innamā anā basharun mith'lukum yūḥā ilayya annamā ilāhukum ilāhun wāḥidun fa-is'taqīmū ilayhi wa-is'taghfirūhu wawaylun lil'mush'rikīna ","translations":["Say","Only","I am","a man","like you","it is revealed","to me","that","your god","(is) God","One","so take a Straight Path","to Him","and ask His forgiveness","And woe","to the polytheists","(6)"],"transliterationArr":["qul","innamā","anā","basharun","mith'lukum","yūḥā","ilayya","annamā","ilāhukum","ilāhun","wāḥidun","fa-is'taqīmū","ilayhi","wa-is'taghfirūhu","wawaylun","lil'mush'rikīna",null],"verseTiming":[[1,0,350],[2,350,3460],[3,3460,3850],[4,3850,4500],[5,4500,5940],[6,5940,8420],[7,8420,9220],[8,9220,12720],[9,12720,13860],[10,13860,15700],[11,15700,17180],[12,17180,20230],[13,20230,21030],[14,21030,25290],[15,25290,26060],[16,26060,30165]]}},{"name":"41:7","price":"Àwọn tí kò yọ Zakāh, àwọn sì ni aláìgbàgbọ́ nínú Ọjọ́ Ìkẹ́yìn.¹","arabic":"ٱلَّذِينَ لَا يُؤۡتُونَ ٱلزَّكَوٰةَ وَهُم بِٱلۡأٓخِرَةِ هُمۡ كَٰفِرُونَ","category":["41 (Fussilat)","Fussilat","Surah Fussilat"],"ayahNumber":4225,"juzNumber":24,"footnotes":"1. Bí āyah yìí bá sọpọ̀ mọ́ āyah tí ó ṣíwájú rẹ̀, “zakāh” máa dúró fún àfọ̀mọ́ ọkàn àti àfọ̀mọ́ ara. Àmọ́ tí āyah yìí bá dádúró, “zakāh” máa túmọ̀ sí àfọ̀mọ́ dúkìá.","lang":"yo","meta":{"transliteration":"alladhīna lā yu'tūna al-zakata wahum bil-ākhirati hum kāfirūna ","translations":["Those who","(do) not","give","the zakah","and they","in the Hereafter","they","(are) disbelievers","(7)"],"transliterationArr":["alladhīna","lā","yu'tūna","al-zakata","wahum","bil-ākhirati","hum","kāfirūna",null],"verseTiming":[[1,0,1080],[2,1080,1500],[3,1500,2390],[4,2390,3480],[5,3480,4450],[6,4450,5970],[7,5970,6360],[8,6360,9275]]}},{"name":"41:8","price":"Dájúdájú àwọn tó gbàgbọ́ ní òdodo, tí wọ́n sì ṣe àwọn iṣẹ́ rere, ẹ̀san tí kò níí pẹ̀dín tí kò níí dáwọ́ dúró ń bẹ fún wọn.","arabic":"إِنَّ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ لَهُمۡ أَجۡرٌ غَيۡرُ مَمۡنُونٖ","category":["41 (Fussilat)","Fussilat","Surah Fussilat"],"ayahNumber":4226,"juzNumber":24,"footnotes":"","lang":"yo","meta":{"transliteration":"inna alladhīna āmanū waʿamilū al-ṣāliḥāti lahum ajrun ghayru mamnūnin ","translations":["Indeed","those who","believe","and do","righteous deeds","for them","(is) a reward","never ending","never ending","(8)"],"transliterationArr":["inna","alladhīna","āmanū","waʿamilū","al-ṣāliḥāti","lahum","ajrun","ghayru","mamnūnin",null],"verseTiming":[[1,0,1130],[2,1130,2060],[3,2060,3160],[4,3160,3810],[5,3810,5220],[6,5220,5760],[7,5760,6430],[8,6430,7030],[9,7030,9685]]}},{"name":"41:9","price":"Sọ pé: “Ṣé dájúdájú ẹ̀yin máa ṣàì gbàgbọ́ nínú Ẹni tí Ó ṣẹ̀dá ilẹ̀ fún ọjọ́ méjì, ẹ sì ń sọ (ẹ̀dá Rẹ̀) di akẹgbẹ́ Rẹ̀ (tí ẹ̀ ń bọ wọ́n)?” Ìyẹn (Ẹlẹ́dàá ilẹ̀) sì ni Olúwa gbogbo ẹ̀dá.","arabic":"۞ قُلۡ أَئِنَّكُمۡ لَتَكۡفُرُونَ بِٱلَّذِي خَلَقَ ٱلۡأَرۡضَ فِي يَوۡمَيۡنِ وَتَجۡعَلُونَ لَهُۥٓ أَندَادٗاۚ ذَٰلِكَ رَبُّ ٱلۡعَٰلَمِينَ","category":["41 (Fussilat)","Fussilat","Surah Fussilat"],"ayahNumber":4227,"juzNumber":24,"footnotes":"","lang":"yo","meta":{"transliteration":"qul a-innakum latakfurūna bi-alladhī khalaqa al-arḍa fī yawmayni watajʿalūna lahu andādan dhālika rabbu al-ʿālamīna ","translations":["Say","Do you indeed","[surely] disbelieve","in the One Who","created","the earth","in","two periods","and you set up","with Him","rivals","That","(is the) Lord","(of) the worlds","(9)"],"transliterationArr":["qul","a-innakum","latakfurūna","bi-alladhī","khalaqa","al-arḍa","fī","yawmayni","watajʿalūna","lahu","andādan","dhālika","rabbu","al-ʿālamīna",null],"verseTiming":[[1,0,350],[2,350,2030],[3,2030,3460],[4,3460,4330],[5,4330,4930],[6,4930,5730],[7,5730,6140],[8,6140,7020],[9,7020,8370],[10,8370,10160],[11,10160,12479],[12,12479,13769],[13,13769,14369],[14,14369,17924]]}},{"name":"41:10","price":"Ó sì fi àwọn àpáta sínú ilẹ̀ láti òkè rẹ̀. Ó fi ìbùkún sínú rẹ̀. Ó sì pèbùbù àwọn arísìkí (àti ohun àmúsọrọ̀) sínú rẹ̀ láààrin ọjọ́ mẹ́rin.¹ (Àwọn ọjọ́ náà) dọ́gba (síra wọn) fún àwọn olùbèèrè (nípa rẹ̀).","arabic":"وَجَعَلَ فِيهَا رَوَٰسِيَ مِن فَوۡقِهَا وَبَٰرَكَ فِيهَا وَقَدَّرَ فِيهَآ أَقۡوَٰتَهَا فِيٓ أَرۡبَعَةِ أَيَّامٖ سَوَآءٗ لِّلسَّآئِلِينَ","category":["41 (Fussilat)","Fussilat","Surah Fussilat"],"ayahNumber":4228,"juzNumber":24,"footnotes":"1. Àwọn nasọ̄rọ̄ lérò pé āyah yìí tako àwọn āyah tó ń fi ọjọ́ mẹ́fà rinlẹ̀ fún ìṣẹ̀dá ayé àti ọ̀run àti ohunkóhun tó wà láààrin méjèèjì. Wọ́n ni āyah yìí pè é ní ọjọ́ mẹ́jọ, àwọn āyah yòókù pè é ní ọjọ́ mẹ́fà. Àwọn “nasọ̄rọ̄ tún sọ pé, yálà ọjọ́ mẹ́fà tàbí ọjọ́ mẹ́jọ, ìkíní kejì tún tako àwọn āyah kunfayakūn tó wà nínú al-Ƙur’ān. Wọ́n ní, “Kò wulẹ̀ yẹ kí Allāhu lo ọjọ́ mẹ́fà tàbí ọjọ́ mẹ́jọ kan kan mọ́ níwọ̀n ìgbà tí ó ti jẹ́ pé Ó ti sọ nínú al-Ƙur’ān pé nígbà tí Òun bá gbèrò láti ṣẹ̀dá n̄ǹkan, gbólóhùn “Jẹ́ bẹ́ẹ̀-ó-sì-máa-jẹ́-bẹ́ẹ̀” ni Òun máa ń sọ.” \n Èsì: Ìtakora tófẹ́jọbẹ́ẹ̀ ni èyí. Kì í ṣe ìtakora tóríbẹ́ẹ̀. Àlàyé ọ̀rọ̀ nìyí. Ní ti òǹkà ọjọ́ fún ìṣẹ̀dá sánmọ̀ àti ilẹ̀, àyè mẹ́jọ ni Allāhu Ẹlẹ́dàá ti sọ̀rọ̀ nípa wọn. Ní àyè mẹ́rin nínú wọn, ó jẹyọ nínú wọn pé, “Allāhu ṣẹ̀dá àwọn sánmọ̀ àti ilẹ̀ fún ọjọ́ mẹ́fà.” Ó wà bẹ́ẹ̀ nínú sūrah al-’A‘rọ̄f; 7:54, sūrah Yūnus; 10:3, sūrah Hūd; 11:7 àti sūrah al-Hadīd; 57:4. Ní àyè mẹ́ta nínú wọn, ó jẹyọ nínú wọn pé, “Allāhu ṣẹ̀dá àwọn sánmọ̀, ilẹ̀ àti ohunkóhun tó wà láààrin méjèèjì fún ọjọ́ mẹ́fà.” Ó wà bẹ́ẹ̀ nínú sūrah al-Furƙọ̄n; 25:59, sūrah as-Sajdah; 32:4 àti sūrah Ƙọ̄f; 50:38. Kíyè sí awẹ́ gbólóhùn “àti ohunkóhun tó wà láààrin méjèèjì”. Ìyẹn ti fi hàn pé, ọjọ́ méjì ni Allāhu lò fún ìṣẹ̀dá sánmọ̀ méje, ọjọ́ méjì fún ìṣẹ̀dá ilẹ̀ méje, ọjọ́ méjì fún ìṣẹ̀da ohunkóhun tó wà láààrin méjèèjì. Ohunkóhun tó wà láààrin méjèèjì sì ń túmọ̀ sí gbogbo ohun tó wà lórí ilẹ̀. Èyí tí já sí pé, ilẹ̀ àti ohun tó wà lórí ilẹ̀ kó ọjọ́ mẹ́rin nínú ọjọ́ mẹ́fà.\n Ìtúpalẹ̀ ìṣírò yìí ni Allāhu fúnra Rẹ̀ fi rinlẹ̀ nínú āyah tí à ń ṣe ìtọsẹ̀-ọ̀rọ̀ fún yìí, sūrah Fussilat 41; 9-10. Ìdí nìyí tí àwọn onímọ̀ èdè Lárúbáwá àti àwọn onímọ̀ ẹ̀sìn ’Islām fi ṣàlàyé āyah 10 pé ọjọ́ mẹ́rin yẹn kó ọjọ́ méjì tí Allāhu dárúkọ nínú āyah 9 sínú. Wọ́n ní àpapọ̀ ọjọ́ ìṣẹ̀dá ilẹ̀ àti ohunkóhun tó wà lórí ilẹ̀ ni òǹkà ọjọ́ mẹ́rin náà dúró fún, kì í ṣe fún ohunkóhun tó wà lórí ilẹ̀ nìkan, gẹ́gẹ́ bí èrò ọkàn àwọn aláìnímọ̀ nípa ìlò èdè Lárúbáwá. Irúfẹ́ ìṣírò yìí l’ó tún jẹyọ nínú sūrah an-Nisā’; 4:3 àti Fātir; 35:1. Ní ti gbólóhùn “kunfayakūn” tí í ṣe “Jẹ́ bẹ́ẹ̀-ó-sì-máa-jẹ́-bẹ́ẹ̀”, kò rújú rárá pé, Allāhu ni Alágbára lórí gbogbo n̄ǹkan. Àmọ́ t’òhun ti bẹ́ẹ̀ náà, Allāhu kì í ṣe n̄ǹkan pẹ̀lú ìkánjú. Àti pé Allāhu kò níí ṣe ìṣe kan tí ó máa mú kí ìtakora ṣẹlẹ̀ láààrin àwọn orúkọ Rẹ̀ tó dára jùlọ àti àwọn ìròyìn Rẹ̀ tó ga jùlọ. Ẹ̀dá l’ó lè jẹ́ alágbára-mámèrò, kì í ṣe Allāhu. Ìwọ̀nyẹn ni àwọn ẹ̀kọ́ pàtàkì tí ó wà lábẹ́ lílo òǹkà ọjọ́ mẹ́fà fún ìṣẹ̀dá ayé àti ọ̀run. \n Ipò tí gbólóhùn “kunfayakūn” wà nínú ìṣẹ̀dá ni ipò ìparí ọ̀rọ̀ àti àṣẹ dídi bíbẹ láti ọ̀dọ̀ Allāhu Ẹlẹ́dàá. Ìyẹn ni pé, lẹ́yìn ìkójọ èròjà ìṣẹ̀dá, n̄ǹkan náà kò níí dòhun àfi pẹ̀lú gbólóhùn “kunfayakūn”. Àwọn ẹ̀dá tí kò bá sì jẹmọ́ èròjà ìṣẹ̀dá tàbí àwọn ẹ̀dá tí Allāhu kò sọ nípa èròjà ìṣẹ̀dá wọn fún wa, Allāhu l’Ó kúkú nímọ̀ nípa ìṣẹ̀dá àwọn ẹ̀dá Rẹ̀, ìkíní kejì kò níí di ẹ̀dá àfi pẹ̀lú gbólóhùn “kunfayakūn”. \n Pẹ̀lú àlàyé yìí, ó ń túmọ̀ sí pé, àwọn ẹ̀dá kan di ẹ̀dá pẹ̀lú gbólóhùn “kunfayakūn” nìkan. Àwọn ẹ̀dá kan sì di ẹ̀dá nípasẹ̀ èròjà ìṣẹ̀dá àti gbólóhùn “kunfayakūn”. Allāhu ń ṣẹ̀dá ohun tí Ó bá fẹ́ ní ọ̀nà tí Ó bá fẹ́. Nítorí náà, gbólóhùn “kunfayakūn” tó jẹ́ ti Allāhu nìkan ṣoṣo kò lè sọ Allāhu di olùkánjú. Ìkánjú kì í ṣe ìròyìn rere fún Allāhu. Bí Allāhu ṣe gbàròyìn pẹ̀lú gbólóhùn “kunfayakūn”, bẹ́ẹ̀ náà l’Ó ṣe gbàròyìn pẹ̀lú pẹ̀lẹ́pẹ̀lẹ́, èyí tí í ṣe ìdà kejì ìkánjú. Nítorí náà, Allāhu lágbára láti ṣẹ̀dá ayé àti ọ̀run láààrin ohun tí ó kéré jùlọ sí ìṣẹ́jú kan. Bí Ó bá ṣe bẹ́ẹ̀, kò kúkú sí ẹni tí Ó lè pè É lẹ́jọ́. Bí Allāhu bá sì lo ọjọ́ mẹ́fà fún ìṣẹ̀dá ayé àti ọ̀run, ìyẹn kò túmọ̀ sí pé àṣẹ “Jẹ́-bẹ́ẹ̀” kò jẹ́ tiRẹ̀. Òun l’Ó kúkú ni gbogbo ìjọba, gbogbo agbára àti gbogbo ògo.","lang":"yo","meta":{"transliteration":"wajaʿala fīhā rawāsiya min fawqihā wabāraka fīhā waqaddara fīhā aqwātahā fī arbaʿati ayyāmin sawāan lilssāilīna ","translations":["And He placed","therein","firmly-set mountains","above it","above it","and He blessed","therein","and determined","therein","its sustenance","in","four","periods","equal","for those who ask","(10)"],"transliterationArr":["wajaʿala","fīhā","rawāsiya","min","fawqihā","wabāraka","fīhā","waqaddara","fīhā","aqwātahā","fī","arbaʿati","ayyāmin","sawāan","lilssāilīna",null],"verseTiming":[[1,0,890],[2,890,1550],[3,1550,2530],[4,2530,3670],[5,3670,4680],[6,4680,5670],[7,5670,6460],[8,6460,7490],[9,7490,9770],[10,9770,11380],[11,11380,11440],[12,11440,12890],[13,12890,15280],[14,15280,16690],[15,16690,18740],[16,18740,19710],[17,19710,21530],[18,21530,23850],[19,23850,29615]]}},{"name":"41:11","price":"Lẹ́yìn náà, Allāhu wà ní òkè sánmọ̀, nígbà tí sánmọ̀ wà ní èéfín. Ó sì sọ fún òhun àti ilẹ̀ pé: “Ẹ wá bí ẹ fẹ́ tàbí ẹ kọ̀.” Àwọn méjèèjì sọ pé: “A wá pẹ̀lú ìfínnú-fíndọ̀.”¹","arabic":"ثُمَّ ٱسۡتَوَىٰٓ إِلَى ٱلسَّمَآءِ وَهِيَ دُخَانٞ فَقَالَ لَهَا وَلِلۡأَرۡضِ ٱئۡتِيَا طَوۡعًا أَوۡ كَرۡهٗا قَالَتَآ أَتَيۡنَا طَآئِعِينَ","category":["41 (Fussilat)","Fussilat","Surah Fussilat"],"ayahNumber":4229,"juzNumber":24,"footnotes":"1. Ẹ wo ìtọsẹ̀-ọ̀rọ̀ sūrah al-’Anbiyā’; 21:30.","lang":"yo","meta":{"transliteration":"thumma is'tawā ilā al-samāi wahiya dukhānun faqāla lahā walil'arḍi i'tiyā ṭawʿan aw karhan qālatā ataynā ṭāiʿīna ","translations":["Then","He directed (Himself)","towards","the heaven","while it (was)","smoke","and He said","to it","and to the earth","Come both of you","willingly","or","unwillingly","They both said","We come","willingly","(11)"],"transliterationArr":["thumma","is'tawā","ilā","al-samāi","wahiya","dukhānun","faqāla","lahā","walil'arḍi","i'tiyā","ṭawʿan","aw","karhan","qālatā","ataynā","ṭāiʿīna",null],"verseTiming":[[1,0,1420],[2,1420,3970],[3,3970,4300],[4,4300,7170],[5,7170,7660],[6,7660,9200],[7,9200,10120],[8,10120,10680],[9,10680,11970],[10,11970,12580],[11,12580,13460],[12,13460,13840],[13,13840,15600],[14,15600,16480],[15,16480,17010],[16,17010,18270],[17,18270,18890],[18,18890,19820],[19,19820,20140],[20,20140,21640],[21,21640,24380],[22,24380,25400],[23,25400,30385]]}},{"name":"41:12","price":"Ó sì parí (ìṣẹ̀dá) rẹ̀ sí sánmọ̀ méje fún ọjọ́ méjì. Ó sì fi iṣẹ́ sánmọ̀ kọ̀ọ̀kan ránṣẹ́ sínú rẹ̀. A sì fi àwọn àtùpà (ìràwọ̀) ṣe sánmọ̀ ilé ayé ní ọ̀ṣọ́ àti ààbò (fún un). Ìyẹn ni ètò Alágbára, Onímọ̀.","arabic":"فَقَضَىٰهُنَّ سَبۡعَ سَمَٰوَاتٖ فِي يَوۡمَيۡنِ وَأَوۡحَىٰ فِي كُلِّ سَمَآءٍ أَمۡرَهَاۚ وَزَيَّنَّا ٱلسَّمَآءَ ٱلدُّنۡيَا بِمَصَٰبِيحَ وَحِفۡظٗاۚ ذَٰلِكَ تَقۡدِيرُ ٱلۡعَزِيزِ ٱلۡعَلِيمِ","category":["41 (Fussilat)","Fussilat","Surah Fussilat"],"ayahNumber":4230,"juzNumber":24,"footnotes":"","lang":"yo","meta":{"transliteration":"faqaḍāhunna sabʿa samāwātin fī yawmayni wa-awḥā fī kulli samāin amrahā wazayyannā al-samāa al-dun'yā bimaṣābīḥa waḥif'ẓan dhālika taqdīru al-ʿazīzi al-ʿalīmi ","translations":["Then He completed them","(as) seven","heavens","in","two periods","and He revealed","in","each","heaven","its affair","And We adorned","the heaven","[the world]","with lamps","and (to) guard","That","(is the) Decree","(of) the All-Mighty","the All-Knower","(12)"],"transliterationArr":["faqaḍāhunna","sabʿa","samāwātin","fī","yawmayni","wa-awḥā","fī","kulli","samāin","amrahā","wazayyannā","al-samāa","al-dun'yā","bimaṣābīḥa","waḥif'ẓan","dhālika","taqdīru","al-ʿazīzi","al-ʿalīmi",null],"verseTiming":[[1,0,2060],[2,2060,2660],[3,2660,4790],[4,4790,5270],[5,5270,6240],[6,6240,7280],[7,7280,7700],[8,7700,8280],[9,8280,10710],[10,10710,11840],[11,11840,14290],[12,14290,16839],[13,16839,17869],[14,17869,19359],[15,19359,20909],[16,20909,21689],[17,21689,22679],[18,22679,23799],[19,23799,26814]]}},{"name":"41:13","price":"Tí wọ́n bá gbúnrí, sọ pé: “Èmi ń ṣèkìlọ̀ iná láti ojú sánmọ̀ irú iná láti ojú sánmọ̀ tó gbá ìjọ ‘Ād àti Thamūd mú fún yín ni.”","arabic":"فَإِنۡ أَعۡرَضُواْ فَقُلۡ أَنذَرۡتُكُمۡ صَٰعِقَةٗ مِّثۡلَ صَٰعِقَةِ عَادٖ وَثَمُودَ","category":["41 (Fussilat)","Fussilat","Surah Fussilat"],"ayahNumber":4231,"juzNumber":24,"footnotes":"","lang":"yo","meta":{"transliteration":"fa-in aʿraḍū faqul andhartukum ṣāʿiqatan mith'la ṣāʿiqati ʿādin wathamūda ","translations":["But if","they turn away","then say","I have warned you","(of) a thunderbolt","like","(the) thunderbolt","(of) Aad","and Thamud","(13)"],"transliterationArr":["fa-in","aʿraḍū","faqul","andhartukum","ṣāʿiqatan","mith'la","ṣāʿiqati","ʿādin","wathamūda",null],"verseTiming":[[1,0,630],[2,630,1570],[3,1570,2220],[4,2220,4420],[5,4420,5610],[6,5610,6880],[7,6880,7960],[8,7960,9620],[9,9620,13075]]}},{"name":"41:14","price":"Nígbà tí àwọn Òjíṣẹ́ wọn wá bá wọn níwájú wọn àti lẹ́yìn wọn,¹ (wọ́n sọ) pé: “Ẹ̀yin kò gbọdọ̀ jọ́sìn fún ẹnì kan àyàfi Allāhu.” Wọ́n wí pé: “Tí ó bá jẹ́ pé Olúwa wa bá fẹ́ ni, ìbá sọ àwọn mọlāika kalẹ̀ (fún ìpèpè yìí). Dájúdájú àwa jẹ́ aláìgbàgbọ́ nínú ohun tí wọ́n fi ran yín níṣẹ́.”","arabic":"إِذۡ جَآءَتۡهُمُ ٱلرُّسُلُ مِنۢ بَيۡنِ أَيۡدِيهِمۡ وَمِنۡ خَلۡفِهِمۡ أَلَّا تَعۡبُدُوٓاْ إِلَّا ٱللَّهَۖ قَالُواْ لَوۡ شَآءَ رَبُّنَا لَأَنزَلَ مَلَٰٓئِكَةٗ فَإِنَّا بِمَآ أُرۡسِلۡتُم بِهِۦ كَٰفِرُونَ","category":["41 (Fussilat)","Fussilat","Surah Fussilat"],"ayahNumber":4232,"juzNumber":24,"footnotes":"1. “níwájú wọn” túmọ̀ sí pé àwọn Òjíṣẹ́ Allāhu - kí ọlà Allāhu máa bá wọn - wá bá àwọn bàbá ńlá wọn, “lẹ́yìn wọn” sì túmọ̀ sí pé àwọn Òjíṣẹ́ Allāhu tún wá bá àwọn àrọ́mọdọ́mọ wọn lẹ́yìn ìparun àwọn bàbá ńlá wọn.","lang":"yo","meta":{"transliteration":"idh jāathumu al-rusulu min bayni aydīhim wamin khalfihim allā taʿbudū illā al-laha qālū law shāa rabbunā la-anzala malāikatan fa-innā bimā ur'sil'tum bihi kāfirūna ","translations":["When","came to them","the Messengers","from before them","from before them","from before them","and from","behind them","(saying) \"Do not","worship","except","Allah","They said","If","(had) willed","our Lord","surely, He (would have) sent down","Angels","So indeed, we","in what","you have been sent","with","(are) disbelievers","(14)"],"transliterationArr":["idh","jāathumu","al-rusulu","min","bayni","aydīhim","wamin","khalfihim","allā","taʿbudū","illā","al-laha","qālū","law","shāa","rabbunā","la-anzala","malāikatan","fa-innā","bimā","ur'sil'tum","bihi","kāfirūna",null],"verseTiming":[[1,0,330],[2,330,3360],[3,3360,4230],[4,4230,4970],[5,4970,6140],[6,6140,7330],[7,7330,7820],[8,7820,8980],[9,8980,9740],[10,9740,12220],[11,12220,12800],[12,12800,16300],[13,16300,17060],[14,17060,17430],[15,17430,19660],[16,19660,20690],[17,20690,22530],[18,22530,25580],[19,25580,27430],[20,27430,29340],[21,29340,31440],[22,31440,32000],[23,32000,34685]]}},{"name":"41:15","price":"Ní ti ìjọ ‘Ād, wọ́n ṣègbéraga ní orí ilẹ̀ láì lẹ́tọ̀ọ́. Wọ́n sì wí pé: “Ta ni ó lágbára jù wá lọ ná?” Ṣé wọn kò rí i pé dájúdájú Allāhu tí Ó ṣẹ̀dá wọn, Ó ní agbára jù wọ́n lọ ni? Wọ́n sì ń tako àwọn āyah Wa!","arabic":"فَأَمَّا عَادٞ فَٱسۡتَكۡبَرُواْ فِي ٱلۡأَرۡضِ بِغَيۡرِ ٱلۡحَقِّ وَقَالُواْ مَنۡ أَشَدُّ مِنَّا قُوَّةًۖ أَوَلَمۡ يَرَوۡاْ أَنَّ ٱللَّهَ ٱلَّذِي خَلَقَهُمۡ هُوَ أَشَدُّ مِنۡهُمۡ قُوَّةٗۖ وَكَانُواْ بِـَٔايَٰتِنَا يَجۡحَدُونَ","category":["41 (Fussilat)","Fussilat","Surah Fussilat"],"ayahNumber":4233,"juzNumber":24,"footnotes":"","lang":"yo","meta":{"transliteration":"fa-ammā ʿādun fa-is'takbarū fī al-arḍi bighayri al-ḥaqi waqālū man ashaddu minnā quwwatan awalam yaraw anna al-laha alladhī khalaqahum huwa ashaddu min'hum quwwatan wakānū biāyātinā yajḥadūna ","translations":["Then as for","Aad","they were arrogant","in","the land","without","[the] right","and they said","Who","(is) mightier","than us","(in) strength","Do not","they see","that","Allah","the One Who","created them","He","(is) Mightier","than them","(in) strength","But they used to","in Our Signs","deny","(15)"],"transliterationArr":["fa-ammā","ʿādun","fa-is'takbarū","fī","al-arḍi","bighayri","al-ḥaqi","waqālū","man","ashaddu","minnā","quwwatan","awalam","yaraw","anna","al-laha","alladhī","khalaqahum","huwa","ashaddu","min'hum","quwwatan","wakānū","biāyātinā","yajḥadūna",null],"verseTiming":[[1,0,1830],[2,1830,3150],[3,3150,4590],[4,4590,4820],[5,4820,5670],[6,5670,6450],[7,6450,7220],[8,7220,8310],[9,8310,8650],[10,8650,9480],[11,9480,11130],[12,11130,12700],[13,12700,13470],[14,13470,14110],[15,14110,15340],[16,15340,16240],[17,16240,17020],[18,17020,18110],[19,18110,18450],[20,18450,19350],[21,19350,20220],[22,20220,21490],[23,21490,22510],[24,22510,24180],[25,24180,27375]]}},{"name":"41:16","price":"Nítorí náà, A rán atẹ́gùn líle sí wọn ní àwọn ọjọ́ burúkú kan nítorí kí Á lè jẹ́ kí wọ́n tọ́ ìyà yẹpẹrẹ wò nínú ìṣẹ̀mí ayé yìí. Ìyà ọjọ́ Ìkẹ́yìn sì máa yẹpẹrẹ wọn jùlọ; Wọn kò sì níí ràn wọ́n lọ́wọ́.¹","arabic":"فَأَرۡسَلۡنَا عَلَيۡهِمۡ رِيحٗا صَرۡصَرٗا فِيٓ أَيَّامٖ نَّحِسَاتٖ لِّنُذِيقَهُمۡ عَذَابَ ٱلۡخِزۡيِ فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَاۖ وَلَعَذَابُ ٱلۡأٓخِرَةِ أَخۡزَىٰۖ وَهُمۡ لَا يُنصَرُونَ","category":["41 (Fussilat)","Fussilat","Surah Fussilat"],"ayahNumber":4234,"juzNumber":24,"footnotes":"1. Àwọn “nasọ̄rọ̄ sọ pé, “Nínú sūrah al-Ƙọmọr; 54:19, Allāhu dárúkọ ọjọ́ kan fún ìparun ìjọ ‘Ād. Àmọ́ nínú sūrah al-Hāƙƙọh; 69:7, Allāhu dárúkọ òru méje àti ọ̀sán mẹ́jọ fún ìparun wọn. Nínú sūrah Fussilat; 41:16, Allāhu dárúkọ àwọn ọjọ́? Wọ́n ní, “Nítorí náà, ìtakora ti jẹyọ lórí òǹkà ọjọ́ ti Allāhu fi pa ìjọ ‘Ād run! \n Èsì: Kò sí ìtakora láààrin àwọn āyah náà. Àlàyé rẹ̀ nìyí, āyah ti sūrah al-Ƙọmọr tó pè é ní ọjọ́ kan sọ pé “ọjọ́ burúkú kan tó ń tẹ̀ síwájú.” Nípasẹ̀ bẹ́ẹ̀, “ọjọ́ kan” di “àwọn ọjọ́ kan” nínú āyah ti sūrah Fussilat. Àmọ́ àpapọ̀ òǹkà ọjọ́ ìparun wọn l’ó jẹyọ nínú āyah ti sūrah al-Hāƙƙọh. Ṣé ẹ ti rí i báyìí pé, àìnímọ̀ nípa èto láààrin àwọn āyah lè ṣokùnfà ìtakora āyah lójú àwọn aláìmọ̀kan.","lang":"yo","meta":{"transliteration":"fa-arsalnā ʿalayhim rīḥan ṣarṣaran fī ayyāmin naḥisātin linudhīqahum ʿadhāba al-khiz'yi fī al-ḥayati al-dun'yā walaʿadhābu al-ākhirati akhzā wahum lā yunṣarūna ","translations":["So We sent","upon them","a wind","furious","in","(the) days","(of) misfortune","that We may make them taste","(the) punishment","(of) disgrace","in","the life","(of) the world","And surely, (the) punishment","(of) the Hereafter","(is) more disgracing","and they","will not be helped","will not be helped","(16)"],"transliterationArr":["fa-arsalnā","ʿalayhim","rīḥan","ṣarṣaran","fī","ayyāmin","naḥisātin","linudhīqahum","ʿadhāba","al-khiz'yi","fī","al-ḥayati","al-dun'yā","walaʿadhābu","al-ākhirati","akhzā","wahum","lā","yunṣarūna",null],"verseTiming":[[1,0,1470],[2,1470,2490],[3,2490,3980],[4,3980,5570],[5,5570,7680],[6,7680,8800],[7,8800,10700],[8,10700,12960],[9,12960,14350],[10,14350,15230],[11,15230,16100],[12,16100,16310],[13,16310,17360],[14,17360,18360],[15,18360,20020],[16,20020,21320],[17,21320,22230],[18,22230,23360],[19,23360,23730],[20,23730,27425]]}},{"name":"41:17","price":"Ní ti ìjọ Thamūd, A ṣàlàyé ìmọ̀nà fún wọn,¹ ṣùgbọ́n wọ́n nífẹ̀ẹ́ sí àìríran dípò ìmọ̀nà. Nítorí náà, ìyà iná láti ojú sánmọ̀ tó ń yẹpẹrẹ ẹ̀dá gbá wọn mú nítorí ohun tí wọ́n ń ṣe níṣẹ́.","arabic":"وَأَمَّا ثَمُودُ فَهَدَيۡنَٰهُمۡ فَٱسۡتَحَبُّواْ ٱلۡعَمَىٰ عَلَى ٱلۡهُدَىٰ فَأَخَذَتۡهُمۡ صَٰعِقَةُ ٱلۡعَذَابِ ٱلۡهُونِ بِمَا كَانُواْ يَكۡسِبُونَ","category":["41 (Fussilat)","Fussilat","Surah Fussilat"],"ayahNumber":4235,"juzNumber":24,"footnotes":"1. Ìyẹn nípasẹ̀ pé Allāhu - Ọba tó ga jùlọ - rán àwọn Òjíṣẹ́ Rẹ̀ sí wọn.","lang":"yo","meta":{"transliteration":"wa-ammā thamūdu fahadaynāhum fa-is'taḥabbū al-ʿamā ʿalā al-hudā fa-akhadhathum ṣāʿiqatu al-ʿadhābi al-hūni bimā kānū yaksibūna ","translations":["And as for","Thamud","We guided them","but they preferred","[the] blindness","over","the guidance","so seized them","a thunderbolt","(of) the punishment","humiliating","for what","they used to","earn","(17)"],"transliterationArr":["wa-ammā","thamūdu","fahadaynāhum","fa-is'taḥabbū","al-ʿamā","ʿalā","al-hudā","fa-akhadhathum","ṣāʿiqatu","al-ʿadhābi","al-hūni","bimā","kānū","yaksibūna",null],"verseTiming":[[1,0,1840],[2,1840,2730],[3,2730,4360],[4,4360,5610],[5,5610,6440],[6,6440,6890],[7,6890,7700],[8,7700,9060],[9,9060,10170],[10,10170,11210],[11,11210,14550],[12,14550,15890],[13,15890,17000],[14,17000,18010],[15,18010,18860],[16,18860,19380],[17,19380,20260],[18,20260,23805]]}},{"name":"41:18","price":"A sì gba àwọn tó gbàgbọ́ ní òdodo, tí wọ́n sì ń bẹ̀rù (Allāhu) là.","arabic":"وَنَجَّيۡنَا ٱلَّذِينَ ءَامَنُواْ وَكَانُواْ يَتَّقُونَ","category":["41 (Fussilat)","Fussilat","Surah Fussilat"],"ayahNumber":4236,"juzNumber":24,"footnotes":"","lang":"yo","meta":{"transliteration":"wanajjaynā alladhīna āmanū wakānū yattaqūna ","translations":["And We saved","those who","believed","and used to","fear (Allah)","(18)"],"transliterationArr":["wanajjaynā","alladhīna","āmanū","wakānū","yattaqūna",null],"verseTiming":[[1,0,1190],[2,1190,2170],[3,2170,3380],[4,3380,4390],[5,4390,7785]]}},{"name":"41:19","price":"Ní ọjọ́ tí wọ́n máa kó àwọn ọ̀tá Allāhu jọ síbi Iná, wọn yó sì kó àwọn ẹni àkọ́kọ́ wọn papọ̀ mọ́ àwọn ẹni ìkẹ́yìn wọn","arabic":"وَيَوۡمَ يُحۡشَرُ أَعۡدَآءُ ٱللَّهِ إِلَى ٱلنَّارِ فَهُمۡ يُوزَعُونَ","category":["41 (Fussilat)","Fussilat","Surah Fussilat"],"ayahNumber":4237,"juzNumber":24,"footnotes":"","lang":"yo","meta":{"transliteration":"wayawma yuḥ'sharu aʿdāu al-lahi ilā al-nāri fahum yūzaʿūna ","translations":["And (the) Day","will be gathered","(the) enemies","(of) Allah","to","the Fire","then they","will be assembled in rows","(19)"],"transliterationArr":["wayawma","yuḥ'sharu","aʿdāu","al-lahi","ilā","al-nāri","fahum","yūzaʿūna",null],"verseTiming":[[1,0,890],[2,890,1650],[3,1650,4190],[4,4190,5080],[5,5080,5410],[6,5410,6940],[7,6940,7600],[8,7600,10925]]}},{"name":"41:20","price":"títí di ìgbà tí wọ́n bá dé ibẹ̀ tán, ìgbọ́rọ̀ wọn, ìríran wọn àti awọ ara wọn yó sì máa jẹ́rìí lé wọn lórí nípa ohun tí wọ́n ń ṣe níṣẹ́.","arabic":"حَتَّىٰٓ إِذَا مَا جَآءُوهَا شَهِدَ عَلَيۡهِمۡ سَمۡعُهُمۡ وَأَبۡصَٰرُهُمۡ وَجُلُودُهُم بِمَا كَانُواْ يَعۡمَلُونَ","category":["41 (Fussilat)","Fussilat","Surah Fussilat"],"ayahNumber":4238,"juzNumber":24,"footnotes":"","lang":"yo","meta":{"transliteration":"ḥattā idhā mā jāūhā shahida ʿalayhim samʿuhum wa-abṣāruhum wajulūduhum bimā kānū yaʿmalūna ","translations":["Until","when","when","they come to it","(will) testify","against them","their hearing","and their sight","and their skins","(as) to what","they used to","do","(20)"],"transliterationArr":["ḥattā","idhā","mā","jāūhā","shahida","ʿalayhim","samʿuhum","wa-abṣāruhum","wajulūduhum","bimā","kānū","yaʿmalūna",null],"verseTiming":[[1,0,2689],[2,2689,3349],[3,3349,3729],[4,3729,6699],[5,6699,7319],[6,7319,8369],[7,8369,9529],[8,9529,11149],[9,11149,13209],[10,13209,13689],[11,13689,14609],[12,14609,18004]]}},{"name":"41:21","price":"Wọn yóò wí fún awọ ara wọn pé: “Nítorí kí ni ẹ ṣe jẹ́rìí lé wa lórí ná?” Wọ́n yóò sọ pé: “Allāhu, Ẹni tí Ó fún gbogbo n̄ǹkan ní ọ̀rọ̀ sọ, Òun l’Ó fún wa ní ọ̀rọ̀ sọ. Òun sì l’Ó ṣẹ̀dá yín nígbà àkọ́kọ́. Ọ̀dọ̀ Rẹ̀ sì ni wọn yóò da yín padà sí.”","arabic":"وَقَالُواْ لِجُلُودِهِمۡ لِمَ شَهِدتُّمۡ عَلَيۡنَاۖ قَالُوٓاْ أَنطَقَنَا ٱللَّهُ ٱلَّذِيٓ أَنطَقَ كُلَّ شَيۡءٖۚ وَهُوَ خَلَقَكُمۡ أَوَّلَ مَرَّةٖ وَإِلَيۡهِ تُرۡجَعُونَ","category":["41 (Fussilat)","Fussilat","Surah Fussilat"],"ayahNumber":4239,"juzNumber":24,"footnotes":"","lang":"yo","meta":{"transliteration":"waqālū lijulūdihim lima shahidttum ʿalaynā qālū anṭaqanā al-lahu alladhī anṭaqa kulla shayin wahuwa khalaqakum awwala marratin wa-ilayhi tur'jaʿūna ","translations":["And they will say","to their skins","Why do","you testify","against us","They will say","Allah made us speak","Allah made us speak","the One Who","makes speak","every","thing","and He","created you","(the) first","time","and to Him","you will be returned","(21)"],"transliterationArr":["waqālū","lijulūdihim","lima","shahidttum","ʿalaynā","qālū","anṭaqanā","al-lahu","alladhī","anṭaqa","kulla","shayin","wahuwa","khalaqakum","awwala","marratin","wa-ilayhi","tur'jaʿūna",null],"verseTiming":[[1,0,1130],[2,1130,2650],[3,2650,2990],[4,2990,4120],[5,4120,5450],[6,5450,8290],[7,8290,10050],[8,10050,10970],[9,10970,13330],[10,13330,14860],[11,14860,15440],[12,15440,16190],[13,16190,17410],[14,17410,18560],[15,18560,19480],[16,19480,21200],[17,21200,22260],[18,22260,25235]]}},{"name":"41:22","price":"Ẹ̀yin kò lè para yín mọ́ (kúrò níbi ẹ̀ṣẹ̀, nítorí) kí ìgbọ́rọ̀ yín, ìríran yín àti awọ ara yín má fi lè jẹ́rìí le yín lórí. Ṣùgbọ́n ẹ lérò pé dájúdájú Allāhu kò mọ ọ̀pọ̀lọ́pọ̀ nínú ohun tí ẹ̀ ń ṣe níṣẹ́.","arabic":"وَمَا كُنتُمۡ تَسۡتَتِرُونَ أَن يَشۡهَدَ عَلَيۡكُمۡ سَمۡعُكُمۡ وَلَآ أَبۡصَٰرُكُمۡ وَلَا جُلُودُكُمۡ وَلَٰكِن ظَنَنتُمۡ أَنَّ ٱللَّهَ لَا يَعۡلَمُ كَثِيرٗا مِّمَّا تَعۡمَلُونَ","category":["41 (Fussilat)","Fussilat","Surah Fussilat"],"ayahNumber":4240,"juzNumber":24,"footnotes":"","lang":"yo","meta":{"transliteration":"wamā kuntum tastatirūna an yashhada ʿalaykum samʿukum walā abṣārukum walā julūdukum walākin ẓanantum anna al-laha lā yaʿlamu kathīran mimmā taʿmalūna ","translations":["And not","you were","covering yourselves","lest","testify","against you","your hearing","and not","your sight","and not","your skins","but","you assumed","that","Allah","(does) not","know","much","of what","you do","(22)"],"transliterationArr":["wamā","kuntum","tastatirūna","an","yashhada","ʿalaykum","samʿukum","walā","abṣārukum","walā","julūdukum","walākin","ẓanantum","anna","al-laha","lā","yaʿlamu","kathīran","mimmā","taʿmalūna",null],"verseTiming":[[1,0,690],[2,690,2400],[3,2400,3790],[4,3790,4120],[5,4120,5720],[6,5720,6770],[7,6770,7940],[8,7940,10150],[9,10150,11710],[10,11710,12320],[11,12320,13620],[12,13620,15660],[13,15660,17490],[14,17490,18690],[15,18690,19710],[16,19710,20080],[17,20080,20920],[18,20920,21920],[19,21920,24390],[20,24390,27725]]}},{"name":"41:23","price":"Ìyẹn, èrò ọkàn yín tí ẹ lérò sí Olúwa yín ló kó ìparun ba yín. Ẹ sì di ẹni òfò.","arabic":"وَذَٰلِكُمۡ ظَنُّكُمُ ٱلَّذِي ظَنَنتُم بِرَبِّكُمۡ أَرۡدَىٰكُمۡ فَأَصۡبَحۡتُم مِّنَ ٱلۡخَٰسِرِينَ","category":["41 (Fussilat)","Fussilat","Surah Fussilat"],"ayahNumber":4241,"juzNumber":24,"footnotes":"","lang":"yo","meta":{"transliteration":"wadhālikum ẓannukumu alladhī ẓanantum birabbikum ardākum fa-aṣbaḥtum mina al-khāsirīna ","translations":["And that","(was) your assumption","which","you assumed","about your Lord","It has ruined you","and you have become","of","the losers","(23)"],"transliterationArr":["wadhālikum","ẓannukumu","alladhī","ẓanantum","birabbikum","ardākum","fa-aṣbaḥtum","mina","al-khāsirīna",null],"verseTiming":[[1,0,1450],[2,1450,3180],[3,3180,4040],[4,4040,6289],[5,6289,7929],[6,7929,9189],[7,9189,10839],[8,10839,11829],[9,11829,15754]]}},{"name":"41:24","price":"Tí wọ́n bá ṣe sùúrù (fún ìyà), Iná kúkú ni ibùgbé fún wọn. Tí wọ́n bá sì jẹ́wọ́ ẹ̀ṣẹ̀ wọn láti fi wá ìyọ́nú Allāhu (ní àsìkò yìí), wọn kò sí níí wà nínú àwọn tí wọ́n máa rí ìyọ́nú Allāhu gbà.","arabic":"فَإِن يَصۡبِرُواْ فَٱلنَّارُ مَثۡوٗى لَّهُمۡۖ وَإِن يَسۡتَعۡتِبُواْ فَمَا هُم مِّنَ ٱلۡمُعۡتَبِينَ","category":["41 (Fussilat)","Fussilat","Surah Fussilat"],"ayahNumber":4242,"juzNumber":24,"footnotes":"","lang":"yo","meta":{"transliteration":"fa-in yaṣbirū fal-nāru mathwan lahum wa-in yastaʿtibū famā hum mina al-muʿ'tabīna ","translations":["Then if","they endure","the Fire","(is) an abode","for them","and if","they ask for favor","then not","they","(will be) of","those who receive favor","(24)"],"transliterationArr":["fa-in","yaṣbirū","fal-nāru","mathwan","lahum","wa-in","yastaʿtibū","famā","hum","mina","al-muʿ'tabīna",null],"verseTiming":[[1,0,760],[2,760,2340],[3,2340,4280],[4,4280,5110],[5,5110,6300],[6,6300,6710],[7,6710,8960],[8,8960,9630],[9,9630,10390],[10,10390,11310],[11,11310,15335]]}},{"name":"41:25","price":"Àwa ti yan àwọn alábàárìn kan fún wọn,¹ tí wọ́n ṣe ohun tí ń bẹ níwájú wọn² àti ohun tí ń bẹ ní ẹ̀yìn wọn³ ní ọ̀ṣọ́ fún wọn. Ọ̀rọ̀ náà sì kò lé wọn lórí (gẹ́gẹ́ bí ó ṣe ṣẹlẹ̀) sí àwọn ìjọ tó ṣíwájú wọn nínú àwọn àlùjànǹú àti ènìyàn pé dájúdájú àwọn ni wọ́n jẹ́ ẹni òfò.","arabic":"۞ وَقَيَّضۡنَا لَهُمۡ قُرَنَآءَ فَزَيَّنُواْ لَهُم مَّا بَيۡنَ أَيۡدِيهِمۡ وَمَا خَلۡفَهُمۡ وَحَقَّ عَلَيۡهِمُ ٱلۡقَوۡلُ فِيٓ أُمَمٖ قَدۡ خَلَتۡ مِن قَبۡلِهِم مِّنَ ٱلۡجِنِّ وَٱلۡإِنسِۖ إِنَّهُمۡ كَانُواْ خَٰسِرِينَ","category":["41 (Fussilat)","Fussilat","Surah Fussilat"],"ayahNumber":4243,"juzNumber":24,"footnotes":"1. Ìyẹn ni pé, A ti yan àwọn èṣù ẹlẹ́tàn kan fún wọn tí ó tàn wọ́n jẹ títí di ọjọ́ ikú wọn.\n 2. “ohun tí ń bẹ níwájú wọn” tí àwọn èṣù wọn ṣe ní ọ̀ṣọ́ fún wọn ni yòdòyìndìn, adùn àti ọ̀ṣọ́ ilé ayé tí ó mú wọn gbàgbé Allāhu.\n 3. “ohun tí ń bẹ ní ẹ̀yìn wọn” tí àwọn èṣù wọn ṣe ní ọ̀ṣọ́ fún wọn ni pé, kò níí sí àjíǹde, ìṣírò-iṣẹ́ àti ẹ̀san ní Ọjọ́ Àjíǹde. Wọ́n sì ń wí pé, “Lẹ́yìn ikú, sàréè ni!” Wọn kò sì mọ̀ pé, àjíǹde, ìṣírò-iṣẹ́ àti ẹ̀san ń bẹ lẹ́yìn sàréè. Ìdí nìyí tí wọn fi gbàgbé Allāhu pátápátá.","lang":"yo","meta":{"transliteration":"waqayyaḍnā lahum quranāa fazayyanū lahum mā bayna aydīhim wamā khalfahum waḥaqqa ʿalayhimu al-qawlu fī umamin qad khalat min qablihim mina al-jini wal-insi innahum kānū khāsirīna ","translations":["And We have destined","for them","companions","(who) made fair-seeming","to them","what","(was) before them","(was) before them","and what","(was) behind them","and (is) justified","against them","the Word","among","nations","(that have) passed away","(that have) passed away","before them","before them","of","the jinn","and the men","Indeed, they","were","losers","(25)"],"transliterationArr":["waqayyaḍnā","lahum","quranāa","fazayyanū","lahum","mā","bayna","aydīhim","wamā","khalfahum","waḥaqqa","ʿalayhimu","al-qawlu","fī","umamin","qad","khalat","min","qablihim","mina","al-jini","wal-insi","innahum","kānū","khāsirīna",null],"verseTiming":[[1,0,1560],[2,1560,2170],[3,2170,4850],[4,4850,6060],[5,6060,6740],[6,6740,7790],[7,7790,8390],[8,8390,9610],[9,9610,10240],[10,10240,11420],[11,11420,12180],[12,12180,13230],[13,13230,15630],[14,15630,17120],[15,17120,18040],[16,18040,18890],[17,18890,20900],[18,20900,22510],[19,22510,22840],[20,22840,23510],[21,23510,24610],[22,24610,25560],[23,25560,26460],[24,26460,28120],[25,28120,30610],[26,30610,32710],[27,32710,33530],[28,33530,36865]]}},{"name":"41:26","price":"Àwọn tó ṣàì gbàgbọ́ wí pé: “Ẹ má ṣe tẹ́tí sí al-Ƙur’ān yìí. Kí ẹ sì sọ ìsọkúsọ nípa rẹ̀ kí ẹ lè borí.”","arabic":"وَقَالَ ٱلَّذِينَ كَفَرُواْ لَا تَسۡمَعُواْ لِهَٰذَا ٱلۡقُرۡءَانِ وَٱلۡغَوۡاْ فِيهِ لَعَلَّكُمۡ تَغۡلِبُونَ","category":["41 (Fussilat)","Fussilat","Surah Fussilat"],"ayahNumber":4244,"juzNumber":24,"footnotes":"","lang":"yo","meta":{"transliteration":"waqāla alladhīna kafarū lā tasmaʿū lihādhā al-qur'āni wal-ghaw fīhi laʿallakum taghlibūna ","translations":["And said","those who","disbelieve","(Do) not","listen","to this","Quran","and make noise","therein","so that you may","overcome","(26)"],"transliterationArr":["waqāla","alladhīna","kafarū","lā","tasmaʿū","lihādhā","al-qur'āni","wal-ghaw","fīhi","laʿallakum","taghlibūna",null],"verseTiming":[[1,0,780],[2,780,1830],[3,1830,2760],[4,2760,3130],[5,3130,4220],[6,4220,5070],[7,5070,6360],[8,6360,7220],[9,7220,7900],[10,7900,9190],[11,9190,12335]]}},{"name":"41:27","price":"Nítorí náà, dájúdájú A óò fún àwọn tó ṣàì gbàgbọ́ ní ìyà líle tọ́ wò. Àti pé dájúdájú A óò fi èyí tó burú ju èyí tí wọ́n ń ṣe níṣẹ́ san wọ́n ní ẹ̀san.","arabic":"فَلَنُذِيقَنَّ ٱلَّذِينَ كَفَرُواْ عَذَابٗا شَدِيدٗا وَلَنَجۡزِيَنَّهُمۡ أَسۡوَأَ ٱلَّذِي كَانُواْ يَعۡمَلُونَ","category":["41 (Fussilat)","Fussilat","Surah Fussilat"],"ayahNumber":4245,"juzNumber":24,"footnotes":"","lang":"yo","meta":{"transliteration":"falanudhīqanna alladhīna kafarū ʿadhāban shadīdan walanajziyannahum aswa-a alladhī kānū yaʿmalūna ","translations":["But surely We will cause to taste","those who","disbelieve","a punishment","severe","and surely We will recompense them","(the) worst","(of) what","they used to","do","(27)"],"transliterationArr":["falanudhīqanna","alladhīna","kafarū","ʿadhāban","shadīdan","walanajziyannahum","aswa-a","alladhī","kānū","yaʿmalūna",null],"verseTiming":[[1,0,2610],[2,2610,3710],[3,3710,4540],[4,4540,5840],[5,5840,8090],[6,8090,10520],[7,10520,11230],[8,11230,12230],[9,12230,13140],[10,13140,16095]]}},{"name":"41:28","price":"Iná, ìyẹn ni ẹ̀san àwọn ọ̀tá Allāhu. Ilé gbére wà nínú rẹ̀ fún wọn. Ó jẹ́ ẹ̀san nítorí pé wọ́n ń tako àwọn āyah Wa.","arabic":"ذَٰلِكَ جَزَآءُ أَعۡدَآءِ ٱللَّهِ ٱلنَّارُۖ لَهُمۡ فِيهَا دَارُ ٱلۡخُلۡدِ جَزَآءَۢ بِمَا كَانُواْ بِـَٔايَٰتِنَا يَجۡحَدُونَ","category":["41 (Fussilat)","Fussilat","Surah Fussilat"],"ayahNumber":4246,"juzNumber":24,"footnotes":"","lang":"yo","meta":{"transliteration":"dhālika jazāu aʿdāi al-lahi al-nāru lahum fīhā dāru al-khul'di jazāan bimā kānū biāyātinā yajḥadūna ","translations":["That","(is the) recompense","(of the) enemies","(of) Allah ","the Fire","for them","therein","(is the) home","(of) the eternity","(as) recompense","for what","they used to","of Our Verses","reject","(28)"],"transliterationArr":["dhālika","jazāu","aʿdāi","al-lahi","al-nāru","lahum","fīhā","dāru","al-khul'di","jazāan","bimā","kānū","biāyātinā","yajḥadūna",null],"verseTiming":[[1,0,1050],[2,1050,3510],[3,3510,6030],[4,6030,6900],[5,6900,8490],[6,8490,8910],[7,8910,10679],[8,10679,11619],[9,11619,12189],[10,12189,13139],[11,13139,13739],[12,13739,14619],[13,14619,18239],[14,18239,18809],[15,18809,19779],[16,19779,21399],[17,21399,24884]]}},{"name":"41:29","price":"Àwọn tó ṣàì gbàgbọ́ wí pé: “Olúwa wa, fi àwọn méjèèjì tí wọ́n ṣì wá lọ́nà nínú àwọn àlùjànnú àti ènìyàn hàn wá, kí á fi àwọn méjèèjì sí abẹ́ ẹsẹ̀ wa, nítorí kí àwọn méjèèjì lè wà ní ìsàlẹ̀ pátápátá.”","arabic":"وَقَالَ ٱلَّذِينَ كَفَرُواْ رَبَّنَآ أَرِنَا ٱلَّذَيۡنِ أَضَلَّانَا مِنَ ٱلۡجِنِّ وَٱلۡإِنسِ نَجۡعَلۡهُمَا تَحۡتَ أَقۡدَامِنَا لِيَكُونَا مِنَ ٱلۡأَسۡفَلِينَ","category":["41 (Fussilat)","Fussilat","Surah Fussilat"],"ayahNumber":4247,"juzNumber":24,"footnotes":"","lang":"yo","meta":{"transliteration":"waqāla alladhīna kafarū rabbanā arinā alladhayni aḍallānā mina al-jini wal-insi najʿalhumā taḥta aqdāminā liyakūnā mina al-asfalīna ","translations":["And (will) say","those who","disbelieve","Our Lord","Show us","those who","misled us","of","the jinn","and the men","(so) we may put them","under","our feet","that they be","of","the lowest","(29)"],"transliterationArr":["waqāla","alladhīna","kafarū","rabbanā","arinā","alladhayni","aḍallānā","mina","al-jini","wal-insi","najʿalhumā","taḥta","aqdāminā","liyakūnā","mina","al-asfalīna",null],"verseTiming":[[1,0,910],[2,910,1990],[3,1990,2910],[4,2910,5410],[5,5410,5950],[6,5950,7040],[7,7040,8540],[8,8540,8830],[9,8830,10450],[10,10450,12460],[11,12460,13810],[12,13810,14520],[13,14520,16130],[14,16130,18140],[15,18140,18810],[16,18810,20280],[17,20280,21540],[18,21540,21900],[19,21900,25785]]}},{"name":"41:30","price":"Dájúdájú àwọn tó sọ pé: “Allāhu ni Olúwa wa.” lẹ́yìn náà, tí wọ́n dúró ṣinṣin (sínú ẹ̀sìn títí di ọjọ́ ikú wọn), àwọn mọlāika yóò máa sọ̀kalẹ̀ wá bá wọn (ní ọjọ́ ikú wọn, wọ́n sì máa sọ pé: “Ẹ má ṣe páyà, ẹ má ṣe banújẹ́. Kí ẹ sì dunnú sí Ọgbà Ìdẹ̀ra èyí tí wọ́n ń ṣe ní àdéhùn fún yín.","arabic":"إِنَّ ٱلَّذِينَ قَالُواْ رَبُّنَا ٱللَّهُ ثُمَّ ٱسۡتَقَٰمُواْ تَتَنَزَّلُ عَلَيۡهِمُ ٱلۡمَلَٰٓئِكَةُ أَلَّا تَخَافُواْ وَلَا تَحۡزَنُواْ وَأَبۡشِرُواْ بِٱلۡجَنَّةِ ٱلَّتِي كُنتُمۡ تُوعَدُونَ","category":["41 (Fussilat)","Fussilat","Surah Fussilat"],"ayahNumber":4248,"juzNumber":24,"footnotes":"","lang":"yo","meta":{"transliteration":"inna alladhīna qālū rabbunā al-lahu thumma is'taqāmū tatanazzalu ʿalayhimu al-malāikatu allā takhāfū walā taḥzanū wa-abshirū bil-janati allatī kuntum tūʿadūna ","translations":["Indeed","those who","say","Our Lord","(is) Allah","then","stand firm ","will descend","on them","the Angels","(Do) not","fear","and (do) not","grieve","but receive the glad tidings","of Paradise","which","you were","promised","(30)"],"transliterationArr":["inna","alladhīna","qālū","rabbunā","al-lahu","thumma","is'taqāmū","tatanazzalu","ʿalayhimu","al-malāikatu","allā","takhāfū","walā","taḥzanū","wa-abshirū","bil-janati","allatī","kuntum","tūʿadūna",null],"verseTiming":[[1,0,1480],[2,1480,2550],[3,2550,3470],[4,3470,4220],[5,4220,5130],[6,5130,6460],[7,6460,7790],[8,7790,9130],[9,9130,10130],[10,10130,13210],[11,13210,14020],[12,14020,15250],[13,15250,15710],[14,15710,16980],[15,16980,18170],[16,18170,21120],[17,21120,22310],[18,22310,24550],[19,24550,25380],[20,25380,27290],[21,27290,30955]]}},{"name":"41:31","price":"Àwa ni ọ̀rẹ́ yín nínú ìṣẹ̀mí ayé àti ní ọ̀run. Ohun tí ẹ̀mí yín ń fẹ́ ti wà fún yín nínú Ọgbà Ìdẹ̀ra. Ohun tí ẹ̀ ń bèèrè fún sì ti wà nínú rẹ̀.","arabic":"نَحۡنُ أَوۡلِيَآؤُكُمۡ فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَا وَفِي ٱلۡأٓخِرَةِۖ وَلَكُمۡ فِيهَا مَا تَشۡتَهِيٓ أَنفُسُكُمۡ وَلَكُمۡ فِيهَا مَا تَدَّعُونَ","category":["41 (Fussilat)","Fussilat","Surah Fussilat"],"ayahNumber":4249,"juzNumber":24,"footnotes":"","lang":"yo","meta":{"transliteration":"naḥnu awliyāukum fī al-ḥayati al-dun'yā wafī al-ākhirati walakum fīhā mā tashtahī anfusukum walakum fīhā mā taddaʿūna ","translations":["We","(are) your protectors","in","the life","(of) the world","and in","the Hereafter","And for you","therein","whatever","desire","your souls","and for you","therein","what","you ask","(31)"],"transliterationArr":["naḥnu","awliyāukum","fī","al-ḥayati","al-dun'yā","wafī","al-ākhirati","walakum","fīhā","mā","tashtahī","anfusukum","walakum","fīhā","mā","taddaʿūna",null],"verseTiming":[[1,0,780],[2,780,3990],[3,3990,4360],[4,4360,5340],[5,5340,6430],[6,6430,6860],[7,6860,8780],[8,8780,9560],[9,9560,10450],[10,10450,10870],[11,10870,13370],[12,13370,15190],[13,15190,15980],[14,15980,16870],[15,16870,17300],[16,17300,20765]]}},{"name":"41:32","price":"Ó jẹ́ n̄ǹkan ìgbàlejò (fún yín) láti ọ̀dọ̀ Aláforíjìn, Àṣàkẹ́-ọ̀run.”","arabic":"نُزُلٗا مِّنۡ غَفُورٖ رَّحِيمٖ","category":["41 (Fussilat)","Fussilat","Surah Fussilat"],"ayahNumber":4250,"juzNumber":24,"footnotes":"","lang":"yo","meta":{"transliteration":"nuzulan min ghafūrin raḥīmin ","translations":["A hospitable gift","from","(the) Oft-Forgiving","(the) Most Merciful","(32)"],"transliterationArr":["nuzulan","min","ghafūrin","raḥīmin",null],"verseTiming":[[1,0,880],[2,880,2130],[3,2130,3220],[4,3220,7025]]}},{"name":"41:33","price":"Níbi ọ̀rọ̀ sísọ, ta ni ó dára ju ẹni tí ó pèpè sí ọ̀dọ̀ Allāhu, tí ó ṣe iṣẹ́ rere, tí ó sì sọ pé: “Dájúdájú èmí wà nínú àwọn mùsùlùmí?”","arabic":"وَمَنۡ أَحۡسَنُ قَوۡلٗا مِّمَّن دَعَآ إِلَى ٱللَّهِ وَعَمِلَ صَٰلِحٗا وَقَالَ إِنَّنِي مِنَ ٱلۡمُسۡلِمِينَ","category":["41 (Fussilat)","Fussilat","Surah Fussilat"],"ayahNumber":4251,"juzNumber":24,"footnotes":"1. Kò sí ẹni tí ó dára jù ú lọ","lang":"yo","meta":{"transliteration":"waman aḥsanu qawlan mimman daʿā ilā al-lahi waʿamila ṣāliḥan waqāla innanī mina al-mus'limīna ","translations":["And who","(is) better","(in) speech","than (one) who","invites","to","Allah","and does","righteous (deeds)","and says","Indeed, I am","of","those who submit","(33)"],"transliterationArr":["waman","aḥsanu","qawlan","mimman","daʿā","ilā","al-lahi","waʿamila","ṣāliḥan","waqāla","innanī","mina","al-mus'limīna",null],"verseTiming":[[1,0,700],[2,700,1480],[3,1480,2220],[4,2220,4520],[5,4520,6500],[6,6500,6890],[7,6890,7670],[8,7670,8500],[9,8500,10270],[10,10270,11090],[11,11090,12530],[12,12530,12920],[13,12920,16145]]}},{"name":"41:34","price":"Rere àti aburú kò dọ́gba. Fi èyí tí ó dára jùlọ dènà (aburú).¹ Nígbà náà ni ẹni tí ọ̀tá wà láààrin ìwọ àti òun máa dà bí ọ̀rẹ́ alásùn-únmọ́ pẹ́kípẹ́kí.","arabic":"وَلَا تَسۡتَوِي ٱلۡحَسَنَةُ وَلَا ٱلسَّيِّئَةُۚ ٱدۡفَعۡ بِٱلَّتِي هِيَ أَحۡسَنُ فَإِذَا ٱلَّذِي بَيۡنَكَ وَبَيۡنَهُۥ عَدَٰوَةٞ كَأَنَّهُۥ وَلِيٌّ حَمِيمٞ","category":["41 (Fussilat)","Fussilat","Surah Fussilat"],"ayahNumber":4252,"juzNumber":24,"footnotes":"1. Fífi rere dènà aburú ni ṣíṣe sùúrù pẹ̀lú ẹni tí ó ń bínú sí wa, ṣíṣe rere sí ẹni tí ó ń ṣe aburú sí wa, kíkí ẹni tí ó ń yàn wá lódì, ṣíṣe àtẹ̀mọ́ra pẹ̀lú ẹni tí ó ń hùwà àìmọ̀kan sí wa, wíwo ẹni tí ó ń ṣépè fún wa níran, wíwo ẹni tí ó ń bú wa níran àti bẹ́ẹ̀ bẹ́ẹ̀ lọ. Ìwọ̀nyí ni kí mùsùlùmí fi ṣẹwà nítorí kí àwa náa má baà di ẹni aburú àti nítorí kí èṣù má baà rí wa lò.","lang":"yo","meta":{"transliteration":"walā tastawī al-ḥasanatu walā al-sayi-atu id'faʿ bi-allatī hiya aḥsanu fa-idhā alladhī baynaka wabaynahu ʿadāwatun ka-annahu waliyyun ḥamīmun ","translations":["And not","(are) equal","the good (deed)","and","the evil (deed)","Repel","by (that) which","[it]","(is) better","then behold","One who","between you","and between him","(was) enmity","(will become) as if he","(was) a friend","intimate","(34)"],"transliterationArr":["walā","tastawī","al-ḥasanatu","walā","al-sayi-atu","id'faʿ","bi-allatī","hiya","aḥsanu","fa-idhā","alladhī","baynaka","wabaynahu","ʿadāwatun","ka-annahu","waliyyun","ḥamīmun",null],"verseTiming":[[1,0,760],[2,760,1600],[3,1600,2750],[4,2750,3040],[5,3040,4380],[6,4380,5660],[7,5660,6700],[8,6700,7220],[9,7220,7980],[10,7980,8640],[11,8640,9500],[12,9500,10380],[13,10380,11520],[14,11520,13530],[15,13530,15610],[16,15610,16560],[17,16560,19665]]}},{"name":"41:35","price":"A ku n yín) sìn títí di ọjọá hu pátápátá.n ní Ọjọ́ Àjíǹde.́ wọn gbàgbé Allāhu.ò níí fún ẹnì kan ní (ìwà rere yìí) àfi àwọn tó ṣe sùúrù. A kò níí fún ẹnì kan sẹ́ àfi olórí-ire ńlá.","arabic":"وَمَا يُلَقَّىٰهَآ إِلَّا ٱلَّذِينَ صَبَرُواْ وَمَا يُلَقَّىٰهَآ إِلَّا ذُو حَظٍّ عَظِيمٖ","category":["41 (Fussilat)","Fussilat","Surah Fussilat"],"ayahNumber":4253,"juzNumber":24,"footnotes":"","lang":"yo","meta":{"transliteration":"wamā yulaqqāhā illā alladhīna ṣabarū wamā yulaqqāhā illā dhū ḥaẓẓin ʿaẓīmin ","translations":["And not","it is granted","except","(to) those who","(are) patient","and not","it is granted","except","(to the) owner","(of) fortune","great","(35)"],"transliterationArr":["wamā","yulaqqāhā","illā","alladhīna","ṣabarū","wamā","yulaqqāhā","illā","dhū","ḥaẓẓin","ʿaẓīmin",null],"verseTiming":[[1,0,750],[2,750,3890],[3,3890,4560],[4,4560,5620],[5,5620,6650],[6,6650,7190],[7,7190,10450],[8,10450,11300],[9,11300,11730],[10,11730,12620],[11,12620,15675]]}},{"name":"41:36","price":"Àti pé tí èròkérò kan láti ọ̀dọ̀ Èṣù bá fẹ́ ṣẹ́ ọ lórí (kúrò níbi ìwà rere yìí), sádi Allāhu (fi Allāhu wá ìṣọ́rí). Dájúdájú Òun ni Olùgbọ́, Onímọ̀.","arabic":"وَإِمَّا يَنزَغَنَّكَ مِنَ ٱلشَّيۡطَٰنِ نَزۡغٞ فَٱسۡتَعِذۡ بِٱللَّهِۖ إِنَّهُۥ هُوَ ٱلسَّمِيعُ ٱلۡعَلِيمُ","category":["41 (Fussilat)","Fussilat","Surah Fussilat"],"ayahNumber":4254,"juzNumber":24,"footnotes":"","lang":"yo","meta":{"transliteration":"wa-immā yanzaghannaka mina al-shayṭāni nazghun fa-is'taʿidh bil-lahi innahu huwa al-samīʿu al-ʿalīmu ","translations":["And if","whisper comes to you","from","the Shaitaan","an evil suggestion","then seek refuge","in Allah","Indeed, He","[He]","(is) the All-Hearer","the All-Knower","(36)"],"transliterationArr":["wa-immā","yanzaghannaka","mina","al-shayṭāni","nazghun","fa-is'taʿidh","bil-lahi","innahu","huwa","al-samīʿu","al-ʿalīmu",null],"verseTiming":[[1,0,1880],[2,1880,4710],[3,4710,5070],[4,5070,6510],[5,6510,8030],[6,8030,9140],[7,9140,12300],[8,12300,14110],[9,14110,14480],[10,14480,15580],[11,15580,18695]]}},{"name":"41:37","price":"Nínú àwọn àmì Rẹ̀ ni òru, ọ̀sán, òòrùn àti òṣùpá. Ẹ kò gbọ́dọ̀ forí kanlẹ̀ fún òòrùn àti òṣùpá. Ẹ forí kanlẹ̀ fún Allāhu, Ẹni tí Ó dá wọn, tí ẹ̀yin bá jẹ́ ẹni tó ń jọ́sìn fún Òun nìkan ṣoṣo.","arabic":"وَمِنۡ ءَايَٰتِهِ ٱلَّيۡلُ وَٱلنَّهَارُ وَٱلشَّمۡسُ وَٱلۡقَمَرُۚ لَا تَسۡجُدُواْ لِلشَّمۡسِ وَلَا لِلۡقَمَرِ وَٱسۡجُدُواْۤ لِلَّهِۤ ٱلَّذِي خَلَقَهُنَّ إِن كُنتُمۡ إِيَّاهُ تَعۡبُدُونَ","category":["41 (Fussilat)","Fussilat","Surah Fussilat"],"ayahNumber":4255,"juzNumber":24,"footnotes":"","lang":"yo","meta":{"transliteration":"wamin āyātihi al-laylu wal-nahāru wal-shamsu wal-qamaru lā tasjudū lilshamsi walā lil'qamari wa-us'judū lillahi alladhī khalaqahunna in kuntum iyyāhu taʿbudūna ","translations":["And of","His Signs","(are) the night","and the day","and the sun","and the moon","(Do) not","prostrate","to the sun","and not","to the moon","but prostrate","to Allah","the One Who","created them","if","you","Him alone","worship","(37)"],"transliterationArr":["wamin","āyātihi","al-laylu","wal-nahāru","wal-shamsu","wal-qamaru","lā","tasjudū","lilshamsi","walā","lil'qamari","wa-us'judū","lillahi","alladhī","khalaqahunna","in","kuntum","iyyāhu","taʿbudūna",null],"verseTiming":[[1,0,750],[2,750,2070],[3,2070,2930],[4,2930,4920],[5,4920,5980],[6,5980,7610],[7,7610,8020],[8,8020,9110],[9,9110,10290],[10,10290,10900],[11,10900,11970],[12,11970,13000],[13,13000,14120],[14,14120,14990],[15,14990,17080],[16,17080,18280],[17,18280,19810],[18,19810,20860],[19,20860,23845]]}},{"name":"41:38","price":"Tí wọ́n bá sì ṣègbéraga, àwọn tó wà ní ọ̀dọ̀ Olúwa rẹ, wọ́n ń ṣàfọ̀mọ́ fún Un ní alẹ́ àti ní ọ̀sán; wọn kò sì kágara.","arabic":"فَإِنِ ٱسۡتَكۡبَرُواْ فَٱلَّذِينَ عِندَ رَبِّكَ يُسَبِّحُونَ لَهُۥ بِٱلَّيۡلِ وَٱلنَّهَارِ وَهُمۡ لَا يَسۡـَٔمُونَ۩","category":["41 (Fussilat)","Fussilat","Surah Fussilat"],"ayahNumber":4256,"juzNumber":24,"footnotes":"","lang":"yo","meta":{"transliteration":"fa-ini is'takbarū fa-alladhīna ʿinda rabbika yusabbiḥūna lahu bi-al-layli wal-nahāri wahum lā yasamūna ","translations":["But if","they are arrogant","then those who","(are) near","your Lord","glorify","Him","by night","and day","And they","(do) not","tire","(38)"],"transliterationArr":["fa-ini","is'takbarū","fa-alladhīna","ʿinda","rabbika","yusabbiḥūna","lahu","bi-al-layli","wal-nahāri","wahum","lā","yasamūna",""],"verseTiming":[[1,0,660],[2,660,1870],[3,1870,3110],[4,3110,4590],[5,4590,5470],[6,5470,7040],[7,7040,7600],[8,7600,8720],[9,8720,10530],[10,10530,11300],[11,11300,11730],[12,11730,15535]]}},{"name":"41:39","price":"Nínú àwọn àmì Rẹ̀ tún ni pé dájúdájú ìwọ yóò rí ilẹ̀ ní asálẹ̀. Nígbà tí A bá sì sọ omi kalẹ̀ lé e lórí, ó máa rúra wá, ó sì máa ga (fún híhu irúgbìn jáde). Dájúdájú Ẹni tí Ó talẹ̀ jí, Òun mà ni Ẹni tí Ó máa sọ àwọn òkú di alààyè. Dájúdájú Allāhu ni Alágbára lórí gbogbo n̄ǹkan.","arabic":"وَمِنۡ ءَايَٰتِهِۦٓ أَنَّكَ تَرَى ٱلۡأَرۡضَ خَٰشِعَةٗ فَإِذَآ أَنزَلۡنَا عَلَيۡهَا ٱلۡمَآءَ ٱهۡتَزَّتۡ وَرَبَتۡۚ إِنَّ ٱلَّذِيٓ أَحۡيَاهَا لَمُحۡيِ ٱلۡمَوۡتَىٰٓۚ إِنَّهُۥ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٌ","category":["41 (Fussilat)","Fussilat","Surah Fussilat"],"ayahNumber":4257,"juzNumber":24,"footnotes":"","lang":"yo","meta":{"transliteration":"wamin āyātihi annaka tarā al-arḍa khāshiʿatan fa-idhā anzalnā ʿalayhā al-māa ih'tazzat warabat inna alladhī aḥyāhā lamuḥ'yī al-mawtā innahu ʿalā kulli shayin qadīrun ","translations":["And among","His Signs","(is) that you","see","the earth","barren","but when","We send down","upon it","water","it is stirred (to life)","and grows","Indeed","the One Who","gives it life","(is) surely the Giver of life","(to) the dead","Indeed, He","(is) on","every","thing","All-Powerful","(39)"],"transliterationArr":["wamin","āyātihi","annaka","tarā","al-arḍa","khāshiʿatan","fa-idhā","anzalnā","ʿalayhā","al-māa","ih'tazzat","warabat","inna","alladhī","aḥyāhā","lamuḥ'yī","al-mawtā","innahu","ʿalā","kulli","shayin","qadīrun",null],"verseTiming":[[1,0,730],[2,730,3710],[3,3710,4920],[4,4920,5300],[5,5300,6160],[6,6160,8220],[7,8220,10580],[8,10580,12650],[9,12650,13500],[10,13500,15620],[11,15620,16760],[12,16760,18130],[13,18130,19520],[14,19520,21960],[15,21960,23220],[16,23220,24090],[17,24090,25340],[18,25340,27570],[19,27570,28270],[20,28270,28940],[21,28940,31020],[22,31020,33775]]}},{"name":"41:40","price":"Dájúdájú àwọn tó ń darí àwọn āyah Wa kọ ọ̀nà òdì,¹ wọn kò pamọ́ fún Wa. Ṣé ẹni tí wọ́n máa jù sínú Iná l’ó lóore jùlọ ni tàbí ẹni tí ó máa wá ní olùfàyàbalẹ̀ ní Ọjọ́ Àjíǹde? Ẹ máa ṣe ohun tí ẹ bá fẹ́. Dájúdájú Allāhu ni Olùríran nípa ohun tí ẹ̀ ń ṣe níṣẹ́.","arabic":"إِنَّ ٱلَّذِينَ يُلۡحِدُونَ فِيٓ ءَايَٰتِنَا لَا يَخۡفَوۡنَ عَلَيۡنَآۗ أَفَمَن يُلۡقَىٰ فِي ٱلنَّارِ خَيۡرٌ أَم مَّن يَأۡتِيٓ ءَامِنٗا يَوۡمَ ٱلۡقِيَٰمَةِۚ ٱعۡمَلُواْ مَا شِئۡتُمۡ إِنَّهُۥ بِمَا تَعۡمَلُونَ بَصِيرٌ","category":["41 (Fussilat)","Fussilat","Surah Fussilat"],"ayahNumber":4258,"juzNumber":24,"footnotes":"1. Nínú dídarí àwọn āyah al-Ƙur’ān kọ ọ̀nà òdì ni fífún āyah kan ní ìtúmọ̀ òdì, fífi āyah kan tako āyah mìíràn, lílo āyah kan ní àyè tí kò jẹmọ́ ọn, fífi āyah kan ṣe ẹ̀fẹ̀, ṣíṣe àtakò sí āyah kan, pípa ọ̀rọ̀ al-Ƙur’ān tì láti tẹ̀lé ìròrí, ìṣe àti àṣà ìgbà-àìmọ̀kan àti bẹ́ẹ̀ bẹ́ẹ̀ lọ. Ní ṣókí, ẹni tó darí āyah al-Ƙur’ān kọ ọ̀nà òdì ni ẹni tí kò tẹ̀lé àwọn äyah al-Ƙur’ān ní ọ̀nà ẹ̀tọ́ àti ẹni tí kò gbàgbọ́ nínú rẹ̀. Àpẹ̀ẹrẹ igun kìíní ni àwọn oníbídíà bíí àwọn sūfī, àwọn Ahmadi àti àwọn oníjálàbí. Àpẹ̀ẹrẹ igun kejì ni àwọn ọ̀ṣẹbọ, àwọn “nasọ̄rọ̄ àti àwọn yẹhudi.","lang":"yo","meta":{"transliteration":"inna alladhīna yul'ḥidūna fī āyātinā lā yakhfawna ʿalaynā afaman yul'qā fī al-nāri khayrun am man yatī āminan yawma al-qiyāmati iʿ'malū mā shi'tum innahu bimā taʿmalūna baṣīrun ","translations":["Indeed","those who","distort","[in]","Our Verses","(are) not","hidden","from Us","So, is (he) who","is cast","in","the Fire","better","or","(he) who","comes","secure","(on the) Day","(of) Resurrection","Do","what","you will","Indeed, He","of what","you do","(is) All-Seer","(40)"],"transliterationArr":["inna","alladhīna","yul'ḥidūna","fī","āyātinā","lā","yakhfawna","ʿalaynā","afaman","yul'qā","fī","al-nāri","khayrun","am","man","yatī","āminan","yawma","al-qiyāmati","iʿ'malū","mā","shi'tum","innahu","bimā","taʿmalūna","baṣīrun",null],"verseTiming":[[1,0,1470],[2,1470,2540],[3,2540,3840],[4,3840,5860],[5,5860,7460],[6,7460,7910],[7,7910,8950],[8,8950,10260],[9,10260,11810],[10,11810,13150],[11,13150,13390],[12,13390,15170],[13,15170,16040],[14,16040,16320],[15,16320,17160],[16,17160,18040],[17,18040,20580],[18,20580,21390],[19,21390,21510],[20,21510,22870],[21,22870,24180],[22,24180,25740],[23,25740,26120],[24,26120,27200],[25,27200,29340],[26,29340,29980],[27,29980,31310],[28,31310,34275]]}},{"name":"41:41","price":"Dájúdájú àwọn tó ṣàì gbàgbọ́ nínú Tírà Ìrántí náà (ìyẹn, al-Ƙur’ān) nígbà tí ó dé bá wọn (ẹni ìparun ni wọ́n.) Dájúdájú òhun mà ni Tírà tó lágbára.","arabic":"إِنَّ ٱلَّذِينَ كَفَرُواْ بِٱلذِّكۡرِ لَمَّا جَآءَهُمۡۖ وَإِنَّهُۥ لَكِتَٰبٌ عَزِيزٞ","category":["41 (Fussilat)","Fussilat","Surah Fussilat"],"ayahNumber":4259,"juzNumber":24,"footnotes":"","lang":"yo","meta":{"transliteration":"inna alladhīna kafarū bil-dhik'ri lammā jāahum wa-innahu lakitābun ʿazīzun ","translations":["Indeed","those who","disbelieve","in the Reminder","when","it comes to them","And indeed, it","(is) surely a Book","mighty","(41)"],"transliterationArr":["inna","alladhīna","kafarū","bil-dhik'ri","lammā","jāahum","wa-innahu","lakitābun","ʿazīzun",null],"verseTiming":[[1,0,1530],[2,1530,2570],[3,2570,3500],[4,3500,4620],[5,4620,5950],[6,5950,8890],[7,8890,10850],[8,10850,12160],[9,12160,15245]]}},{"name":"41:42","price":"Ìbàjẹ́ kò níí kàn án láti iwájú rẹ̀ àti láti ẹ̀yìn rẹ̀.¹ Ìmísí tí wọ́n sọ̀kalẹ̀ ni láti ọ̀dọ̀ Ọlọ́gbọ́n, Ẹlẹ́yìn.","arabic":"لَّا يَأۡتِيهِ ٱلۡبَٰطِلُ مِنۢ بَيۡنِ يَدَيۡهِ وَلَا مِنۡ خَلۡفِهِۦۖ تَنزِيلٞ مِّنۡ حَكِيمٍ حَمِيدٖ","category":["41 (Fussilat)","Fussilat","Surah Fussilat"],"ayahNumber":4260,"juzNumber":24,"footnotes":"1. Ìyẹn ni pé, kò sí tírà sánmọ̀ kan tí ó sọ àsọtẹ́lẹ̀ pé irọ́ wà nínú al-Ƙur’ān ṣíwájú ìsọ̀kalẹ̀ rẹ̀. Kò sì wulẹ̀ níí sí tírà kan kan mọ́ lẹ́yìn rẹ̀ láti sánmọ̀, áḿbọ̀sìbọ́sí pé ó máa pe al-Ƙur’ān ní irọ́. Ní ṣókí, kò sí ẹni tí ó lè rí āyah kan pè ní irọ́ nínú al-Ƙur’ān. Èyí jẹ́ ààbò mímọ́ tí Allāhu - Ọba Aláààbò - fi bo al-Ƙur’ān yàtọ̀ sí àwọn tírà yòókù tó ṣíwájú rẹ̀ nítorí pé, ọwọ́kọ́wọ́ ti wọ inú wọn ní ìbámú sí sūrah al-Baƙọrah; 2:75 àti 79 àti sūrah al-Mọ̄’idah; 5:13. \n Kódà ìwé kan tí àwọn nasọ̄rọ̄ ń pè ní “Bíbélì”, ohun tí àwọn òǹtẹ̀wé rẹ̀ “The Bible Societies” sọ nípa rẹ̀ nínú ọ̀rọ̀ ìṣáájú tí wọ́n kọ sínú “Revised Standard Version” ni pé: “Àwọn ìwé bíbélì tí wọ́n kọ́kọ́ túmọ̀ sí èdè Gẹ̀ẹ́sì wáyé láti inú ojúlówó èdè Hébérù àti èdè Greek tààrà. Títúmọ̀ ìwé bíbélì tó sì jẹ́ àtẹ̀jáde àkọ́kọ́ ni iṣẹ́ ọwọ́ William Tyndale. Ó fojú winá àtakò tó lágbára. Wọ́n fi ẹ̀sùn kàn án pé, ó fínnú-fíndọ̀ dojú ìtúmọ̀ àwọn ọ̀rọ̀ inú bíbélì rú, wọ́n sì pa á láṣẹ pé kí wọ́n dáná sun àwọn májẹ̀mu titun rẹ̀ gẹ́gẹ́ bí ó ṣe jẹ́ “àwọn ìtúmọ̀ tí kì í ṣe òdodo”. Arákùnrin náà padà bọ́ sọ́wọ́ àwọn ọ̀tá rẹ̀, wọ́n pa á níta gban̄gba, wọ́n kangi ikú fún un, wọ́n sì dáná sun ún lórí rẹ̀ ní October 1536. Síbẹ̀síbẹ̀ ńkọ́, iṣẹ́ ìtúmọ̀ tí Tyndale ṣe ló padà di ìpìlẹ̀ ìtọ́kasí fún àwọn bíbélì tí wọ́n ń padà túmọ̀ sí èdè Gẹ̀ẹ́sì… Àwọn tí wọ́n ṣe iṣẹ́ ìtúmọ̀ bíbélì ti King James Version ṣe àkíyèsí sí àwọn èyí tí wọ́n ti ṣe ṣíwájú; … Síbẹ̀síbẹ̀ ńkọ́, iṣẹ́ ìtúmọ̀ tí King James Version ṣe tún ní àléébù tó burú gan-an nínú. Láààrin 19 sẹ́ńtúrì, ìdàgbàsókè ẹ̀kọ́ bíbélì àti ṣíṣe àwárí àwọn àkọsílẹ̀ ìpìlẹ̀ bíbélì tí ó lọ́jọ́ lórí ju èyí tí king James Version gbé iṣẹ́ ìtúmọ̀ bíbélì tirẹ̀ lé lórí, ó fi hàn kedere pé àwọn àlèébù = wọ̀nyí pọ̀ púpọ̀ gan-an, wọ́n sì lágbára gan-an dé ibi pé ó bèèrè fún àtúnṣe àwọn ìtúmọ̀ tí wọ́n túmọ̀ bíbélì sí…”","lang":"yo","meta":{"transliteration":"lā yatīhi al-bāṭilu min bayni yadayhi walā min khalfihi tanzīlun min ḥakīmin ḥamīdin ","translations":["Not","comes to it","the falsehood","from","before it","before it","and not","from","behind it","A Revelation","from","(the) All-Wise","(the) Praiseworthy","(42)"],"transliterationArr":["lā","yatīhi","al-bāṭilu","min","bayni","yadayhi","walā","min","khalfihi","tanzīlun","min","ḥakīmin","ḥamīdin",null],"verseTiming":[[1,0,600],[2,600,1660],[3,1660,2720],[4,2720,3850],[5,3850,4550],[6,4550,5420],[7,5420,6080],[8,6080,6370],[9,6370,7540],[10,7540,10400],[11,10400,11450],[12,11450,12570],[13,12570,15235]]}},{"name":"41:43","price":"Wọn kò sọ ọ̀rọ̀ kan sí ọ bí kò ṣe ohun tí wọ́n ti sọ sí àwọn Òjíṣẹ́ tó ṣíwájú rẹ. Dájúdájú Olúwa rẹ mà ni Aláforíjìn, Ó sì ní ìyà ẹlẹ́ta-eléro (lọ́dọ̀).","arabic":"مَّا يُقَالُ لَكَ إِلَّا مَا قَدۡ قِيلَ لِلرُّسُلِ مِن قَبۡلِكَۚ إِنَّ رَبَّكَ لَذُو مَغۡفِرَةٖ وَذُو عِقَابٍ أَلِيمٖ","category":["41 (Fussilat)","Fussilat","Surah Fussilat"],"ayahNumber":4261,"juzNumber":24,"footnotes":"","lang":"yo","meta":{"transliteration":"mā yuqālu laka illā mā qad qīla lilrrusuli min qablika inna rabbaka ladhū maghfiratin wadhū ʿiqābin alīmin ","translations":["Not","is said","to you","except","what","was said","was said","to the Messengers","before you","before you","Indeed","your Lord","(is) Possessor","(of) forgiveness","and Possessor","(of) penalty","painful","(43)"],"transliterationArr":["mā","yuqālu","laka","illā","mā","qad","qīla","lilrrusuli","min","qablika","inna","rabbaka","ladhū","maghfiratin","wadhū","ʿiqābin","alīmin",null],"verseTiming":[[1,0,600],[2,600,1480],[3,1480,1930],[4,1930,2840],[5,2840,3220],[6,3220,3700],[7,3700,4430],[8,4430,5470],[9,5470,6950],[10,6950,8330],[11,8330,9530],[12,9530,10390],[13,10390,10960],[14,10960,13270],[15,13270,13850],[16,13850,14950],[17,14950,18155]]}},{"name":"41:44","price":"Tí ó bá jẹ́ pé A ṣe al-Ƙur’ān ní n̄ǹkan kíké ní èdè mìíràn yàtọ̀ sí èdè Lárúbáwá ni, wọn ìbá wí pé: “Kí ni kò jẹ́ kí wọ́n ṣe àlàyé àwọn āyah rẹ̀?” Báwo ni al-Ƙur’ān ṣe lè jẹ́ èdè mìíràn (yàtọ̀ sí èdè Lárúbáwá), nígbà tí Ànábì (Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a -) jẹ́ Lárúbáwá? Sọ pé: “Ó jẹ́ ìmọ̀nà àti ìwòsàn fún àwọn tó gbàgbọ́ ní òdodo. Àwọn tí kò sì gbàgbọ́, èdídí wà nínú etí wọn ni. Fọ́júǹǹfọ́jú sì wà nínú ojú wọn sí (òdodo al-Ƙur’ān). Àwọn wọ̀nyẹn ni wọ́n sì ń pè (síbi òdodo al-Ƙur’ān) láti àyè tó jìnnà.¹","arabic":"وَلَوۡ جَعَلۡنَٰهُ قُرۡءَانًا أَعۡجَمِيّٗا لَّقَالُواْ لَوۡلَا فُصِّلَتۡ ءَايَٰتُهُۥٓۖ ءَا۬عۡجَمِيّٞ وَعَرَبِيّٞۗ قُلۡ هُوَ لِلَّذِينَ ءَامَنُواْ هُدٗى وَشِفَآءٞۚ وَٱلَّذِينَ لَا يُؤۡمِنُونَ فِيٓ ءَاذَانِهِمۡ وَقۡرٞ وَهُوَ عَلَيۡهِمۡ عَمًىۚ أُوْلَٰٓئِكَ يُنَادَوۡنَ مِن مَّكَانِۭ بَعِيدٖ","category":["41 (Fussilat)","Fussilat","Surah Fussilat"],"ayahNumber":4262,"juzNumber":24,"footnotes":"1. Ìyẹn ni pé, wọ́n ti sọnù jìnnà. Nítorí náà, wọn kò lè gbọ́ ìpè òdodo láti ọ̀nà jíjìn.","lang":"yo","meta":{"transliteration":"walaw jaʿalnāhu qur'ānan aʿjamiyyan laqālū lawlā fuṣṣilat āyātuhu āʿ'jamiyyun waʿarabiyyun qul huwa lilladhīna āmanū hudan washifāon wa-alladhīna lā yu'minūna fī ādhānihim waqrun wahuwa ʿalayhim ʿaman ulāika yunādawna min makānin baʿīdin ","translations":["And if","We (had) made it","a Quran","(in) a foreign (language)","they (would have) said","Why not","are explained in detail","its verses","(Is it) a foreign (language)","and an Arab","Say","It (is)","for those who","believe","a guidance","and a healing","And those who","(do) not","believe","in","their ears","(is) deafness","and it","(is) for them","blindness","Those","are being called","from","a place","far","(44)"],"transliterationArr":["walaw","jaʿalnāhu","qur'ānan","aʿjamiyyan","laqālū","lawlā","fuṣṣilat","āyātuhu","āʿ'jamiyyun","waʿarabiyyun","qul","huwa","lilladhīna","āmanū","hudan","washifāon","wa-alladhīna","lā","yu'minūna","fī","ādhānihim","waqrun","wahuwa","ʿalayhim","ʿaman","ulāika","yunādawna","min","makānin","baʿīdin",null],"verseTiming":[[1,0,710],[2,710,2100],[3,2100,3390],[4,3390,4670],[5,4670,5950],[6,5950,6810],[7,6810,7920],[8,7920,9750],[9,9750,11300],[10,11300,13900],[11,13900,14320],[12,14320,14650],[13,14650,15950],[14,15950,17120],[15,17120,18680],[16,18680,21970],[17,21970,23110],[18,23110,23590],[19,23590,24810],[20,24810,26710],[21,26710,28220],[22,28220,28700],[23,28700,29640],[24,29640,30150],[25,30150,31250],[26,31250,32600],[27,32600,35260],[28,35260,36580],[29,36580,36850],[30,36850,39650],[31,39650,42405]]}},{"name":"41:45","price":"A kúkú fún (Ànábì) Mūsā ní Tírà. Wọ́n sì yapa-ẹnu sí i. Tí kò bá jẹ́ pé ọ̀rọ́ kan tí ó ti ṣíwájú ní ọ̀dọ̀ Olúwa rẹ ni, A ìbá ṣe ìdájọ́ láààrin wọn. Dájúdájú wọ́n tún wà nínú iyèméjì tó gbópọn nípa al-Ƙur’ān.","arabic":"وَلَقَدۡ ءَاتَيۡنَا مُوسَى ٱلۡكِتَٰبَ فَٱخۡتُلِفَ فِيهِۚ وَلَوۡلَا كَلِمَةٞ سَبَقَتۡ مِن رَّبِّكَ لَقُضِيَ بَيۡنَهُمۡۚ وَإِنَّهُمۡ لَفِي شَكّٖ مِّنۡهُ مُرِيبٖ","category":["41 (Fussilat)","Fussilat","Surah Fussilat"],"ayahNumber":4263,"juzNumber":24,"footnotes":"","lang":"yo","meta":{"transliteration":"walaqad ātaynā mūsā al-kitāba fa-ukh'tulifa fīhi walawlā kalimatun sabaqat min rabbika laquḍiya baynahum wa-innahum lafī shakkin min'hu murībin ","translations":["And certainly","We gave","Musa","the Book","but disputes arose","therein","And had it not been","(for) a word","(that) preceded","from","your Lord","surely, would have been settled","between them","But indeed, they","surely (are) in","doubt","about it","disquieting","(45)"],"transliterationArr":["walaqad","ātaynā","mūsā","al-kitāba","fa-ukh'tulifa","fīhi","walawlā","kalimatun","sabaqat","min","rabbika","laquḍiya","baynahum","wa-innahum","lafī","shakkin","min'hu","murībin",null],"verseTiming":[[1,0,850],[2,850,2200],[3,2200,2790],[4,2790,3870],[5,3870,4910],[6,4910,7010],[7,7010,7970],[8,7970,9790],[9,9790,10680],[10,10680,10850],[11,10850,11950],[12,11950,12740],[13,12740,14330],[14,14330,16170],[15,16170,16790],[16,16790,17580],[17,17580,19320],[18,19320,21655]]}},{"name":"41:46","price":"Ẹnikẹ́ni tí ó bá ṣe iṣẹ́ rere, ó ṣe é fún ẹ̀mí ara rẹ̀. Ẹnikẹ́ni tí ó bá sì ṣe aburú, ó ṣe é fún ẹ̀mí ara rẹ̀. Olúwa rẹ kò sì níí ṣe àbòsí sí àwọn ẹrúsìn.","arabic":"مَّنۡ عَمِلَ صَٰلِحٗا فَلِنَفۡسِهِۦۖ وَمَنۡ أَسَآءَ فَعَلَيۡهَاۗ وَمَا رَبُّكَ بِظَلَّٰمٖ لِّلۡعَبِيدِ","category":["41 (Fussilat)","Fussilat","Surah Fussilat"],"ayahNumber":4264,"juzNumber":24,"footnotes":"","lang":"yo","meta":{"transliteration":"man ʿamila ṣāliḥan falinafsihi waman asāa faʿalayhā wamā rabbuka biẓallāmin lil'ʿabīdi ","translations":["Whoever","does","righteous deeds","then it is for his soul","and whoever","does evil","then it is against it","And not","(is) your Lord","unjust","to His slaves","(46)"],"transliterationArr":["man","ʿamila","ṣāliḥan","falinafsihi","waman","asāa","faʿalayhā","wamā","rabbuka","biẓallāmin","lil'ʿabīdi",null],"verseTiming":[[1,0,480],[2,480,1140],[3,1140,2950],[4,2950,4490],[5,4490,5150],[6,5150,7640],[7,7640,9020],[8,9020,10080],[9,10080,11030],[10,11030,12320],[11,12320,16145]]}},{"name":"41:47","price":"Ọ̀dọ̀ Rẹ̀ ni wọn yóò máa dá ìmọ̀ Àkókò náà padà sí. Kò sí èso kan tí ó máa jáde nínú apó rẹ̀, obìnrin kan kò sì níí lóyún, kò sì níí bímọ àfi pẹ̀lú ìmọ̀ Rẹ̀. (Rántí) ọjọ́ tí Ó sì máa pè wọ́n pé: “Ibo ni àwọn akẹgbẹ́ Mi (tí ẹ jọ́sìn fún) wà?”¹ Wọ́n á wí pé: “Àwa ń jẹ́ kí O mọ̀ pé kò sí olùjẹ́rìí kan nínú wa (tí ó máa jẹ́rìí pé, O ní akẹgbẹ́.)”","arabic":"۞ إِلَيۡهِ يُرَدُّ عِلۡمُ ٱلسَّاعَةِۚ وَمَا تَخۡرُجُ مِن ثَمَرَٰتٖ مِّنۡ أَكۡمَامِهَا وَمَا تَحۡمِلُ مِنۡ أُنثَىٰ وَلَا تَضَعُ إِلَّا بِعِلۡمِهِۦۚ وَيَوۡمَ يُنَادِيهِمۡ أَيۡنَ شُرَكَآءِي قَالُوٓاْ ءَاذَنَّٰكَ مَا مِنَّا مِن شَهِيدٖ","category":["41 (Fussilat)","Fussilat","Surah Fussilat"],"ayahNumber":4265,"juzNumber":25,"footnotes":"1. Allāhu kò ní akẹgbẹ́ ẹyọ kan áḿbọ̀sìbọ́sí àwọn akẹgbẹ́. Àmọ́ àwọn aláìgbàgbọ́ ló sọ àwọn òrìṣà wọn di akẹgbẹ́ Allāhu. Ìpè àbùkù àti ìpè ẹ̀sín ni èyí máa jẹ́ fún àwọn abọ̀rìṣà àti àwọn òrìṣà wọn ní ọjọ́ ìpè náà, ìyẹn Ọjọ́ Àjíǹde.","lang":"yo","meta":{"transliteration":"ilayhi yuraddu ʿil'mu al-sāʿati wamā takhruju min thamarātin min akmāmihā wamā taḥmilu min unthā walā taḍaʿu illā biʿil'mihi wayawma yunādīhim ayna shurakāī qālū ādhannāka mā minnā min shahīdin ","translations":["To Him","is referred","(the) knowledge","(of) the Hour","And not","comes out","any","fruits","from","their coverings","and not","bears","any","female","and not","gives birth","except","with His knowledge","And (the) Day","He will call them","Where (are)","My partners","They will say","We announce (to) You","not","among us","any","witness","(47)"],"transliterationArr":["ilayhi","yuraddu","ʿil'mu","al-sāʿati","wamā","takhruju","min","thamarātin","min","akmāmihā","wamā","taḥmilu","min","unthā","walā","taḍaʿu","illā","biʿil'mihi","wayawma","yunādīhim","ayna","shurakāī","qālū","ādhannāka","mā","minnā","min","shahīdin",null],"verseTiming":[[1,0,880],[2,880,1660],[3,1660,2290],[4,2290,3860],[5,3860,4450],[6,4450,5340],[7,5340,5760],[8,5760,7520],[9,7520,8480],[10,8480,9930],[11,9930,10550],[12,10550,11410],[13,11410,12980],[14,12980,13590],[15,13590,14220],[16,14220,14890],[17,14890,15680],[18,15680,16990],[19,16990,17910],[20,17910,19390],[21,19390,19960],[22,19960,22720],[23,22720,25170],[24,25170,27430],[25,27430,27830],[26,27830,29280],[27,29280,30570],[28,30570,33835]]}},{"name":"41:48","price":"Ohun tí wọ́n ń pè tẹ́lẹ̀tẹ́lẹ̀ sì di òfo mọ́ wọn lọ́wọ́.¹ Wọ́n sì mọ̀ ní àmọ̀dájú pé, kò sí ibùsásí kan fún àwọn.","arabic":"وَضَلَّ عَنۡهُم مَّا كَانُواْ يَدۡعُونَ مِن قَبۡلُۖ وَظَنُّواْ مَا لَهُم مِّن مَّحِيصٖ","category":["41 (Fussilat)","Fussilat","Surah Fussilat"],"ayahNumber":4266,"juzNumber":25,"footnotes":"1. Ẹ wo ìtọsẹ̀-ọ̀rọ̀ sūrah al-’Ani‘ām; 6:24.","lang":"yo","meta":{"transliteration":"waḍalla ʿanhum mā kānū yadʿūna min qablu waẓannū mā lahum min maḥīṣin ","translations":["And lost","from them","what","they were","invoking","before","before","and they (will) be certain","(that) not","for them","any","place of escape","(48)"],"transliterationArr":["waḍalla","ʿanhum","mā","kānū","yadʿūna","min","qablu","waẓannū","mā","lahum","min","maḥīṣin",null],"verseTiming":[[1,0,930],[2,930,1830],[3,1830,2860],[4,2860,3760],[5,3760,4730],[6,4730,6160],[7,6160,7120],[8,7120,8990],[9,8990,9400],[10,9400,9990],[11,9990,11070],[12,11070,15155]]}},{"name":"41:49","price":"Ènìyàn kò kó ṣúṣú níbi àdúà (láti tọrọ) oore. Tí aburú bá sì fọwọ́ bà á, ó máa di olùsọ̀rètínù, olùjákànmùná.","arabic":"لَّا يَسۡـَٔمُ ٱلۡإِنسَٰنُ مِن دُعَآءِ ٱلۡخَيۡرِ وَإِن مَّسَّهُ ٱلشَّرُّ فَيَـُٔوسٞ قَنُوطٞ","category":["41 (Fussilat)","Fussilat","Surah Fussilat"],"ayahNumber":4267,"juzNumber":25,"footnotes":"","lang":"yo","meta":{"transliteration":"lā yasamu al-insānu min duʿāi al-khayri wa-in massahu al-sharu fayaūsun qanūṭun ","translations":["(Does) not","get tired","man","of","praying","(for) the good","but if","touches him","the evil","then he gives up hope","(and) despairs","(49)"],"transliterationArr":["lā","yasamu","al-insānu","min","duʿāi","al-khayri","wa-in","massahu","al-sharu","fayaūsun","qanūṭun",null],"verseTiming":[[1,0,570],[2,570,1340],[3,1340,3430],[4,3430,4520],[5,4520,6930],[6,6930,7810],[7,7810,8250],[8,8250,9910],[9,9910,10760],[10,10760,12740],[11,12740,16065]]}},{"name":"41:50","price":"Dájúdájú tí A bá ṣe ìdẹ̀ra fún un láti ọ̀dọ̀ Wa lẹ́yìn aburú tí ó fọwọ́ bà á, dájúdájú ó máa wí pé: “Èyí ni tèmi. Èmi kò sì ní àmọ̀dájú pé Àkókò náà máa ṣẹlẹ̀. Àti pé dájúdájú tí Wọ́n bá dá mi padà sí ọ̀dọ̀ Olúwa mi, dájúdájú rere tún wà fún mi ní ọ̀dọ̀ Rẹ̀.” Dájúdájú Àwa yóò fún àwọn tó ṣàì gbàgbọ́ ní ìró ohun tí wọ́n ṣe níṣẹ́. Dájúdájú A sì máa fún wọn ní ìyà tó nípọn tọ́ wò.","arabic":"وَلَئِنۡ أَذَقۡنَٰهُ رَحۡمَةٗ مِّنَّا مِنۢ بَعۡدِ ضَرَّآءَ مَسَّتۡهُ لَيَقُولَنَّ هَٰذَا لِي وَمَآ أَظُنُّ ٱلسَّاعَةَ قَآئِمَةٗ وَلَئِن رُّجِعۡتُ إِلَىٰ رَبِّيٓ إِنَّ لِي عِندَهُۥ لَلۡحُسۡنَىٰۚ فَلَنُنَبِّئَنَّ ٱلَّذِينَ كَفَرُواْ بِمَا عَمِلُواْ وَلَنُذِيقَنَّهُم مِّنۡ عَذَابٍ غَلِيظٖ","category":["41 (Fussilat)","Fussilat","Surah Fussilat"],"ayahNumber":4268,"juzNumber":25,"footnotes":"","lang":"yo","meta":{"transliteration":"wala-in adhaqnāhu raḥmatan minnā min baʿdi ḍarrāa massathu layaqūlanna hādhā lī wamā aẓunnu al-sāʿata qāimatan wala-in rujiʿ'tu ilā rabbī inna lī ʿindahu lalḥus'nā falanunabbi-anna alladhīna kafarū bimā ʿamilū walanudhīqannahum min ʿadhābin ghalīẓin ","translations":["And verily, if","We let him taste","mercy","from Us","after","after","an adversity","(has) touched him","he will surely say","This (is)","(due) to me","and not","I think","the Hour","(will be) established","and if","I am returned","to","my Lord","indeed","for me","with Him","(will be) the best","But We will surely inform","those who","disbelieved","about what","they did","and We will surely make them taste","of","a punishment","severe","(50)"],"transliterationArr":["wala-in","adhaqnāhu","raḥmatan","minnā","min","baʿdi","ḍarrāa","massathu","layaqūlanna","hādhā","lī","wamā","aẓunnu","al-sāʿata","qāimatan","wala-in","rujiʿ'tu","ilā","rabbī","inna","lī","ʿindahu","lalḥus'nā","falanunabbi-anna","alladhīna","kafarū","bimā","ʿamilū","walanudhīqannahum","min","ʿadhābin","ghalīẓin",null],"verseTiming":[[1,0,840],[2,840,2140],[3,2140,2990],[4,2990,5380],[5,5380,6540],[6,6540,7150],[7,7150,9840],[8,9840,10830],[9,10830,12880],[10,12880,13710],[11,13710,14860],[12,14860,17140],[13,17140,17990],[14,17990,18380],[15,18380,20490],[16,20490,21800],[17,21800,22980],[18,22980,26250],[19,26250,26730],[20,26730,27910],[21,27910,28490],[22,28490,30740],[23,30740,31980],[24,31980,32470],[25,32470,34300],[26,34300,35330],[27,35330,38640],[28,38640,39730],[29,39730,40570],[30,40570,41190],[31,41190,42170],[32,42170,45240],[33,45240,46370],[34,46370,47500],[35,47500,50515]]}},{"name":"41:51","price":"Àti pé nígbà tí A bá ṣe ìdẹ̀ra fún ènìyàn, ó máa gbúnrí (kúrò ní ọ̀dọ̀ Wa). Ó sì máa ṣègbéraga. Nígbà tí aburú bá sì fọwọ́ bà á, nígbà náà l’ó máa di aládùáà rẹgẹdẹ.","arabic":"وَإِذَآ أَنۡعَمۡنَا عَلَى ٱلۡإِنسَٰنِ أَعۡرَضَ وَنَـَٔا بِجَانِبِهِۦ وَإِذَا مَسَّهُ ٱلشَّرُّ فَذُو دُعَآءٍ عَرِيضٖ","category":["41 (Fussilat)","Fussilat","Surah Fussilat"],"ayahNumber":4269,"juzNumber":25,"footnotes":"","lang":"yo","meta":{"transliteration":"wa-idhā anʿamnā ʿalā al-insāni aʿraḍa wanaā bijānibihi wa-idhā massahu al-sharu fadhū duʿāin ʿarīḍin ","translations":["And when","We bestow favor","upon","man","he turns away ","and distances himself","and distances himself","but when","touches him","the evil","then (he is) full","(of) supplication","lengthy","(51)"],"transliterationArr":["wa-idhā","anʿamnā","ʿalā","al-insāni","aʿraḍa","wanaā","bijānibihi","wa-idhā","massahu","al-sharu","fadhū","duʿāin","ʿarīḍin",null],"verseTiming":[[1,0,2180],[2,2180,3470],[3,3470,3880],[4,3880,6070],[5,6070,6960],[6,6960,7740],[7,7740,9290],[8,9290,10150],[9,10150,10960],[10,10960,11860],[11,11860,12460],[12,12460,15170],[13,15170,18365]]}},{"name":"41:52","price":"Sọ pé: “Ẹ sọ fún mi, tí ó bá jẹ́ pé al-Ƙur’ān wá láti ọ̀dọ̀ Allāhu, lẹ́yìn náà tí ẹ ṣàì gbàgbọ́ nínú rẹ̀ (ṣé ẹ̀yin kò ti wà nínú ìyapa bí?)” Ta l’ó ṣìnà ju ẹni tí ó wà nínú ìyapa tó jìnnà (sí òdodo)!","arabic":"قُلۡ أَرَءَيۡتُمۡ إِن كَانَ مِنۡ عِندِ ٱللَّهِ ثُمَّ كَفَرۡتُم بِهِۦ مَنۡ أَضَلُّ مِمَّنۡ هُوَ فِي شِقَاقِۭ بَعِيدٖ","category":["41 (Fussilat)","Fussilat","Surah Fussilat"],"ayahNumber":4270,"juzNumber":25,"footnotes":"","lang":"yo","meta":{"transliteration":"qul ara-aytum in kāna min ʿindi al-lahi thumma kafartum bihi man aḍallu mimman huwa fī shiqāqin baʿīdin ","translations":["Say","You see ","if","it is","from","from","Allah","then","you disbelieve","in it","who","(is) more astray","than (one) who ","he","(is) in","opposition","far","(52)"],"transliterationArr":["qul","ara-aytum","in","kāna","min","ʿindi","al-lahi","thumma","kafartum","bihi","man","aḍallu","mimman","huwa","fī","shiqāqin","baʿīdin",null],"verseTiming":[[1,0,440],[2,440,1720],[3,1720,2850],[4,2850,3410],[5,3410,3900],[6,3900,5280],[7,5280,6120],[8,6120,7420],[9,7420,8900],[10,8900,9800],[11,9800,10200],[12,10200,11080],[13,11080,12750],[14,12750,13090],[15,13090,13510],[16,13510,14700],[17,14700,18215]]}},{"name":"41:53","price":"A óò máa fi àwọn àmì Wa hàn wọ́n nínú òfurufú àti nínú ẹ̀mí ara wọn títí ó máa fi hàn kedere sí wọn pé dájúdájú al-Ƙur’ān ni òdodo. Ǹjẹ́ Olúwa rẹ kò tó kí ó jẹ́ pé dájúdájú Òun ni Arínú-róde lórí gbogbo n̄ǹkan?","arabic":"سَنُرِيهِمۡ ءَايَٰتِنَا فِي ٱلۡأٓفَاقِ وَفِيٓ أَنفُسِهِمۡ حَتَّىٰ يَتَبَيَّنَ لَهُمۡ أَنَّهُ ٱلۡحَقُّۗ أَوَلَمۡ يَكۡفِ بِرَبِّكَ أَنَّهُۥ عَلَىٰ كُلِّ شَيۡءٖ شَهِيدٌ","category":["41 (Fussilat)","Fussilat","Surah Fussilat"],"ayahNumber":4271,"juzNumber":25,"footnotes":"","lang":"yo","meta":{"transliteration":"sanurīhim āyātinā fī al-āfāqi wafī anfusihim ḥattā yatabayyana lahum annahu al-ḥaqu awalam yakfi birabbika annahu ʿalā kulli shayin shahīdun ","translations":["Soon We will show them","Our Signs","in","the horizons","and in","themselves","until","becomes clear","to them","that it","(is) the truth","Is (it) not","sufficient","concerning your Lord","that He","(is) over","all","things","a Witness","(53)"],"transliterationArr":["sanurīhim","āyātinā","fī","al-āfāqi","wafī","anfusihim","ḥattā","yatabayyana","lahum","annahu","al-ḥaqu","awalam","yakfi","birabbika","annahu","ʿalā","kulli","shayin","shahīdun",null],"verseTiming":[[1,0,1410],[2,1410,3030],[3,3030,3270],[4,3270,4540],[5,4540,6430],[6,6430,8360],[7,8360,9280],[8,9280,10440],[9,10440,11200],[10,11200,12790],[11,12790,14240],[12,14240,14990],[13,14990,15840],[14,15840,16830],[15,16830,18780],[16,18780,19420],[17,19420,20020],[18,20020,21740],[19,21740,24995]]}},{"name":"41:54","price":"Gbọ́, dájúdájú wọ́n wà nínú iyèméjì nípa ìpàdé Olúwa wọn. Gbọ́, dájúdájú Allāhu yí gbogbo n̄ǹkan ká.","arabic":"أَلَآ إِنَّهُمۡ فِي مِرۡيَةٖ مِّن لِّقَآءِ رَبِّهِمۡۗ أَلَآ إِنَّهُۥ بِكُلِّ شَيۡءٖ مُّحِيطُۢ","category":["41 (Fussilat)","Fussilat","Surah Fussilat"],"ayahNumber":4272,"juzNumber":25,"footnotes":"","lang":"yo","meta":{"transliteration":"alā innahum fī mir'yatin min liqāi rabbihim alā innahu bikulli shayin muḥīṭun ","translations":["Unquestionably","they","(are) in","doubt","about","(the) meeting","(with) their Lord","Unquestionably","indeed, He","(is) of all","things","encompassing","(54)"],"transliterationArr":["alā","innahum","fī","mir'yatin","min","liqāi","rabbihim","alā","innahu","bikulli","shayin","muḥīṭun",null],"verseTiming":[[1,0,2240],[2,2240,4010],[3,4010,4500],[4,4500,5440],[5,5440,6450],[6,6450,9080],[7,9080,10810],[8,10810,13049],[9,13049,14879],[10,14879,15839],[11,15839,16579],[12,16579,21844]]}}],"chapter":["41 (Fussilat)","Fussilat","Surah Fussilat","Chapter Fussilat","Surah 41","Chapter 41","Explained in Detail","فُصِّلَت"],"version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."}}